{
    "@recordid": "f5b1910a89b7a8b49ef7207e0d01055536e9a44b",
    "@doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
    "@filename": "2018-BASE_PROCUREMENT-2018-DEFENSE_JIDO-U_PROCUREMENT_JustificationBook_Defense_Threat_Reduction_Agency_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Threat_Reduction_Agency_PB_2018.xml",
    "JustificationBook": {
        "@targetSchemaVersion": "1.0",
        "@classification": "UNCLASSIFIED",
        "Title": {
            "val": "Justification Book"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0300D"
        },
        "AppropriationName": {
            "val": "Procurement, Defense-Wide"
        },
        "CoverPage": {
            "Title": {
                "val": "Joint Improvised−Threat Defeat Fund (JIDF)"
            }
        },
        "ExternalDocuments": {
            "UserP1Doc": {
                "Title": {
                    "val": "Comptroller Exhibit P-1"
                },
                "FileName": {
                    "val": "JIDO P-1 Docs.pdf"
                }
            }
        },
        "DocumentAssemblyOptions": {
            "ForceEvenPages": {
                "val": "true"
            },
            "GenerateLineItemTocByBA": {
                "val": "true"
            },
            "IncludeTableOfVolumes": {
                "val": "true"
            }
        },
        "LineItemList": {
            "LineItem": [
                {
                    "@quantityUnits": "Each",
                    "@quantityUnitName": "Each",
                    "@unitCostUnits": "Millions",
                    "@totalCostUnits": "Millions",
                    "@classification": "UNCLASSIFIED",
                    "LineItemNumber": {
                        "val": "1"
                    },
                    "LineItemTitle": {
                        "val": "Rapid Acquisition and Threat Response"
                    },
                    "P1LineNumber": {
                        "val": "1"
                    },
                    "BudgetYear": {
                        "val": "2018"
                    },
                    "BudgetCycle": {
                        "val": "PB"
                    },
                    "SubmissionDate": {
                        "val": "2017-05"
                    },
                    "ServiceAgencyName": {
                        "val": "Defense Threat Reduction Agency"
                    },
                    "AppropriationNumber": {
                        "val": "2093D"
                    },
                    "AppropriationTitle": {
                        "val": "Joint Improvised-Threat Defeat Fund"
                    },
                    "BudgetActivityNumber": {
                        "val": "1"
                    },
                    "BudgetActivityTitle": {
                        "val": "Rapid Acquisition and Threat Response"
                    },
                    "BudgetSubActivityNumber": {
                        "val": "1"
                    },
                    "BudgetSubActivityTitle": {
                        "val": "Rapid Acquisition and Threat Response - Defense Threat Reduction Agency"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "14.442"
                            },
                            "BudgetYearOneOCO": {
                                "val": "483.058"
                            },
                            "BudgetYearOne": {
                                "val": "497.5"
                            },
                            "BudgetYearTwo": {
                                "val": "13.106"
                            },
                            "BudgetYearThree": {
                                "val": "12.856"
                            },
                            "BudgetYearFour": {
                                "val": "13.324"
                            },
                            "BudgetYearFive": {
                                "val": "13.777"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "NetProcurementP1": {
                            "BudgetYearOneBase": {
                                "val": "14.442"
                            },
                            "BudgetYearOneOCO": {
                                "val": "483.058"
                            },
                            "BudgetYearOne": {
                                "val": "497.5"
                            },
                            "BudgetYearTwo": {
                                "val": "13.106"
                            },
                            "BudgetYearThree": {
                                "val": "12.856"
                            },
                            "BudgetYearFour": {
                                "val": "13.324"
                            },
                            "BudgetYearFive": {
                                "val": "13.777"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        },
                        "TotalObligationAuthority": {
                            "BudgetYearOneBase": {
                                "val": "14.442"
                            },
                            "BudgetYearOneOCO": {
                                "val": "483.058"
                            },
                            "BudgetYearOne": {
                                "val": "497.5"
                            },
                            "BudgetYearTwo": {
                                "val": "13.106"
                            },
                            "BudgetYearThree": {
                                "val": "12.856"
                            },
                            "BudgetYearFour": {
                                "val": "13.324"
                            },
                            "BudgetYearFive": {
                                "val": "13.777"
                            },
                            "Continuing": {
                                "val": "true"
                            }
                        }
                    },
                    "Description": {
                        "val": "The Joint Improvised-Threat Defeat Fund (JIDF) is available for obligation for three years. While these resources are documented in exhibit formats that are customary for Procurement appropriations, Congress approved these funds for development, procurement, and fielding of measures to defeat improvised threats to U.S. Joint Forces (such as, but not limited to, the development of defeat technologies for advanced wireless signals, compatible electronic countermeasures for improvised explosive devices (IED) defeat\/neutralization, miniaturized and integrated sensors, hand held detectors, and fielding of cutting edge Information Technology capabilities). These resources support the Department of Defense's (DoD) goal to close the gap between the enemy's innovation cycles and the operational capabilities of the U.S. Joint Forces.\n\nThe Joint Improvised-Threat Defeat Organization (JIDO) under the authority, direction and control of the Defense Threat Reduction Agency (DTRA), enables DoD actions to counter improvised threats, including improvised explosive devices. JIDO provides tactical responsiveness to near and mid-term threats and supports the Combatant Commands' efforts to prepare for and adapt to battlefield surprise in support of counter-terrorism (CT), counter-insurgency (COIN), and other related mission areas, including counter-improvised explosive devices (C-IED).\n\nThe FY 2018 budget request funds the requirements to support deployed U.S. Joint Forces supporting contingency operations in Iraq and Afghanistan, provides U.S. Joint Force Combatant Commanders (CCMDs) with an awareness and understanding of the threat, and the resources needed to support other contingencies including those with the mission to defeat the Islamic State of Iraq and Syria (ISIS).\nJIDO accomplishes its mission by:\n-\tSustaining an advanced information technology and fusion infrastructure that enables a threat awareness and understanding capability.\n-\tProviding expeditionary, forward-deployed operations, intelligence, training, and advisory capabilities with reach-back support.\n-\tEnabling rapid and innovative counter-improvised-threat solution development and delivery.\n-\tSupporting Military Departments\/Services' pre-deployment training and CCMDs' priority training-exercise support requirements as requested and validated.\n-\tLeveraging broad Communities of Action (CoA) that include DoD, other U.S. Government (USG) departments and agencies, key coalition allies and partners, academia, and the private sector, to leverage their capabilities, expertise, access, and authorities to counter threat-networks and their use and facilitation of improvised weapons."
                    },
                    "Justification": {
                        "val": "Historical Context:\n\nPrior to FY 2017, funds were enacted as the Joint Improvised Explosive Device Defeat Fund (JIEDDF) and were executed through the Army.\n\nJIEDDF \/ JIDF \n\nFY 2016      FY 2017     FY 2018\t  \t\t\n$349.464    $508.072    $497.500\t\t\t\n\nThe FY 2016 actual shown above does not include $100M requested, but transferred to Operation & Maintenance, Defense-Wide (O&M, DW) as per the FY 2016 Appropriations Bill.  The FY 2017 request shown above reflects request for additional appropriations as well as $62.8M in mission support costs that will be transferred to O&M, DW as per the Consolidated Appropriations Act of 2017.\t\t\t\n\nJustification:\nThe FY 2018 budget enables The Joint Improvised-Threat Defeat Organization (JIDO) to apply its efforts through three (3) core capabilities:\n\n1.  Enable Rapid Capability Delivery (to Implement DoD Accelerated and Urgent Acquisition Models).  JIDO uses a threat-based, deliberate, structured, and proactive approach to identify and validate urgent or emergent capability requirements and gaps.  JIDO acquires and delivers capability solutions to prevent or mitigate battlefield operational surprise.  JIDO's embedded presence with deployed U.S. Joint Forces and coordination with the Military Service components, provides for the identification and understanding of counter-improvised threat (C-IT) and counter improvised explosive device (C-IED) risks and vulnerabilities; enables the timely validation of counter-threat solution requirements; and informed investment decisions on counter-threat technologies and non-material solutions.\n\n2.  Assist Situational Understanding (of threat-network activities).  The IED and other disruptive improvised threats represent a continuing and irregular threat for deployed U.S. and coalition forces.  By using operational data while embedded with U.S. Joint Forces, production from the Defense Intelligence Enterprise, and continuously evolving analytical tools and methodologies, JIDO acquires a deep understanding of current and emerging threat activities and the supporting threat facilitation networks.  JIDO delivers consumable assessments and intelligence information to help warfighters plan for and adapt to rapidly changing conditions.  This is supported by JIDO CONUS-based reach-back linked to the intelligence community, the inter-agency, and coalition partners.  This core function also informs research and development investment decisions (threat-based acquisition) and our international-interagency community of action pursuing the non-kinetic targeting of personnel and\/or businesses contributing to the problem.\n\n\n3.  Enable DoD Responses to Improvised Weapons.  JIDO builds counter-threat solutions in full collaboration with its partners.  Through a robust communities of action approach, JIDO coordinates with the Military Departments\/Services, the Joint Staff, CCMDs, other U.S. Departments and Agencies, coalition partners, industry, and academia to develop counter-improvised threat capabilities for deployed U.S. Joint Forces.  This methodology leverages the authorities, access, and capabilities of the entire U.S. Government and its partners as counter-improvised threat solutions are developed and realized.\n\nJIDO Lines of Effort.  JIDO applies its core capabilities across three (3) Lines of Effort (LOE) in support of the CCMDs and their deployed U.S. Joint Forces.  These LOEs enable JIDO to react in a scalable manner based on the threat to U.S. Joint Forces and the urgency to the CCMD.  JIDO LOEs are listed in order of intensity, from highest (contingency operations) to lowest (core capability).\n\n1.  Decisive Effort – Quick Reaction Capability (Surge).  This LOE provides support, in full coordination with the CCMDs and the Joint Staff, where U.S. forces are deployed in support of a contingency operation that is contested by threat networks and their use of improvised weapons including IEDs.  The decisive effort-quick reaction capability (QRC) requires the commitment of the full-spectrum of JIDO capabilities and resources to rapidly identify, develop, deliver, and integrate materiel and non-materiel solutions and associated pre-deployment training to meet the CCMDs' timeline.  Recognizing the Military Services' responsibility to train their forces, JIDO training support is focused on new tools, tactics, and materiel; assistance with pre-deployment training support as required by the Military Departments \/ Services and \/ or CCMDs; planning and exercise support for CCMD exercise; and fulfillment of approved and directed CCMD training support requirements for building partner nation capacity.  All mission-support service elements are designed for flexibility in order to quickly expand and contract.\n\n2.  Regional-Focused Support.  This LOE provides support where threat networks and their improvised weapons are emerging or maturing and\/or are having a direct or indirect (supporting) impact on contingency operations and currently deployed U.S. Joint Forces.  JIDO provides regionally focused support through dedicated, tailored capabilities (materiel and non-materiel) to enhance the situational understanding of threat networks posing the greatest threat or potential threat to U.S. interests; identifies CCMD capability requirements and gaps; and facilitates timely validation and accelerates development of counter-threat solutions.  JIDO provides regionally focused support to CCMDs in accordance with DoD priorities.  This LOE includes rapid prototyping and assessment of technologies to counter improvised threats.  It also fulfills approved and directed CCMD training support requirements for building partner nation capacity.\n\n3.  Global Situational Awareness.  This LOE allows decision-makers to understand the current threat and supporting events within the CCMD area of responsibility that affect CCMD strategies, goals, and objectives both immediately and in the near future.  JIDO, in collaboration with the intelligence community, other U.S. Departments and Agencies, the military departments\/services, and coalition partners, evaluates the global operational environment with a focus to assist CCMDs in anticipating near-term threats and identifying priorities.  JIDO maintains global situational awareness, including continuous monitoring for changes in threat networks; their evolving tactics, techniques, and procedures; and the identification of new, potentially disruptive, threat technologies.  JIDO informs where the Department's current counter-improvised threat portfolio poses potential risk to the U.S. Joint Forces, conveys the results to the CCMD, and informs the JIDO rapid acquisition team of the gaps regarding emerging threats."
                    },
                    "ItemExhibitList": {
                        "P40AItemGroup": [
                            {
                                "Name": {
                                    "val": "Enable Rapid Capability Delivery"
                                },
                                "CategoryList": {
                                    "Category": [
                                        {
                                            "Name": {
                                                "val": "Enable Rapid Capability Delivery"
                                            },
                                            "ItemList": {
                                                "Item": [
                                                    {
                                                        "Name": {
                                                            "val": "Enable Rapid Capability Delivery"
                                                        },
                                                        "ItemNumber": {
                                                            "val": "1"
                                                        },
                                                        "ResourceSummary": {
                                                            "TotalCost": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "14.442"
                                                                },
                                                                "BudgetYearOneOCO": {
                                                                    "val": "197.458"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "211.9"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "14.442"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "197.458"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "211.9"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "Remarks": {
                                    "val": "JIDO provides a threat based, deliberate, structured, and proactive approach to identify and validate urgent and emergent capability requirements and associated gaps to rapidly acquire, train, and deliver solutions to prevent or mitigate battlefield or operational surprise.  Since its inception JIDO has reduced the time to field solutions to engaged units by more than 50 percent since 2007.  JIDO's unique rapid requirements process enables validation of immediate needs and application of resources to develop solutions.  The organization maintains a critical embedded presence with deployed U.S. joint forces, which allows the organization to identify and begin development of solutions before the formal Urgent or Emergent Operational Needs Statement (UONS\/EONS) assignments occur.  JIDO employs an open, internal governance process to validate all requirements.  This process is executed in coordination with the affected CCMD, the Joint Rapid Acquisition Cell, the Functional Capabilities Board, the Joint Requirements Oversight Council, the Military Departments\/Services, and Congress.\n\nIn FY 2018, JIDO requests $211.9 million ($14.442 million in Base and $197.458 million in OCO), which will be used to: \n\nProvide Decisive Effort Material Support ($110.7M)\n-  Provide a rapid and early understanding of capability gaps by identifying and understanding risks and vulnerabilities in coordination with the military services and joint force commanders.\n-  Provide timely validation of requirements to inform investments in counter-threat technologies and non-material solutions.\n-  Initiate, accelerate, develop, and\/or deliver urgent (zero to two years) counter-improvised threat solutions addressing validated CCMD capability requirements.\n-  Examples:  1. Technology to detect disturbed earth as an indicator for buried IEDs on a mounted vehicle; 2. Technology to detect electronic circuits commonly found in radio controlled IEDs.\n\nDevelop Capabilities to Address Midterm Evolving and Emergent Threats ($67.8M)\n-  Provide DoD up to an 18-month \"head start\" on addressing critical warfighter gaps and enables the delivery of the most technologically advanced capabilities available to respond to improvised threats.  These are developed in concert with ongoing operations and informed by operational experience.\n-  Enable a \"warm start\" on critical emerging requirements (two to five years) and influence counter-threat development efforts in the five+ year outlook.\n-  Examples:  1. Technology to detect IED network activities from the air; 2. Technology to defeat next generation weaponized smartphones.\n\nMaintain Solution Delivery Enablers ($33.4M)\n-  Coordinate counter-threat development efforts with the military services science and technology organizations, the Defense Advanced Research Projects Agency (DARPA), partner nations, and through appropriate vehicles with the national labs, academia, and industry.\n-  Sustain research and development (R&D) activities that may provide value in obtaining technology or doctrine to counter developing threats.\n-  Examples:  1. Ensure material solution compatibility among Five Eyes partners (Australia, Canada, New Zealand, The United Kingdom, and the United States); 2.  Provide analysis, development, and distribution of new threat devices to test ranges."
                                },
                                "TotalCost": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "14.442"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "197.458"
                                        },
                                        "BudgetYearOne": {
                                            "val": "211.9"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Assist Situational Understanding"
                                },
                                "CategoryList": {
                                    "Category": [
                                        {
                                            "Name": {
                                                "val": "Assist Situational Understanding"
                                            },
                                            "ItemList": {
                                                "Item": [
                                                    {
                                                        "Name": {
                                                            "val": "Assist Situational Understanding"
                                                        },
                                                        "ItemNumber": {
                                                            "val": "2"
                                                        },
                                                        "ResourceSummary": {
                                                            "TotalCost": {
                                                                "BudgetYearOneOCO": {
                                                                    "val": "270.95"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "270.95"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "BudgetYearOneOCO": {
                                                        "val": "270.95"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "270.95"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "Remarks": {
                                    "val": "Assist Situational Understanding is broken down into support of named operations, CCMD support packages, and counter-improvised threat analytical capabilities.  These groupings contain various programs that adhere to the Lines of Effort (LOE) construct previously outlined.\n\nIn FY 2018, JIDO requests $270.950 million in OCO, which will be used to: \n\nProvide Decisive Effort Non-Material Support ($123.150M)\n-  Identify threat networks and threat network activity.  Provides for the identification of threat networks and their supporting activities that employ and\/or facilitate the use of IEDs and other improvised weapons.\n-  Provide mission IT intelligence-operations integration and support services.  This provides for field services that support the development and fielding of cutting edge IT capabilities to enable the rapid collection, fusion, and dissemination of operational information, intelligence, and technology to defeat threat networks.  Funding allows for specific Mission IT via software licenses and maintenance agreements.\n-  Examples:  1. Forward deployed intelligence professionals who identify dispositions and intentions of human enemy networks; 2. Forward deployed IT engineers who maintain JIDO's satellite based deployable communication kits worldwide.\n\nProvide Combatant Commander Support Packages ($59.9M)\n-  Provide regionally focused support through dedicated CCMD teams to enhance the situational understanding of threat networks in that area of responsibility.\n-  Provide data capture and integration.  JIDO provides customer various intelligence data feeds for further analysis, mitigates information and data gaps, and provides software tools, visualization capabilities, and customer analytical efforts.\n-  Examples:  1. CCMD dedicated intelligence professionals identifying trends, assessing threats, and informing national and military decision-makers; 2. One-of-a-kind mission IT to ingest, fuse, analyze, and disseminate mission-relevant data and information.\n\nCounter-Improvised Threat Analytical Capability ($87.9M)\n-  Provides customers with Advanced Technology to include a state-of-the-art analytical cloud architecture.  Provides rapid software development\/deployment support and tools such as 3D modeling, blast simulation, geospatial analysis, and data-voice connectivity.  Provides rapid prototype development, accreditation, and deployment on classified networks to support current operations.\n-  Provides Operations Research and System Analysis (ORSA) Pattern Analysis.  This encompasses frontline operational units supporting military operations that require development of dynamic and complex analytical solutions.  ORSA Pattern Analysis utilizes specialized software which consists of a suite of tools designed to detect patterns of activity and provide predictions on future events.  Analysis and IED related data includes, but is not limited to, significant event reports, post blast analysis, forensic and biometric data, trend analysis, counter-IED capability assessments, crime pattern analyses, network analyses, intelligence products and reports, and new\/innovative analytical techniques.\n-  Distributes data across IED Spectrum.  JIDO provides synchronization of intelligence to inform operational forces by rapidly disseminating data through a variety of technological means.  Customers include CCMDs, federal agencies, and allied nations.\n-  Examples:  1. Intelligence professionals to maintain an operations intelligence integration center; 2. Operations research professionals providing data-driven analysis and visualization of IED activity."
                                },
                                "TotalCost": {
                                    "TotalCost": {
                                        "BudgetYearOneOCO": {
                                            "val": "270.95"
                                        },
                                        "BudgetYearOne": {
                                            "val": "270.95"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Enable DoD Responsiveness"
                                },
                                "CategoryList": {
                                    "Category": [
                                        {
                                            "Name": {
                                                "val": "Enable DoD Responsiveness"
                                            },
                                            "ItemList": {
                                                "Item": [
                                                    {
                                                        "Name": {
                                                            "val": "Enable DoD Responsiveness"
                                                        },
                                                        "ItemNumber": {
                                                            "val": "3"
                                                        },
                                                        "ResourceSummary": {
                                                            "TotalCost": {
                                                                "BudgetYearOneOCO": {
                                                                    "val": "14.65"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "14.65"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "BudgetYearOneOCO": {
                                                        "val": "14.65"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "14.65"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "Remarks": {
                                    "val": "JIDO executes an interagency Communities of Action approach to synchronize development and discovery of counter-improvised threat solutions.\n\nIn FY 2018, JIDO requests $14.650 million in OCO, which will be used to:\n\n-  Provide threat and counter improvised threat information and expertise support in the development of CCMD planning efforts.\n-  Provide interagency coordination in order to achieve action against those who contribute to and facilitate the use of improvised threats affecting US Joint Forces.\n-  Provide train-advise-assist support to foreign nations (Build Partner Nation Capacity).\n-  Partner with other U.S. Government agencies to compliment JIDO solution development."
                                },
                                "TotalCost": {
                                    "TotalCost": {
                                        "BudgetYearOneOCO": {
                                            "val": "14.65"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.65"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "DocumentAssemblyOptions": {
                        "p40AItemScheduleSetting": {
                            "val": "item"
                        }
                    }
                }
            ]
        }
    }
}