{
    "id": "2018-Navy-PB-1508N-JBOOK-bb34469c279045fd55682640826a877bef9d55f96e3a744f15f33fd4a3411a15-14",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_AMMUNITION_VOL-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1508N",
        "appropriation_name": "Procurement of Ammo, Navy & MC"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "0400"
        },
        "LineItemTitle": {
            "val": "Ammunition less than $5 million"
        },
        "P1LineNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1508N"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammo, Navy & MC"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Proc Ammo, Navy"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Navy Ammunition"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "72.792"
                },
                "PriorYear": {
                    "val": "9.143"
                },
                "CurrentYear": {
                    "val": "6.395"
                },
                "BudgetYearOneBase": {
                    "val": "3.08"
                },
                "BudgetYearOneOCO": {
                    "val": "0.866"
                },
                "BudgetYearOne": {
                    "val": "3.946"
                },
                "BudgetYearTwo": {
                    "val": "3.13"
                },
                "BudgetYearThree": {
                    "val": "3.158"
                },
                "BudgetYearFour": {
                    "val": "3.226"
                },
                "BudgetYearFive": {
                    "val": "3.289"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "72.792"
                },
                "PriorYear": {
                    "val": "9.143"
                },
                "CurrentYear": {
                    "val": "6.395"
                },
                "BudgetYearOneBase": {
                    "val": "3.08"
                },
                "BudgetYearOneOCO": {
                    "val": "0.866"
                },
                "BudgetYearOne": {
                    "val": "3.946"
                },
                "BudgetYearTwo": {
                    "val": "3.13"
                },
                "BudgetYearThree": {
                    "val": "3.158"
                },
                "BudgetYearFour": {
                    "val": "3.226"
                },
                "BudgetYearFive": {
                    "val": "3.289"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "72.792"
                },
                "PriorYear": {
                    "val": "9.143"
                },
                "CurrentYear": {
                    "val": "6.395"
                },
                "BudgetYearOneBase": {
                    "val": "3.08"
                },
                "BudgetYearOneOCO": {
                    "val": "0.866"
                },
                "BudgetYearOne": {
                    "val": "3.946"
                },
                "BudgetYearTwo": {
                    "val": "3.13"
                },
                "BudgetYearThree": {
                    "val": "3.158"
                },
                "BudgetYearFour": {
                    "val": "3.226"
                },
                "BudgetYearFive": {
                    "val": "3.289"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This program provides funding for ammunition with value less than $5 million.\n\nMarine Location Markers include both air-launched and hand-launched pyrotechnic devices.  The aircraft launched units visually assist in the location of sonobouys during anti-submarine operations.  The hand launched units are used in a variety of situations to include Search and Rescue operations, Man Overboard drills and Target Marking.  The Mk-58 was designed for day or night use in any condition calling for long burning, smoke and flame reference-point marking on the ocean.  It produces yellow flame and white smoke for 40-60 minutes, which is visible for at least three miles under normal operating conditions. The Mk-25 was designed for day or night use in any condition with shorter burning, smoke and flame reference-point marking on the ocean.  It produces yellow flame and white smoke for 20-30 minutes, which is visible for at least three miles under normal operating conditions.  The Mk-25 has a smaller logistical footprint to support use on smaller ships.  The Mk-25 is also provided as a fresh water variant. \n\nThe LUU-19 Aircraft Parachute Flares (APFs) are used for near infrared nighttime illumination of surface areas in search and attack operations.  They are 36 inches long, 4.9 inches in diameter and weigh approximately 36 pounds, and provide 7 minutes illumination at approximately 650 watts\/steradian in the infrared region."
        },
        "Justification": {
            "val": "FY 2018 baseline funding is required to procure Mk-25 and Mk-58 Marine Location Markers (MLMs) to enable day and night Search and Rescue operations and target marking from aircraft and surface combatants as well as to procure LUU-19 Aircraft Parachute Flares (APFs) to enable near-infrared illumination of target areas during night-time ground force engagements and Close Air Support (CAS) operations.  Additionally, FY 2018 baseline funding is required for MLM and APF production support.\n\nThe Mk-25 is a new procurement beginning in FY2018 and required for small ships and combatants due to the reduced storage capacity available for these types of energetics. Continued use of these assets have reduced inventory to minimum levels; therefore procurements are needed in order to manage the inventory levels and meet the products operational requirements. \n\nAdditional Baseline funding is required to address production support to include product improvements needed for components designed as well as Production Engineering Support, Integrated Logistics Support, Reliability Life (i.e. Safety and Product Improvement Program, Quality Assurance and Acceptance Testing), including Miscellaneous Items to provide for procurement of various components not to exceed a total cost of 100K per year per component.\n\nOCO: \nFY 2018 Overseas Contingency Operations (OCO) is required to procure LUU-19 APFs expended during Operation Enduring Freedom (OEF) operations, replenishing actual in-theatre supply levels.  Failure to replenish LUU-19 APF expenditures will significantly diminish the US Marine Corps' ability to conduct night-time ground combat and CAS operations."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}