{
    "id": "2018-Navy-PB-1810N-MJBOOK-0-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-18",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "0946"
        },
        "LineItemTitle": {
            "val": "LPD Class Support Equipment"
        },
        "P1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "9"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shipboard Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "69.252"
                },
                "PriorYear": {
                    "val": "37.929"
                },
                "CurrentYear": {
                    "val": "40.321"
                },
                "BudgetYearOneBase": {
                    "val": "61.908"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "61.908"
                },
                "BudgetYearTwo": {
                    "val": "75.993"
                },
                "BudgetYearThree": {
                    "val": "76.183"
                },
                "BudgetYearFour": {
                    "val": "77.761"
                },
                "BudgetYearFive": {
                    "val": "79.318"
                },
                "ToComplete": {
                    "val": "33.235"
                },
                "Total": {
                    "val": "551.9"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "69.252"
                },
                "PriorYear": {
                    "val": "37.929"
                },
                "CurrentYear": {
                    "val": "40.321"
                },
                "BudgetYearOneBase": {
                    "val": "61.908"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "61.908"
                },
                "BudgetYearTwo": {
                    "val": "75.993"
                },
                "BudgetYearThree": {
                    "val": "76.183"
                },
                "BudgetYearFour": {
                    "val": "77.761"
                },
                "BudgetYearFive": {
                    "val": "79.318"
                },
                "ToComplete": {
                    "val": "33.235"
                },
                "Total": {
                    "val": "551.9"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "69.252"
                },
                "PriorYear": {
                    "val": "37.929"
                },
                "CurrentYear": {
                    "val": "40.321"
                },
                "BudgetYearOneBase": {
                    "val": "61.908"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "61.908"
                },
                "BudgetYearTwo": {
                    "val": "75.993"
                },
                "BudgetYearThree": {
                    "val": "76.183"
                },
                "BudgetYearFour": {
                    "val": "77.761"
                },
                "BudgetYearFive": {
                    "val": "79.318"
                },
                "ToComplete": {
                    "val": "33.235"
                },
                "Total": {
                    "val": "551.9"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This budget provides funding for the in service LPD 17 class program support equipment. Previous funding for LPD 17 class support equipment (FY12 and earlier) was provided under line item OPN 0981, Items Less Than $5 Million. Funding is required to upgrade mission critical electronics and Hull Mechanical & Engineering (HM&E) systems including the Engineering Control Systems (ECS), Ship Control Systems (SCS), Degaussing Systems, Shipboard Wide-Area Network (SWAN), commercial software products for ECS, SCS, Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Administrative Communications.\n\n[P40A \/ CJ010 - Schoolhouse TTE]: CJ010 - SCHOOLHOUSE TTE\nFunding for Schoolhouse Technical Training Equipment (TTE) is for the infrastructure and equipment to set up the schoolhouses for multiple systems such as ECS and SCS 60Hz and Ship Service Diesel Generators (SSDG).  The schoolhouses will provide critical training to sailors in operation and maintenance of those systems.\n\n[P40A \/ CJ020 - Shore Based Spares]: CJ020 SHORE BASED SPARES\t\t\t\t\t\t\t\t\t\nShore-Based Spares funding is required for procurement of Shore-Based Spares in support of the LPD 17 class deployed assets.  Shore-Based Spares are critical long lead time items that will be staged shoreside in case of catastrophic failure.\n\n[P40A \/ CJ080 Conjunctive HM&E AIT]: CJ080 CONJUNCTIVE HM&E ALTERATIONS\nConjunctive HM&E Alterations includes design integration, equipment procurement, recurring equipment engineering, equipment integration, and Integrated Logistics Services (ILS).\n\n[P40AMOD \/ CJ030 - HW\/SW Obsolescence]: CJ030 LPD 17  Hardware\/Software HW\/SW Obsolescence effort addresses critical hardware obsolescence and technology refreshment issues and supporting class upgrades focused on increased capability and reliability.  Funding will support procurement of hardware and software changes to the systems listed:\n- Command Information Display System (CIDS) 23TV, Replace projectors with Light Emitting Diode(LED) Projectors\n- Engineering Control Systems (ECS) - Windows XP upgrade\n- Ship Control Systems (SCS) - Windows XP upgrade\/SCS Tech Refresh, Digital Rudder Angle Display Information System (DRADIS)  \n- Magnetic Signature Control System (MSCS) - Windows XP upgrade, Digital Control Assembly (DCA) Redesign.\n- HM&E Network - HM&E Network Upgrades\n- Wire-free Portable Communication System (WPCS) - Uninterrupted Power Supply (UPS) Upgrade, Low Power Amplifier Upgrade, Main Site Upgrade.- 27TV - 27TV System Upgrade\n- Advanced Fire and Smoke Sensor System (AFSS) - AFSS System Upgrade. \n- Integrated Voice Communication System (IVCS) - IVCS system upgrades (local cutout switches, AFT lookout comm mod, obsolete terminal replacement, FWD\/AFT Keyswitched Integrated Terminal Equipment (KITE)), Software version 7.2.2\n- 1MC Announcing System - Digital Microphone Control Station\n- Navigational Data Distribution System (NDDS)\n\n[P40AMOD \/ CJ040 HM&E Electrical Modifications]: CJ040 HM&E ELECTRICAL MODIFICATIONSHM&E Modernization funding is provided to correct mission, safety and reliability issues on electrical systems and ultimately resolve maintenance intensive system concerns. HM&E Electrical Modifications include:\nSWAN UPS- Space Based UPS Reduction\n\n[P40AMOD \/ CJ050 - HM&E Survivability Modifications]: CJ050 HM&E SURVIVABILITY MODIFICATIONS HM&E Modernization funding is provided to correct mission, safety and reliability issues on HM&E systems (impacting ship survivability) and ultimately resolve maintenance intensive system concerns. HM&E Survivability Modifications include: Damage Control Action Management System (DCAMS) 1.1 upgrade, Smoke Ejection System (SES) Redesign, Night Vision Device (NVD) Well Deck Upgrades, Composite Ventilation Louvers and Screens.\n\n[P40AMOD \/ CJ060 - HM&E Mechanical\/Auxiliary Modifications]: CJ060 HM&E MECHANICAL\/AUXILIARY MODIFICATIONSHME Modernization funding is provided to correct mission, safety and reliability issues on mechanical and auxiliary systems and ultimately resolve maintenance intensive system concerns. HM&E Mechanical\/ Auxiliary Modifications include:\nMIDE Bulkhead Shaft Seal, Helo Hangar Door Control Modifications, Vacuum Collection, Holding & Transfer (VCHT) Ejector Pump PLC Upgrade, 2nd Pass Reverse Osmosis (RO) Unit Upgrade, RO Unit Potable Water Electrolytic Disinfectant Generator (EDG) Recirculation Capability, Aviation Maintenance Bridge Crane Replacement, Knuckleboom Crane Improvements, Geislinger Coupling Improvements, Scullery Improvements and Gaylord System Improvements.\n\n[P3A - 5 \/ CJ070 SWAN-CANES Integration]: CJ070 SWAN-CANES Integration\nThe results of the Shipboard Wide Area Network (SWAN) \/ Consolidated Afloat Networks and Enterprise Services (CANES) study directed the replacement of the C4I capability of the LPD 17 Class SWAN with CANES and the conversion of the non-C4I SWAN into a new HM&E Network (mini SWAN).   SWAN funding is required to field the new HM&E Network in support of the CANES  installation.  In addition, funding is required to sustain the legacy SWAN, while the LPD 17 Class ships await the CANES\/HM&E Network back fit installation.   SWAN serves as the backbone of the LPD 17 class and funding is necessary to address obsolescence, reliability issues, performance concerns, emergent Fleet requirements including enabling Cryptologic Log On (CLO), eradicating Windows XP, replacing aging obsolete network hardware (e.g., servers and core switches), and maintaining the Information Assurance posture of the Common Operating Environment (COE).   This funding is vital to ensure the LPD 17 Class ships can combat the evolving cyber threat."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "LPD Class Support Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) CJ010 - Schoolhouse TTE"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Schoolhouse TTE"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.2"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "1.2"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) CJ020 - Shore Based Spares"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Shore Based Spares"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.7"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5.253"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.253"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "8.7"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.253"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.253"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) CJ080 Conjunctive HM&E AIT"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "CJ080- CONJUNCTIVE HM&E ALTERATIONS   (FY18) Advanced Planning Long Lead Time Material in support of FY19 planned availabilities for LPD 20, LPD 23, and LPD 24.  (FY19) Advanced Planning Long Lead Time Material in support of FY20 planned availabilities for LPD 17, LPD 18, LPD 25, and LPD 26. (FY21) Ship hull shock trial certifications and Combat Systems Ships Qualification Trials (CSSQT) in support of (4) FY21 availabilities to include LPD 19, LPD 20, LPD 22, and LPD 27. (FY22) Ship hull shock trial certifications and CSSQTs in support of (2) FY22 availabilities to include LPD 21, and LPD 23.",
                                                "val": "3.1) Conjunctive HM&E Alterations"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "13.918"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "13.918"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.918"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.918"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "9.9"
                            },
                            "BudgetYearOneBase": {
                                "val": "19.171"
                            },
                            "BudgetYearOne": {
                                "val": "19.171"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "CJ030 - HW\/SW Obsolescence"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "HW\/SW Obsolescence (CJ030) includes funding for procurement and installation of equipment to correct critical obsolescence issues on LPD17 Class mission systems. Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single Chief of Naval Operations (CNO) Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.  FY 16 Procurements were contracted to support the LPD 18 Dry-Docking Select Restricted Availability beginning in Jan 2017.  In FY17, there are (10) total kits being procured for installation during (2) FY18 CNO Availabilities on LPD 19 (4 kits), LPD 22 (6 kits). In FY18, there are (16) total kits being procured for installation during (4) FY19 CNO Availabilities on LPD 20 (5 kits), LPD 21 (2 kits) LPD 23 (4 kits), and LPD 24 (5 kits).  In FY19, there are (25) total kits being procured for installation during (4) FY20 Availabilities on LPD 17 (4 kits), LPD 18 (4 kits), LPD 25 (9 kits), and LPD 26 (8 kits).  In FY20, there are (9) total kits being procured for installation during (3) FY21 CNO Availabilities on LPD 19 (4 kits), LPD 22 (4 kits), and LPD 27 (1 kit).  In FY21, there are (9) total kits being procured for installation during (3) FY22 CNO Availabilities on LPD 21 (4 kits), LPD 23 (3 kits), and LPD 28 (2 kits).  In FY22, there are (7) total kits being procured for installation during (6) FY23 CNO Availabilities on LPD 17 (1 kit), LPD 18 (1 kit), LPD 20 (1 kit), LPD 24 (1 kit), LPD 25 (2 kits), and LPD 26 (1 kit).",
                                                "val": "HW\/SW Obsolescence -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "54"
                                                    },
                                                    "PriorYear": {
                                                        "val": "9"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "10"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "16"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "16"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "11.165"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.335"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.504"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.729"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.729"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "206759.26"
                                                    },
                                                    "PriorYear": {
                                                        "val": "259444.44"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "150400"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "233062.5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "233062.5"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "HW\/SW Obsolescence -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "4.399"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.511"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.883"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.259"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.259"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "15.564"
                                        },
                                        "PriorYear": {
                                            "val": "4.846"
                                        },
                                        "CurrentYear": {
                                            "val": "5.387"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.988"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.988"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Non-Recurring Engineering"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.06"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.06"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.06"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.06"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Models of Systems Affected: HW\/SW Obsolescence\n\nHW\/SW Obsolescence (CJ030) includes funding for procurement and installation of equipment to correct critical obsolescence issues on LPD17 Class mission systems. Resolves operational and obsolescence issues.  Replaces current split controllers, resolves rack cooling, modifies loud speaker cable plant, and provides commonality and system architecture and hardware. Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single Chief of Naval Operations (CNO) Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.  In FY18, there are (2) total kits being procured for installation during (2) FY19 CNO Availabilities on LPD 20 (1 kit) and LPD 23 (1 kit). In FY19, there are (4) total kits being procured for installation during (4) FY20 CNO Availabilities on LPD 17 (1 kit), LPD 18 (1 kit), LPD 25 (1 kit), and LPD 26 (1 kit). In FY20, there are no procurements being made to support FY21 CNO availabilities.  In FY21, there is (1) total kit being procured for installation during (1) FY22 CNO Availability on LPD 21 (1 kit). In FY22, there is (1) total kit being procured for installation during (1) FY23 CNO Availability on LPD 24 (1 kit).\nHW\/SW Obsolescence effort addresses hardware obsolescence\/technology refreshment issues, and class upgrades focused on increased capabilities, force protection, and safety.  Funding will support procurement of hardware and software changes to the systems listed:\n- Command Information Display System (CIDS) 23TV - Replace projectors with LED Projectors\n- Engineering Control Systems (ECS) - Windows XP upgrade\n- Ship Control Systems (SCS) - Windows XP upgrade\/SCS Tech Refresh, Digital Rudder Angle Display Information System (DRADIS) \n- Magnetic Signature Control System (MSCS) - Windows XP upgrade\n- Wire-free Portable Communication System (WPCS) - Uninterruptible Power Supply (UPS) Upgrade, Low Power Amplifier Upgrade\n- 27TV - 27TV System Upgrade\n- Advanced Fire and Smoke Sensor System (AFSS) - AFSS System Upgrade \n- Integrated Voice Communication System (IVCS)- IVCS system upgrades (local cutout switches, AFT lookout comm mod, obsolete terminal replacement, FWD\/AFT KITE), Software version 7.2.2.\n- 1MC Announcing System - Digital Microphone Control Station1MC improvements\n- Navigational Data Distribution System (NDDS)\nNRE Includes the following efforts:\nFY18: Technology refresh for Announcing System 1MC will upgrade system firmware and obsolete components in the AN\/SIA-134 Announcing System Racks.\nFY21: Conduct engineering studies in support of LPD 17 Class Midlife Planning to include Weight, Moment, and Stability, Corrosion, Space and Equipment Configuration, Internal Communication Upgrades, etc.\nFY22: Conduct engineering studies in support of LPD 17 Class Midlife Planning to include Weight, Moment, and Stability, Corrosion, Space and Equipment Configuration, and Internal Communication Upgrades.  Non Recurring Engineering and Advanced Planning Long Lead Time Material in support of planned Midlife installations."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "15.564"
                            },
                            "PriorYear": {
                                "val": "4.846"
                            },
                            "CurrentYear": {
                                "val": "5.387"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.048"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.048"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "CJ040 HM&E Electrical Modifications"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "HM&E Electrical Modification (CJ040) includes funding for procurement and installation of equipment to upgrade shipboard electrical systems to a more sustainable, reliable configuration on LPD17 Class ships. Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year.  A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single CNO Availability.  Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized. In FY17, there are (2) total kits being procured for installation during (2) FY18 CNO Availabilities on LPD19 (1 kit) and LPD 22 (1 kit).  In FY18, there are (2) total kits being procured for installation during (2) FY19 CNO Availabilities on LPD 21 (1 kit), LPD 24 (1 kit). In FY19, there are (3) total kits being procured for installation during (3) FY20 CNO Availabilities on LPD 17 (1 kit), LPD 18 (1 kit), and LPD 25 (1 kit). In FY20, there is (1) total kit being procured for installation during (1) FY21 CNO Availability on LPD 20 (1 kit).  In FY21, there is (1) total kit being procured for installation during (1) FY22 CNO Availability on LPD 23 (1 kit).  In FY22, there is (1) total kit being procured for installation during (1) FY23 CNO Availability on LPD 26 (1 kit). Funding supports safety and capability improvements in the design of the Space Based UPS. This results in a more robust system configuration, requiring additional cable runs, load center tie-in, battery placements, and industrial work efforts.",
                                                "val": "HM&E Electrical Upgrades -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "3.596"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.596"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.596"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "1798000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1798000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1798000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "HM&E Electrical Upgrades -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.075"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.179"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.179"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "3.671"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.775"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.775"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Non-Recurring Engineering"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.803"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "0.803"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Models of Systems Affected: HM&E Electrical Modifications\n\nHM&E Modernization funding is provided to correct mission, safety and reliability issues on electrical systems and ultimately resolve maintenance intensive system concerns. HM&E Electrical Modifications include:\nSWAN UPS - Space Based Uninterruptable Power Supply (UPS) Reduction\nNRE Includes the following efforts:\nFY21: Conduct engineering studies in support of LPD 17 Class Midlife Planning to include support of USMC equities in upgraded Lithium Ion battery stowage and upgraded power and energy storage requirements for combat systems.\nFY22: Conduct engineering studies in support of LPD 17 Class Midlife Planning to include support of USMC equities in upgraded Lithium Ion battery stowage and upgraded power and energy storage requirements for combat systems."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "4.474"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.775"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "6.775"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "CJ050 - HM&E Survivability Modifications"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "HM&E Survivability Modifications (CJ050) includes funding for procurement and installation of equipment to support upgrades of shipboard survivability systems to a more sustainable, reliable configuration on LPD17 Class ships. Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single CNO Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.  In FY18, there are (2) total kits being procured for installation during (2) FY19 CNO Availabilities on LPD 23 (1 kit) and LPD 24 (1 kit). In FY19, there are (5) total kits being procured for installation during (3) FY20 CNO Availabilities on LPD 17 (2 kits), LPD 18 (2 kits), and LPD 25 (1 kit). In FY20, there are (7) total kits being procured for installation during (4) FY21 CNO Availabilities on LPD 19 (2 kits), LPD 20 (2 kits), LPD 22 (2 kits), and LPD 27 (1 kit). In FY21, there is (1) total kit being procured for installation during (1) FY22 CNO Availability on LPD 21 (1 kit).",
                                                "val": "HM&E Survivability Modifications -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "3"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.824"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.45"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.45"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "274666.67"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "225000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "225000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "HM&E Survivability Modifications -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.032"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.092"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.15"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.15"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.856"
                                        },
                                        "PriorYear": {
                                            "val": "0.092"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.6"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.6"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Models of Systems Affected: HM&E Survivability Modifications\n\nHM&E Modernization funding is provided to correct mission, safety and reliability issues on HM&E systems (impacting ship survivability) and ultimately resolve maintenance intensive system concerns. HM&E Survivability Modifications include: \nSmoke Ejection System (SES) Redesign\nComposite Ventilation Louvers and Screens.\nNRE includes the following efforts:\nFY21: Conduct Non-recurring engineering in support of the Magazine Sprinkling System detection redesign, and Engineering Plant Control System (EPCS). \nFY22: Conduct Non-recurring engineering in support of the Magazine Sprinkling System detection redesign, and Engineering Plant Control System (EPCS)."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0.856"
                            },
                            "PriorYear": {
                                "val": "0.092"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.6"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.6"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "CJ060 - HM&E Mechanical\/Auxiliary Modifications"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "HM&E Mechanical\/Auxiliary Modifications (CJ061) Titanium Valve Replacement Phase includes funding for procurement and installation of equipment to support upgrades of shipboard mechanical\/auxiliary systems to a more sustainable, reliable configuration on LPD17 Class ships. Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single CNO Availability. Ships may be receiving more than 1 kit in a single availability being modernized.  In FY17, there are (8) total kits being procured for installation during (2) FY18 CNO Availabilities on LPD 19 (4 kits) and LPD 22 (4 kits). In FY18, there are (9) total kits being procured for installation during (4) FY19 CNO Availabilities on LPD 20 (3 kits), LPD 21 (1 kit), LPD 23 (3 kits), and LPD 24 (2 kits). In FY19, there are (17) total kits being procured for installation during (4) FY20 CNO Availabilities on LPD 17 (6 kits), LPD 18 (6 kits), LPD 25 (4 kits), and LPD 26 (1 kit). In FY20, there are (14) total kits being procured for installation during (4) FY21 CNO Availabilities on LPD 19 (5 kits), LPD 20 (2 kits), LPD 22 (4 kits), and LPD 27 (3 kits).  In FY21, there are (6) total kits being procured for installation during (2) FY22 CNO Availabilities on LPD 21 (5 kits) and LPD 23 (1 kit). In FY22, there are (4) total kits being procured for installation during (3) FY23 CNO Availabilities on LPD 20 (1 kit), LPD 24 (1 kit), and LPD 26 (2 kits).",
                                                "val": "CJ060 HM&E Mechanical\/Auxiliary Modifications -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "22"
                                                    },
                                                    "PriorYear": {
                                                        "val": "13"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "8"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "23.063"
                                                    },
                                                    "PriorYear": {
                                                        "val": "11.968"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.791"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.346"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.346"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1048318.18"
                                                    },
                                                    "PriorYear": {
                                                        "val": "920615.38"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "223875"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "149555.56"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "149555.56"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "CJ060 HM&E Mechanical\/Auxiliary Modifications -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "5.379"
                                                    },
                                                    "PriorYear": {
                                                        "val": "7.477"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "6.52"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.456"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.456"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "28.442"
                                        },
                                        "PriorYear": {
                                            "val": "19.445"
                                        },
                                        "CurrentYear": {
                                            "val": "8.311"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.802"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.802"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Non-Recurring Engineering"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "1.9"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.054"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.054"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "1.9"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.054"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.054"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Models of Systems Affected: HM&E Mechanical\/Auxiliary Modifications\n\nHM&E Mechanical\/Auxiliary Modifications(CJ060) includes funding for procurement and installation of equipment to support upgrades of shipboard mechanical\/auxiliary systems to a more sustainable, reliable configuration on LPD17 Class ships. Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single CNO Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.\nNRE includes the following efforts:\nFY17: Conduct Non-recurring engineering in support of Geislinger Coupling upgrades.  \nFY18: Conduct Non-recurring engineering in support of Scullery redesign.\nFY19: N\/A\nFY20: Conduct Non-recurring engineering in support of Helo Hangar Door Control Modifications. \nFY21: Conduct engineering studies in support of LPD 17 Class Midlife Planning to include Crane improvement\/replacement, corrosion, weight and moment, USMC priorities, and reefer system upgrades.\nFY22: Conduct engineering studies in support of LPD 17 Class Midlife Planning to include Crane improvement\/replacement, corrosion, weight and moment, USMC priorities, and reefer system upgrades."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "28.442"
                            },
                            "PriorYear": {
                                "val": "19.445"
                            },
                            "CurrentYear": {
                                "val": "10.211"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.856"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "4.856"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "CJ031 HW\/SW Obsolescence Announcing System Replacement"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Announcing System Replacement HW\/SW Obsolescence includes funding for procurement and installation of equipment to correct critical obsolescence issues on LPD17 Class mission systems. Resolves operational and obsolescence issues.  Replaces current split controllers, resolves rack cooling, modifies loud speaker cable plant, and provides commonality and system architecture and hardware. Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single Chief of Naval Operations (CNO) Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.  In FY18, there are (2) total kits being procured for installation during (2) FY19 CNO Availabilities on LPD 20 (1 kit) and LPD 23 (1 kit). In FY19, there are (4) total kits being procured for installation during (4) FY20 CNO Availabilities on LPD 17 (1 kit), LPD 18 (1 kit), LPD 25 (1 kit), and LPD 26 (1 kit). In FY20, there are no procurements being made to support FY21 CNO availabilities.  In FY21, there is (1) total kit being procured for installation during (1) FY22 CNO Availability on LPD 21 (1 kit). In FY22, there is (1) total kit being procured for installation during (1) FY23 CNO Availability on LPD 24 (1 kit).",
                                                "val": "Announcing System Replacement -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2.4"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.4"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1200000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1200000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Announcing System Replacement -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.2"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.6"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.6"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Non-Recurring Engineering"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.734"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "0.734"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "ANNOUNCING SYSTEM REPLACEMENT Hardware\/Software:  HW\/SW Obsolescence effort addresses critical hardware obsolescence and technology refreshment issues and supporting class upgrades focused on increased capability and reliability. Funding will support procurement of an upgraded replacement announcing system.\nNRE includes the following efforts:\nFY17: Conduct non-recurring engineering and support studies in support of the next generation announcing system to resolve operational and obsolescence issues to include inadequate rack cooling, environmentally qualified components and achieve system architecture and hardware commonality."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0.734"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.6"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "2.6"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "CJ032 HW\/SW Obsolescence Wireless Portable Communications Main Site Upgrades"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "HW\/SW Obsolescence WPCS Main Site Upgrades includes funding for procurement and installation of equipment to correct critical obsolescence issues on LPD17 Class mission systems. Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single Chief of Naval Operations (CNO) Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.  In FY18, there are (2) total kits being procured for installation during (2) FY19 CNO Availabilities on LPD 20 (1 kit) and LPD 23 (1 kit). In FY19, there are (3) total kits being procured for installation during (3) FY20 CNO Availabilities on LPD 18 (1 kit), LPD 25 (1 kit), and LPD 26 (1 kit). In FY20, there are (2) total kits being procured for installation during (2) FY21 CNO Availabilities on LPD 19 (1 kit) and LPD 22 (1 kit). In FY21, there is (1) total kit being procured for installation during (1) FY22 CNO Availability on LPD 21 (1 kit).  In FY22, there are (2) total kits being procured for installation during (2) FY23 CNO Availabilities on LPD 17 (1 kit) and LPD 24 (1 kit).",
                                                "val": "WPCS Main Site Upgrades -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.6"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.6"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "800000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "800000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "WPCS Main Site Upgrades -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.2"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.8"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.8"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Non-Recurring Engineering"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.738"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "0.738"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "WIRELESS PORTABLE COMMUNICATIONS SYSTEM (WPCS) Hardware\/Software (CJ030):  HW\/SW Obsolescence effort addresses critical hardware obsolescence and technology refreshment issues and supporting class upgrades focused on increased capability and reliability. Funding will support procurement of hardware and software changes to the WPCS Main Site.\nNRE includes the following efforts:\nFY17: Wireless Portable Communications System (WPCS) non-recurring engineering in support of hardware obsolescence, software upgrade to Microsoft Windows 10, and upgrades to the e-stop and fall protection of the main site."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0.738"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.8"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "1.8"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "CJ033 HW\/SW Obsocescence Magnetic Signature Control System (MSCS) Upgrades"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "HW\/SW Obsolescence MSCS DCA Software Win10 includes funding for procurement and installation of equipment to correct critical obsolescence issues on LPD17 Class mission systems.   Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single Chief of Naval Operations (CNO) Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.  In FY18, there is (1) total kit being procured for installation during (1) FY19 CNO Availability on LPD 20 (1 kit). In FY19, there are (1) total kit being procured for installation during (1) FY20 CNO Availability on LPD 26.  In FY20, there are no procurements being made to support FY21 CNO availabilities.  In FY21, there are (2) total kits being procured for installation during (2) FY22 CNO Availabilities on LPD 21 (1 kit) and LPD23 (1 kit).  In FY22, there are (4) total kits being procured for installation during (4) FY23 CNO Availabilities on LPD 17 (1 kit), LPD 18 (1 kit), LPD 24 (1 kit), and LPD 25 (1 kit).",
                                                "val": "Magnetic Signature Control Systems -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.65"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.65"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "650000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "650000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Magnetic Signature Control Systems -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.65"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.65"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "MAGNETIC SIGNATURE CONTROL SYSTEM DIGITAL CONTROL ASSEMBLY (DCA) Hardware\/Software:  HW\/SW Obsolescence effort addresses critical hardware obsolescence and technology refreshment issues and supporting class upgrades focused on increased capability and reliability. Funding will support procurement of a new DCA and upgrade of the Operating System."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.65"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.65"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "CJ061 Titanium Valve Replacement"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring -- Titanium Valve Replacement Phase 1"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "CJ061 HM&E MECHANICAL\/AUXILIARY MODIFICATIONSHME Modernization Titanium Valve Replacement Phase I funding is provided to correct mission, safety and reliability issues on mechanical and auxiliary systems and ultimately resolve maintenance intensive system concerns. Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single Chief of Naval Operations (CNO) Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.  In FY17, there is (1) total kit being procured for installation during (1) FY18 CNO Availability on LPD 19 (1 kit).  In FY18 and FY19, there are no procurements being made to support FY19 and FY20 CNO availabilities.  In FY20, there is (1) total kit being procured for installation during (1) FY21 CNO Availability on LPD 22 (1 kit).",
                                                "val": "Titanium Valve Replacement Phase 1 -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "1.79"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "1790000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Titanium Valve Replacement Phase 1 -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.151"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.628"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.628"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "1.941"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.628"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.628"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring -- Titanium Valve Replacement Phase 2"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "HM&E MECHANICAL\/AUXILIARY MODIFICATIONSHME Modernization, Titanium Valve Replacement Phase II funding is provided to correct mission, safety and reliability issues on mechanical and auxiliary systems and ultimately resolve maintenance intensive system concerns.  Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single Chief of Naval Operations (CNO) Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.  In FY18, there are (2) total kit being procured for installation during (2) FY19 CNO Availability on LPD 20 (1 kit) and LPD 21 (1 kit). In FY19, there are (2) total kits being procured for installation during (2) FY20 CNO Availabilities on LPD 17 (1 kit) and LPD 18 (1 kit). In FY20, there are (2) total kits being procured for installation during (2) FY21 CNO Availabilities on LPD 19 (1 kit) and LPD 22 (1 kit).",
                                                "val": "Titanium Valve Replacement Phase 2 -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "3.58"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.58"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1790000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1790000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Titanium Valve Replacement Phase 2 -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.302"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.302"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.882"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.882"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "TITANIUM VALVE REPLACEMENT (CJ061)Titanium Valve Replacement Phase I: Modernization funding is provided to correct mission, safety and reliability issues on mechanical and auxiliary systems and ultimately resolve maintenance intensive system concerns. Funding will support Phase I of the Titanium valve replacement.\nTITANIUM VALVE REPLACEMENT Modernization, Titanium Valve Replacement Phase II funding is provided to correct mission, safety and reliability issues on mechanical and auxiliary systems and ultimately resolve maintenance intensive system concerns. Funding will support Phase II of the Titanium valve replacement.\nTITANIUM VALVE REPLACEMENT  Modernization Titanium Valve Replacement Phase III funding is provided to correct mission, safety and reliability issues on mechanical and auxiliary systems and ultimately resolve maintenance intensive system concerns. Funding will support Phase III of the Titanium valve replacement."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "1.941"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.51"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "4.51"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "CJ062 HM&E Mechanical\/Auxiliary Mods Knuckleboom Crane Improvements"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "HM&E MECHANICAL\/AUXILIARY MODIFICATIONSHME Modernization Knuckleboom Crane Improvement funding is provided to correct mission, safety and reliability issues on mechanical and auxiliary systems and ultimately resolve maintenance intensive system concerns.  Shipsets of equipment vary in quantities and types of components each fiscal year and within a fiscal year. Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations. A quantity of \"1\" represents a single \"kit\" intended for installation in one ship, in a single Chief of Naval Operations (CNO) Availability. Ships may be receiving more than 1 kit in a single availability based upon the fielding plan for the systems being modernized.  In FY18, there are (2) total kits being procured for installation during (2) FY19 CNO Availabilities on LPD 20 (1 kit) and LPD 23 (1 kit). In FY19, there are (2) total kits being procured for installation during (2) FY20 CNO Availabilities on LPD 18 (1 kit), LPD 25 (1 kit). In FY20, there are (3) total kits being procured for installation during (3) FY21 CNO Availabilities on LPD 19 (1 kit) and LPD 22 (1 kit) and LPD 27 (1 kit). In FY21, there is (1) total kit being procured for installation during (1) FY22 CNO Availability on LPD 21 (1 kit).  In FY22, there are (3) total kits being procured for installation during (3) FY23 CNO Availabilities on LPD 17 (1 kit) and LPD 24 (1 kit), and LPD 26 (1 kit).",
                                                "val": "Knuckleboom Crane Improvement -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "500000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "500000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Knuckleboom Crane Improvement -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.3"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.3"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.3"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Non-Recurring Engineering"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.3"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "0.3"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "KNUCKLEBOOM CRANE IMPROVEMENTS Modernization funding is provided to correct mission, safety and reliability issues on mechanical and auxiliary systems and ultimately resolve maintenance intensive system concerns. Funding will support boat and cargo crane safety upgrades.\nNRE include the following efforts:\nFY17: Non-recurring engineering in support of Knuckleboom Crane safety improvements to include interlock switches, e-stops, secure anchor points, crane cab ventilation, and access point for emergency egress."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0.3"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.3"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "1.3"
                            }
                        }
                    }
                }
            ],
            "P3AModificationItemGroup": [
                {
                    "ModificationTitle": {
                        "val": "CJ070 SWAN-CANES Integration"
                    },
                    "ModificationNumber": {
                        "val": "5"
                    },
                    "ModificationType": {
                        "val": "TBD"
                    },
                    "Model": {
                        "val": "LPD 17 Class SWAN-CANES Integration"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "14.49"
                            },
                            "PriorYear": {
                                "val": "13.546"
                            },
                            "CurrentYear": {
                                "val": "16.536"
                            },
                            "BudgetYearOneBase": {
                                "val": "12.598"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "12.598"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "14.49"
                            },
                            "PriorYear": {
                                "val": "13.546"
                            },
                            "CurrentYear": {
                                "val": "16.536"
                            },
                            "BudgetYearOneBase": {
                                "val": "12.598"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "12.598"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "14.49"
                            },
                            "PriorYear": {
                                "val": "13.546"
                            },
                            "CurrentYear": {
                                "val": "16.536"
                            },
                            "BudgetYearOneBase": {
                                "val": "12.598"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "12.598"
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "CJ070 SWAN-CANES Integration"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "@footnote": "This mod has sharp fluctuations in procurement and installation unit cost due to the variations in equipment quantities and types of components that make up a shipset.  Each ship requires a different number of alterations to be installed, and these alteration packages vary in scope and cost based on individual ship configurations.  Due to Type Commander (TYCOM) Integrated Class Maintenance Plan(ICMP) scheduling adjustments, CNO availabilities for LPD 17 Class have increased from once every 2 years to once every 3 years.  This has caused CANES and HM&E Network schedules to slip and SWAN sustainment modification quantities to increase.",
                                                            "val": "1.1.1) SWAN-CANES Integration - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "43"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "16"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "29"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "4"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "4"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "5.069"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "5.996"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "10.182"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "7.868"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "7.868"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "5.069"
                                                    },
                                                    "PriorYear": {
                                                        "val": "5.996"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "10.182"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7.868"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7.868"
                                                    }
                                                }
                                            }
                                        },
                                        "NonRecurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "@footnote": "FY17 Availabilities: LPD 17 - HM&E Conversion Mesh; SWAN Removal Mesh. LPD 18 - HM&E Conversion Mesh; SWAN Removal Mesh. LPD 20 - SWAN COMPOSE 4.0.0; Network Router Upgrade; Network Storage Device Upgrade; SIPRNET CLO COMPOSE 4.0; NIPRNET CLO COMPOSE 4.0.  LPD 25 - SWAN Mesh CORE Switch; SWAN COMPOSE 4.0.0; Network Router Upgrade; Network Storage Device Upgrade; SWAN Transport Upgrades; SIPRNET CLO COMPOSE 4.0; NIPRNET CLO COMPOSE 4.0.  FY18 Availabilities: LPD 19 - SWAN Server COMPOSE 4.0; SWAN COMPOSE 4.0.1; Network Storage Device Upgrade; SIPRNET CLO COMPOSE 4.0; NIPRNET CLO COMPOSE 4.0; SWAN Workstation PC(Inc 2); SWAN Virtualization Mgt LAN; Windows 10 SHB Requirement; Enclave Boundary Defense Capability. LPD 22 - SWAN Mesh CORE Switch; SWAN Server COMPOSE 4.0; SWAN COMPOSE 4.0.1; Network Router Upgrade; Network Storage Device Upgrade; SWAN Transport Upgrades; SIPRNET CLO COMPOSE 4.0; NIPRNET CLO COMPOSE 4.0; SWAN Workstation PC(Inc 2); SWAN Virtualization Mgt LAN; Windows 10 SHB Requirement; Enclave Boundary Defense Capability.  LPD 21 - SWAN COMPOSE 4.0.1; SIPRNET CLO COMPOSE 4.0; NIPRNET CLO COMPOSE 4.0; SWAN Workstation PC(Inc 2); SWAN Virtualization Mgt LAN; Windows 10 SHB Requirement; Enclave Boundary Defense Capability. LPD 27 - Windows 10 SHB Requirement  FY 2017 funding profile was reduced $0.303M due to Bipartisan budget reduction.",
                                                            "val": "1.2.1) SWAN-CANES Integration - Organic"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "4.435"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "1.2"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "1.25"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "1.203"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1.203"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "4.435"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.2"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.25"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.203"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.203"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "9.504"
                                                },
                                                "PriorYear": {
                                                    "val": "7.196"
                                                },
                                                "CurrentYear": {
                                                    "val": "11.432"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "9.071"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "9.071"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "Raytheon"
                                                },
                                                "Location": {
                                                    "val": "San Diego, CA"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2015-12"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2016-12"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2017-12"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2016-07"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-07"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-07"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "2"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "7"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "AllPriorYears": {
                                                "val": "43"
                                            },
                                            "PriorYear": {
                                                "val": "16"
                                            },
                                            "CurrentYear": {
                                                "val": "29"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "4"
                                            },
                                            "BudgetYearOne": {
                                                "val": "4"
                                            }
                                        },
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "9.504"
                                            },
                                            "PriorYear": {
                                                "val": "7.196"
                                            },
                                            "CurrentYear": {
                                                "val": "11.432"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "9.071"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9.071"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "AIT:: Installation Name: SWAN-CANES Integration"
                                                    },
                                                    "InstallationCost": {
                                                        "AllPriorYears": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "23"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "20"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "4.986"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "6.35"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "PriorYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "CurrentYear": {
                                                                        "val": "16"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "CurrentYear": {
                                                                        "val": "5.104"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "CurrentYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "29"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "29"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "3.527"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "3.527"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "23"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "20"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "16"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "29"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "29"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "4.986"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "6.35"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "5.104"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "3.527"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "3.527"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "AllPriorYears": {
                                                                "val": "23"
                                                            },
                                                            "PriorYear": {
                                                                "FirstQuarter": {
                                                                    "val": "7"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "7"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "6"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "12"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "9"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "12"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "8"
                                                                }
                                                            }
                                                        },
                                                        "Out": {
                                                            "AllPriorYears": {
                                                                "val": "19"
                                                            },
                                                            "PriorYear": {
                                                                "FirstQuarter": {
                                                                    "val": "4"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "7"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "7"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "6"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "5"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "9"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "12"
                                                                }
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "4.986"
                                            },
                                            "PriorYear": {
                                                "val": "6.35"
                                            },
                                            "CurrentYear": {
                                                "val": "5.104"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "3.527"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "3.527"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "9.504"
                            },
                            "PriorYear": {
                                "val": "7.196"
                            },
                            "CurrentYear": {
                                "val": "11.432"
                            },
                            "BudgetYearOneBase": {
                                "val": "9.071"
                            },
                            "BudgetYearOne": {
                                "val": "9.071"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "4.986"
                            },
                            "PriorYear": {
                                "val": "6.35"
                            },
                            "CurrentYear": {
                                "val": "5.104"
                            },
                            "BudgetYearOneBase": {
                                "val": "3.527"
                            },
                            "BudgetYearOne": {
                                "val": "3.527"
                            }
                        }
                    },
                    "Description": {
                        "val": "[SWAN-CANES Integration] The results of the Shipboard Wide Area Network (SWAN) \/ Consolidated Afloat Networks and Enterprise Services (CANES) study directed the replacement of the C4I capability of the LPD 17 Class SWAN with CANES and the conversion of the non-C4I SWAN into a new HM&E Network (mini SWAN).   SWAN funding is required to field the new HM&E Network in support of the CANES  installation.  In addition, funding is required to sustain the legacy SWAN, while the LPD 17 Class ships await the CANES\/HM&E Network back fit installation.   SWAN serves as the backbone of the LPD 17 class and funding is necessary to address obsolescence, reliability issues, performance concerns, emergent Fleet requirements including enabling Cryptologic Log On (CLO), eradicating Windows XP, replacing aging obsolete network hardware (e.g., servers and core switches), and maintaining the Information Assurance posture of the Common Operating Environment (COE).   This funding is vital to ensure the LPD 17 Class ships can combat the evolving cyber threat."
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}