{
    "id": "2018-Navy-PB-1109N-JBOOK-17739c5c620c15f539dc8999b4e6e3d77ad81ce51089eece75bc6066efab4ac2-20",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "4640"
        },
        "LineItemTitle": {
            "val": "Air Operations C2 Systems"
        },
        "P1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "14"
        },
        "BudgetSubActivityTitle": {
            "val": "Command and Control System (Non-Tel)"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "299.979"
                },
                "PriorYear": {
                    "val": "3.021"
                },
                "CurrentYear": {
                    "val": "15.917"
                },
                "BudgetYearOneBase": {
                    "val": "18.393"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "18.393"
                },
                "BudgetYearTwo": {
                    "val": "7.088"
                },
                "BudgetYearThree": {
                    "val": "5.056"
                },
                "BudgetYearFour": {
                    "val": "1.537"
                },
                "BudgetYearFive": {
                    "val": "1.573"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "299.979"
                },
                "PriorYear": {
                    "val": "3.021"
                },
                "CurrentYear": {
                    "val": "15.917"
                },
                "BudgetYearOneBase": {
                    "val": "18.393"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "18.393"
                },
                "BudgetYearTwo": {
                    "val": "7.088"
                },
                "BudgetYearThree": {
                    "val": "5.056"
                },
                "BudgetYearFour": {
                    "val": "1.537"
                },
                "BudgetYearFive": {
                    "val": "1.573"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "299.979"
                },
                "PriorYear": {
                    "val": "3.021"
                },
                "CurrentYear": {
                    "val": "15.917"
                },
                "BudgetYearOneBase": {
                    "val": "18.393"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "18.393"
                },
                "BudgetYearTwo": {
                    "val": "7.088"
                },
                "BudgetYearThree": {
                    "val": "5.056"
                },
                "BudgetYearFour": {
                    "val": "1.537"
                },
                "BudgetYearFive": {
                    "val": "1.573"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206313M"
                },
                {
                    "val": "0206335M"
                }
            ]
        },
        "Description": {
            "val": "Joint Cooperative Target Identification-Ground (JCTI-G): The Joint Cooperative Target ID - Ground (JCTI-G) program will address four of the 26 capability gaps identified in the validated Combat ID - Friendly Force Tracker (CID-FFT) Joint Capabilities Document (JCD).  A Jun 2010 JFCOM-led AoA concluded, and the USMC concurred, that pursuit of a new material solution and introduction of a new system would not be cost effective.  This conclusion was based upon both cost and ability to address the four defined capability gaps in Combat Identification specific to reducing fratricide of U.S. and coalition forces.  The AoA evaluated the currently Fielded and Planned Capability Improvements (FPCI) resident within funded projects and existing programs of records across all Services and determined that the most affordable alternative would leverage the FPCI programs by allocating the CID-FFT requirements and funding capability improvements within these existing programs. The AoA further concluded that, in addition to significant cost avoidance, leveraging the FPCI to meet the CID-FFT requirements, as opposed to establishing a new program of record material solution, would have greater impact and achieve a higher percentage of CID-FFT JCD capability gap closure by 2016.  In support of a Jan 2010 Memorandum of Understanding between the Vice Chief of Staff of the Army and Assistant Commandant of the Marine Corps (which documents the Army and Marine Corps agreement to support closure of the Fires on Dismounts fratricide mitigation gap), the USMC refocused the program in June 2011 to begin allocation of CID-FFT JCD requirements to the USMC FPCI programs to meet this valid Joint Capabilities Integration and Development System (JCIDS) requirement.  Having no previous CID-FFT requirement, these FPCI programs have neither planned for nor been resourced to support the additional requirements of the CID-FFT JCD.  As a result of these events, this effort will ensure requirements allocation, traceability and validation within 24 USMC FPCI programs in accordance with the CID-FFT JCD and JCIDS processes and provide resource funding and augment workforce to support the additional unanticipated requirements being levied on FPCI programs.  Additionally, it will support aggregation of a time-phased schedule of USMC CID-FFT capabilities and future interoperability engineering\/testing between FPCI systems and related modernization efforts necessary to minimize costs and measure attainment of CID-FFT JCD capability gap closure by 2016. The AoA recommendation, accepted by the Services and OSD, is to maintain and enhance the full range of FPCI programs to meet the requirements and mitigate CID-FFT capability gaps identified in the CID-FFT JCD.  The intent is to reduce fratricide, uphold the DOD and USMC position on JCTI-G, remain consistent with the AoA recommendations, comply with the purpose of JCTI-G appropriations, and support capability gap closure in accordance with the AoA and OSD led OIPT findings. (RDTE: 0206313M)\n\nComposite Tracking Network (CTN) - The Composite Tracking Network (CTN) system distributes composite tracking data to Command and Control (C2) and weapon systems participating in a Cooperative Engagement Capability (CEC) network.  The system will significantly contribute to real-time situational awareness.  The program received ACAT III designation in Nov 01. The program is USMC led with US Navy and US Army cooperation. The CTN program is executing a single-step to full capability acquisition strategy by integrating Commercial Off-the-Shelf (COTS) and Non-Development Item (NDI) subsystems. AAO: 10 systems.  The 12 April 1995 Mission Need Statement (MNS) No. AAS 48 for the Common Aviation Command and Control System (CAC2S) established the Marine Corps' need to upgrade its existing air defense architecture with capabilities to support improved situational awareness (SA) and advanced engagement concepts.  The Composite Tracking Network (CTN) program was initiated to address this capability gap.  The CTN system (AN\/MSQ-143) is an integration effort consisting of an AN\/USG-4A and other Marine-unique components.  All Marine-unique components are Government Furnished Equipment (GFE) with the exception of the shelter and mast.  The components include: Vehicle - M1152A-1 (GFE Marine Corps Systems Command (MCSC), Trailer - M102 LTT-MCC (GFE MCSC), 10 KW Generator - MEP 803 (GFE MCSC), Tactical Radio - AN\/MRC103 (GFE MCSC), Global Positioning System - DAGR (GFE MCSC), Environmental Control Unit - BOO03 (GFE MCSC), Shelter - S788 (COTS NSWC Crane), and Antenna Mast - TEAMS EXL 195\/26-5.4 (COTS Naval Surface Warfare Center Crane).  The CTN system will interface with the AN\/TPS-59 radar and CAC2S to provide the Marine Air-Ground Task Force (MAGTF) and Joint Task Force Commanders a ground-based sensor netting solution that correlates sensor measurement data (target velocity and position) from local and remote radars that interface in the CEC network.  This data will effectively increase Situational Awareness by providing accurate, composite, real-time surveillance tracks.  Interfaces with CTN include CAC2S and the Ground\/Air Task Oriented Radar (G\/ATOR). Procurement of Common Array Block - Expeditionary (CAB-E) to replace obsolete Compact Solid State Antenna (CSSA) to begin FY 2018.  (RDTE: 0206313M)\n\nMarine Air Command and Control (MACCS) - MACCS Family of Systems (FoS) is organized into tactical agencies and operational facilities, each having different functions, tasks, and equipment suites.  These agencies are fielded and supported by squadrons within the Marine Air Control Group (MACG) in support of the Aviation Combat Element (ACE).  The tactical agencies are:  the Tactical Air Command Center (TACC), the Tactical Air Operations Center (TAOC), and the Direct Air Support Center (DASC).   The core MACCS systems consist of:  The AN\/TYQ-23 Tactical Air Operations Module (TAOM); AN\/TYQ-101 Communications Data Link System (CDLS); AN\/MRQ-12(V)4 Communications Interface System (CIS); AN\/TYQ-87(V)2 Sector Anti Air Warfare Facility; AN\/UYQ-3B Direct Air Support Central\/Airborne System (DASC\/AS); and the AN\/MSQ-124 Air Defense Communications Platform (ADCP).  The MACCS FoS program office ensures that the TACC, TAOC, and DASC systems remain ready, relevant, and capable until Full Operational Capability (FOC) of Common Aviation Command and Control System (CAC2S). (RDTE: 0206313M)\n\nRemote Video Viewing Terminal (RVVT) - Consists of Video Down-Link (VDL) products such as the VideoScout Mobile Configuration 2 (VS-MC\/2), VideoScout Mobile Configuration 3 (VS-MC\/3), and Man Portable Video Down-Link (MPVDL) that allow for the viewing and exploitation of Full Motion Video (FMV) from Intelligence, Surveillance and Reconnaissance (ISR) assets.  VDL systems are mission critical for coordination of direct and indirect fires and the prevention of fratricide.  These systems provide the warfighter with video and metadata from all USMC manned and unmanned aircraft such as the Raven B, Puma, Micro-UAS, Shadow, Predator, Fire Scout, and Litening Pod on P-3, AV8-B, and F\/A-18.  Data is displayed to Forward Observers (FO), Joint Fires Observers (JFO), Joint Terminal Attack Coordinators (JTAC), and Forward Air Controller (FAC). \n\nTheater Battle Management Core System (TBMCS) - Joint mandated Air War planning tool for the generation, dissemination, and execution of the Air Tasking Order (ATO).  TBMCS is an Air Force led program, which provides the automated tools necessary to manage tactical air operations, execute area air defense and airspace management in the tactical area of operation, and coordinate operations with components of other military services.  TBMCS is located at the Tactical Air Command Center (TACC), with remotes located throughout the Marine Air Ground Task Force (MAGTF).  It is scalable, allowing for joint, coalition, and service specific operations.  It is an evolutionary acquisition program. (RDTE: 0206313M)\n\nIntegrated Range Status System (IRSS)- The IRSS is a position location and area status display system that allows range and\/or air traffic controllers to update area status information and monitor commercial and military aircraft within special use airspace (SUA) using information, if available, from radars and  air and ground position location information (PLI) systems.\n\nCommon Aviation Command and Control (CAC2S) - Prior year funding resides in this Budget Line Item.  Funding for FY 2015 and beyond resides in Budget Line Item 4644. (RDTE: 0206313M, Project 2273 for FY 2014 and prior. PE 0206335M, Project 3373 for FY 2015 and beyond)."
        },
        "Justification": {
            "val": "FY 2018 Base Appropriation ($18.393M):\n\nComposite Tracking Network (CTN) $5.360M - Funds support the procurement of quantity five Common Array Block - Expeditionary (CAB-E) and associated New Equipment Training (NET). Funds also support completion of AN\/USG-4B retrofit and fielding.  Increase of $3.845M from FY 2017 to FY 2018 reflects procurement of five CAB-E antennas and associated NET. \n\nMarine Air Command and Control (MACCS) $2.662M - Funds support the procurement of twenty five (25) Multifunctional Information Distribution System (MIDS) Block II Upgrades in accordance with DoD mandate and to ensure participation in any radio frequency Link-16 network.  Decrease of $0.193M in FY18 is due to reduction of field activity support\nrelated to procurement of Multifunctional Information Distribution System\n(MIDS) Block II Upgrades.\n\nTheater Battle Management Core System (TBMCS)  $1.902M -  Funding continues efforts such as on-site fielding representatives to support updated software and hardware fielding and the incremental procurement of new hardware for TBMCS to maintain cyber security accreditation as well as associated NET.  Increase of $0.603M from FY 2017 to FY 2018 reflects additional funding required for procurement of hardware\/software to mitigate obsolescence and avoid cyber security vulnerabilities as well as associated training and implementation costs.\n\nRemote Video Viewing Terminal (RVVT) $8.469M- Funds will procure hardware and ancillary equipment for the integration of the Full Motion Video capability into a user supported viewing platform. The decrease in funding from FY17 to FY18 ($1.779M) is due to a decreased requirement for MC2 ancillary components and cabling.\n\nOCO: \nFY2018 Overseas Contingency Operations (OCO): N\/A"
        },
        "MDAPCode": {
            "val": "N36"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}