{
    "id": "2018-Navy-PB-1810N-JBOOK-d28d83334f9383e77611ff4064e40d00fd933e9ab87acc3419c09665f6cb2c63-41",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA1-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "1610"
        },
        "LineItemTitle": {
            "val": "LSD Midlife & Modernization"
        },
        "P1LineNumber": {
            "val": "42"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "16"
        },
        "BudgetSubActivityTitle": {
            "val": "Logistic Support"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "573.811"
                },
                "PriorYear": {
                    "val": "48.174"
                },
                "CurrentYear": {
                    "val": "10.813"
                },
                "BudgetYearOneBase": {
                    "val": "89.536"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "89.536"
                },
                "BudgetYearTwo": {
                    "val": "6.31"
                },
                "BudgetYearThree": {
                    "val": "42.365"
                },
                "BudgetYearFour": {
                    "val": "64.91"
                },
                "BudgetYearFive": {
                    "val": "64.953"
                },
                "Total": {
                    "val": "900.872"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "573.811"
                },
                "PriorYear": {
                    "val": "48.174"
                },
                "CurrentYear": {
                    "val": "10.813"
                },
                "BudgetYearOneBase": {
                    "val": "89.536"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "89.536"
                },
                "BudgetYearTwo": {
                    "val": "6.31"
                },
                "BudgetYearThree": {
                    "val": "42.365"
                },
                "BudgetYearFour": {
                    "val": "64.91"
                },
                "BudgetYearFive": {
                    "val": "64.953"
                },
                "Total": {
                    "val": "900.872"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "573.811"
                },
                "PriorYear": {
                    "val": "48.174"
                },
                "CurrentYear": {
                    "val": "10.813"
                },
                "BudgetYearOneBase": {
                    "val": "89.536"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "89.536"
                },
                "BudgetYearTwo": {
                    "val": "6.31"
                },
                "BudgetYearThree": {
                    "val": "42.365"
                },
                "BudgetYearFour": {
                    "val": "64.91"
                },
                "BudgetYearFive": {
                    "val": "64.953"
                },
                "Total": {
                    "val": "900.872"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Modernized LSD 41\/49 Class ships transport and launch amphibious craft and vehicles with their crews and embarked personnel in amphibious assault operations. Supporting amphibious operations include landings via Landing Craft, Air Cushion (LCAC), conventional landing craft, and helicopters, onto hostile shores.\n\nPRIOR SMOSF EQUIPMENT: $64.3 million requested in FY 2018 is for installation of equipment on LSD 46 USS Tortuga.  For FY 2018-FY 2022, this funding is shifting from SMOSF to the base budget.  This equipment was procured in prior years with SMOSF funds.  LSD 46 Tortuga Midlife is being installed as phased modernization.  The LSD 46 Phased Modernization program replaces obsolete\/unsupported HM&E systems and legacy C5I systems, and implements TOC savings upgrades to maintain amphibious warfare capabilities through DECOM (2038).  These include items such as LPAC, Steering Control Systems (SCS), A\/C-plants, Generators, Propulsion Load Management Units (PLMU), Reverse Osmosis (RO) Desalinators, Automated Digital Network System (ADNS), Battle Force Tactical Network (BFTN), Digital Modular Radio (DMR), Global Broadcast System (GBS), Information Systems Security Program (KMI and KW46), Naval Modular Automated Communications System (NAVMACS), Advanced Digital Antenna Production (ADAP), Navy Multiband Terminal (NMT), CRYPTO, Ship Self Defense System (SSDS) Upgrade suite, Interior Communications (IC) Systems and LSD 46 Davit Upgrade.\n\nThe LSD 41 Whidbey Island and LSD 42 Germantown is being installed as phased modernization receiving a five year service life extension package.\n\n[P40A \/ ST001 C4I Systems]: Procures C4I System including equipment procurement, recurring equipment engineering, equipment integration, and ILS.\n\n[P40A \/ Canned Lube Oil Pump]: Procures and installs a lube oil pump and controllers for the main four (4) propulsion diesel engines, including piping and sensor modifications.\n\n[P40A \/ ST5IN Installation\/DSA\/AIT]: Provides Planning Yard Design Services Allocation (DSA) (design, advance planning, and kitted material), MSR installations and AIT installation support.\n\n[P40A \/ LSD 41 FY22 EDSRA INSTALLATION \/ AIT]: FY22 EDSRA Availability for Major Ship Repair (MSR) \/ AIT installations.  Availability installs HM&E Mod Conjunctive Alteration, C4I Systems, IC Systems, and Combat Systems.\n\n[P40A \/ LSD 46 FY18 EDSRA Installation \/ AIT]: FY18 Extended Docking Selected Restricted Availability (EDSRA) Availability for MSR \/ AIT installations.  Availability installs include C4I Systems, IC Systems, Combat Systems, and HM&E Mod and Conjunctive Alterations (Reverse Osmosis (RO) configurations specific to the LSD 46, Electric Water Heater and Galley Mods for All Electric Upgrade, 130 Ton Air Conditioning Plant, Damage Control Console Upgrades, and Slewing Arm Davit.)  This is installation of equipment that was procured in prior years with SMOSF funds.\n\n[P40A \/ LSD 46 Design Services Allocation (DSA)]: FY15 SMOSF for First Year DSA and ADVANCE PLANNING LLTM on the LSD 46 USS Tortuga.  FY16 SMOSF for DSA and ADVANCE PLANNING LLTM on the LSD 46 USS Tortuga.\n\n[P40A \/ ST001 - LSD Conjunctive Combat System]: Procures Combat Systems including equipment procurement, recurring equipment engineering, equipment integration, and ILS.\n\n[P40A \/ LSD 41 Combat System Equipment]: Procures LSD 41 Ship Self Defense System (SSDS) combat system upgrade suite.\n\n[P40A \/ LSD 46 Combat System Equipment]: Procures LSD 46 Ship Self Defense System (SSDS) combat system upgrade suite.\n\n[P40A \/ ST001 - HM&E Mod]: Procures HM&E Modernization Systems including equipment procurement, recurring equipment engineering, equipment integration, and ILS.\n\n[P40A \/ ST001 LSD 41 HM&E Mod and Conjunctive Alterations]: Procurements in FY20 are for HM&E Midlife Mods and Conjunctive Alterations for LSD 41.  FY20 Conjuctive Alteration procurement costs included equipment procurements, recurring engineering, equipment integration, and integrated logistics support for the 5 year extended service life modernization package.  Equipment is scheduled to be installed on the LSD41 FY22 EDSRA.\n\n[P40A \/ ST001 LSD 46 HM&E Mod and Conjunctive Alterations]: Procurements in FY16 HM&E Midlife Mods and Conjunctive alterations was funded under Ship Modernization Operation Sustainment Fund (SMOSF) for LSD 46.  FY16 Alterations procurement costs included equipment procurements, recurring engineering, equipment integration, and integrated logistics Support.  Alterations include Reverse Osmosis (RO) configurations specific to the LSD 46, Electric Water Heater and Galley Mods for All Electric Upgrade, 130 Ton Air Conditioning Plant, \nDamage Control Console Upgrades, and Slewing Arm Davit.  Equipment is scheduled to be installed on the LSD 46 FY18 EDSRA.\n\n[P40AMOD \/ ST002 -  Propeller Blades & PLMU]: Replaces the existing Propeller Blades with higher efficiency blades and installs Propulsion Load Management Units (PLMU).\n\n[P40AMOD \/ ST002 - Steering Control System]: Replaces the analog Helm and Lee Helm Steering Consoles and equipment with an electronic, computerized Steering Control System (SCS).\n\n[P40AMOD \/ ST002 - Low Pressure Air Compressor]: Replaces the Low-Pressure Air Compressors (LPAC) with modern, oil-free compressors.\n\n[P40AMOD \/ LT329 LSD Deck Crane]: LT329 - Replaces the control system for the 60 and 20 Ton Cranes with a modern, electronic, computerized control system.\n\n[P40AMOD \/ LT329 LSD Flight Deck Thermal Management System]: Provides Flight Deck Thermal Management System (FDTMS) on the flight deck to mitigate damage resulting from MV-22 vertical take off\/landing (VTOL) flight operations.\n\n[P40AMOD \/ LT329 - LSD Ballast Control Console]: Provides upgrades to the existing Ballast Control Consoles (BCS).\n\n[P3A - 8 \/ ST002 - Generators & Elect Distribution]: Replaces the generator on the Ship Service Diesel Generators (SSDG) with a higher wattage version and increased electric distribution capability for shore power, switchboard and load centers."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "@footnote": "(1) PRIOR SMOSF EQUIPMENT: $64.3 million requested in FY 2018 is for installation of equipment on LSD 46 USS Tortuga.  For FY 2018-FY 2022, this funding is shifting from SMOSF to the base budget.  This equipment was procured in prior years with SMOSF funds.  (a) The Consolidated Appropriations Act, 2015, H.R. 8110 re-appropriated and extended the Ship Modernization, Operations and Sustainment fund (SMOSF) to provide for costs associated with the continued operations and modernization of eleven CGs and LSD 46.  Received $13,800,000 FY15 SMOSF funds for the LSD 46 Tortuga.  Received $45,400,000 FY16 SMOSF for the LSD 46 Tortuga. (b) FY15 C4I procurements, FY16 HM&E Modernization procurements, FY16 combat systems procurement and FY16 SSRA for LSD 46 Tortuga. (c) FY15 SMOSF for First Year DSA on the LSD 46 Tortuga.  FY16 SMOSF for DSA and ADVANCE PLANNING LLTM on the LSD 46 Tortuga. (d) Funding for FY18 - FY22 is shifting funds from SMOSF to base budget.",
                        "val": "LSD Midlife"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "@footnote": "FY2015\/FY2016 ST001-C4I System funded via Ship Modernization, Operations, and Sustainment Funds (SMOSF).",
                                    "val": "1) ST001 C4I Systems"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Automated Digital Network System (ADNS)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.497"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) Battle Force Tactical Network (BFTN)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.22"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.3) Digital Modular Radio (DMR)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.755"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.396"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.4) Global Broadcast System (GBS)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.383"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.5) Information Systems Security Program  (KMI and KW46)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.11"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.6) Naval Modular Automated Communications System (NAVMACS)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.301"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.7) Advanced Digital Antenna Production (ADAP)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.425"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.8) Navy Multiband Terminal (NMT)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.635"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.9) CRYPTO"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.082"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.10) CANES"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "5"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.11) VINSON\/ANDVT Cryptographic Modernization (VACM)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.325"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.12) Interior Communications (IC) Systems"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "3.3"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Procures and installs a lube oil pump and controllers for the main four (4) propulsion diesel engines, including piping and sensor modifications.",
                                                "val": "1.13) Canned Lube Oil Pump"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "15.754"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.789"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "26.162"
                                        },
                                        "PriorYear": {
                                            "val": "9.021"
                                        },
                                        "CurrentYear": {
                                            "val": "0.789"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "FY2016 ST5IN Installation\/DSA\/AIT funded via Ship Modernization, Operations, and Sustainment Funds (SMOSF).",
                                    "val": "2) ST5IN Installation\/DSA\/AIT"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.3) LSD 46 FY18 EDSRA Installation \/ AIT"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "63.3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "63.3"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.4) LSD 46 Special Selected Restrited Availability (SSRA)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "9.4"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "FY15 SMOSF for First Year DSA and ADVANCE PLANNING LLTM on the LSD 46 USS Tortuga.  FY16 SMOSF for DSA and ADVANCE PLANNING LLTM on the LSD 46 USS Tortuga.",
                                                "val": "2.5) LSD 46 Design Services Allocation (DSA)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.392"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.5"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "3.392"
                                        },
                                        "PriorYear": {
                                            "val": "13.9"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "64.3"
                                        },
                                        "BudgetYearOne": {
                                            "val": "64.3"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "FY2016 LSD 46 Conjunctive Combat System funded via Ship Modernization, Operations, and Sustainment Funds (SMOSF).",
                                    "val": "3) ST001 - LSD Conjunctive Combat System"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.2) LSD 46 Combat System Equipment"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "7.456"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "7.456"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) ST001 - HM&E Mod"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Procurements in FY16 HM&E Midlife Mods and Conjunctive alterations was funded under Ship Modernization Operation Sustainment Fund (SMOSF) for LSD 46.  FY16 Alterations procurement costs included equipment procurements, recurring engineering, equipment integration, and integrated logistics Support.  Alterations include Reverse Osmosis (RO) configurations specific to the LSD 46, Electric Water Heater and Galley Mods for All Electric Upgrade, 130 Ton Air Conditioning Plant,  Damage Control Console Upgrades, and Slewing Arm Davit.  Equipment is scheduled to be installed on the LSD 46 FY18 EDSRA.",
                                                "val": "4.2) ST001 LSD 46 HM&E Mod and Conjunctive Alterations"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "15.023"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "15.023"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "Accounting entry for prior year funds of all other cost elements no longer funded.",
                                    "val": "5) Other Prior Year Costs"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) All Other Prior Year Costs"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "459.382"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "459.382"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "488.936"
                            },
                            "PriorYear": {
                                "val": "45.4"
                            },
                            "CurrentYear": {
                                "val": "0.789"
                            },
                            "BudgetYearOneBase": {
                                "val": "64.3"
                            },
                            "BudgetYearOne": {
                                "val": "64.3"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "ST002 -  Propeller Blades & PLMU"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "FMP Ship Units -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "7"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.121"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.742"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1017285.71"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1742000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "FMP Ship Units -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.678"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.373"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.362"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.362"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "End Item Spares"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.938"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "969000"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "17.737"
                                        },
                                        "CurrentYear": {
                                            "val": "2.115"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.362"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.362"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Models of Systems Affected: Propeller Blades & PLMU\n\nThis SHIPALT replaces the existing Propeller Blades with higher efficiency blades and installs Propulsion Load Management Units (PLMU) that result in fuel savings and engine maintenance reduction as well as operational benefits.  The prototype for this SHIPALT was installed and proven aboard the LSD 44 under the DOD sponsored Commercial Operations and Support Savings Initiative (COSSI).  Return On Investment (ROI) for the class is estimated at over $40M (after payback) and operational benefits include increased top speed, quicker response\/deceleration, and elimination of existing system performance problems (i.e., low lube-oil pressure trip of main engines).  Only 9 LSDs will require this SHIPALT as part of the Midlife Program."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "17.737"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "2.115"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.362"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "1.362"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "ST002 - Steering Control System"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Non-FMP Shore Site Units -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.433"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "716500"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Non-FMP Shore Site Units -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.102"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "IN\/OUT based on current phased mod availability. FY 2017 DSA ($1.2 million) efforts in support of the FY 2018 LSD Class install.",
                                                "val": "FMP Ship Units -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "11"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "9.582"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.844"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "871090.91"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "844000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "FMP Ship Units -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "32.591"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.228"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.828"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.828"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "50.708"
                                        },
                                        "CurrentYear": {
                                            "val": "2.072"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.828"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.828"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Models of Systems Affected: Steering Control System\n\nThis SHIPALT replaces the analog Helm and Lee Helm Steering Consoles and equipment with an electronic, computerized Steering Control System (SCS) that integrates various navigation parameters, such as location (latitude, longitude) from GPS as well as pitch, roll, speed, heading, and wind.  SCS will be designed to integrate with Electronic Chart Display and Information Systems-Navy (ECDIS-N) digital nautical charts. The existing Bridge control system was designed in the late 1970s and is near the end of its useful service life.  Parts obsolescence is a rapidly growing and more costly problem on this maintenance intensive control system.  The IBS also provides significantly enhanced operational and monitoring capabilities as well as real-time Navigation data.  This system will reduce workload, provide significant readiness improvement, improve safety and provide cost avoidance."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "50.708"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "2.072"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.828"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "1.828"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "ST002 - Low Pressure Air Compressor"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "FMP Ship Units -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "7"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "5.73"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.75"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "818571.43"
                                                    },
                                                    "PriorYear": {
                                                        "val": "750000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "FMP Ship Units -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "10.7"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.327"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.438"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.438"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "16.43"
                                        },
                                        "PriorYear": {
                                            "val": "0.85"
                                        },
                                        "CurrentYear": {
                                            "val": "0.327"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.438"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.438"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Models of Systems Affected: LPAC\n\nThis Ship Change replaces the Low-Pressure Air Compressors (LPAC) with modern, oil-free compressors.   Parts obsolescence is a rapidly growing and more costly problem on these maintenance intensive compressors.  This Ship Change provides Return On Investment (ROI) through improved reliability and maintainability of LPACs and reduced maintenance by elimination of oil contamination of pneumatic controls components (new compressors are oil-free).  In addition, the new compressors will provide significant readiness improvement through increased reliability of Vital, low-pressure air supply to Vital combat systems and the main propulsion controls."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "16.43"
                            },
                            "PriorYear": {
                                "val": "0.85"
                            },
                            "CurrentYear": {
                                "val": "0.327"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.438"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "1.438"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "LT329 LSD Deck Crane"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "FY18 Non-Recurring Engineering (NRE) is required to support the first procurement in FY20 and the installation of two alterations (20 Ton Crane and 60 Ton Crane) in FY21, which is scheduled to start in January of 2021. Funds will be used to identify obsolete and at-risk parts\/subsystems (brakes, motors, safety devices), to redesign and upgrade electrical and control systems (motor controllers, electrical circuits, panels, and switches), to improve design of high failure items, and to upgrade operator control interface and preservation corrosion control requirements.  Other NRE efforts include conducting vendor and industrial surveys to identify current obsolete crane components and recommending best course of actions for life-cycle support.  Other efforts involve identifying new training requirements, spare parts requirements, technical manual updates and other logistics element support.",
                                                "val": "Non-recurring Engineering"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.736"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.736"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.736"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.736"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "SCD 19102 (60 Ton) and SCD 19770 (20 Ton) Crane controls - These ship changes replaces the control system for the 60 and 20 Ton Cranes with a modern, electronic, computerized control system. The existing crane control system was designed in the late 1970s and is no longer logistically supported. Maintenance costs continue to be high due to the difficulty in obtaining repair parts and frequent failure of components. In addition, mission capability has been frequently degraded because the Deck Crane is required to support USMC amphibious assault landings and boat ops. The LSD-41 class crane control upgrades will include: replace obsolete and at-risk parts\/subsystems (brakes, motors, safety devices), replace and upgrading electrical and control system (motor controllers, electrical circuits, panels, and switches), improve design of high failure items, upgrade operator control interface and preservation corrosion control requirements."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.736"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "1.736"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "LT329 LSD Flight Deck Thermal Management System"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "LSD Flight Deck Thermal Management System -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.164"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.164"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.164"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.164"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Non-recurring Engineering"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.256"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.256"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.256"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.256"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "SCD 16657 - The Flight Deck Thermal Management System (FDTMS) consists of the installation of heat mitigating, two layer, composite panels that provides heat protection to the helicopter deck to mitigate damage resulting from MV-22 vertical take off\/landing (VTOL) flight operations."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.42"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.42"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "LT329 - LSD Ballast Control Console"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "BALLAST CONTROL CONSOLE UPGRADE -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.248"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.248"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.248"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.248"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "FY18 NRE is required to support Request for Proposal (RFP) and first procurement award in FY19 without schedule delays. Funds will be used to identify obsolete and at-risk 1970's vintage parts\/subsystems, to redesign and upgrade electrical and control systems (motor controllers, electrical circuits, panels, and switches), to improve design of high failure items, and to upgrade operator ballast control console interface and preservation corrosion control requirements.  Other NRE efforts include conducting vendor and industrial surveys to identify currently obsolete ballast control console components, recommending best course of actions for life-cycle support, and identifying new training requirements, spare parts requirements, technical manual updates, other logistics element support. Additional Engineering\/Non-Recurring Engineering is for performing Electro-Magnetic Interference (EMI), shock and vibration testing; and for development of the formal lifecycle training Front End Analysis (FEA), development of the formal lifecycle training Navy Training System Plan (NTSP) and procurement of training equipment for the LSD controls systems Maintainer Classrooms in Norfolk and San Diego. Also funds the In-Service Engineering Agent (ISEA) to serve as the government Subject Matter Expertise (SME) for evaluating new ballast control console designs, interfacing with commercial manufactures, evaluating new technologies, and determining best form\/fit\/function for ballast control design efforts.",
                                                "val": "System Engineering\/NonRecurring Engineering"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.18"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.18"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.18"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.18"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "SCD 10828 - Ballast Control Console (BCS) - This mission and safety critical SCD addresses system degradation due to obsolescence issues, extensive downtime and reduced system capability\/reliability. The system is currently operating in a degraded capacity and requires immediate replacement.  The SCD leverages hardware\/software commonality with LSD Tech Refresh and LHD Mid Life efforts to integrate legacy equipment controlled and monitored in BCS utilizing an Open System Architecture."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.428"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "1.428"
                            }
                        }
                    }
                }
            ],
            "P3AModificationItemGroup": [
                {
                    "ModificationTitle": {
                        "val": "ST002 - Generators & Elect Distribution"
                    },
                    "ModificationNumber": {
                        "val": "8"
                    },
                    "ModificationType": {
                        "val": "TBD"
                    },
                    "Model": {
                        "val": "Generators & Elect Distribution"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "1.924"
                            },
                            "CurrentYear": {
                                "val": "5.51"
                            },
                            "BudgetYearOneBase": {
                                "val": "17.024"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "17.024"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "1.924"
                            },
                            "CurrentYear": {
                                "val": "5.51"
                            },
                            "BudgetYearOneBase": {
                                "val": "17.024"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "17.024"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "1.924"
                            },
                            "CurrentYear": {
                                "val": "5.51"
                            },
                            "BudgetYearOneBase": {
                                "val": "17.024"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "17.024"
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "ST002 - Generators & Elect Distribution"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "@footnote": "The replacement generator to be installed in FY18 for LSD-46 is procured in components and is budgeted in FY16, FY17, and FY18 based on the production lead-times of individual components. FY16 funding is required to procure generator couplings, load centers, shore power receptacles, and shore power switchboard with lead-times ranging from 11 to 21 months. IN\/OUT based on current phased mod availability.  FY17 DSA is for the year prior to install costs associated with the remainder of Midlife Long Lead Time Material and Advanced Planning.  IN\/OUT based on current phased mod availability.  FY18 funding is required to procure Generator and Electric Distribution System Sensors, circuit breakers, buss bars, and actuators.",
                                                            "val": "1.1.1) FMP Ship Units - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "PriorYear": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "PriorYear": {
                                                                    "val": "1.738"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "2.576"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "0.649"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "0.649"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.738"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.576"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.649"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.649"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "0"
                                                },
                                                "PriorYear": {
                                                    "val": "1.738"
                                                },
                                                "CurrentYear": {
                                                    "val": "2.576"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "0.649"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "0.649"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "Awua-Chem"
                                                },
                                                "Location": {
                                                    "val": "Knoxiville, TN"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2016-03"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-01"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2017-12"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-12"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "2"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "21"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "PriorYear": {
                                                "val": "1"
                                            }
                                        },
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "1.738"
                                            },
                                            "CurrentYear": {
                                                "val": "2.576"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.649"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.649"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "SHIPYARD\/AIT:: Installation Name: FMP Ship Units"
                                                    },
                                                    "InstallationCost": {
                                                        "PriorYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "PriorYear": {
                                                                        "val": "0"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "1"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "1"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "PriorYear": {
                                                                        "val": "0.186"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "2.934"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "16.375"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "16.375"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "PriorYear": {
                                                                        "val": "0"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "1"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "1"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "PriorYear": {
                                                                        "val": "0.186"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "2.934"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "16.375"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "16.375"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "1"
                                                                }
                                                            }
                                                        },
                                                        "Out": []
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0"
                                            },
                                            "PriorYear": {
                                                "val": "0.186"
                                            },
                                            "CurrentYear": {
                                                "val": "2.934"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "16.375"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "16.375"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "1.738"
                            },
                            "CurrentYear": {
                                "val": "2.576"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.649"
                            },
                            "BudgetYearOne": {
                                "val": "0.649"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0.186"
                            },
                            "CurrentYear": {
                                "val": "2.934"
                            },
                            "BudgetYearOneBase": {
                                "val": "16.375"
                            },
                            "BudgetYearOne": {
                                "val": "16.375"
                            }
                        }
                    },
                    "Description": {
                        "val": "This SHIPALT replaces the generator on the Ship Service Diesel Generators (SSDG) with a higher wattage version and increased electric distribution capability for shore power, switchboard and load centers. This SHIPALT provides significant Return on Investment (ROI) through improved reliability and maintainability of electrical ship systems\/equipment versus the obsolete and maintenance intensive equipment.  Also, additional electrical plant loads will improve efficient operation of the currently under-loaded SSDGs and contribute to the ROI through reduced maintenance costs for the SSDGs."
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}