{
    "id": "2018-Army-PB-2033A-JBOOK-97766fb5efc36974a03ffece59c3d5581ef4425fe875bd1f1fb7d73a21f355ae-29",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_WTCV-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2033A",
        "appropriation_name": "Procurement of W&TCV, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "GZ1290"
        },
        "LineItemTitle": {
            "val": "M249 SAW Machine Gun MODS"
        },
        "P1LineNumber": {
            "val": "30"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2033A"
        },
        "AppropriationTitle": {
            "val": "Procurement of W&TCV, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Weapons and Other Combat Vehicles"
        },
        "BudgetSubActivityNumber": {
            "val": "20"
        },
        "BudgetSubActivityTitle": {
            "val": "Mod of Weapons and Other Combat Veh"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "214.241"
                },
                "PriorYear": {
                    "val": "1.19"
                },
                "CurrentYear": {
                    "val": "1.179"
                },
                "BudgetYearOneBase": {
                    "val": "3.339"
                },
                "BudgetYearOne": {
                    "val": "3.339"
                },
                "BudgetYearTwo": {
                    "val": "3.959"
                },
                "BudgetYearThree": {
                    "val": "4.526"
                },
                "BudgetYearFour": {
                    "val": "3.444"
                },
                "Total": {
                    "val": "231.878"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "214.241"
                },
                "PriorYear": {
                    "val": "1.19"
                },
                "CurrentYear": {
                    "val": "1.179"
                },
                "BudgetYearOneBase": {
                    "val": "3.339"
                },
                "BudgetYearOne": {
                    "val": "3.339"
                },
                "BudgetYearTwo": {
                    "val": "3.959"
                },
                "BudgetYearThree": {
                    "val": "4.526"
                },
                "BudgetYearFour": {
                    "val": "3.444"
                },
                "Total": {
                    "val": "231.878"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "214.241"
                },
                "PriorYear": {
                    "val": "1.19"
                },
                "CurrentYear": {
                    "val": "1.179"
                },
                "BudgetYearOneBase": {
                    "val": "3.339"
                },
                "BudgetYearOne": {
                    "val": "3.339"
                },
                "BudgetYearTwo": {
                    "val": "3.959"
                },
                "BudgetYearThree": {
                    "val": "4.526"
                },
                "BudgetYearFour": {
                    "val": "3.444"
                },
                "Total": {
                    "val": "231.878"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "1.19"
                                },
                                "CurrentYear": {
                                    "val": "1.179"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.339"
                                },
                                "BudgetYearOne": {
                                    "val": "3.339"
                                },
                                "BudgetYearTwo": {
                                    "val": "3.959"
                                },
                                "BudgetYearThree": {
                                    "val": "4.526"
                                },
                                "BudgetYearFour": {
                                    "val": "3.444"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "1.19"
                    },
                    "CurrentYear": {
                        "val": "1.179"
                    },
                    "BudgetYearOneBase": {
                        "val": "3.339"
                    },
                    "BudgetYearOne": {
                        "val": "3.339"
                    },
                    "BudgetYearTwo": {
                        "val": "3.959"
                    },
                    "BudgetYearThree": {
                        "val": "4.526"
                    },
                    "BudgetYearFour": {
                        "val": "3.444"
                    }
                }
            }
        },
        "Description": {
            "val": "The M249 Squad Automatic Weapon (SAW) is a 5.56mm, lightweight machine gun that can be utilized in either the automatic rifle role or light machine gun role. Various system enhancements have been identified that improve the use of this weapon system. These include the addition of a feedtray cover rail and forward rail assemblies. The addition of these rails provides a Military-Standard-1913 interface allowing the mounting of standard military optics and other target designation devices directly to the machine gun. Improved components include a collapsible buttstock, bipod, drop-in mount cradle and 200-round ammunition pack. Other items being procured to enhance Soldier performance include design modifications to the lightweight ground mount, short barrel, short barrel blank firing adapter, improved sling assembly and improved extractor and op-rod kits.\n\nThe M197 Vehicle Mount is the current standard used to mount the M249 SAW and M240B Medium Machine Gun to most vehicle platforms. A system improvement (drop in mount cradle) adds a link\/spent case deflector and ammo handling system to provide capability upgrades addressing issues that Soldiers have identified as shortcomings of the current system. \n\nThe M192 is the primary ground mount for the M240B\/L and M249 machine guns. Based on recent combat experience, improvements are required to address identified shortcomings in the design and to enhance operational performance."
        },
        "Justification": {
            "val": "FY 2018 Base procurement dollars in the amount of $3.339 million supports the Active Army by purchasing Collapsible Buttstocks and M197 Modification Work Order (MWO) Kits (drop-in mount cradle) for the M249 SAW Machine Gun weapon system.  Continues support on Short Barrels, Short Barrel Blank Firing Adapters (BFA), M192 Lightweight Ground Mount improvements (MWO Kits), and Feedbox Support Improvement Kits (FSIK).  The M249 SAW when deployed with a collapsible buttstock and short barrel it reduces the overall weapon length by 10 inches, when compared to the standard issue M249 SAW.  The shorter length improves Military Operation in Urban Terrain (MOUT) and Airborne\/Air Assault Operations.  It allows for easier egress and entrance into vehicles and confined areas, also facilitates clearing operation in current urban combat environments.  Improvements to the short barrel will also increase durability and enhance the operability by the Warfighter.   The shortened M249 SAW improves survivability in extended missions and close combat situations encountered in current war-time deployments.  \n\nThe M197 MWO Kit (drop-in mount cradle) upgrades the existing M197 Vehicle Mounts to add a link\/spent case deflector and ammo handling system.  These upgrades provide capability improvements addressing issues that Soldiers have identified as shortcomings of the current system.  The M192 MWO Kit upgrades the primary lightweight ground mount used for the M249 to address shortcomings detected during recent combat excursions. \n \nIn accordance with Section 1815 of the FY2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}