{
    "id": "2018-Army-PB-2035A-JBOOK-377d93ca794817f44e4b0e8b6a4ac9da01254c9911de0ea9a8ab395d402568a9-51",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_OTHER_2-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "BK5300"
        },
        "LineItemTitle": {
            "val": "Biometric Tactical Collection Devices (MIP)"
        },
        "P1LineNumber": {
            "val": "77"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "80"
        },
        "BudgetSubActivityTitle": {
            "val": "Elect Equip - Tact Int Rel Act (TIARA)"
        },
        "ResourceSummary": {
            "Quantity": {
                "CurrentYear": {
                    "val": "2000"
                },
                "BudgetYearOneOCO": {
                    "val": "275"
                },
                "BudgetYearOne": {
                    "val": "275"
                },
                "Total": {
                    "val": "2275"
                }
            },
            "TotalCost": {
                "CurrentYear": {
                    "val": "14.42"
                },
                "BudgetYearOneOCO": {
                    "val": "5.18"
                },
                "BudgetYearOne": {
                    "val": "5.18"
                },
                "Total": {
                    "val": "19.6"
                }
            },
            "UnitCost": {
                "CurrentYear": {
                    "val": "7.21"
                },
                "BudgetYearOneOCO": {
                    "val": "18.836"
                },
                "BudgetYearOne": {
                    "val": "18.836"
                },
                "Total": {
                    "val": "8.615"
                }
            },
            "NetProcurementP1": {
                "CurrentYear": {
                    "val": "14.42"
                },
                "BudgetYearOneOCO": {
                    "val": "5.18"
                },
                "BudgetYearOne": {
                    "val": "5.18"
                },
                "Total": {
                    "val": "19.6"
                }
            },
            "TotalObligationAuthority": {
                "CurrentYear": {
                    "val": "14.42"
                },
                "BudgetYearOneOCO": {
                    "val": "5.18"
                },
                "BudgetYearOne": {
                    "val": "5.18"
                },
                "Total": {
                    "val": "19.6"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "Quantity": {
                                "CurrentYear": {
                                    "val": "2000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "275"
                                },
                                "BudgetYearOne": {
                                    "val": "275"
                                }
                            },
                            "TotalCost": {
                                "CurrentYear": {
                                    "val": "14.42"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "5.18"
                                },
                                "BudgetYearOne": {
                                    "val": "5.18"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "Quantity": {
                    "CurrentYear": {
                        "val": "2000"
                    },
                    "BudgetYearOneOCO": {
                        "val": "275"
                    },
                    "BudgetYearOne": {
                        "val": "275"
                    }
                },
                "TotalCost": {
                    "CurrentYear": {
                        "val": "14.42"
                    },
                    "BudgetYearOneOCO": {
                        "val": "5.18"
                    },
                    "BudgetYearOne": {
                        "val": "5.18"
                    }
                }
            }
        },
        "Description": {
            "val": "Product Lead Biometrics Automated Toolset-Army (BAT-A) manages two Army biometric tactical collection devices, the Biometric Automated Toolset-Army (BAT-A) Kit and BAT-A Handheld (HH).  These two devices support the Army Force Protection Mission and Identity Dominance Mission.  The BAT-A system is the Army’s biometric tactical collection devices which collect, match, store, and share biometric and contextual information on Known & Suspected Terrorists, potential adversaries, host nation personnel, and third country nationals.  Recipients of collected information include DoD organizations, other U.S. government agencies, and Coalition Partners.  The BAT-A devices are also used by non-Military Intelligence personnel (Infantry and Military Police).   The capability was originally deployed as a Quick Reaction Capability (QRC) and has been deployed in a combat zone and other OCONUS contingency operations for the past decade.  The current BAT-A systems will serve as the Army biometrics enduring capability through FY22.  PL BAT-A will continue to serve as the Office of Primary Responsibility as the BAT-A is now a Post Milestone C program of record in sustainment.\n\nUnited States Central Command (CENTCOM) submitted JUONS CC-0548 on 11 Dec 15 for enhanced biometric capabilities to support current operations.  The Joint Requirements Oversight Council (JROC) validated 5 of 6 key requirements of JUONS CC-0548 on 3 June 2016 and identified the requirements as \"key enablers\" to existing JEON CCE-0008 (near Real-Time Identity Operations).  The Joint Rapid Acquisition Cell (JRAC) assigned execution responsibility for the validated 5 key requirements in JUONS CC-0548 to the Army on 30 June 2016.  The Army Acquisition Executive assigned OPR to Program Executive Officer for Intelligence, Electronic Warfare, and Sensors\/Project Manager for DoD Biometrics on 13 September 2016."
        },
        "Justification": {
            "val": "FY 2018 Overseas Contingency Operations (OCO) procurement in the amount of $5.180 million procures multiple Biometric Automated Toolsets - Army (BAT-A) Kit Hardware and BAT-A Handheld (HH) accessories for quantities RESET\/REFRESH activities supporting both Operation Freedom's Sentinel (OFS) and Operation Inherent Resolve for ISIL (OIR).  Specifically for OFS, requested funds will refresh 204 BAT-A laptops and obsolete peripherals; refresh six (6) BAT-A Servers with accessories; and will refresh BAT-A Handheld obsolete parts and accessories ensuring the continued mission critical capability.  Specifically for OIR, requested funds will refresh 63 BAT-A laptops and obsolete peripherals; refresh two (2) BAT-A Servers with accessories; and will refresh BAT-A Handheld obsolete parts and accessories ensuring the continued mission critical capability.\n\nThe Biometric Automated Toolset - Army (BAT-A) requires both hardware reset and associated minor software integration to maintain operational viability.  These devices have been in Iraq and Afghanistan well beyond the standard 3 – 6 years of useful electronic equipment life.  BAT-A is the Army's Biometric Program of Record and failure to reset these devices will degrade the mission effectiveness of this enabler of Identity Dominance and Force Protection."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}