{
    "id": "2018-Navy-PB-1508N-JBOOK-bb34469c279045fd55682640826a877bef9d55f96e3a744f15f33fd4a3411a15-13",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_AMMUNITION_VOL-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1508N",
        "appropriation_name": "Procurement of Ammo, Navy & MC"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "0340"
        },
        "LineItemTitle": {
            "val": "Pyrotechnic and Demolition"
        },
        "P1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1508N"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammo, Navy & MC"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Proc Ammo, Navy"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Navy Ammunition"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "72.955"
                },
                "PriorYear": {
                    "val": "12.798"
                },
                "CurrentYear": {
                    "val": "10.928"
                },
                "BudgetYearOneBase": {
                    "val": "9.495"
                },
                "BudgetYearOneOCO": {
                    "val": "0.765"
                },
                "BudgetYearOne": {
                    "val": "10.26"
                },
                "BudgetYearTwo": {
                    "val": "11.18"
                },
                "BudgetYearThree": {
                    "val": "10.917"
                },
                "BudgetYearFour": {
                    "val": "11.141"
                },
                "BudgetYearFive": {
                    "val": "11.363"
                },
                "Total": {
                    "val": "151.542"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "72.955"
                },
                "PriorYear": {
                    "val": "12.798"
                },
                "CurrentYear": {
                    "val": "10.928"
                },
                "BudgetYearOneBase": {
                    "val": "9.495"
                },
                "BudgetYearOneOCO": {
                    "val": "0.765"
                },
                "BudgetYearOne": {
                    "val": "10.26"
                },
                "BudgetYearTwo": {
                    "val": "11.18"
                },
                "BudgetYearThree": {
                    "val": "10.917"
                },
                "BudgetYearFour": {
                    "val": "11.141"
                },
                "BudgetYearFive": {
                    "val": "11.363"
                },
                "Total": {
                    "val": "151.542"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "72.955"
                },
                "PriorYear": {
                    "val": "12.798"
                },
                "CurrentYear": {
                    "val": "10.928"
                },
                "BudgetYearOneBase": {
                    "val": "9.495"
                },
                "BudgetYearOneOCO": {
                    "val": "0.765"
                },
                "BudgetYearOne": {
                    "val": "10.26"
                },
                "BudgetYearTwo": {
                    "val": "11.18"
                },
                "BudgetYearThree": {
                    "val": "10.917"
                },
                "BudgetYearFour": {
                    "val": "11.141"
                },
                "BudgetYearFive": {
                    "val": "11.363"
                },
                "Total": {
                    "val": "151.542"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "12.712"
                                },
                                "CurrentYear": {
                                    "val": "10.834"
                                },
                                "BudgetYearOneBase": {
                                    "val": "9.405"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.765"
                                },
                                "BudgetYearOne": {
                                    "val": "10.17"
                                },
                                "BudgetYearTwo": {
                                    "val": "11.086"
                                },
                                "BudgetYearThree": {
                                    "val": "10.829"
                                },
                                "BudgetYearFour": {
                                    "val": "11.05"
                                },
                                "BudgetYearFive": {
                                    "val": "11.27"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "0.086"
                                },
                                "CurrentYear": {
                                    "val": "0.094"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.09"
                                },
                                "BudgetYearOne": {
                                    "val": "0.09"
                                },
                                "BudgetYearTwo": {
                                    "val": "0.094"
                                },
                                "BudgetYearThree": {
                                    "val": "0.088"
                                },
                                "BudgetYearFour": {
                                    "val": "0.091"
                                },
                                "BudgetYearFive": {
                                    "val": "0.093"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "12.798"
                    },
                    "CurrentYear": {
                        "val": "10.928"
                    },
                    "BudgetYearOneBase": {
                        "val": "9.495"
                    },
                    "BudgetYearOneOCO": {
                        "val": "0.765"
                    },
                    "BudgetYearOne": {
                        "val": "10.26"
                    },
                    "BudgetYearTwo": {
                        "val": "11.18"
                    },
                    "BudgetYearThree": {
                        "val": "10.917"
                    },
                    "BudgetYearFour": {
                        "val": "11.141"
                    },
                    "BudgetYearFive": {
                        "val": "11.363"
                    }
                }
            }
        },
        "Description": {
            "val": "Program provides pyrotechnics and demolition materials for all active naval vessels, construction battalions, mobile diving and salvage units, cargo handling and port groups, naval security groups, and explosive ordnance disposal groups\/mobile units\/detachments\/teams.  Pyrotechnics are used for training, combat exercises, submarine rescue and personnel search, and rescue operations.  These items consist of illumination, signaling, identification, and location devices using flares or smoke as the primary signaling agent. Demolitions consist of explosive devices and accessories and are required for fleet units to perform training functions and operations\/requirements. Fleet requirements are based upon CNO approved allowance lists for special needs on a case by case basis and worldwide fleet expenditure.  This program also provides materials to support the ship shock test program.\n\nNaval Special Warfare pyrotechnics and demolition materials consists of smoke and flare signals for safety of life, combat effects simulators, remote and time delay firing devices, safe and arming devices, blasting machines, demolition charges, blasting caps, detonating cord, time fuse, cable cutters, cartridge actuated devices, shape charges, and shock tube type detonators. The demolition materials are used by the Naval Special Warfare Center for initial demolition training and qualification, and by SEAL platoons for constructing breaching charges, construction of obstacles or barriers, clearance of obstacles or barriers, cable cutting, coral and channel clearance, material and equipment destruction, diversions, combat effects simulation charges, improvised incendiary charges, and defensive anti-vehicle and anti-personnel charges.  Pyrotechnics are used by Naval Special Warfare for emergency or distress signaling, combat effects simulation, target marking, de-confliction, escalation of force warning, and distraction."
        },
        "Justification": {
            "val": "FY 2018 baseline funding procures pyrotechnics to support surface, air, ground, and underwater Navy requirements for training, combat exercises, submarine rescue, and personnel search and rescue operations, and demolition consisting of explosive devices and accessories to support fleet units performing training and operational exercises.  \n\nPyrotechnics and demolition materials consists of smoke and flare signals for safety of life, simulators, remote and time delay firing devices, safe and arming devices, demolition charges, blasting caps, detonating cord, time fuze, cable cutters, Improvised Explosive Device (IED) disrupters, cartridge actuated devices, shape charges, and shock test charges.  These materials are used by all Navy platforms, and Navy Mobile Construction Battalions, mobile diving and salvage units, cargo handling and port groups, naval security groups, fleet composite operational readiness groups, and Explosive Ordnance Disposal groups, mobile units, detachments, and teams.  \n\nBaseline funding also provides Product Improvement Programs to resolve obsolescence issues in cartridge actuated devices.  Baseline program funds Renovation of firing devices and supply components for demolition items, and Production Engineering and Gauge requirements for pyrotechnics and demolition materials.\n\nFY 2018 baseline funding procures demolition devices and accessories to support Naval Special Warfare (NSW) requirements for initial qualification, pre-deployment, and sustainment training, combat exercises, and testing.  Baseline program funds are also necessary for production engineering as required by DoD and Navy safety and acquisition regulations.\n\nOCO: \nFY 2018 Overseas Contingency Operations (OCO) funding is required to replenish munitions that were expended in combat and operations in theater by Naval Special Warfare (NSW) in support of Operation Inherent Resolve (OIR), Operation Freedom's Sentinel (OFS) and in the fight to defeat ISIS. FY 2018 OCO funding procures NSW explosive sheet charges and low-hazard flex linear charges, all of which are used to assemble a variety of explosive breaching charges, and are high use items."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}