{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-51",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "3130"
        },
        "LineItemTitle": {
            "val": "Submarine Communication Equipment"
        },
        "P1LineNumber": {
            "val": "94"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "12"
        },
        "BudgetSubActivityTitle": {
            "val": "Submarine Communications"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "577.251"
                },
                "PriorYear": {
                    "val": "58.037"
                },
                "CurrentYear": {
                    "val": "64.529"
                },
                "BudgetYearOneBase": {
                    "val": "86.204"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "86.204"
                },
                "BudgetYearTwo": {
                    "val": "78.987"
                },
                "BudgetYearThree": {
                    "val": "85.101"
                },
                "BudgetYearFour": {
                    "val": "87.12"
                },
                "BudgetYearFive": {
                    "val": "87.793"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "577.251"
                },
                "PriorYear": {
                    "val": "58.037"
                },
                "CurrentYear": {
                    "val": "64.529"
                },
                "BudgetYearOneBase": {
                    "val": "86.204"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "86.204"
                },
                "BudgetYearTwo": {
                    "val": "78.987"
                },
                "BudgetYearThree": {
                    "val": "85.101"
                },
                "BudgetYearFour": {
                    "val": "87.12"
                },
                "BudgetYearFive": {
                    "val": "87.793"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "577.251"
                },
                "PriorYear": {
                    "val": "58.037"
                },
                "CurrentYear": {
                    "val": "64.529"
                },
                "BudgetYearOneBase": {
                    "val": "86.204"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "86.204"
                },
                "BudgetYearTwo": {
                    "val": "78.987"
                },
                "BudgetYearThree": {
                    "val": "85.101"
                },
                "BudgetYearFour": {
                    "val": "87.12"
                },
                "BudgetYearFive": {
                    "val": "87.793"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "1.048"
                },
                "CurrentYear": {
                    "val": "0.305"
                },
                "BudgetYearOneBase": {
                    "val": "0.701"
                },
                "BudgetYearOne": {
                    "val": "0.701"
                },
                "BudgetYearTwo": {
                    "val": "1.438"
                },
                "BudgetYearThree": {
                    "val": "1.109"
                },
                "BudgetYearFour": {
                    "val": "0.349"
                },
                "BudgetYearFive": {
                    "val": "0.64"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "PROGRAM COVERAGE:  The Submarine Communications Program mission is to create a common, automated, open system architecture radio room for all submarine classes.  The program provides for the procurement and installation of systems incorporating the technical advances of network centric warfare to allow the submarine force to communicate as part of the Battle Group.  The program addresses the unique demands of submarine communications, stealth, obsolescence issues and higher data rate requirements.\n\n[P40A \/ L0035 Antenna Modifications]: - Antenna modifications provide for the procurement and installation of field change kits of legacy antenna equipment (OE-315, AN\/BRA-24, AN\/BRA-6B, BRT-1\/1A). These modifications address performance issues, improve reliability and maintainability, decrease vulnerability, and provide cost effective technology refresh.  Modifications are applicable to all submarine classes (LOS ANGELES, SEAWOLF, OHIO SSBN\/SSGN, and VIRGINIA) and are implemented on a Fleet priority basis. Procurement and Installation unit costs vary due to procuring and installing different components each fiscal year.\n\n[P40A \/ L0099 Towed Buoy Antenna BRR-6\/6B Reliability Improvements]: - The AN\/BRR-6\/6B Towed Buoy Antenna system is installed on the OHIO-class Ballistic Missile Submarines (SSBN). Each boat has two (2) towed communications buoys with the sole function of supporting Navy Nuclear Command, Control, and Communications (NC3) strategic requirements, connecting the President of the United States (POTUS) to Ballistic Missile Submarines (SSBN) communications reception for the strategic deterrent mission.  The  AN\/BRR-6\/6B Towed Buoy Antenna system receives transmission across the LF,VLF, HF frequency range.  The buoy system provides significant operational flexibility by providing a means to passively receive communications while remaining at depth with minimal impact on boat's maneuverability or detectability.   \n\nThe Towed Buoy Antenna BRR-6\/6B reliability improvements provide for the procurement and installation of field change kits of the Towed Buoy Antenna BRR-6\/6B to improve system performance (measured by operational availability Ao) and reliability (measured by mean time between failures MTBF); improvements are applicable to SSBN only. The Towed Buoy Antenna BRR-6\/6B is a key component of the NC3 system and the primary means of receiving Emergency Action Messages (EAMs). \n\nThe Antenna BRR-6\/6B Reliability Improvements program does not follow a traditional acquisition life cycle. Procurement and installation unit costs vary due to the phased approach as prescribed in the AN\/BRR-6\/6B Towed Buoy Antenna Lean Event Final Report of 30 September 2011 for procuring and installing different components each fiscal year in order to meet platform installation availabilities without degrading SSBN operational readiness.\n\n[P40A \/ L0097 Submarine Local Area Network (SUBLAN)]: Provides a robust shipboard backbone Information Technology (IT) network with multiple classification enclaves that, along with the Common Submarine Radio Room (CSRR) and Automated Digital Network System (ADNS), provides end-to-end wideband connectivity to the global Defense Information System Networks (DISN)  (Secret Internet Protocol Router Network and Nonclassified Internet Protocol Router Network).  SubLAN is designed in accordance with the IT for the 21st Century fleet initiative, and thus SubLAN will support greatly improved connectivity to, and interoperability with, the carrier strike group (CSG) and expeditionary strike group (ESG) commander, thereby achieving network-centric warfare, and with shore commands.  The SubLAN network is enhanced for mission-critical tactical applications, and as such SubLAN forms the medium that will interconnect Sonar, Combat, Electronic Surveillance Measures, Radio, etc., and permits the seamless exchange of warfighting tactical data between these systems and with the CSG\/ESG commander.  The SubLAN tactical backbone replicates the functionality of the United States Ship (USS) VIRGINIA class network architecture, allowing back fit of VIRGINIA class tactical subsystem modernization into existing submarines.  The SubLAN shipboard IT infrastructure is being designed as an all-Commercial Off-The-Shelf (COTS), open-system architecture such that it will permit other electronic subsystem programs to rely on SubLAN for subsystem interconnectivity (rather than having each subsystem install its own IT network); the revolutionary approach of treating the shipboard network as a basic utility (like water, power and lighting) will support the efficient and economic modernization of the various electronic subsystems.\n\n[P40AMOD \/ L0087 Submarine High Data Rate Antenna]: SUBMARINE HIGH DATA RATE (SubHDR) SATELLITE COMMUNICATIONS SYSTEM - The Submarine HDR system provides submarines with antennas that have the bandwidth, gain, and flexibility to meet the stated Commander, Submarine Force, United States Atlantic Fleet\/Commander, Submarine Force, US Pacific Fleet  (COMSUBLANT\/COMSUBPAC) requirements for HDR communications in the Super High Frequency (SHF) and Extremely High Frequency (EHF) frequency spectrums. The Radome provides a watertight enclosure for the antenna and associated electronics, as well as being a transparent window for Radio Frequency, (RF) communication signals to pass through. This radome needs to be replaced with a newly designed radome because the existing radome is experiencing severe cracking after only 3 to 4 years of service, at which time it is required to be pulled from service in order to prevent an implosion. This new design will prevent those cracks from occurring.\n\n[P3A \/ L0080 OE-538\/BRC Inc 2]: OUTBOARD ELECTRONICS (OE)-538 & OE-592 ANTENNA GROUP - The OE-538 System is currently installed on all submarine classes except SSBN. The OE-592 system is currently installed on SSBNs. The OE-538 Inc 2 consists of  two configurations: OE-538A and OE-538B. The OE-538A effort upgrades the OE-538 system from FY15-FY20 to support Mobile User Objective System (MUOS), Link-16 Tactical Data Link and Iridium capabilities. The OE-538B efforts upgrades the OE-538A from FY20-FY27 to support Global Positioning System (GPS) Anti-Jam and GPS Military Coded capabilities.\n\n[P3A - 3 \/ L0084 CSRR-SSBN (OHIO)]: COMMON SUBMARINE RADIO ROOM (CSRR) (L0084) - The CSRR is an interoperable submarine communications system operating within the Information Dominance architecture, which provides consistent and reliable two-way, modern, Internet Protocol (IP) connectivity to joint and combined forces. This evolutionary system achieves unmatched capability, cost reduction, and future technology integration via a multimedia, circuit sharing, and Commercial Off-The-Shelf (COTS) based open architecture that serves as the shipboard automated communications control system. Procurement in this line is for the radio room workstations, chassis, Radio Frequency Distribution and Control System (RFDACS), common power supplies, power distribution units, cabling, mounting kits and ancillary components required to integrate communications equipment for submarines. The RFDACS technology update for LOS ANGELES class submarines brings COTS functionality and supportability to the submarine external communications system. The CSRR Program supports LOS ANGELES, SEAWOLF, VIRGINIA and OHIO (SSBN and SSGN) class submarines.\n\nCSRR modernization activities bring new capabilities, address new requirements, resolve End-of-Life (EOL) and obsolescence issues or correct known system deficiencies.  The unit cost variance between the CSRR Increment 1 Version 3-6 is due to different capabilities\/configurations. For example, CSRR Increment 1 Version 3 is a more complex upgrade to the CSRR suite. CSRR Increment 1 Version 4 is planned to address equipment obsolescence and EOL issues. CSRR Increment 1 Version 5 will be another more complex modernization to the CSRR suite. \n\nThe Undersea Platforms Special Communications program provides a fully integrated and tested Low Probability of Intercept \/ Low Probability of Detection (LPI\/LPD) communications systems enabling command and control (C2) in an environment where traditional communications are not available, thereby reducing platform susceptibility of detection and attack by the adversary.\n\nThe Link 16 program provides an enhanced submarine communication system by providing a two-way Tactical Data Link (TDL) processing capability on all Submarine (Nuclear) (SSN), Guided Missile Submarine (Nuclear) (SSGN) and Ballistic Missile Submarine (Nuclear) (SSBN) platforms.  The Link 16 program provides submarine Command & Control systems with Link 16 tactical network communications capabilities for situational awareness in a contested environment and is a key element in naval tactical networking.  The new technology ensures the submarine's continued ability to participate in network-centric warfare and exploit its inherent stealth capabilities in support of the Navy, Nuclear Command, Control, and Communications (NC3), Joint, and allied\/coalition fight to achieve total battlespace information dominance."
        },
        "Justification": {
            "val": "- FY18 Antenna Modifications: Procure and install multiple field change kits for legacy antenna equipment, applicable to all submarine classes, to address performance issues, improve reliability and maintainability, decrease vulnerability, and provide cost effective technology refresh.\n- FY18 Towed Buoy Antenna BRR-6\/6B: Procure and install multiple field change kits to improve system performance (measured by operational availability) and reliability (measured by mean time between failures).\n- FY18 CSRR: Implements CSRR on LOS ANGELES class submarines and modernizes CSRR on OHIO (SSBN and SSGN), SEAWOLF and VIRGINIA platforms. Funding will support procurement and installation on Increment 1 Version 3, Increment 1 Version 4 and Low Probability of Intercept \/ Low Probability of Detection (LPI\/LPD).\n- FY18 SubHDR: Radome procurement inventory requirement met in FY17\n- FY18 OE-538: Procure OE-538A upgrade kits to support submarine communications requirements: Mobile User Objective System (MUOS), Link-16 Tactical Data Link, and Iridium."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Submarine Communication Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) L0035 Antenna Modifications"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Antenna Modifications provide for the procurement and installation of field change kits of legacy antenna equipment (OE-315, AN\/BRA-24, AN\/BRA-6B, BRT-1\/1A). These modifications address performance issues, improve reliability and maintainability, decrease vulnerability, and provide cost effective technology refresh. FY18 will procure; qty. 20 Advanced Buoyant Cable Antennas (ABCA),   qty. 50 Vertical Buoyant Cable Antennas (VBCA), and qty. 50 JHU\/APL Amplifiers. Procurement and Installation unit costs vary due to procuring and installing different components each fiscal year.",
                                                "val": "1.1) Antenna Modifications"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "150"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "120"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "120"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "22.267"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.553"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.553"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "148.447"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "29.608"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "29.608"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "22.267"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.553"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.553"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "CSRR Support Systems Modernization Kits provide for the procurement and installation of CSRR baseline modernization reconfigurable lab assets to improve system performance and reliability and vary by Increment, Version, and Platform. CSRR modernization activities bring new capabilities, address new requirements, resolve End-of-Life (EOL) and obsolescence issues or correct known system deficiencies.  The unit cost variance between the CSRR Increment 1 Version 3-6 is due to different capabilities\/configurations. For example, CSRR Increment 1 Version 3 is a more complex upgrade to the CSRR suite. CSRR Increment 1 Version 4 is planned to address equipment obsolescence and EOL issues. CSRR Increment 1 Version 5 will be another more complex modernization to the CSRR suite. FY18 includes procurement of one CSRR Increment 1 Version 4 modernization reconfigurable lab asset.",
                                    "val": "2) CSRR - Support Systems Mod Kits (Increment 1 Ver 3, 4 & 5)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Kit Quantity (Prior Years)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "8"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "34.702"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "4337.75"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) Equipment - Mod Kits Inc 1 Ver 3"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "4"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.618"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1904.5"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "The unit cost for the lab asset in FY18 increased above inflation due to the reduction in procurement quantity (procurement of two (2) labs in FY16 versus one (1) lab in FY18) and the requirement for a new contract to be awarded.",
                                                "val": "2.3) Equipment - Mod Kits Inc 1 Ver 4"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.387"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.205"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.205"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "193.5"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "205"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "205"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.6) Equipment - MRTS"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "8"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.248"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "281"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.8) Equipment - LPI\/LPD Solution 1"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "7"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.401"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.401"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "200.143"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "200.143"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.10) Production Support"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.503"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.023"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.096"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.096"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "45.071"
                                        },
                                        "PriorYear": {
                                            "val": "0.41"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.702"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.702"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "The Towed Buoy Antenna BRR-6\/6B Reliability Improvements provide for the procurement and installation of field change kits of the Towed Buoy Antenna BRR-6\/6B to improve system performance and reliability. Procurement and Installation unit costs vary due to procuring and installing different components each fiscal year. FY17 procured; qty 44 Antenna\/Amplifiers, qty 45 Tow Cables, and qty 45 Tow Cable Boxes. FY18 will procure qty 56 Antenna\/Amplifiers, qty 66 Tow Cables, and qty 66 Tow Cables Boxes. Production lead time varies from component to component. The antenna procurements vary due to different components required for modernization.",
                                    "val": "3) L0099 Towed Buoy Antenna BRR-6\/6B Reliability Improvements"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "The BRR-6 program does not follow a traditional acquisition life cycle. Procurement and installation unit costs vary due to the phased approach as prescribed in the AN\/BRR-6\/6B Towed Buoy Antenna Lean Event Final Report of 30 September 2011 for procuring and installing different components each fiscal year in order to meet platform installation availabilities without degrading SSBN operational readiness. FY16 procured 41 reliability improvements (34 Full Production Seated Switches, 2 Antenna\/Amplifiers, and 5 Multi-Reconfigurable Training Systems (MRTS) modules) and the antenna\/amplifiers unit cost was $153K which elevated the average unit cost.  FY18 will procure 134 reliability improvements ( 56 Antenna\/Amplifiers, 66 Tow Cable Boxes, and 66 Tow Cables)  and 122 tow cables has an average unit cost of $40K, causing a unit cost decrease of $24.26 from FY 16. The unit cost fluctuation is based on procurement of completely different items and associated costs each fiscal year and is not related to inflation or prior year unit cost. Installation costs included in procurement (turnkey).",
                                                "val": "3.1) Reliability Improvements"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "69"
                                                    },
                                                    "PriorYear": {
                                                        "val": "41"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "134"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "188"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "188"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.886"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.287"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.225"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5.926"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.926"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "41.826"
                                                    },
                                                    "PriorYear": {
                                                        "val": "55.78"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "31.53"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "31.521"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "31.521"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.886"
                                        },
                                        "PriorYear": {
                                            "val": "2.287"
                                        },
                                        "CurrentYear": {
                                            "val": "4.225"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.926"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.926"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "Installation of SubLAN Personal Computers (PC's) and Engine Room Drop Augment (ERDA).",
                                    "val": "4) L0097 Submarine Local Area Network (SUBLAN)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) Hardware"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "274"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "76.901"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "280.661"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.2) Installation of Hardware"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "52.413"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.074"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.3) Production Support"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.704"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.4) DSA"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.812"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.053"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "138.83"
                                        },
                                        "PriorYear": {
                                            "val": "1.127"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "209.054"
                            },
                            "PriorYear": {
                                "val": "3.824"
                            },
                            "CurrentYear": {
                                "val": "4.225"
                            },
                            "BudgetYearOneBase": {
                                "val": "11.181"
                            },
                            "BudgetYearOne": {
                                "val": "11.181"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "L0087 Submarine High Data Rate Antenna"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Only 102 of 112 Radome kits require installation. The remaining 10 are used for the Ready For issue (RFI) rotatable pool.",
                                                "val": "Replacement Radomes Installed -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "75"
                                                    },
                                                    "PriorYear": {
                                                        "val": "18"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "9"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "18.189"
                                                    },
                                                    "PriorYear": {
                                                        "val": "5.351"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.94"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "242.52"
                                                    },
                                                    "PriorYear": {
                                                        "val": "297.278"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "326.667"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Replacement Radomes Installed -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.839"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.256"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.288"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.144"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.144"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funding made available by OE-538 program cost savings was used to complete the Radome Kit procurement in FY17.",
                                                "val": "Replacement Radomes Not Installed"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "10"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "2.85"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "285"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "19.028"
                                        },
                                        "PriorYear": {
                                            "val": "5.607"
                                        },
                                        "CurrentYear": {
                                            "val": "6.078"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.144"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.144"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Production Support"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.807"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.284"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.19"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Other (DSA)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.239"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.18"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.17"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "13.046"
                                        },
                                        "PriorYear": {
                                            "val": "0.464"
                                        },
                                        "CurrentYear": {
                                            "val": "0.36"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Type Modification: Individual Modification Program\n\nProcurement and Installation of Submarine High Data Rate Antenna (SubHDR)"
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "32.074"
                            },
                            "PriorYear": {
                                "val": "6.071"
                            },
                            "CurrentYear": {
                                "val": "6.438"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.144"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.144"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "L0084 CSRR-SSGN (OHIO) Mod Upgrades"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Equipment - Mod Kits (Prior Years) -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "12"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "13.732"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1144.333"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Equipment - Mod Kits (Prior Years) -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.384"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Equipment - LPI\/LPD Solution 1 -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.384"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.384"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "192"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "192"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Equipment - LPI\/LPD Solution 1 -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "21.116"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.384"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.384"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "The Enterprise Change Request (ECR) is a configuration control process rigorously implemented for the approval of new CSRR baselines or for changes to C4I systems produced by other Component Programs of Record (PORs) that impact the CSRR baseline.  These changes to other Component PORs frequently occur outside of a planned CSRR modernization and therefore, funding for these changes is required every fiscal year in order to speed the delivery of critical capabilities to the submarine force.",
                                                "val": "Enterprise Change Request\/Nonrecurring"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.793"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.117"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.117"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funding supports development and planning of ShipALT design package, work element descriptions and design\/GFI changes. The ShipALT design package is required the year prior to procurement because it is due to the planning yard 12 months prior to install.  It is also required the year that the first modernization kit or LPI\/LPD solution is procured for each CSRR version on each Class to meet ship construction deadlines.",
                                                "val": "ShipALT\/DSA Nonrecurring"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.621"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.522"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.626"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.626"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funds the initial logistics package, consisting of multiple individual products, for each modernization baseline (version). The logistics package is funded in the year prior to and the year that the first modernization kit or LPI\/LPD solution is procured for each CSRR version on each submarine class.",
                                                "val": "Data\/Logistics"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.617"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.53"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.589"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.589"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Production Support"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.242"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.023"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.023"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Other (DSA Recurring)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.559"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "10.832"
                                        },
                                        "CurrentYear": {
                                            "val": "1.052"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.355"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.355"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Procurement and Installation of CSRR and upgrades on SSGN (OHIO) Class Submarines"
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "31.948"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "1.052"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.739"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "4.739"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "L0084 CSRR-SSN (SEAWOLF)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Equipment (Prior Years) -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "10"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "32.15"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "3215"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Equipment (Prior Years) -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "9.158"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.062"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Equipment - LPI\/LPD Solution 1 -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.096"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.096"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "96"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "96"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Equipment - LPI\/LPD Solution 1 -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.115"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.115"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "41.308"
                                        },
                                        "CurrentYear": {
                                            "val": "2.062"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.211"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.211"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Support Cost"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Funding supports development and planning of ShipALT design package, work element descriptions and design\/GFI changes. The ShipALT design package is required the year prior to procurement because it is due to the planning yard 12 months prior to install.  It is also required the year that the first modernization kit or LPD\/LPD solution is procured for each CSRR version on each Class to meet ship construction deadlines.",
                                                "val": "ShipALT\/DSA Nonrecurring"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.563"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.425"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.238"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.238"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "The Enterprise Change Request (ECR) is a configuration control process rigorously implemented for the approval of new CSRR baselines or for changes to C4I systems produced by other Component Programs of Record (PORs) that impact the CSRR baseline.  These changes to other Component PORs frequently occur outside of a planned CSRR modernization and therefore, funding for these changes is required every fiscal year in order to speed the delivery of critical capabilities to the submarine force.",
                                                "val": "Enterprise Change Request \/Nonrecurring"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.117"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.188"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.188"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funds the initial logistics package, consisting of multiple individual products, for each modernization baseline (version). The logistics package is funded in the year prior to and the year that the first modernization kit or LPI\/LPD solution is procured for each CSRR version on each submarine class.",
                                                "val": "Data\/Logistics"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.825"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.514"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.576"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.576"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Production Support"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.704"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.006"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.006"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Other (DSA Recurring)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.527"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.265"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.021"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.021"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "9.736"
                                        },
                                        "CurrentYear": {
                                            "val": "1.204"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.029"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.029"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Procurement and Installation of CSRR and upgrades on SSN (SEAWOLF) Class Submarines."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "51.044"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "3.266"
                            },
                            "BudgetYearOneBase": {
                                "val": "3.24"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "3.24"
                            }
                        }
                    }
                }
            ],
            "P3AModificationItemGroup": [
                {
                    "ModificationTitle": {
                        "val": "L0080 OE-538\/BRC Inc 2"
                    },
                    "ModificationNumber": {
                        "val": "1"
                    },
                    "ModificationType": {
                        "val": "Individual Modification Program"
                    },
                    "Model": {
                        "val": "[No Model Specified]"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "6.869"
                            },
                            "PriorYear": {
                                "val": "6.141"
                            },
                            "CurrentYear": {
                                "val": "12.426"
                            },
                            "BudgetYearOneBase": {
                                "val": "21.929"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "21.929"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "6.869"
                            },
                            "PriorYear": {
                                "val": "6.141"
                            },
                            "CurrentYear": {
                                "val": "12.426"
                            },
                            "BudgetYearOneBase": {
                                "val": "21.929"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "21.929"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "6.869"
                            },
                            "PriorYear": {
                                "val": "6.141"
                            },
                            "CurrentYear": {
                                "val": "12.426"
                            },
                            "BudgetYearOneBase": {
                                "val": "21.929"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "21.929"
                            }
                        }
                    },
                    "RelatedProgramElementList": {
                        "ProgramElementNumber": [
                            {
                                "val": "0604503N"
                            }
                        ]
                    },
                    "SupportCost": {
                        "CostElementList": {
                            "CostElement": [
                                {
                                    "Name": {
                                        "val": "2.1) Production Support"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.454"
                                            },
                                            "PriorYear": {
                                                "val": "0.36"
                                            },
                                            "CurrentYear": {
                                                "val": "0.632"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.093"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.093"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "@footnote": "DSA costs are directly related to number of installations. The DSA in FY17 increased in FY18 because the number of installs in FY17 (4) increased in FY18 (7).",
                                        "val": "2.2) Other (DSA)"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "0.08"
                                            },
                                            "CurrentYear": {
                                                "val": "0.123"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.292"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.292"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "2.3) Support Prior Years"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.7"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "CategorySubtotal": {
                            "TotalCost": {
                                "AllPriorYears": {
                                    "val": "1.154"
                                },
                                "PriorYear": {
                                    "val": "0.44"
                                },
                                "CurrentYear": {
                                    "val": "0.755"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.385"
                                },
                                "BudgetYearOne": {
                                    "val": "1.385"
                                }
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "L0080 OE-538\/BRC Inc 2"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "@footnote": "OE-538A, OE-538B, and RFDACS unit cost varies by submarine class and economic quantity order. The changes in quantities are due to changes in ship availabilities based on the updated fielding plans.  PB17 budget combined OE-538 antennas and the Radio Frequency Distribution and Control System (RFDACS) kits.  The PB18 budget breaks out the OE-538A, OE-538B and the RFDACS kits.  Additionally, items installed and not installed are broken out to provide clarity.",
                                                            "val": "1.1.1) Equipment - OE-538A Antenna Upgrade Kits Installed - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "2"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "2"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "7"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "22"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "22"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "1.905"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "2.11"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "9.068"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "14.211"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "14.211"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "1.1.2) Equipment - OE-538A Antenna Upgrade Kits Not Installed - Organic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "4"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "3"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "3.81"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "3.164"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "1.1.3) Equipment - OE-538A RFDACS Upgrade Kits Installed - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "CurrentYear": {
                                                                    "val": "2"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "8"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "8"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "CurrentYear": {
                                                                    "val": "0.977"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "4.014"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "4.014"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "@footnote": "One (1) RFDACS does not require installation funding as it will be used as a swing set for SSBN installations.",
                                                            "val": "1.1.4) Equipment - OE-538A RFDACS Upgrade Kits Not Installed - Organic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "CurrentYear": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "CurrentYear": {
                                                                    "val": "0.489"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "5.715"
                                                    },
                                                    "PriorYear": {
                                                        "val": "5.274"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "10.534"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "18.225"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "18.225"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "5.715"
                                                },
                                                "PriorYear": {
                                                    "val": "5.274"
                                                },
                                                "CurrentYear": {
                                                    "val": "10.534"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "18.225"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "18.225"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "Submarine Antenna Joint Venture"
                                                },
                                                "Location": {
                                                    "val": "Marion, MA & Manchester, NH"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2016-07"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-05"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-03"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2017-07"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2018-05"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2019-03"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "5"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "12"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "AllPriorYears": {
                                                "val": "6"
                                            },
                                            "PriorYear": {
                                                "val": "5"
                                            },
                                            "CurrentYear": {
                                                "val": "10"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "30"
                                            },
                                            "BudgetYearOne": {
                                                "val": "30"
                                            }
                                        },
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "5.715"
                                            },
                                            "PriorYear": {
                                                "val": "5.274"
                                            },
                                            "CurrentYear": {
                                                "val": "10.534"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "18.225"
                                            },
                                            "BudgetYearOne": {
                                                "val": "18.225"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Method:: Installation Name: OE-538"
                                                    },
                                                    "InstallationCost": {
                                                        "AllPriorYears": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "PriorYear": {
                                                                        "val": "2"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "PriorYear": {
                                                                        "val": "0.427"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "PriorYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "CurrentYear": {
                                                                        "val": "2"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "CurrentYear": {
                                                                        "val": "1.137"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "CurrentYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "9"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "9"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "2.319"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "2.319"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "PriorYear": {
                                                                        "val": "2"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "2"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "9"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "9"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "PriorYear": {
                                                                        "val": "0.427"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "1.137"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "2.319"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "2.319"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "2"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "ThirdQuarter": {
                                                                    "val": "3"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "4"
                                                                }
                                                            }
                                                        },
                                                        "Out": {
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "2"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "ThirdQuarter": {
                                                                    "val": "3"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "4"
                                                                }
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0"
                                            },
                                            "PriorYear": {
                                                "val": "0.427"
                                            },
                                            "CurrentYear": {
                                                "val": "1.137"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.319"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.319"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "5.715"
                            },
                            "PriorYear": {
                                "val": "5.274"
                            },
                            "CurrentYear": {
                                "val": "10.534"
                            },
                            "BudgetYearOneBase": {
                                "val": "18.225"
                            },
                            "BudgetYearOne": {
                                "val": "18.225"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0.427"
                            },
                            "CurrentYear": {
                                "val": "1.137"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.319"
                            },
                            "BudgetYearOne": {
                                "val": "2.319"
                            }
                        }
                    },
                    "Description": {
                        "val": "Procurement and Installation of OUTBOARD ELECTRONICS (OE)-538 & OE-592 ANTENNA GROUP (OE-538)"
                    }
                },
                {
                    "ModificationTitle": {
                        "val": "L0084 CSRR-SSBN (OHIO)"
                    },
                    "ModificationNumber": {
                        "val": "3"
                    },
                    "ModificationType": {
                        "val": "TBD"
                    },
                    "Model": {
                        "val": "[No Model Specified]"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "56.066"
                            },
                            "PriorYear": {
                                "val": "9.729"
                            },
                            "CurrentYear": {
                                "val": "12.896"
                            },
                            "BudgetYearOneBase": {
                                "val": "14.432"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "14.432"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "56.066"
                            },
                            "PriorYear": {
                                "val": "9.729"
                            },
                            "CurrentYear": {
                                "val": "12.896"
                            },
                            "BudgetYearOneBase": {
                                "val": "14.432"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "14.432"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "56.066"
                            },
                            "PriorYear": {
                                "val": "9.729"
                            },
                            "CurrentYear": {
                                "val": "12.896"
                            },
                            "BudgetYearOneBase": {
                                "val": "14.432"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "14.432"
                            }
                        }
                    },
                    "RelatedProgramElementList": {
                        "ProgramElementNumber": [
                            {
                                "val": "0604503N"
                            }
                        ]
                    },
                    "SupportCost": {
                        "CostElementList": {
                            "CostElement": [
                                {
                                    "Name": {
                                        "@footnote": "Funding supports development of Government Furnished Information (GFI) package for the planning yard in the year prior to installation and preparation of ship installation drawings in the year of installation.",
                                        "val": "2.1) ShipALT\/DSA Nonrecurring"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "4.562"
                                            },
                                            "PriorYear": {
                                                "val": "0.45"
                                            },
                                            "CurrentYear": {
                                                "val": "0.45"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.325"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.325"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "@footnote": "The Enterprise Change Request (ECR) is a configuration control process rigorously implemented for the approval of new CSRR baselines or for changes to C4I systems produced by other Component Programs of Record (PORs) that impact the CSRR baseline.  These changes to other Component PORs frequently occur outside of a planned CSRR modernization and therefore, funding for these changes is required every fiscal year in order to speed the delivery of critical capabilities to the submarine force.",
                                        "val": "2.2) Enterprise Change Request"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "5.385"
                                            },
                                            "PriorYear": {
                                                "val": "0.625"
                                            },
                                            "CurrentYear": {
                                                "val": "0.531"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.137"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.137"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "@footnote": "Funds the initial logistics package, consisting of multiple individual products, for each modernization baseline (version). The logistics package is funded in the year prior to and the year that the first modernization kit is procured for each CSRR version on each submarine class.",
                                        "val": "2.3) Data\/Logistics"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "4.951"
                                            },
                                            "PriorYear": {
                                                "val": "0.624"
                                            },
                                            "CurrentYear": {
                                                "val": "0.624"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.507"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.507"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "2.4) Production Support"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "10.876"
                                            },
                                            "PriorYear": {
                                                "val": "0.249"
                                            },
                                            "CurrentYear": {
                                                "val": "0.511"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.117"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.117"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "2.5) Other (DSA Recurring)"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "7.142"
                                            },
                                            "PriorYear": {
                                                "val": "0.484"
                                            },
                                            "CurrentYear": {
                                                "val": "0.445"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.762"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.762"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "CategorySubtotal": {
                            "TotalCost": {
                                "AllPriorYears": {
                                    "val": "32.916"
                                },
                                "PriorYear": {
                                    "val": "2.432"
                                },
                                "CurrentYear": {
                                    "val": "2.561"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.848"
                                },
                                "BudgetYearOne": {
                                    "val": "3.848"
                                }
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "L0084 CSRR-SSBN (OHIO)"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "@footnote": "Quantities reflect alignment with fleet installation availabilities. Submarine availability windows fluctuate to optimize SSBN Operational Availability (Ao). The number and class of submarines available in any given year are very limited and, consequently, the ability to shift installations from one submarine to another is often not possible. Installation funds are required by the installing activity 3 months prior to the start of the installation. The following installations were impacted by Fleet rescheduling of availabilities: Three CSRR Inc1V3 modernization kits procured in FY14 will not install until FY16. Three CSRR Inc1V3 modernization kits procured in FY15 will not install until FY17. Three CSRR Inc1V3 procurements in FY17 will not install until Q4 FY18 and one in Q2 FY19.",
                                                            "val": "1.1.1) Equipment - Mod Kits Increment 1 Ver 3 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "8"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "2"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "4"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "15.708"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "4.257"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "8.77"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "@footnote": "CSRR modernization activities bring new capabilities, address new requirements, resolve End-of-Life (EOL) and obsolescence issues or correct known system deficiencies.  The unit cost variance between the CSRR Increment 1 Version 3-5 is due to different capabilities\/configurations. For example, CSRR Increment 1 Version 3 is a more complex upgrade to the CSRR suite. CSRR Increment 1 Version 4 is planned as a minor upgrade to address equipment obsolescence and EOL issues. CSRR Increment 1 Version 5 will be another more complex modernization to the CSRR suite. FY18 includes procurement of three CSRR Increment 1 Version 4 modernization kits.",
                                                            "val": "1.1.2) Equipment - Mod Kits Increment 1 Ver 4 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "3"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "3"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "0.795"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "0.795"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "1.1.4) Equipment - LPI\/LPD Solution 1 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "12"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "12"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "1.152"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1.152"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "15.708"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.257"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "8.77"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.947"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.947"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "15.708"
                                                },
                                                "PriorYear": {
                                                    "val": "4.257"
                                                },
                                                "CurrentYear": {
                                                    "val": "8.77"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "1.947"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "1.947"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "@footnote": "Production lead time for upgrade kits varies from 3 to 12 months depending on the contents of each kit and the specific components being modernized.",
                                                    "val": "SAIC"
                                                },
                                                "Location": {
                                                    "val": "Charleston, SC"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2016-02"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-04"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-01"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2017-02"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2018-04"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-10"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "3"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "9"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "AllPriorYears": {
                                                "val": "8"
                                            },
                                            "PriorYear": {
                                                "val": "2"
                                            },
                                            "CurrentYear": {
                                                "val": "4"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "15"
                                            },
                                            "BudgetYearOne": {
                                                "val": "15"
                                            }
                                        },
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "15.708"
                                            },
                                            "PriorYear": {
                                                "val": "4.257"
                                            },
                                            "CurrentYear": {
                                                "val": "8.77"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.947"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.947"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "[none specified]:: Installation Name: SSBN Ohio"
                                                    },
                                                    "InstallationCost": {
                                                        "AllPriorYears": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "5"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "2"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "1"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "7.442"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "3.04"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "1.565"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "PriorYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "2"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "2"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "3.224"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "3.224"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "CurrentYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "3"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "3"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "4.838"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "4.838"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "5"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "5"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "0.575"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "0.575"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "5"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "2"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "1"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "10"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "10"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "7.442"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "3.04"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "1.565"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "8.637"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "8.637"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "AllPriorYears": {
                                                                "val": "2"
                                                            },
                                                            "PriorYear": {
                                                                "SecondQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "SecondQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "3"
                                                                }
                                                            }
                                                        },
                                                        "Out": {
                                                            "AllPriorYears": {
                                                                "val": "2"
                                                            },
                                                            "PriorYear": {
                                                                "SecondQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "SecondQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "3"
                                                                }
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "7.442"
                                            },
                                            "PriorYear": {
                                                "val": "3.04"
                                            },
                                            "CurrentYear": {
                                                "val": "1.565"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "8.637"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "8.637"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "15.708"
                            },
                            "PriorYear": {
                                "val": "4.257"
                            },
                            "CurrentYear": {
                                "val": "8.77"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.947"
                            },
                            "BudgetYearOne": {
                                "val": "1.947"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "7.442"
                            },
                            "PriorYear": {
                                "val": "3.04"
                            },
                            "CurrentYear": {
                                "val": "1.565"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.637"
                            },
                            "BudgetYearOne": {
                                "val": "8.637"
                            }
                        }
                    },
                    "Description": {
                        "val": "Procurement and Installation of CSRR upgrades on SSBN (OHIO) Class submarines."
                    }
                },
                {
                    "ModificationTitle": {
                        "val": "L0084 CSRR-SSN (VIRGINIA) Mod Upgrades"
                    },
                    "ModificationNumber": {
                        "val": "6"
                    },
                    "ModificationType": {
                        "val": "TBD"
                    },
                    "Model": {
                        "val": "[No Model Specified]"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "44.801"
                            },
                            "PriorYear": {
                                "val": "8.608"
                            },
                            "CurrentYear": {
                                "val": "9.704"
                            },
                            "BudgetYearOneBase": {
                                "val": "15.093"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "15.093"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "44.801"
                            },
                            "PriorYear": {
                                "val": "8.608"
                            },
                            "CurrentYear": {
                                "val": "9.704"
                            },
                            "BudgetYearOneBase": {
                                "val": "15.093"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "15.093"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "44.801"
                            },
                            "PriorYear": {
                                "val": "8.608"
                            },
                            "CurrentYear": {
                                "val": "9.704"
                            },
                            "BudgetYearOneBase": {
                                "val": "15.093"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "15.093"
                            }
                        }
                    },
                    "RelatedProgramElementList": {
                        "ProgramElementNumber": [
                            {
                                "val": "0604503N"
                            }
                        ]
                    },
                    "SupportCost": {
                        "CostElementList": {
                            "CostElement": [
                                {
                                    "Name": {
                                        "val": "2.1) Support Cost (Prior Years)"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0.625"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "@footnote": "Funds the initial logistics package, consisting of multiple individual products, for each modernization baseline (version). The logistics package is funded in the year prior to and the year that the first modernization kit is procured for each CSRR version on each submarine class.",
                                        "val": "2.2) Data\/Logistics"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "1.984"
                                            },
                                            "PriorYear": {
                                                "val": "0.45"
                                            },
                                            "CurrentYear": {
                                                "val": "0.44"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.032"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.032"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "@footnote": "Funding supports development of Government Furnished Information (GFI) package for the planning yard in the year prior to installation and preparation of ship installation drawings in the year of installation.",
                                        "val": "2.3) ShipALT\/DSA Nonrecurring"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "3.63"
                                            },
                                            "PriorYear": {
                                                "val": "0.35"
                                            },
                                            "CurrentYear": {
                                                "val": "0.347"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.993"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.993"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "@footnote": "The Enterprise Change Request (ECR) is a configuration control process rigorously implemented for the approval of new CSRR baselines or for changes to C4I systems produced by other Component Programs of Record (PORs) that impact the CSRR baseline.  These changes to other Component PORs frequently occur outside of a planned CSRR modernization and therefore, funding for these changes is required every fiscal year in order to speed the delivery of critical capabilities to the submarine force.",
                                        "val": "2.4) Enterprise Change Request"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "2.612"
                                            },
                                            "PriorYear": {
                                                "val": "0.414"
                                            },
                                            "CurrentYear": {
                                                "val": "0.478"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.111"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.111"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "2.5) Production Support"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "2.323"
                                            },
                                            "PriorYear": {
                                                "val": "0.153"
                                            },
                                            "CurrentYear": {
                                                "val": "0.336"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.24"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.24"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "2.6) Other (DSA Recurring)"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "1.626"
                                            },
                                            "PriorYear": {
                                                "val": "0.275"
                                            },
                                            "CurrentYear": {
                                                "val": "0.248"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.419"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.419"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "CategorySubtotal": {
                            "TotalCost": {
                                "AllPriorYears": {
                                    "val": "12.8"
                                },
                                "PriorYear": {
                                    "val": "1.642"
                                },
                                "CurrentYear": {
                                    "val": "1.849"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.795"
                                },
                                "BudgetYearOne": {
                                    "val": "5.795"
                                }
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "L0084 CSRR-SSN (VIRGINIA) Mod Upgrades"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "val": "1.1.1) Equipment - Mod Kits (Prior Years) - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "4"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "4.872"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "1.1.2) Equipment - Baseline upgrade Increment 1 Ver 3 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "6"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "1"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "2"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "14.002"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "2.595"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "5.346"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "2.753"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "2.753"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "@footnote": "Quantities reflect alignment with fleet installation availabilities. The number and class of submarines available in any given year are very limited and consequently, the ability to shift installations from one submarine to another is often not possible. Installation funds are required by the installing activity 3 months prior to the start of the installation. CSRR modernization activities bring new capabilities, address new requirements, resolve End-of-Life (EOL) and obsolescence issues or correct known system deficiencies.  The unit cost variance between the CSRR Increment 1 Version 3-5 is due to different capabilities\/configurations. For example, CSRR Increment 1 Version 3 is a more complex upgrade to the CSRR suite. CSRR Increment 1 Version 4 is planned to address equipment obsolescence and EOL issues. CSRR Increment 1 Version 5 will be another more complex modernization to the CSRR suite.",
                                                            "val": "1.1.3) Equipment - Mod Kits Increment 1 Ver 4 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "CurrentYear": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "CurrentYear": {
                                                                    "val": "0.258"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "1.1.5) Equipment - LPI\/LPD Solution 1 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "13"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "13"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "1.248"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1.248"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "18.874"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.595"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "5.604"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.001"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.001"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "18.874"
                                                },
                                                "PriorYear": {
                                                    "val": "2.595"
                                                },
                                                "CurrentYear": {
                                                    "val": "5.604"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "4.001"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "4.001"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "@footnote": "Production lead time for upgrade kits varies from 3 to 12 months depending on the contents of each kit and the specific components being modernized.",
                                                    "val": "SAIC"
                                                },
                                                "Location": {
                                                    "val": "Charleston, SC"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2016-02"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-01"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-01"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2017-02"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2018-01"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-07"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "3"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "6"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "AllPriorYears": {
                                                "val": "10"
                                            },
                                            "PriorYear": {
                                                "val": "1"
                                            },
                                            "CurrentYear": {
                                                "val": "3"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "14"
                                            },
                                            "BudgetYearOne": {
                                                "val": "14"
                                            }
                                        },
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "18.874"
                                            },
                                            "PriorYear": {
                                                "val": "2.595"
                                            },
                                            "CurrentYear": {
                                                "val": "5.604"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "4.001"
                                            },
                                            "BudgetYearOne": {
                                                "val": "4.001"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Method:: Installation Name: Virginia Class"
                                                    },
                                                    "InstallationCost": {
                                                        "AllPriorYears": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "8"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "2"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "13.127"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "4.371"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "PriorYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "CurrentYear": {
                                                                        "val": "1"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "CurrentYear": {
                                                                        "val": "2.251"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "CurrentYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "3"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "3"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "4.952"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "4.952"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "3"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "3"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "0.345"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "0.345"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "8"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "2"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "1"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "6"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "6"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "13.127"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "4.371"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "2.251"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "5.297"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "5.297"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "AllPriorYears": {
                                                                "val": "8"
                                                            },
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "ThirdQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "2"
                                                                }
                                                            }
                                                        },
                                                        "Out": {
                                                            "AllPriorYears": {
                                                                "val": "8"
                                                            },
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "2"
                                                                }
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "13.127"
                                            },
                                            "PriorYear": {
                                                "val": "4.371"
                                            },
                                            "CurrentYear": {
                                                "val": "2.251"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "5.297"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "5.297"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "18.874"
                            },
                            "PriorYear": {
                                "val": "2.595"
                            },
                            "CurrentYear": {
                                "val": "5.604"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.001"
                            },
                            "BudgetYearOne": {
                                "val": "4.001"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "13.127"
                            },
                            "PriorYear": {
                                "val": "4.371"
                            },
                            "CurrentYear": {
                                "val": "2.251"
                            },
                            "BudgetYearOneBase": {
                                "val": "5.297"
                            },
                            "BudgetYearOne": {
                                "val": "5.297"
                            }
                        }
                    },
                    "Description": {
                        "val": "Procurement and Installation of CSRR upgrades on VIRGINIA Class submarines"
                    }
                },
                {
                    "ModificationTitle": {
                        "val": "L0084 CSRR-SSN LOS ANGELES (LA) Mod Upgrades"
                    },
                    "ModificationNumber": {
                        "val": "7"
                    },
                    "ModificationType": {
                        "val": "TBD"
                    },
                    "Model": {
                        "val": "[No Model Specified]"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "145.395"
                            },
                            "PriorYear": {
                                "val": "23.664"
                            },
                            "CurrentYear": {
                                "val": "14.522"
                            },
                            "BudgetYearOneBase": {
                                "val": "15.446"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "15.446"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "145.395"
                            },
                            "PriorYear": {
                                "val": "23.664"
                            },
                            "CurrentYear": {
                                "val": "14.522"
                            },
                            "BudgetYearOneBase": {
                                "val": "15.446"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "15.446"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "145.395"
                            },
                            "PriorYear": {
                                "val": "23.664"
                            },
                            "CurrentYear": {
                                "val": "14.522"
                            },
                            "BudgetYearOneBase": {
                                "val": "15.446"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "15.446"
                            }
                        }
                    },
                    "RelatedProgramElementList": {
                        "ProgramElementNumber": [
                            {
                                "val": "0604503N"
                            }
                        ]
                    },
                    "SupportCost": {
                        "CostElementList": {
                            "CostElement": [
                                {
                                    "Name": {
                                        "@footnote": "The Enterprise Change Request (ECR) is a configuration control process rigorously implemented for the approval of new CSRR baselines or for changes to C4I systems produced by other Component Programs of Record (PORs) that impact the CSRR baseline.  These changes to other Component PORs frequently occur outside of a planned CSRR modernization and therefore, funding for these changes is required every fiscal year in order to speed the delivery of critical capabilities to the submarine force.",
                                        "val": "2.1) Enterprise Change Request\/Nonrecurring"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "4.146"
                                            },
                                            "PriorYear": {
                                                "val": "1.303"
                                            },
                                            "CurrentYear": {
                                                "val": "0.85"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.405"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.405"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "@footnote": "Funding supports development of Government Furnished Information (GFI) package for the planning yard in the year prior to installation and preparation of ship installation drawings in the year of installation.",
                                        "val": "2.2) ShipALT\/DSA Nonrecurring"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "1.441"
                                            },
                                            "PriorYear": {
                                                "val": "0.257"
                                            },
                                            "CurrentYear": {
                                                "val": "0.372"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.786"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.786"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "@footnote": "Funds the initial logistics package, consisting of multiple individual products, for each modernization baseline (version). The logistics package is funded in the year prior to and the year that the first modernization kit is procured for each CSRR version on each submarine class.",
                                        "val": "2.3) Data\/Logistics"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "2"
                                            },
                                            "PriorYear": {
                                                "val": "0.448"
                                            },
                                            "CurrentYear": {
                                                "val": "0.552"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.57"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.57"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "2.4) Production Support"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "6.014"
                                            },
                                            "PriorYear": {
                                                "val": "0.708"
                                            },
                                            "CurrentYear": {
                                                "val": "0.257"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.426"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.426"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "@footnote": "DSA Recurring Cost includes funding for CSRR planning yard activities.",
                                        "val": "2.5) Other (DSA Recurring)"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "8.028"
                                            },
                                            "PriorYear": {
                                                "val": "0.784"
                                            },
                                            "CurrentYear": {
                                                "val": "0.913"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.708"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.708"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "CategorySubtotal": {
                            "TotalCost": {
                                "AllPriorYears": {
                                    "val": "21.629"
                                },
                                "PriorYear": {
                                    "val": "3.5"
                                },
                                "CurrentYear": {
                                    "val": "2.944"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.895"
                                },
                                "BudgetYearOne": {
                                    "val": "5.895"
                                }
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "L0084 CSRR-SSN LOS ANGELES (LA) Mod Upgrades"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "@footnote": "FY18 funding includes cost to procure two Radio Frequency Distribution and Control Systems (RFDACS) to support Legacy Ultra High Frequency (UHF) communications on LOS ANGELES Class platforms. Installation funds are required by the installing activity three months prior to the start of the installation. FY18 includes procurement of one CSRR Increment 1 Version 3 modernization kit.",
                                                            "val": "1.1.1) Equipment - Mod Kits Increment 1 Ver 3 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "25"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "4"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "86.425"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "16.986"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "4.374"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "4.505"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "4.505"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "@footnote": "Quantities reflect alignment with fleet installation availabilities. The number and class of submarines available in any given year are very limited and consequently, the ability to shift installations from one submarine to another is often not possible. Installation funds are required by the installing activity 3 months prior to the start of the installation. CSRR modernization activities bring new capabilities, address new requirements, resolve End-of-Life (EOL) and obsolescence issues or correct known system deficiencies.  The unit cost variance between the CSRR Increment 1 Version 3-5 is due to different capabilities\/configurations. For example, CSRR Increment 1 Version 3 is a more complex upgrade to the CSRR suite. CSRR Increment 1 Version 4 is planned to address equipment obsolescence and EOL issues. CSRR Increment 1 Version 5 will be another more complex modernization to the CSRR suite. FY18 includes procurement of four CSRR Increment 1 Version 4 modernization kits.",
                                                            "val": "1.1.2) Equipment - Mod Kits Increment 1 Ver 4 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "CurrentYear": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "4"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "4"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "CurrentYear": {
                                                                    "val": "0.258"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "1.061"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1.061"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "1.1.4) Equipment - LPI\/LPD Solution 1 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "16"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "16"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "1.536"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1.536"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "86.425"
                                                    },
                                                    "PriorYear": {
                                                        "val": "16.986"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.632"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7.102"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7.102"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "86.425"
                                                },
                                                "PriorYear": {
                                                    "val": "16.986"
                                                },
                                                "CurrentYear": {
                                                    "val": "4.632"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "7.102"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "7.102"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "@footnote": "Production lead time for upgrade kits varies from 3 to 12 months depending on the contents of each kit and the specific components being modernized.",
                                                    "val": "SAIC"
                                                },
                                                "Location": {
                                                    "val": "Charleston, SC"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2015-12"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-01"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-01"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2016-12"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2018-01"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-08"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "3"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "7"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "AllPriorYears": {
                                                "val": "25"
                                            },
                                            "PriorYear": {
                                                "val": "4"
                                            },
                                            "CurrentYear": {
                                                "val": "2"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "21"
                                            },
                                            "BudgetYearOne": {
                                                "val": "21"
                                            }
                                        },
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "86.425"
                                            },
                                            "PriorYear": {
                                                "val": "16.986"
                                            },
                                            "CurrentYear": {
                                                "val": "4.632"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "7.102"
                                            },
                                            "BudgetYearOne": {
                                                "val": "7.102"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Method:: Installation Name: LA Class"
                                                    },
                                                    "InstallationCost": {
                                                        "AllPriorYears": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "23"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "2"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "37.341"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "3.178"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "PriorYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "CurrentYear": {
                                                                        "val": "4"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "CurrentYear": {
                                                                        "val": "6.946"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "CurrentYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "2"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "2"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "2.104"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "2.104"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "3"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "3"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "0.345"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "0.345"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "23"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "2"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "4"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "5"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "5"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "37.341"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "3.178"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "6.946"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "2.449"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "2.449"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "AllPriorYears": {
                                                                "val": "20"
                                                            },
                                                            "PriorYear": {
                                                                "SecondQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "2"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "FourthQuarter": {
                                                                    "val": "2"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "3"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "2"
                                                                }
                                                            }
                                                        },
                                                        "Out": {
                                                            "AllPriorYears": {
                                                                "val": "19"
                                                            },
                                                            "PriorYear": {
                                                                "FirstQuarter": {
                                                                    "val": "1"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "2"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "2"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "2"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "3"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "2"
                                                                }
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "37.341"
                                            },
                                            "PriorYear": {
                                                "val": "3.178"
                                            },
                                            "CurrentYear": {
                                                "val": "6.946"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.449"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.449"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "86.425"
                            },
                            "PriorYear": {
                                "val": "16.986"
                            },
                            "CurrentYear": {
                                "val": "4.632"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.102"
                            },
                            "BudgetYearOne": {
                                "val": "7.102"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "37.341"
                            },
                            "PriorYear": {
                                "val": "3.178"
                            },
                            "CurrentYear": {
                                "val": "6.946"
                            },
                            "BudgetYearOneBase": {
                                "val": "2.449"
                            },
                            "BudgetYearOne": {
                                "val": "2.449"
                            }
                        }
                    },
                    "Description": {
                        "val": "Procurement and Installation of CSRR and upgrades on LOS ANGELES Class Submarines"
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}