{
    "id": "2018-Navy-PB-1810N-MJBOOK-3-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-2",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "5253"
        },
        "LineItemTitle": {
            "val": "Tomahawk Support Equipment"
        },
        "P1LineNumber": {
            "val": "122"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Ordnance Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Ship Missile Systems Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "541.808"
                },
                "PriorYear": {
                    "val": "71.245"
                },
                "CurrentYear": {
                    "val": "95.546"
                },
                "BudgetYearOneBase": {
                    "val": "73.184"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "73.184"
                },
                "BudgetYearTwo": {
                    "val": "72.852"
                },
                "BudgetYearThree": {
                    "val": "73.015"
                },
                "BudgetYearFour": {
                    "val": "74.539"
                },
                "BudgetYearFive": {
                    "val": "76.023"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "541.808"
                },
                "PriorYear": {
                    "val": "71.245"
                },
                "CurrentYear": {
                    "val": "95.546"
                },
                "BudgetYearOneBase": {
                    "val": "73.184"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "73.184"
                },
                "BudgetYearTwo": {
                    "val": "72.852"
                },
                "BudgetYearThree": {
                    "val": "73.015"
                },
                "BudgetYearFour": {
                    "val": "74.539"
                },
                "BudgetYearFive": {
                    "val": "76.023"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "541.808"
                },
                "PriorYear": {
                    "val": "71.245"
                },
                "CurrentYear": {
                    "val": "95.546"
                },
                "BudgetYearOneBase": {
                    "val": "73.184"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "73.184"
                },
                "BudgetYearTwo": {
                    "val": "72.852"
                },
                "BudgetYearThree": {
                    "val": "73.015"
                },
                "BudgetYearFour": {
                    "val": "74.539"
                },
                "BudgetYearFive": {
                    "val": "76.023"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.147"
                },
                "CurrentYear": {
                    "val": "0.177"
                },
                "BudgetYearOneBase": {
                    "val": "0.311"
                },
                "BudgetYearOne": {
                    "val": "0.311"
                },
                "BudgetYearTwo": {
                    "val": "0.374"
                },
                "BudgetYearThree": {
                    "val": "0.281"
                },
                "BudgetYearFour": {
                    "val": "0.231"
                },
                "BudgetYearFive": {
                    "val": "0.204"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Theater Mission Planning Center (TMPC) consists of Commercial and Government Off-The-Shelf (COTS\/GOTS) software and COTS hardware.  TMPC provides targeting, mission planning, strike planning and execution, mission distribution, and operational employment capabilities for the Tomahawk Land Attack Missile (TLAM).  Continuous TMPC software development decreases mission planning time and increases the quality and accuracy of each mission while reducing complexity.  TMPC provides mission planning at the theater and operational levels and is designed for high rate mission planning production responsive to national strategic, operational, and tactical requirements.  TMPC develops and distributes missions for the Tomahawk Missile; provides command information services for Tomahawk Weapon System (TWS); provides strike planning, execution, coordination, control and reporting, and provides Maritime Component Commanders (MCC) the capability to plan or modify conventional TLAM missions.  TMPC has evolved into scalable configurations deployed in four configurations at 186 sites: Cruise Missile Support Activities (CMSAs) (3+1 FMS), Tomahawk Strike and Mission Planning Cells (TSMPCs) (3 - C5F, C6F, C7F), Carrier Strike Groups (CSGs) (19 - 10 CVN), Firing Units (FRUs) (84 Surface\/55 Submarines), and fleet training sites and labs (19).  TMPC supports major joint combat operations and Overseas Contingency Operations.  TMPC was previously referred to as the Tomahawk Command and Control System (TC2S).     \n\nFunds provide for systems engineering, testing, Independent Verification & Validation (IV&V), security accreditation, installation, site acceptance testing, user familiarization of products and hardware.  The Selective Availability Anti-Spoofing Module (SAASM) Global Positioning System (GPS) capability, workflow improvements to Mission Planning, Strike Planning & Execution and TWS Single System initiative are included in this line to transition to a Service Oriented Architecture, improve TCS \"Kill Chain\" planning and communications architecture and system effectiveness.  Also, this funding line provides for COTS\/GOTS refreshment, engineering changes, software upgrades, and associated Nuclear Powered General Purpose Attack Submarine\/Guided Missile Destroyer\/Guided Missile Cruiser\/Nuclear Aircraft Carrier (SSNs\/DDGs\/CGs\/CVN) logistics, and infrastructure to maintain compatibility and interoperability with existing and future TMPC system configurations.\n\nSurface and Submarine Tactical Tomahawk Weapon Control System (TTWCS) is a post milestone III program executing its first major tech refresh since its 2004 IOC.  The first phase of this tech refresh partially resolves processor component obsolescence.  The final phase completes all hardware and software obsolescence efforts and will be fleet released in 2017.  TTWCS functions include: tasking validation (missile mission matching), planning of over the water routes, initialization, preparation and launch of BLK III\/IV missiles, TTWCS reduced response time and increased operational flexibility through addition of Launch Platform Mission Planning (LPMP), and in-flight monitoring and control of Blk IV missiles.  Final phase efforts began in FY 2012 and consist of the completion of full TTWCS hardware technology refresh, C4I Web services interfaces and operability to be fielded in backfit firing units.  In addition, funds provided to continue TTWCS viability in TTWCS v5.6 and ensure compliance with cyber security mandates, continue to address hardware obsolescence through periodic COTS hardware refresh and periodically refresh of GOTS software to address obsolescence, support migration from 32 bit to 64 bit architecture and migrate away from legacy Ada code. Finally, it will allow reduction of system complexity and incorporation of critical software fixes.  Program options are being identified that will enable TWS integration into future platforms.  Included in those options will be changes necessary for TTWCS to ensure required functionality as the missile is modernized beginning in FY 2019."
        },
        "Justification": {
            "val": "Funding is required to continue fielding version TTWCS 5.4.0 and begin fielding of TTWCS hardware\/software obsolescence updates (v5.4.0.2).  Funds also provide for integration, modernization and interoperability efforts necessary to keep pace with changes, retain capability and exploit capabilities of internal (TWS All-Up-Round missile and TTWCS) and external (Modernized Integrated Data Base (MIDB)), National Geospatial Intelligence Agency (NGA) products, Distributed Common Ground Systems (DCGS) Integrated Backbone (DIB) compliance, Future Imagery Architecture (FIA) imagery formats and Intelligence Surveillance & Reconnaissance (ISR) interfaces, Network Centric Enterprise Services (NCES), Global Information Grid\/Internet Protocol (GIG\/IP) (V)6, FORCEnet compliance systems\/interfaces to the effectiveness of the TWS, into TMPC deployed configurations.  Funding supporting TTWCS is appropriately phased to complete the 1st major tech refresh since IOC in 2004.  TTWCS relies on COTS hardware that requires a constant and predictive upgrade path to meet cyber security mandates, ensure continued vendor supportability, avoid costly retrofits of fielded systems, and ensure interoperability between tightly coupled COTS software applications, operating systems, and hardware processing nodes.  Consequently, increased product improvement resources are required commencing in FY 2017 and continuing in to FY 2018 to comply with commercial hardware\/software supportability mandates, obsolescence, and information assurance requirements to maintain pace with modern computing architectures.\n\nFunding is required to initiate and continue the upgrade of unsupportable and obsolete TMPC software to ensure compliance with DoD cyber security mandates.  Funding also addresses a National Technical Means (NTM) imagery format change.  The NTM change requires TMPC upgrades to be fielded to all TLAM mission planning sites by 3QFY 2018.  The Tomahawk Weapon System cannot execute a mission successfully without the NTM imagery as it is used by TMPC for precision targeting and mission planning.  FY 2018 continues deployment of TMPC 5.0.1 to Firing Units and modernization upgrade efforts for TMPC 6.0. TMPC 6.0 includes navigation and communications improvements required to support the TWS Modernization program."
        },
        "MDAPCode": {
            "val": "289"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "525300, TOMAHAWK Support Equipment"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "541.808"
                            },
                            "PriorYear": {
                                "val": "71.245"
                            },
                            "CurrentYear": {
                                "val": "95.546"
                            },
                            "BudgetYearOneBase": {
                                "val": "73.184"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "73.184"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "541.808"
                            },
                            "PriorYear": {
                                "val": "71.245"
                            },
                            "CurrentYear": {
                                "val": "95.546"
                            },
                            "BudgetYearOneBase": {
                                "val": "73.184"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "73.184"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "541.808"
                            },
                            "PriorYear": {
                                "val": "71.245"
                            },
                            "CurrentYear": {
                                "val": "95.546"
                            },
                            "BudgetYearOneBase": {
                                "val": "73.184"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "73.184"
                            }
                        },
                        "InitialSpares": {
                            "PriorYear": {
                                "val": "0.147"
                            },
                            "CurrentYear": {
                                "val": "0.177"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.311"
                            },
                            "BudgetYearOne": {
                                "val": "0.311"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "TTWCS"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "TTWCS Hardware funds are required to address hardware obsolescence through periodic COTS hardware refresh.",
                                                    "val": "1.1.1) Tactical Tomahawk Weapon Control System (TTWCS) Hardware"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "11.817"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.594"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.519"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.549"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.549"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "11.817"
                                            },
                                            "PriorYear": {
                                                "val": "2.594"
                                            },
                                            "CurrentYear": {
                                                "val": "1.519"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.549"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.549"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "11.817"
                                        },
                                        "PriorYear": {
                                            "val": "2.594"
                                        },
                                        "CurrentYear": {
                                            "val": "1.519"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.549"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.549"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "HARDWARE RECURRING SUPPORT - TTWCS"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "TTWCS relies on COTS hardware that requires a constant and predictive upgrade path to meet cyber security mandates, ensure continued vendor supportability, avoid costly retrofits of fielded systems, and ensure interoperability between tightly coupled COTS software applications, operating systems, and hardware processing nodes.  Consequently, increased product improvement resources are required commencing in FY 2017 and continuing in to FY 2018 to comply with commercial hardware\/software supportability mandates, obsolescence, and information assurance requirements to maintain pace with modern computing architectures.",
                                                    "val": "2.1.1) TTWCS Product Improvement"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "122.909"
                                                        },
                                                        "PriorYear": {
                                                            "val": "11.511"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "18.735"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "18.018"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "18.018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "122.909"
                                            },
                                            "PriorYear": {
                                                "val": "11.511"
                                            },
                                            "CurrentYear": {
                                                "val": "18.735"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "18.018"
                                            },
                                            "BudgetYearOne": {
                                                "val": "18.018"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "122.909"
                                        },
                                        "PriorYear": {
                                            "val": "11.511"
                                        },
                                        "CurrentYear": {
                                            "val": "18.735"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.018"
                                        },
                                        "BudgetYearOne": {
                                            "val": "18.018"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "TMPC"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "Procures hardware and software for installations of system upgrades at all 186 TMPC sites.  This also includes hardware and software for the system developers.  FY 2018 procure the hardware and software for the installation of TMPC 5.0.1 onboard Firing Units Guided Missile Destroyer, Guided Missile Cruiser and Nuclear Powered General Purpose Attack Submarine  (DDGs\/CGs\/SSNs), Command Staffs, laboratories, and training sites.",
                                                    "val": "3.1.1) Tomahawk Mission Planning Center (TMPC) Hardware"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "19.001"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.765"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2.969"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "3.579"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "3.579"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "19.001"
                                            },
                                            "PriorYear": {
                                                "val": "2.765"
                                            },
                                            "CurrentYear": {
                                                "val": "2.969"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "3.579"
                                            },
                                            "BudgetYearOne": {
                                                "val": "3.579"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "19.001"
                                        },
                                        "PriorYear": {
                                            "val": "2.765"
                                        },
                                        "CurrentYear": {
                                            "val": "2.969"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.579"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.579"
                                        }
                                    }
                                }
                            }
                        ],
                        "Software": {
                            "Name": {
                                "val": "PRODUCT IMPROVEMENTS - TMPC"
                            },
                            "Recurring": {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "@footnote": "Provides for software engineering efforts associated with the delivery of system modernization and improvements by the prime developers to continue the upgrade of unsupportable and obsolete TMPC software and to ensure compliance with DoD cyber security mandates.  Funding also addresses a National Technical Means (NTM) imagery format change.  The NTM change requires TMPC upgrades to be fielded to all TLAM mission planning sites by 3QFY 2018.  The Tomahawk Weapon System cannot execute a mission successfully without the NTM imagery as it is used by TMPC for precision targeting and mission planning.  In FY 2018, this line also continues the upgrades to the TMPC Enterprise Network (TEN 2.0) will improve the distribution of electronic software distribution \/ propagation, enable remote assistance\/troubleshooting, provide enhanced configuration management visibility, and reduce TMPC IA risk and costs associated with maintaining an effective IA posture.  Funding also provides software upgrades to the submarine community to specifically address system interfaces.  Cost increases in FY 2017 support the TMPC system complexity reduction initiative that address US Fleet Forces Command (USFFC) requirements for fleet operators to effectively execute large and complex TLAM operations.",
                                                "val": "4.1.1) TMPC Product Improvements"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "121.031"
                                                    },
                                                    "PriorYear": {
                                                        "val": "22.635"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "33.385"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "17.867"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "17.867"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "121.031"
                                        },
                                        "PriorYear": {
                                            "val": "22.635"
                                        },
                                        "CurrentYear": {
                                            "val": "33.385"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.867"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.867"
                                        }
                                    }
                                }
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "AllPriorYears": {
                                        "val": "121.031"
                                    },
                                    "PriorYear": {
                                        "val": "22.635"
                                    },
                                    "CurrentYear": {
                                        "val": "33.385"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "17.867"
                                    },
                                    "BudgetYearOne": {
                                        "val": "17.867"
                                    }
                                }
                            }
                        },
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "5.1) TTWCS Production Engineering"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "22.123"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.018"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.038"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.059"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.059"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "TTWCS Integrated Logistics Support required for Surface\/Submarine installations onboard firing units.  Costs increases in FY 2017 are associated with the commencement of installation of version v5.4.0.2. which is more expensive than previous upgrades due to increased shipboard hardware changes.  FY 2018 funding decrease associated with surface and submarine platform TTWCS update schedules.",
                                                "val": "5.2) TTWCS Integrated Logistic Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "88.809"
                                                    },
                                                    "PriorYear": {
                                                        "val": "9.982"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "13.433"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "11.081"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "11.081"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "110.932"
                                        },
                                        "PriorYear": {
                                            "val": "11"
                                        },
                                        "CurrentYear": {
                                            "val": "14.471"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.14"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.14"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Support - TTWCS"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "@footnote": "Provides systems engineering support for system design and definition of requirements necessary to evaluate all functional aspects of the TMPC subsystems and workflows that directly impact strike & execution and mission planning products.  It includes reviewing TWS and external interfaces for impacts resulting from design upgrades\/changes within TWS and by external organizations, Independent Verification & Validation (IV&V), and security accreditation activities.",
                                                "val": "6.1) TMPC Production Engineering"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "32.35"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.295"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.392"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.353"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.353"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funds activities that directly support system upgrades requirements such as user events, requirements validation, systems engineering technical reviews, software formal qualification testing, and delta training documentation.",
                                                "val": "6.2) TMPC Production Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "30.342"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.032"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.164"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.126"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.126"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funds installations support associated with the deployment of new TMPC system upgrades to all 186 TMPC sites.  FY 2018 funds the installation of TMPC 5.0.1 onboard Firing Units Guided Missile Destroyer, Guided Missile Cruiser and Nuclear Attack Submarine (DDGs\/CGs\/SSNs), Command Staffs, laboratories, and training classrooms.",
                                                "val": "6.3) TMPC Integrated Logistic Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "69.398"
                                                    },
                                                    "PriorYear": {
                                                        "val": "12.413"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "15.911"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "11.552"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "11.552"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "132.09"
                                        },
                                        "PriorYear": {
                                            "val": "20.74"
                                        },
                                        "CurrentYear": {
                                            "val": "24.467"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.031"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.031"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "TMPC"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "7.1) FMP Installations"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "15.139"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "15.139"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "ILS INSTALLATIONS"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "8.1) TTWCS Other Cost"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.889"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "8.889"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Miscellaneous"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}