{
    "id": "2018-Army-PB-2035A-JBOOK-377d93ca794817f44e4b0e8b6a4ac9da01254c9911de0ea9a8ab395d402568a9-32",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_OTHER_2-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "TA0600"
        },
        "LineItemTitle": {
            "val": "Information System Security Program-ISSP"
        },
        "P1LineNumber": {
            "val": "55"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "64"
        },
        "BudgetSubActivityTitle": {
            "val": "Information Security"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "1529.658"
                },
                "PriorYear": {
                    "val": "19.92"
                },
                "Total": {
                    "val": "1549.578"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "1529.658"
                },
                "PriorYear": {
                    "val": "19.92"
                },
                "Total": {
                    "val": "1549.578"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "1529.658"
                },
                "PriorYear": {
                    "val": "19.92"
                },
                "Total": {
                    "val": "1549.578"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0303140A"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "19.92"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "19.92"
                    }
                }
            }
        },
        "Description": {
            "val": "The Cryptographic Systems (CS) Program procures and fields Communications Security (COMSEC) solutions to secure the Army's tactical and enterprise classified networks.  New and emerging architectures, cease key dates, emerging threats, and DoD\/Army policy are driving the need to replace current inventory of stove pipe systems with technologically advanced (network centric\/Global Information Grid (GIG) compliant) devices that incorporate Chairman of the Joint Chiefs of Staff and Joint Requirements Oversight Council directed cryptographic standardization, advanced key management and network centric performance capabilities.  This program enables DoD to equip the force with critical cryptographic solutions and services during peacetime, wartime, and contingency operations. The program consists of three product families: In-Line Network Encryptors (INE), Link\/Trunk Encryptors Family (LEF), and Secure Voice. (PD Net E)\n\nThe Army-wide Cryptographic Network Standardization (ACNS) effort brings cryptographic equipment into compliance with NSA mandated use of modern cryptographic algorithms and keys as well as the Army's upgraded data network including use of Internet Protocol version 6 (IPv6), as mandated by the Army Chief Information Officer (CIO)\/G6.  ACNS provides the Army fully modernized equipment and provides assistance in the areas of system identification, training, integration, network optimization, and property book updates to gaining Units.  ACNS is an essential project as many currently fielded legacy devices will fall out of compliance starting in FY 2015 due to NSA driven cease key dates.  Failure to comply will result in vulnerabilities to classified data transmissions, or an inability to communicate at classified levels. (PD Net E)\n\nThe Defensive Cyberspace Operations (DCO) program provides initial capabilities to Cyber Protection Teams. Teams enable passive and active cyberspace defensive operations to preserve friendly cyberspace capabilities, and protect data, networks, net-centric capabilities, and other designated systems.  DCO consists of four critical capabilities: \n\nDCO-Infrastructure (DCO-I): the hardware and software baseline for remote cyber maneuver based on Defense Advanced Research Projects Agency (DARPA) Plan X \nCyber Protection Team (CPT) support: tools that reside inside DCO-I \nWeb Vulnerability Scanning: the software baseline to secure key cyber terrain and protect DoD websites \nBig Data Analytics: analytics that leverage Defense Information System Agency (DISA) Acropolis analytics  \n\nDCO responds to unauthorized activity or alerts\/threat information against the Army enterprise, and leverages intelligence, counterintelligence, law enforcement, and other military capabilities.  It includes outmaneuvering adversaries taking or about to take offensive actions against defended networks, or otherwise responding to internal and external cyberspace threats.  Internal defense measures include mission assurance actions to dynamically reestablish, re-secure, reroute, reconstitute, or isolate degraded or compromised local networks to ensure sufficient cyberspace access for commanders.  The Army's DCO activities are a construct of active cyberspace defenses which provide synchronized, real-time capabilities to discover, detect, analyze, and mitigate threats and vulnerabilities to DoD networks and systems."
        },
        "Justification": {
            "val": "Program has no FY 2018 requirement.\n\nIn accordance with Section 1815 of the FY2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}