{
    "id": "2018-Navy-PB-1810N-MJBOOK-0-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-30",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "1130"
        },
        "LineItemTitle": {
            "val": "Diving and Salvage Equipment"
        },
        "P1LineNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "11"
        },
        "BudgetSubActivityTitle": {
            "val": "Ocean Engineering"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "41.919"
                },
                "PriorYear": {
                    "val": "15.982"
                },
                "CurrentYear": {
                    "val": "8.973"
                },
                "BudgetYearOneBase": {
                    "val": "10.619"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "10.619"
                },
                "BudgetYearTwo": {
                    "val": "10.797"
                },
                "BudgetYearThree": {
                    "val": "12.438"
                },
                "BudgetYearFour": {
                    "val": "11.266"
                },
                "BudgetYearFive": {
                    "val": "11.352"
                },
                "Total": {
                    "val": "123.346"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "41.919"
                },
                "PriorYear": {
                    "val": "15.982"
                },
                "CurrentYear": {
                    "val": "8.973"
                },
                "BudgetYearOneBase": {
                    "val": "10.619"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "10.619"
                },
                "BudgetYearTwo": {
                    "val": "10.797"
                },
                "BudgetYearThree": {
                    "val": "12.438"
                },
                "BudgetYearFour": {
                    "val": "11.266"
                },
                "BudgetYearFive": {
                    "val": "11.352"
                },
                "Total": {
                    "val": "123.346"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "41.919"
                },
                "PriorYear": {
                    "val": "15.982"
                },
                "CurrentYear": {
                    "val": "8.973"
                },
                "BudgetYearOneBase": {
                    "val": "10.619"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "10.619"
                },
                "BudgetYearTwo": {
                    "val": "10.797"
                },
                "BudgetYearThree": {
                    "val": "12.438"
                },
                "BudgetYearFour": {
                    "val": "11.266"
                },
                "BudgetYearFive": {
                    "val": "11.352"
                },
                "Total": {
                    "val": "123.346"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0204561N"
                },
                {
                    "val": "0204454N"
                },
                {
                    "val": "0204423N"
                }
            ]
        },
        "Description": {
            "val": "DIVING AND SALVAGE EQUIPMENT:\n\nDIVING:  This funding is for procurement of modern equipment to replace the Navy's aging diving systems.  The demand for divers' services for salvage, ship husbandry underwater construction, EOD and special warfare is rapidly increasing.  The requested funding buys diving hardware which increases the efficiency and safety of the working diver.  Program objectives are to:  (1) provide increased safety for diver decompression and better recompression chamber patient monitoring capability, (2) increase underwater ship maintenance capabilities, (3) improve quick response capability, and (4) standardize the configuration of diving systems in the Fleet.\n\nSALVAGE: This funding is for procurement of critical salvage and underwater ship repair items.  These specialized tools and equipment are used by divers to make emergent and scheduled repairs to ships and submarines and to execute worldwide salvage operations.\n\n[P40A \/ DIVING (N97)]: The DIVING EQUIPMENTS to be procured are:\n\n[P40A \/ HY176 - HP AIR COMPRESSORS]: This item replaces high pressure air compressors in existing divers' life support systems which have reached the end of their service life. Required I\/O is 300.\n\n[P40A \/ HY177 - AIR PURIFICATION UNITS]: The Portable Air Purification Unit is used when charging diver's life support system breathing air flasks. The Portable Air Monitor Unit can monitor the diver's breathing air in accordance with the requirements of the U.S. Navy Dive Manual and can be inserted inline of the DLSS to monitor the purity of the diver's breathing air in accordance with the requirements of the U.S. Navy Dive Manual.  Required I\/O is 50 units.\n\n[P40A \/ HY179 - NAVY EXPERIMENTAL DIVING UNIT]: NEDU's mission is to support the Fleet diver through test and evaluation of diving equipment and procedures as well as hyperbaric systems for NAVSEA, Navy, and DoD activities. Funding is to procure equipment for test, facilities atmospheric control, life support, and physiological systems. These systems not only ensure the safety and lives of NEDU sailors performing experimental dives, but ultimately support the combat readiness and mission success of the Fleet sailors who use the equipment tested at NEDU. Funding is included to support the periodic upgrade of Ocean Simulation Facility (OSF) components. The OSF is the world's largest man-rated hyperbaric chamber affording space for 12 divers in 5 hyperbaric dry chambers, man-rated for dives to 2,250 feet of sea water (1000 psi) with a 50' x 15', 55,000-gallon wet-pot capacity, temperatures from 28 to 104 degrees Fahrenheit, an associated 1.3 million-cubic foot (37 km3) bottle field and uses a fully computerized data instrumentation and collection system. Unit prices vary depending on the specific equipment mix planned for upgrade in any single year.\n\n[P40A \/ HY192 - THERMAL DIVING SUITS]: The Thermal Diving Suits are active diver thermal protection for operations in extreme cold or warm water.  Thermal protection is required to maintain a diver temperature within a safe thermal range.  I\/O is 24.\n\n[P40A \/ HY193 - SURFACE SUPPLIED DIVING HELMET]: Kirby Morgan KM-37 NS Underwater Breathing Apparatus.  This is a diving helmet with a fiberglass shell and second stage regulator that works in conjunction with a surface supply control console assembly (CCA) and an umbilical. Required I\/O is 250.\n\n[P40A \/ HY194 - CONTAMINATED WATER DIVING EQUIPMENT]: Surface supplied diving equipment (helmets, drysuits, umbilicals, surface exhaust consoles, etc.) specifically designed for protecting the diver during in water contaminated water diving operations. Diving equipment is composed of helmets, specialized drysuits, surface return umbilicals, and surface exhaust consoles.   Required I\/O is 2.\n\n[P40A \/ HY199 - NAVY DIVE COMPUTER]: The Navy Dive Computer is a diver worn decompression computer which provides primarily Self Contained Underwater Breathing Apparatus (SCUBA) divers with real time calculation of decompression limits\/obligations. I\/O is 1400.\n\n[P40A \/ HY210 - COMPACT DIVER LIFE SUPPORT SYSTEM AIR SUPPLY]: This is a portable Air Supply that has designated primary and secondary air cylinders with a simple, unregulated control panel. The air supply will provide 3000-5000 psi diver-breathing air to diving life support systems including but not limited to the SNDL, TRCS, FADS III, and LWDS. This is for use in surface supplied diving and hyperbaric treatment operations.  Required Inventory Objective I\/O is 50.\n\n[P40A \/ HY212 - PORTABLE DIVE SYSTEM CONTROL CONSOLE ASSEMBLY (CCA)]: This is a surface supplied diving system control console assembly that will regulate and supply diving breathing gas from the surface to 3 divers. The system is not anticipated to have a volume tank as it will operate on separate high pressure breathing gas sources only. Required Inventory Objective I\/O is 100.\n\n[P40A \/ HY213 - HP COMPOSITE FLASK REPLACEMENT]: The flasks used in the CAOS, ASRA, OSRA, HOSRA, CASRA, and COSRA all require replacement after 15 years. NAVSEA 00C has will provide the cylinders to fleet diving commands. Required Inventory Objective I\/O is 2500.\n\n[P40A \/ HY214 - CONTAMINATED WATER DIVING SURFACE DECONTAMINATION EQUIPMENT]: Contaminated Water Diving Decontamination Equipment is specifically designed for protecting the diver and topside operators during contaminated water diving operations. Decontamination equipment is composed of tender personal protective devices (PPE), diver PPE ((gloves, boots, chafing gear, drysuits, neck dams), decontamination\/disinfectant solutions, sprayers, showers and tents, collection basins and pools, disposable cleaning materials (brushes, sponges, towels, etc), and emergency gas supplies.  Required Inventory Objective I\/O is 2.\n\n[P40A \/ HY222 - 300 FSW NAVY DEEP DOUBLE LOCK RECOMPRESSION CHAMBER]: The 300 FSW Navy Deep Double Lock Recompression Chamber is a conventional chamber designed to be built using standard commercial specifications and standards; however it operates at a significantly higher pressure than the SNDL (HY132). The NDDL provides a full range of recompression treatment for one patient and one attendant down to a depth of 300 FSW. This chamber is containerized to allow the chamber to be transported and installed for long term operations. This chamber will be used to support fly away mixed gas operations utilizing the FMGS as well as deep MK-16 UBA operations where possible. Required Inventory Objective I\/O is 0.\n\n[P40A \/ HY224 - SCUBA REGULATORS]: This is 1st and 2nd stage Self Contained Underwater Breathing Apparatus (SCUBA) regulator fitted with an additional octopus 2nd stage and a console with both a cylinder pressure gauge and diver's depth gauge included. I\/O is 5,000.\n\n[P40A \/ HY225 - PRESSURE TEST CHAMBERS]: The pressure test chambers (PTC) have been developed to replace legacy PTC's that have reached the end of their service life. The PTC is a small pressurized chamber and gas supply that allows for comparative calibration of diver depth gauges down to 300 FSW. I\/O is 60.\n\n[P40A \/ HY226 - FLEX CHAMBER]: The flexible recompression chamber system is composed of a double-lock flexible chamber, control console, gas supply and interconnecting hoses.  The flex chamber is designed as an extreme lightweight system used to treat diver's injuries, including Arterial Gas Embolism and Decompression Sickness.  I\/O is 36.\n\n[P40A \/ HY233 - SURFACE SUPPLY AUGMENTED SCUBA SYSTEM]: The Surface Supply Augmented SCUBA System consists of the Interspiro DIVIATOR Dive Panel (DP) Surface Supply System and the Interspiro DIVIATOR Self Contained Underwater Breathing Apparatus (SCUBA) System. This is a lightweight, highly portable system which makes is ideal for rapid deployment to remote locations.  The apparatus combines the capability of surface supplied diving with the portability of SCUBA.  Required Inventory Objective I\/O is 50.\n\n[P40A \/ HY234 - DIVER AUGMENTED VISUAL DISPLAY (DAVD)]: The Diver Augmented Visual Display (DAVD) is a system that incorporates 3D sonar mapping, high speed - high frequency helmet mounted sonar, diver tracking, and a head's up display into an existing USN underwater breathing apparatus (UBA).  The system allows a diver in low\/no visibility waters to locate targets of interest, transit to the location and see their work environment in real-time.  In addition, the system allows a top-side diving supervisor to monitor the divers work progress.  Each system includes equipment for one diver.  Required Inventory Objective I\/O is 173\n\n[P40A \/ NSW SERVICE-COMMON EQUIPMENT (N95)]: The NSW SERVICE-COMMON EQUIPMENTS to be procured are:\n\n[P40A \/ HY235 - NSW SERVICE COMMON SCUBA\/SONAR KIT]: This kit includes standard SCUBA gear for one diver including: regulator, buoyancy compensator, mask, fins, gloves, boots, suits.  In addition, it also includes handheld SONAR systems, lights and other diver visualization gear. I\/O is 200\n\n[P40A \/ HY236 - NSW SERVICE COMMON STANDARD DOUBLE LOCK RECOMPRESSION CHAMBER]: The NSW Service Common Standard Navy Double Lock Recompression Chamber System (SNDLRCS) is a conventional chamber designed and built using standard commercial specifications and standards. The SNDLRCS provides for surface decompression, training, and for the full range of recompression treatment for two patients and two attendants. These chambers are containerized to allow for transport and installation at a destination for long term operations. The SNDLRCS will replace aging legacy recompression chambers that are difficult to maintain and will be retired due to fatigue and material flaws. Required I\/O is 4\n\n[P40A \/ SALVAGE (N9I & N97)]: The SALVAGE EQUIPMENTS to be procured are:\n\n[P40A \/ HY016 - DECK SYSTEMS]: The deck systems are composed of multiple portable hydraulic systems and components that are designed to handle synthetic line or wire rope to aid in moving or positioning of barges, ships, or other floating elements on the water or items resting on the ocean floor.  Deck Systems consist of portable hydraulic driven capstans, portable hydraulic driven winches with horizontal capstans, hydraulic power units, control systems, hydraulic hoses and all ancillary equipment. Required I\/O is 34.\n\n[P40A \/ HY050 - SYNTHETIC LINES]: This line is used for lifting, mooring, towing, rigging, and in conjunction with the remotely operated vehicles at the salvage site.  Required I\/O is 123.\n\n[P40A \/ HY062 - ROV SONAR SYSTEMS]: These sonars are used on the SWISS, DEEP DRONE, ORION, HYDROS, and CURV-21 remotely operated vehicles to locate items lost on the sea floor, aircraft debris fields, sunken hull sections, and submerged obstacles.  Total I\/O is 8 (6 operational plus 2 spares).\n\n[P40A \/ HY116 - PORTABLE SUBMERSIBLE PUMPS]: The submersible salvage pump system is designed move large volumes of fluid at a high discharge pressure resulting is a high lift capacity.  The submersible pumps vary in discharge size of 2\" to over 24\" to meet designated response requirements.  Systems are modular packaged for rapid deployment and transportation.  Pump assemblies are designed to be used through limited access openings or to be positioned in confined spaces.  Submersible salvage pump systems consist of submersible hydraulic pumps (2\" to 24\"), hydraulic power units, hydraulic hoses, and all ancillary equipment.  Required I\/O is 94.\n\n[P40A \/ HY131 - ROV HANDLING SYSTEM]: These systems are used to launch and recover remotely operated vehicles and to tend the deployed cable, compensate for ship motion, monitor cable tension, and store cable.  Required I\/O is 10 (5 operational and 5 spares).\n\n[P40A \/ HY142 - SALVAGE AIR COMPRESSOR]: The salvage air compressor systems are designed to generate high pressure air to be used by salvage response personnel to accomplish numerous possible salvage actions requiring pneumatic capability, including dewatering of flooded spaces to restore lost buoyancy, inflation of salvage lift bags and pontoons, operation of pneumatic tools and equipment that are employed in the salvage or recovery operation.  Salvage Air Compressor Systems consist of multiple capacity diesel powered air compressor units including 125 CFM, 600 CFM, and 5000 psi models, air hoses for the rated air pressure and flow capacity, air manifolds, and all ancillary equipment.  Required I\/O is 36.\n\n[P40A \/ HY145 - COFFERDAM SYSTEM]: This system will contain a variety of cofferdams necessary to accomplish underwater repair tasks to hull plating, shafts, stern tubes and sea chests on several ship classes.  The cofferdams are engineered structural habitats which provide a safe underwater dry environment for divers to work and require very little maintenance.  Required I\/O is 50.\n\n[P40A \/ HY146 - PROPELLER REPAIR KIT]: These kits will contain the tools necessary to repair minor propeller damage underwater.  By accomplishing these repairs in-place, propeller removal and replacement can be avoided thereby saving maintenance funds and returning ships to service faster.  Required I\/O is 20.\n\n[P40A \/ HY147 - ROV TELEMETRY SYSTEM]: The ROV Telemetry System is the communication link between the surface controller and the vehicle.  Required I\/O is 6 (3 operational plus 3 spares).\n\n[P40A \/ HY153 - TENSIOMETERS]: Tensiometers are used to measure the tension exerted on a beach gear ground leg or heavy lift system.  One system consists of two load sensing units with associated rigging and read-out meters.  Required I\/O is 66.\n\n[P40A \/ HY156 - SALVAGE VANS]: Salvage Vans are modified ISO 8ft x 8ft x 20ft shipping containers that are equipped with industrial shop equipment, hand tools, powered hand tools, lifting and hoisting devices, and other misc required material to fulfill the various missions of salvage and recovery.  Each van is outfitted with humidity control devices for prolonging equipment life during storage.  Required I\/O is 10.\n\n[P40A \/ HY164 - FLYAWAY FADOSS SYSTEM]: This system consists of lightweight motion compensators, winches, rigging jewelry, and lines for lifting heavy objects off the sea floor.  All of the components are designed to be flown to the salvage site and loaded aboard ships of opportunity.  Required I\/O is 4.\n\n[P40A \/ HY166 - ROV TOOL PACKAGE]: This tool package is utilized by remotely operated vehicles to accomplish work on objects on the sea floor and in the water column.  I\/O is 8.\n\n[P40A \/ HY169 - UWSH POWER TOOLS]: These tools will replace the hydraulic tool previously issued to Fleet divers with improved technology.  This technology improvement will provide tools which are more environmentally compatible, offer greater power, lighter weight  and reduced maintenance.  I\/O is 20.\n\n[P40A \/ HY184 - SALVAGE SUPPORT SYSTEMS]: Salvage support systems are used to support Fleet Salvage Operations and include complex systems and equipment required for Command & Control, communications, supply, repair, rigging, and personnel support.  Each system includes the storage and shipping containers necessary to forward deploy the systems and equipment to a salvage site.  Humidity control devices are used for prolonging equipment life during storage.  Required I\/O is 10.\n\n[P40A \/ HY186 - SMART TOW SYSTEMS]: These systems consists of load cells, accelerometers, fire and flooding alarms, telemetry links and ancillary equipment to provide ship handlers with information critical to safe conduct of open ocean tows.  I\/O is 6.\n\n[P40A \/ HY190 - VIDEO\/CAMERA EQUIPMENT]: Underwater video\/camera equipment used by divers to perform detailed inspections and provide objective quality evidence (OQE) of ship hulls and appendages condition before, during and after repair. Equipment is used extensively throughout the Fleet. This equipment will replace aging systems currently in use throughout the Fleet. I\/O is 30.\n\n[P40A \/ HY195 - UNDERWATER RIGGING SUPPORT SYSTEM]: General and special purpose rigging and rigging support equipment designed for use in underwater ship repair applications. These systems support operation across all ship and submarine classes. I\/O is 20.\n\n[P40A \/ HY196 - UWSH SUBMARINE SUPPORT SYSTEM]: Special purpose underwater tools and equipment used by divers to perform routine and emergent repairs on all classes of submarines.  I\/O is 24.\n\n[P40A \/ HY197 - UWSH PIERSIDE SUPPORT VANS]: Portable milvans and shippable containers outfitted with general and special purpose tools to support various underwater ship husbandry operations.  I\/O is 12.\n\n[P40A \/ HY198 - UWSH SURFACE SHIP SUPPORT SYSTEMS]: Special purpose underwater tools and equipment used by divers to perform routine and emergent repairs to all Classes of surface ships.  I\/O is 32.\n\n[P40A \/ HY201 - JETTING PUMPS]: System is designed to provide a high velocity water stream to move mud, sand, or silt.  The system consists of a medium pressure, high flow rate pump that supplies water to specially designed diver operated jetting nozzles via high pressure hoses.   The system is used mainly for jetting, but also can be used for firefighting and limited dewatering.   Unit Issue increase in FY18 due to Tier IV engines reengineered to meet EPA standards.   I\/O is 22.\n\n[P40A \/ HY202 - 300\/400 AMP PORTABLE ELECTRIC WELDER]: System consists of a portable electric powered welder, welding cables, a stinger and ground clamp, welding safety equipment, and a spare parts kit.  The system is used for arc welding and oxygen-arc cutting.  Required Inventory Objective I\/O is 22.\n\n[P40A \/ HY203 - HYDRAULIC U\/W TOOL KIT]: Tool kit consists of various hydraulic actuated tools operated by a diver to perform various tasks underwater.  The kit also contains hydraulic hoses, various fittings, and accessories.  Required Inventory Objective I\/O is 25.\n\n[P40A \/ HY204 - 400 AMP WELDER - DIESEL]: System consists of a skid-mounted, portable, diesel powered welding generator, welding cables, a stinger and ground clamp, welding safety equipment, and a spare parts kit.  The system is used for arc welding and oxygen-arc cutting.  Required Inventory Objective I\/O is 25.\n\n[P40A \/ HY205 - LIGHTING KIT SYSTEM]: System consists of extendable masts, 500-watt halogen floodlights, drop lights, extension cords, spare bulbs, and other miscellaneous items to support general lighting for salvage and oil pollution operations.  The Lighting Kit System can use any 100-volt, single phase power source found at the salvage or pollution site.  Required Inventory Objective I\/O is 25.\n\n[P40A \/ HY206 - KERRIE CABLE UNDERWATER CUTTING SYSTEM]: Underwater cutting systems are used by salvage response personnel to cut through metal and other material either underwater or in air using an exothermic material.  The underwater cutting systems include the exothermic material including Brocco Rod or Kerri Cable, pressurize oxygen gas hoses and regulators, cutting support fixtures, and all ancillary equipment.  Required I\/O is 36.\n\n[P40A \/ HY215 - LIGHTWEIGHT MOORING SYSTEM]: This is a lightweight and highly portable system for establishing a mooring in shallow to deep water.  The system shall include a mooring leg consisting of anchors, chain, synthetic line and associated jewelry and fittings.  Total I\/O is 8.\n\n[P40A \/ HY216 - SALVAGE\/BDR MATERIAL KIT]: This system is for emergency response to ship casualties and provides the necessary material to construct custom patches and cofferdams.  The kit also includes tools to install the custom built items in place over the damaged hull sections.  I\/O is 12.\n\n[P40A \/ HY217 - SALVAGE LIFT BAGS (22K lbs)]: This system provides a buoyant force using compressed air to lift or support items in the water column.  These Lift Bags are sized to provide a force of approximately 22,000 lbs.  The I\/O is 22.\n\n[P40A \/ HY218 - SALVAGE LIFT BAGS (35 TONS)]: This system provides a buoyant force using compressed air to lift or support items in the water column.  These Lift Bags are sized to provide a force of approximately 35 tons.  The I\/O is 16.\n\n[P40A \/ HY219 - PORTABLE SALVAGE CRANE]: A portable crane system for use on a vessel of opportunity to provide a lifting force during salvage operations.  I\/O is 8.\n\n[P40A \/ HY220 - AUV SEARCH SYSTEM]: The AUV Search System will survey the ocean floor using a suite of sensors to locate and identify targets of interest. The sensors include Side Scan Sonar, multibeam, sub bottom profile, and still photo. The complete system includes a vehicle, sensor suite, A-frame handling system, and operations\/shipping container. I\/O is 1.\n\n[P40A \/ HY221 - ADVANCED POWER GENERATOR]: This system generates electrical power using solar and wind energy and stores it in super efficient Lithium Ion Batteries.  The system is capable of supplying electrical power to operate a Command Van, Salvage Shop Van and a Salvage BDR Rigging Van for up to 5 days with no traditional petroleum fueled electrical power generator support.  I\/O is 8.\n\n[P40A \/ HY223 - 3D SONAR]: This system generates a 3D Image of the area or object being surveyed and is viewable in real time.  The record of data is viewable off line for mission planning, allows for the measurement of distances and dimensions, and can be used during mission execution for operational control and situational awareness in zero visibility situations.  I\/O is 2.\n\n[P40A \/ HY227 - COMPLEX AND\/OR LARGE UWSH REPAIR COFFERDAM SUPPORT SYSTEMS]: Special purpose underwater tools, equipment, cofferdams and habitat with a higher complexity and or size used by divers to perform routine and emergent repairs on all classes of surface ship and submarines.  I\/O is 15.\n\n[P40A \/ HY228 - CLYDE WINCH UPGRADE MODIFICATIONS]: Portable Clyde deck winch consists of a dual drum assembly and a horizontal capstan mounted on the side of the deck winch.  The deck winch is hydraulically driven by  a self contained diesel engine and each drum\/ capstan can pull up to 8 tons.  The drive mechanism and braking system is upgraded to a hydraulic control and operation.    Required I\/O is 25.\n\n[P40A \/ HY229 - AC SOLAR CELL DEPLOYMENT KIT]: This system provides all the necessary equipment to power the energy efficient Salvage Command Center with solar energy.  Contained within the systems are the solar panels, mounting brackets\/frames\/hardware, safety rails, installation tools, and all handling equipment.  Required I\/O is 8.\n\n[P40A \/ HY230 - NEXGEN HYDRAULIC POWER UNIT, MOD 6B]: This Hydraulic Power Unit is designed to provide the hydraulic fluids to operate US Navy Salvage equipment including the Beach Gear system.  The hydraulic power unit is silenced for significant personnel safety and meets the latest environmental standards for clean air.  Required I\/O is 60.\n\n[P40A \/ HY231 - REMOTE SITE LOGISTIC SUPPORT HANDLING SYSTEM]: This system allows for offloading and loading of containerized Salvage equipment at remote locations that do not have logistic handling equipment.  System is capable of offloading\/loading US Cargo aircraft and surface transportation trucks in remote locations without the aid of forklift.  Systems also contains the ability for local movement of equipment over unimproved surfaces.  Required I\/O is 8."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}