{
    "id": "2018-Army-PB-2031A-JBOOK-ab1495ba2d5922cbe318d0f3fb486a59348b48ced2218cff2a8848292e28ab16-2",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_AIRCRAFT-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2031A",
        "appropriation_name": "Aircraft Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "A02005"
        },
        "LineItemTitle": {
            "val": "Aerial Common Sensor (ACS) (MIP)"
        },
        "P1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2031A"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Fixed Wing"
        },
        "ResourceSummary": {
            "Quantity": {
                "AllPriorYears": {
                    "val": "8"
                },
                "PriorYear": {
                    "val": "5"
                },
                "Total": {
                    "val": "13"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "238.59"
                },
                "PriorYear": {
                    "val": "96.5"
                },
                "Total": {
                    "val": "335.09"
                }
            },
            "UnitCost": {
                "AllPriorYears": {
                    "val": "29823.75"
                },
                "PriorYear": {
                    "val": "19300"
                },
                "Total": {
                    "val": "25776.154"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "238.59"
                },
                "PriorYear": {
                    "val": "96.5"
                },
                "Total": {
                    "val": "335.09"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "238.59"
                },
                "PriorYear": {
                    "val": "96.5"
                },
                "Total": {
                    "val": "335.09"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "5"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "96.5"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "Quantity": {
                    "PriorYear": {
                        "val": "5"
                    }
                },
                "TotalCost": {
                    "PriorYear": {
                        "val": "96.5"
                    }
                }
            }
        },
        "Description": {
            "val": "The Enhanced Medium Altitude Reconnaissance and Surveillance System (EMARSS) is the Army's next generation C-12 based, direct support, manned airborne intelligence collection, processing, and targeting support system.  EMARSS provides a persistent capability to detect, locate, classify\/identify, and track surface targets with a high degree of timeliness and accuracy.  EMARSS aircraft will be assigned to the U.S. Army Intelligence and Security Command's (INSCOM) Aerial Exploitation Battalions (AEB). EMARSS is an improvement over the existing Medium Altitude Reconnaissance and Surveillance System Quick Reaction Capability (MARSS QRC) in that it hosts an on board Distributed Common Ground System - Army (DCGS-A) capability, improved satellite communications, improved aircraft performance, and life cycle logistics sustainment capability. \n\nEMARSS will consist of a commercial derivative aircraft equipped with an Electro-optical\/Infrared (EO\/IR) sensor with Full Motion Video (FMV), a Communications Intelligence (COMINT) collection system, an Aerial Precision Geolocation (APG) system, tactical line-of-site (LOS) and beyond line-of-site (BLOS) communications suite, two DCGS-A enabled operator workstations and a self-protection suite.  EMARSS is built to allow future capabilities to be integrated on platform with the addition of a third carry-on workstation.  \n\nEMARSS will operate in direct support of tactical missions.  EMARSS, integrating elements of the DCGS-A, will provide efficient response to Combat Forces with Intelligence, Surveillance and Reconnaissance (ISR) tasking.  \n\nThe Army Acquisition Objective for EMARSS is 36 systems, with an Army Procurement Objective of 24, to include the following variants: EMARSS-G (Constant Hawk & TACOP LiDAR); EMARSS-V (VaDER); EMARSS-M (Liberty Project Aircraft (LPA)); and EMARSS-S (Engineering and Manufacturing Development (EMD)) systems."
        },
        "Justification": {
            "val": "There is no FY 2018 Funding on this line. \n\nFor FY 2016 forward, the overall EMARSS efforts are found in the following two lines; AZ2054 EMARSS Payloads (Project Manager Sensors - Aerial Intelligence (PM SAI)) and A02112 EMARSS SEMA (Project Manager Fixed Wing (PM FW)).  Separate funding lines support the Army Acquisition Executive's directive, codified in the October 28, 2011 memorandum, to assign overall acquisition lead for manned airborne Intelligence systems to Program Executive Officer for Aviation (PEO-AVN); and overall sensor, processing, exploitation, and dissemination responsibilities to Program Executive Officer for Intelligence, Electronic Warfare, and Sensors (PEO-IEWS). \n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\n\nAll COMPO 1 Active"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}