{
    "id": "2018-Navy-PB-1810N-JBOOK-2113ab7837a90c0a8084ef1f29db50f97653b77e7897f2c73846efef066a8cd8-18",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "8109"
        },
        "LineItemTitle": {
            "val": "Medical Support Equipment"
        },
        "P1LineNumber": {
            "val": "149"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Personnel & Command Support Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Command Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "8.148"
                },
                "PriorYear": {
                    "val": "32.79"
                },
                "CurrentYear": {
                    "val": "9.128"
                },
                "BudgetYearOneBase": {
                    "val": "4.383"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.383"
                },
                "BudgetYearTwo": {
                    "val": "4.562"
                },
                "BudgetYearThree": {
                    "val": "5.228"
                },
                "BudgetYearFour": {
                    "val": "4.727"
                },
                "BudgetYearFive": {
                    "val": "4.818"
                },
                "ToComplete": {
                    "val": "17.603"
                },
                "Total": {
                    "val": "91.387"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "8.148"
                },
                "PriorYear": {
                    "val": "32.79"
                },
                "CurrentYear": {
                    "val": "9.128"
                },
                "BudgetYearOneBase": {
                    "val": "4.383"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.383"
                },
                "BudgetYearTwo": {
                    "val": "4.562"
                },
                "BudgetYearThree": {
                    "val": "5.228"
                },
                "BudgetYearFour": {
                    "val": "4.727"
                },
                "BudgetYearFive": {
                    "val": "4.818"
                },
                "ToComplete": {
                    "val": "17.603"
                },
                "Total": {
                    "val": "91.387"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "8.148"
                },
                "PriorYear": {
                    "val": "32.79"
                },
                "CurrentYear": {
                    "val": "9.128"
                },
                "BudgetYearOneBase": {
                    "val": "4.383"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.383"
                },
                "BudgetYearTwo": {
                    "val": "4.562"
                },
                "BudgetYearThree": {
                    "val": "5.228"
                },
                "BudgetYearFour": {
                    "val": "4.727"
                },
                "BudgetYearFive": {
                    "val": "4.818"
                },
                "ToComplete": {
                    "val": "17.603"
                },
                "Total": {
                    "val": "91.387"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This line item provides funding for the Medical Support Equipment (MSE) and the Fleet Hospital\/Expeditionary Medical Facility (EMF) Programs. \n\nThe Medical Support Equipment (MSE) program funds new medical capability and new technology on naval operating ships. Medical Support Equipment configuration management, spares, technical manuals and installations are also funded through this line item.  Requirements are determined through Commander, U.S. Fleet Forces Command and Commander, U.S. Pacific Fleet, and procurement is managed by Naval Medical Logistics Command (NAVMEDLOGCOM). Funding is used to procure modifications or additions to the ships' allowance items that are identified within the Authorized Medical Allowance List (AMAL) and Authorized Dental Allowance List (ADAL). AMALs and ADALs are unique to specific classes or types of ship or Commands to fulfill its intended health care mission. AMAL and ADAL allowances are approved by the respective Fleet Type Commander (TYCOM) Force Surgeon with concurrence by the Commander, Fleet Forces Command Surgeon. The initiation of a change to the current depth (allowance amount) of material or addition of a new allowance for an item(s) within an AMAL or ADAL results from either a change in the scope of care a specific ship must provide in accordance with its Required Operational Capability (ROC) and Projected Operational Environment (POE) and\/or a change in the standard of medical care the assigned personnel are expected to provide. Changes to AMAL and ADAL requirements are determined through Individual Allowance Change Requests, as a result of reviews chaired by TYCOM Fleet Surgeons.             \n                                                           \nThe Fleet Hospital\/Expeditionary Medical Facility (EMF) program funds critical medical equipment to support and provide theater hospitalization capabilities (commonly referred to as Role III Care) as defined in Joint Publication 4-02 Health Services Support and the EMF ROC and POE.  This funding is used to procure investment equipment that supports the standard of care for Casualty Management as determined by the DoD Combat Trauma Surgery Committee.   \n\nThis line item also includes funding for the Hospital Ships (USNS Comfort (Fleet Forces Command) and USNS MERCY (PACFLT)) major systems replacement. The program is part of the standardization and life cycle management of the MERCY Class Hospital ships sustainability plan.\n\nFunds in this line item will be used to procure medical equipment from the AMAL\/ADAL, and for major systems replacement, including:\n\nDirect Radiology System, and CAD CAM Milling Machine (Computer Aided Design and Computer Aided Manufacturing).\n\nComputed Axial Tomography (CAT) Scan system; funding will cover one (1) unit per prepositioned Expeditionary Medical Facility.\n\nDigital X-Ray Shelters; funding will cover one (1) Digital X-Ray Shelter per prepositioned Expeditionary Medical Facility to provide higher resolution diagnostic images, which provide digital storage capability, and alleviates the need for chemical processors.\n\n[P40A \/ Computerized Axial Tomography Scan Replacement]: Funding provided for the procurement and installation of a Computerized Axial Tomography (CAT) Scan for the USNS COMFORT.  The CAT scan is an x-ray procedure that combines many x-ray images with the aid of a computer to generate cross-sectional views and, if needed, three-dimensional images of the internal organs and structures of the body.  It is used to define normal and abnormal structures in the body and\/or assist in procedures by helping to accurately guide the placement of instruments or treatments.  This equipment is required in support of the hospital ship mission and to provide a similar standard of care on the hospital ships to what a patient would receive in other Navy Military Facilities (fixed or expeditionary).\n\n[P40A \/ Rad Fluoro Replace w\/Wireless Digital Imaging Option]: Procure and install Radiographic Fluoroscopy Replacement System with wireless digital radiology imaging option for USNS COMFORT.  The system provides digital storage capability of images and alleviates the need for chemical processors. R\/F systems are used for diagnostic radiographic and fluoroscopic examinations.  Most allow spot filming of an image to produce an x-ray film for later detailed study including those that use contrast media such as gastrointestinal or cardio studies.\n\n[P40A \/ Oxygen Nitrogen (O2N2) Automated Control System]: Automation upgrade to modernize and make the existing O2N2 plant safer & simpler for the end user to operate while increasing overall reliability. The existing O2N2 producer is outfitted with a legacy control system that makes it difficult for the end user to timely produce liquid oxygen at required purity and volume. The automation will control plant parameters in a more precise manner allowing the plant to produce more high purity liquid oxygen per unit time. It will provide the end user with trending data of all plant parameters that will greatly assist with troubleshooting and diagnostics and will be in compliance with ISO 9001 standards.  By allowing the plant to operate more efficiently, less time is needed to achieve purity reducing production run times which results in realized fuel and maintenance savings. This equipment is required in support of the hospital ship mission and to provide a similar standard of care on the hospital ships to what a patient would receive in other Navy Military Facilities (fixed or expeditionary).\n\n[P40A \/ Anesthesia Units]: Anesthesia Units: Funding will provide anesthesia units aboard the USNS MERCY, which dispense a mixture of gases and vapor and vary the proportions to control a patient's level of consciousness and\/or analgesia during surgical procedures.\n\n[P40A \/ Computerized Axial Tomography (CAT) Scan Replacement]: Computerized Axial Tomography(CAT) Scan Replacement (MLC):  Funding provided for the procurement and installation of a Computerized Axial Tomography (CAT) Scan for the USNS MERCY. The CAT scan is an x-ray procedure that combines many x-ray images with the aid of a computer to generate cross-sectional views and, if needed, three-dimensional images of the internal organs and structures of the body.\n\n[P40A \/ Infusion Pump, Multi-therapy]: Infusion Pump, Multi-therapy Infusion:  Funding provides Multi-therapy Infusion pumps for the USNS MERCY, and are used to deliver agents from syringes or collapsible bags and are small enough to be worn or carried by patients.  They are used on patients that require repeated or continuous infusions.\n\n[P40A \/ Radiographic Fluoroscopy w\/Wireless Digital Imaging Option]: Radiographic Fluroscopy Replacement with Wireless Digital Imaging Option (MLC):     Procure and install Radiographic Fluoroscopy Replacement System with wireless digital radiology imaging option for USNS MERCY.  The system is used for diagnostic radiographic and fluoroscopic examinations, and provides digital storage capability of images and alleviates the need for chemical processors.\n\n[P40A \/ Simulator, Environmental Detector\/Monitor]: Procure Simulator, environmental detector\/monitor(with Operators Training). Patient simulator is used as an advanced training unit that can display neurological symptoms as well as physiological. It provides realistic patient simulation training to Doctors, Nurses, and Hospital Corpsmen onboard the USNS MERCY during patient casualty drills.\n\n[P40A \/ Detector\/X-Ray Digital Radiography]: Procure and install Detector that is compatible with current Mobile Radiology units onboard the USNS MERCY. Wireless x-ray detectors replaced the radiographic cassettes. It's a digital pad that receives radiographic rays from the X-Ray unit that produces the image for radiological diagnostics.\n\n[P40A \/ Electrosurgical Unit, Monopolar\/Bipolar]: Procure Electrosurgical unit(with Test equipment, Operators Training, and repair and maintenance training). ESU's is a full-featured electrosurgical system that provides electrosurgical cutting and coagulation, bipolar functionality, and vessel sealing during surgical procedures.\n\n[P40A \/ Radiographic System, Digital]: Procure and install Radiographic Replacement System with wireless digital radiology imaging option for USNS MERCY.  The system is used for diagnostic radiographic examinations, and provides digital storage capability of images.\n\n[P40A \/ O2N2 Plant]: Automation upgrade to modernize and make the existing O2N2 plant safer & simpler for the end user to operate while increasing overall reliability. The existing O2N2 producer is outfitted with a legacy control system that makes it difficult for the end user to timely produce liquid oxygen at required purity and volume. The automation will control plant parameters in a more precise manner allowing the plant to produce more high purity liquid oxygen per unit time. It will provide the end user with trending data of all plant parameters that will greatly assist with troubleshooting and diagnostics and will be in compliance with ISO 9001 standards.  By allowing the plant to operate more efficiently, less time is needed to achieve purity reducing production run times which results in realized fuel and maintenance savings. This equipment is required in support of the hospital ship mission and to provide a similar standard of care on the hospital ships to what a patient would receive in other Navy Military Facilities (fixed or expeditionary)."
        },
        "Justification": {
            "val": "Funding required to support the healthcare readiness needs of Navy's operating forces.\n\nThe Medical Support Equipment (MSE) program funds new medical capability and new technology on naval operating ships. Medical Support Equipment configuration management, spares, technical manuals and installations are also funded through this line item. \n\nPB18 specifically requests:\n\n3 Direct Digital Radiology Systems and installation: The Direct Digital Radiology system is required to keep pace with the advanced nature of diagnostic imaging. It is a form of X-Ray imaging, in which digital X-ray sensors are used instead of traditional photographic film. This provides shipboard medical personnel the capability to digitally process, and store images thereby reducing film development time, maintenance, and storage costs. This also provides seamless integration of digital imaging with other systems used in Telemedicine, creating a more efficient process that bypasses chemical processing and provides the ability to digitally transfer and enhance images. Using an existing DLA-TS IDIQ Contract, NMLC will procure equipment from AGFA Health Care.  The installation and related procurement plan for Direct Digital Radiology units reflects ship availability for installation periods (per data from the Navy Data Environment database).  Equipment is procured in the year preceding installation.  Units will be procured as follows: 3 in FY16; 3 in FY17; 3 in FY18; and 3 per year for FY19-22.  Prior year activity reflects procurement of 7 units in FY13, 14 units in FY14, and 4 units in FY15; and installation of 7 units in FY13, 1 in FY14, and 3 in FY15.\n\n1 Computerized Axial Tomography (CAT) Scan Replacement.  The Computed Axial Tomography (CAT) Scan system is primarily used for medical imaging that supports or helps establish the diagnosis of a certain type of disease after more primitive diagnostic exams have been performed, like the X-ray and standard ultrasound. The CAT scan provides a critical diagnostic tool in the field of Expeditionary Medicine in that it can help in the emergent diagnosis of brain injuries, bleeding within body cavities, and bone malformations.  Funding will cover one (1) unit per prepositioned Expeditionary Medical Facility.\n\n1 Rad Fluoro Replace w\/ Wireless Digital Imaging Option: Funds procure and install Radiographic Fluoroscopy Replacement System with wireless digital radiology imaging option for USNS COMFORT.  The system provides digital storage capability of images and alleviates the need for chemical processors. R\/F systems are used for diagnostic radiographic and fluoroscopic examinations.  Most allow spot filming of an image to produce an x-ray film for later detailed study including those that use contrast media such as gastrointestinal or cardio studies.\n\n1 Infusion Pump, Multi-therapy Infusion:  Funding provides Multi-therapy Infusion pumps for the USNS MERCY, and are used to deliver agents from syringes or collapsible bags and are small enough to be worn or carried by patients.  They are used on patients that require repeated or continuous infusions.\n\nFY 2017 decrease in Medical Support Equipment OPN by $0.174M as required for the Department of the Navy to comply with the Bipartisan Budget Act of 2015."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}