{
    "id": "2018-Army-PB-2035A-JBOOK-47aba4e61a9576ce00f42879503931d6f46619e32b635c55302b3bc83156cbe1-61",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_OTHER_3-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "MB7000"
        },
        "LineItemTitle": {
            "val": "Base Level Common Equipment"
        },
        "P1LineNumber": {
            "val": "180"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "90"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "545.106"
                },
                "PriorYear": {
                    "val": "1.87"
                },
                "CurrentYear": {
                    "val": "2.168"
                },
                "BudgetYearOneBase": {
                    "val": "13.239"
                },
                "BudgetYearOne": {
                    "val": "13.239"
                },
                "BudgetYearTwo": {
                    "val": "6.716"
                },
                "BudgetYearThree": {
                    "val": "14.517"
                },
                "BudgetYearFour": {
                    "val": "14.607"
                },
                "BudgetYearFive": {
                    "val": "14.699"
                },
                "Total": {
                    "val": "612.922"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "545.106"
                },
                "PriorYear": {
                    "val": "1.87"
                },
                "CurrentYear": {
                    "val": "2.168"
                },
                "BudgetYearOneBase": {
                    "val": "13.239"
                },
                "BudgetYearOne": {
                    "val": "13.239"
                },
                "BudgetYearTwo": {
                    "val": "6.716"
                },
                "BudgetYearThree": {
                    "val": "14.517"
                },
                "BudgetYearFour": {
                    "val": "14.607"
                },
                "BudgetYearFive": {
                    "val": "14.699"
                },
                "Total": {
                    "val": "612.922"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "545.106"
                },
                "PriorYear": {
                    "val": "1.87"
                },
                "CurrentYear": {
                    "val": "2.168"
                },
                "BudgetYearOneBase": {
                    "val": "13.239"
                },
                "BudgetYearOne": {
                    "val": "13.239"
                },
                "BudgetYearTwo": {
                    "val": "6.716"
                },
                "BudgetYearThree": {
                    "val": "14.517"
                },
                "BudgetYearFour": {
                    "val": "14.607"
                },
                "BudgetYearFive": {
                    "val": "14.699"
                },
                "Total": {
                    "val": "612.922"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "1.87"
                                },
                                "CurrentYear": {
                                    "val": "2.168"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.239"
                                },
                                "BudgetYearOne": {
                                    "val": "13.239"
                                },
                                "BudgetYearTwo": {
                                    "val": "6.716"
                                },
                                "BudgetYearThree": {
                                    "val": "14.517"
                                },
                                "BudgetYearFour": {
                                    "val": "14.607"
                                },
                                "BudgetYearFive": {
                                    "val": "14.699"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "1.87"
                    },
                    "CurrentYear": {
                        "val": "2.168"
                    },
                    "BudgetYearOneBase": {
                        "val": "13.239"
                    },
                    "BudgetYearOne": {
                        "val": "13.239"
                    },
                    "BudgetYearTwo": {
                        "val": "6.716"
                    },
                    "BudgetYearThree": {
                        "val": "14.517"
                    },
                    "BudgetYearFour": {
                        "val": "14.607"
                    },
                    "BudgetYearFive": {
                        "val": "14.699"
                    }
                }
            }
        },
        "Description": {
            "val": "This program procures Base-level commercially available equipment from a list authorized by the Table of Distribution and Allowances (TDA) for Army activities but is not Army centrally managed or purchased. Equipment unit cost must meet the currently approved Expense-Investment threshold of $250,000.00. The equipment supports recurring and generic activities typically performed by garrisons, such as material and cargo handling, engineering and public works, port and terminal operations support. Procures new investment items or replacements for existing equipment that is over-aged, obsolete, or beyond economical repair.\n\nInstallation Management Commands existing BCE fleet is fifteen to forty years old and exceeds overall programmed life expectancy and Army set Maintenance Expenditure Limits (MEL). Equipment is becoming more difficult to repair after years of continual heavy use and repair parts are limited or not available due to discontinuation by the manufacture causing longer and more frequent down times. Continued maintenance is increasingly cost prohibitive and competes with other critical Base Operations Services for resources. When new procurement is not possible, garrisons turn to leasing equipment at an extremely high cost, over 45% more expensive over the life of the vehicle, to meet mission requirements.  If resources do not keep pace with IMCOM's aging fleet, safety risks rise, equipment readiness suffers, and mission support will be compromised as equipment continues to fail.  \n\nA Scanning Electron Microscope is one of the most advanced pieces of forensic equipment in a Criminal Investigation Command laboratory.  It one of the most sensitive instruments for elemental analysis of materials.  The majority of examinations are geared to the analysis of crystalline materials.  It serves multiple functions in scientific investigations of materials associated with sexual assaults, assaults, homicides, suicides, arsons, burglaries, shooting investigations, IED investigations, etc.  In conjunction with the elemental analysis using SEM\/EDS\/WDS, the XRD is able to conclusively identify the manner in which elements in a compounds are associated (bonded).  The impact to the laboratory of not completing the life cycle replacement would be to significantly limit the laboratory’s ability to conduct investigations which require explosives analysis, soil analysis, and most significantly the identification of molecular structure of crystalline materials.  The requirement must be obtained in order to meet electrical, mechanical and other installation requirements.  If not funded, the completion, occupation, relocation, and ability to complete mission functions will be adversely effected. If the current microscope is not replaced, the aging instrument could fail or result in evidence pertaining to homicides and sexual assault cases not being analyzed in a timely manner due to outdated software and incompatibility with Army networks."
        },
        "Justification": {
            "val": "FY 2018 funding in the amount of $13.239 million procures the following:\n\nIn FY18, Installation Management Command (IMCOM) will use $12.768 million to procure 32 essential equipment items. This includes Bulldozers (5), Cranes (3), Dump Trucks (1), Excavators (2), Front End Loaders (2), Road Graders (11), Scrapers (3), Snow Plow\/Blowers (2), Tractors (1) and Tub Grinders (2). These items will be used to meet the immediate\/daily needs of 10 Installations. Increase from FY17 acknowledges need to reconstitute aging fleet. \n\nArmy Criminal Investigation Command requires life cycle replacement for a Scanning Electron Microscope ($0.471 million) with Energy Dispersive X-ray Spectrometer w\/Wavelength Dispersive Spectrometer (SEM-EDS\/WDS). The requirement is part of the US Army Criminal Investigation Laboratories continuing effort to modernize and advance its forensic capability. This instrument allows for the investigation of elemental and crystalline structure compounds. By using x-rays, the instrument is able to develop patterns of the x-ray bending properties of compounds, better known as “diffraction patterns”. This instrument combines the areas of high magnification microscopy with the ability to conduct analysis of detectable energies in the form of x-rays."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}