{
    "id": "2018-TheJointStaff-PB-0300D-MJBOOK-0-0-e8ae7aa29942ff2183faddcc8aa60885b0218219a896d8e2dbe802252d62b545-0",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-DEFENSE_TJS-U_PROCUREMENT_MasterJustificationBook_The_Joint_Staff_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_The_Joint_Staff_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "10"
        },
        "LineItemTitle": {
            "val": "Major Equipment, TJS"
        },
        "P1LineNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "15"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, TJS"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "63.002"
                },
                "PriorYear": {
                    "val": "13.027"
                },
                "CurrentYear": {
                    "val": "7.988"
                },
                "BudgetYearOneBase": {
                    "val": "9.341"
                },
                "BudgetYearOne": {
                    "val": "9.341"
                },
                "BudgetYearTwo": {
                    "val": "8.503"
                },
                "BudgetYearThree": {
                    "val": "8.533"
                },
                "BudgetYearFour": {
                    "val": "8.337"
                },
                "BudgetYearFive": {
                    "val": "8.377"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "63.002"
                },
                "PriorYear": {
                    "val": "13.027"
                },
                "CurrentYear": {
                    "val": "7.988"
                },
                "BudgetYearOneBase": {
                    "val": "9.341"
                },
                "BudgetYearOne": {
                    "val": "9.341"
                },
                "BudgetYearTwo": {
                    "val": "8.503"
                },
                "BudgetYearThree": {
                    "val": "8.533"
                },
                "BudgetYearFour": {
                    "val": "8.337"
                },
                "BudgetYearFive": {
                    "val": "8.377"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "63.002"
                },
                "PriorYear": {
                    "val": "13.027"
                },
                "CurrentYear": {
                    "val": "7.988"
                },
                "BudgetYearOneBase": {
                    "val": "9.341"
                },
                "BudgetYearOne": {
                    "val": "9.341"
                },
                "BudgetYearTwo": {
                    "val": "8.503"
                },
                "BudgetYearThree": {
                    "val": "8.533"
                },
                "BudgetYearFour": {
                    "val": "8.337"
                },
                "BudgetYearFive": {
                    "val": "8.377"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "The Chairman of the Joint Chiefs of Staff (CJCS) is the principal military adviser to the President, National Security Council, and Secretary of Defense. The Chairman presides over and serves as a member of the Joint Chiefs of Staff. CJCS relies upon the Joint Staff (TJS) to craft and distribute guidance for combatant forces' unified strategic direction, operations under unified commands, and integration into effective combat forces. On behalf of the Chairman, TJS provides Combatant Commands (CCMDs), the Services, and U.S. war fighters with joint policy, strategy, and doctrine necessary to employ effective joint combat forces in contingencies worldwide."
        },
        "Justification": {
            "val": "Remarks\/Justification:\n\nThe FY 2018 Joint Staff procurement appropriation requests $9.341M for mission critical information technology (IT) systems, applications investment requirements, and for commercial heavy-armored vehicles (CHAV). The procurement appropriation resources support various efforts across the Joint Staff including: New investments in Joint Force Development data center and Information Technology\/Information Security equipment, the management of video teleconferencing services, and operations to ensure IT services at the Pentagon and remote site locations operate efficiently. \n\n1. Joint Lessons Learned Information System (JLLIS): \nNo new FY 2018 procurement funding is required.  FY 2016 procurement funding was for JLLIS to support periodic JLLIS computer technical refresh\/new capability enhancements.  \n\nJoint Staff Analytical Support (JSAS) is made up of five major categories:  Joint Collaborative Analysis (JCA), Functional Capabilities Boards (FCBs), Joint Logistics, Adaptive Planning, and Joint Training System (JTS).  Procurement funding for JLLIS falls under the JCA category.\n\na. The JLLIS supports the Chairman's Title X responsibilities and is the DoD system of record supporting the Chairman's Joint Lessons Learned Program. JLLIS enables the capture of observations and the management of lessons learned across the four lessons learned phases – discovery, validation, integration, and evaluation. JLLIS supports programs across OSD, TJS, Services, Combatant Commands, Combat Support Agencies, National Guard Bureau, the Interagency, the Intelligence Community, and international partners.\n\nb. Requirement:\n\n• Provide an effective system and authoritative database to capture, record, and disseminate critical lessons learned from operations, exercises, training, experiments, and other real world events\n• Provide a comprehensive information and knowledge management system for sharing of lessons and managing workflow associated with lesson resolution\n\nNOTE: Due to the cyclic nature of the JLLIS technical refresh requirement, this program presents a non-linear funding profile with noticeable spikes in funding requirements during technical refresh years.  Expenditure plan for FY 17-18 outlined in paragraph e.\n\nc. Accomplishments to Date \/ FY 2017 – FY 2018 Plans:\n$1.066M was used in support of the LINK-16 Pulse De-confliction Server (LPDS) Phase II. As the vendor has nearly completed the contract, C4Transport and Joint Interoperability Division (JID) began working to connect and operate the new server on the Joint Training Exercise Network (JTEN). They discovered that an immediate change in the scope of an existing contract was required to increase the virtual machines, and support the information assurance accreditation package to support authority to connect and operate the new server.\n\nd. $1.094M was provided for technical refresh requirements to video teleconference (VTC) and to enhance presentation capabilities for both classified and unclassified systems In Building NH-95, in Norfolk, Va. \n\ne. The JLLIS program is in the beginning stages of employing IBM Watson Analytics as an advanced search engine that also facilitates data analysis. The current configuration does not support Single Sign-On (SSO); therefore, users are required to maintain separate Watson and JLLIS accounts and log into each independent of the other. JLLIS and Watson require a more seamless method to the allow users to access information based on their permissions between the two applications without having to log in using multiple accounts. Additionally, JLLIS needs a practical method to manage JLLIS and Watson accounts and access. Other enhancements planned for FY 17-18 include cross domain transfer which will combine NIPR and SIPR data onto the SIPR domain in order to allow for a single search of both sets of data, data integration which will allow data to be transferred between JLLIS, the Joint Training Information Management System (JTIMS) and the Defense Readiness Reporting System (DRRS), and an off-site backup for JLLIS data.\n\n2. Planning and Decision Aid System (PDAS):\nPDAS is a classified, protected program operated by the Joint Staff.  PDAS supports the planning and execution of Joint Staff and Unified Combatant Commanders (COCOM) Operations.  PDAS is a world-wide network protecting sensitive information that meets the Intelligence Community Directive (ICD) 503 security requirements.  PDAS provides office automation packages, document and information management tools; collaboration, voice, and video tools in a secure, flexible architecture that promotes a distributed enterprise.  Within the enterprise, PDAS users have access to their data regardless of log-on location and secure data exchange and conferencing and planning sessions among physically distributed Continental United States (CONUS) and Outside Continental United States (OCONUS) locations. The operational user community is provided access to Help Desk and remote troubleshooting within the enterprise. \n\nNOTE: Due to the cyclic nature of the PDAS technical refresh requirement of datacenters, client computers and other IT equipment, this program presents a non-linear funding profile with noticeable spikes in funding requirements during technical refresh years.  Equipment is purchased in increments across fiscal years which mitigates spikes in funding requirements.\n\nPDAS funding will be used to procure additional Program Site Installations, datacenter refresh, client refresh, and equipment modernizations. \n\na.\tProcurement of additional PDAS Program Site Installations will allow the Joint Staff Operational Sponsor\/ Acquisition Program Manager to complete the installation of additional PDAS user sites. PDAS is comprised of hundreds of user sites with thousands of users worldwide. In recent years, the number of PDAS sites grew by 25% and is expected to continue to add sites and users annually.  These sites will provide PDAS capabilities, services and the infrastructure necessary to support the expansion of PDAS services and capabilities to meet operational mission needs. \n\nb.\tDatacenter Refresh will allow the Joint Staff to provide refreshed datacenter hardware and software to replace hardware and software for user and test datacenters.  The hardware and software to be replaced is reaching the end of its service life and approaching obsolescence.  New equipment for the datacenters will enable the PDAS program to consolidate equipment baselines and provide commonality at the datacenters.  This periodic update provides PDAS with an updated IT infrastructure, enabling improved performance, security, efficiency and reduced logistical requirements.  From an operational perspective, it moves the IT team from event-driven, reactive situations of coping with the latest problem to a more proactive, forward-facing operational posture. The focus becomes one of preemptive quality assurance, standardization, and optimization while deferment leads to unsupportable hardware and software due to end-of-life or end-of-service issues.\n\nc.\tClient Refresh will allow the Joint Staff to provide updated computer hardware to the PDAS users in order to be compliant with Security Control 28 (SC-28), which is protection of information at rest to prevent insider threats.   This periodic update provides the users with an up to date information technology (IT) infrastructure, enabling improved performance, security, efficiency, reducing logistical requirements and other benefits.  From an IT operational perspective, it moves the IT team from event-driven, reactive situations of coping with the latest problem to a more proactive, forward-facing operational posture. The focus becomes one of preemptive quality assurance, standardization, and optimization while deferment of this purchase will require development of additional computer operating system baselines on deployed computer clients, additional baselines will significantly increase life-cycle sustainment cost.  \n\nd.\tEquipment Modernization will allow the Joint Staff to develop plans to provide and implement materiel solutions to address hardware and software configuration items that are outdated, nearing end-of-life or end-of-support or which can no longer be commercially acquired.  Historically, this equipment has been purchased as required due to failures, end-of-life, or end-of-service constraints which has led to many baselines and configurations of deployed IT and communications equipment.  These items reach end-of-life in different years, providing a cascade of equipment replacement requirements.  This spacing lessens the financial impact but requires constant purchase, integration, testing and installation.  The integration and extensive testing will ensure the hardware or software is compatible with other installed hardware and software configuration items and does not introduce vulnerabilities into PDAS, or allow unauthorized personnel to gain access to information for which they are not authorized.\n\n3. Management Headquarters:\nManagement Headquarters provides the day-to-day financial resources necessary to conduct Joint Staff operations and enabling Information Technology (IT) requirements. The most critical of these is staff action processing (decision-making) for faster coordination of critical classified and unclassified issues between the CJCS, Joint Staff, the CCMDs, Services, Agencies, and the Department. It provides information management resources required for decision processing that empowers the Joint Staff as a knowledge enabled organization. Funding supports the Joint Integrated Air & Missle Defense Organization (JIAMDO), Joint Range Extender (JRE), commercial heavy-armored vehicle (CHAV) program, and technology upgrades for the joint training facility. \n\na. JIAMDO uses these funds to support a Near Real Time (NRT) Server in support of Combat Identification (CID) applications. The NRT Server provides an increased storage capacity for NRT data for real-time processing as well as testing and evaluation of new capabilities. It provides the ability to store non-standard data securely and also to enable future use of the data in development and testing. This item supports JIAMDO's National-to-Tactical CID mission. Additional details are classified.\n\nb. Procure JRE, semi-rugged laptops (with JRE software license) and JRE Help Desk support. These JREs are required to support the Joint Integrated Air and Missile Defense Organization (JIAMDO) Advanced-Combat Identification (A-CID) efforts. These JREs will be installed in the AF Digital Integration for Combat Employment (AFDICE) Joint Mobile Lab and will support hosting of Link 16 Terminals for participation in exercises, testing, and operational events. The purpose of this funding is to conduct activities to develop and operationalize enhanced CID capability. This will also entail collaboration with other governmental or industrial sources, as directed. This item supports JIAMDO's National-to-Tactical CID mission. Additional details are classified.\n\nc. The Management Headquarters program element also funds costs associated with the CHAV program for transportation of senior military leadership.  Reference DoDI O-2000.22, Designation and Physical Protection of DoD High Risk Personnel (HRP); Change 1: (June 19, 2014) designates the CJCS and VCJCS as High Risk Personnel (HRP) level 1, authorizing them personal security detail (PSD) support.  Based on the Personal Security Vulnerability Assessment for the CJCS, and the professional judgement of the CJCS's Protective Service Detail (PSD), an operable CHAV is required to provide the necessary level of protection.  A Memorandum of Agreement (MOA) between the Protective Services Battalion (PSB), US Army Criminal Investigation Command (USACIDC) and the Joint Staff Support Services Office (JSSSO) describes responsibilities related to CHAVs used for Protection of the CJCS and VCJCS and assigns responsibility for programming, budgeting, funding, and acquiring CHAVs to the JSSSO.\n\nd. Procures major hardware and software technology upgrades for the Suffolk, VA joint training facility. Provides significant network distribution\/security, data processing, and capacity upgrades to the Suffolk Data Center to increase performance, security, reliability, and accessibility to the combatant commands and Services. Capability upgrades are required to host current joint training applications (Joint Knowledge Online, Joint Training Information Management System, Joint Lessons Learned Information Systems, and Joint Live, Virtual, and Constructive simulations) as well as provide support to multi-site, multi-command, distributed Live, Virtual, and Constructive joint force training events, such as the Globally Integrated Exercise (GIE) Program addressing transregional, multi-domain, and multi-functional (TMM) threat environment in support of the National Military Strategy.\n\nNote:  Deputy Secretary of Defense (DepSecDef) approved the alignment of IT services in the Pentagon and the National Capital Region (NCR) to the Joint Service Provider (JSP) operating as a field service activity in Defense Information Systems Agency (DISA). In 2018, JSIN resources will permanently transfer to JSP (DISA PE 0305830K).  The overall effect to the Department is a net-zero profile change for FY 2018.\n\n4.  Joint Information Operations Range (JIOR):\nThe JIOR provides DoD a closed-loop, persistent, geographically distributed network to conduct training, testing, and experimentation in support of Computer Network Attack (CNA)\/Computer Network Defense (CND) in a threat representative environment with realistic and relevant targets and command & control systems of interest. JIOR uniquely provides Services, Combatant Commanders (CCMDs), and other government agencies the ability to test deployment and collaboratively gain insights into advanced Cyberspace, Information Operations (IO), and Electronic Warfare (EW) capabilities under current and future operational environment conditions. JIOR integrates other cyberspace ranges, replicates critical infrastructure, cyber targets, Internet traffic, and opposing forces.  These provide the capacity to meet Presidential policy and CJCS mandates for training and certification of 6000+ cyber warriors by 2017 and DoD\/Interagency cyber vulnerability assessments. The JIOR security construct allows users to develop, test, and secure their unique cyber capabilities and protect their identity during range activities. The JIOR hosts multiple, simultaneous, and disparate training\/certification, testing, and experimentation events on a secure, closed-loop enterprise network."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}