{
    "id": "2018-AirForce-PB-3080F-MJBOOK-0-0-a287d26f2c4c963e73cbce78e7bb49d0d2178908ace420b726c59dcfb0a7a39e-35",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-AIRFORCE_OTHER-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "834520"
        },
        "LineItemTitle": {
            "val": "Theater Battle Mgt C2 System"
        },
        "P1LineNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "7.473"
                },
                "CurrentYear": {
                    "val": "9.659"
                },
                "BudgetYearOneBase": {
                    "val": "9.646"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "9.646"
                },
                "BudgetYearTwo": {
                    "val": "9.28"
                },
                "BudgetYearThree": {
                    "val": "9.446"
                },
                "BudgetYearFour": {
                    "val": "9.617"
                },
                "BudgetYearFive": {
                    "val": "9.792"
                },
                "Total": {
                    "val": "64.913"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "7.473"
                },
                "CurrentYear": {
                    "val": "9.659"
                },
                "BudgetYearOneBase": {
                    "val": "9.646"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "9.646"
                },
                "BudgetYearTwo": {
                    "val": "9.28"
                },
                "BudgetYearThree": {
                    "val": "9.446"
                },
                "BudgetYearFour": {
                    "val": "9.617"
                },
                "BudgetYearFive": {
                    "val": "9.792"
                },
                "Total": {
                    "val": "64.913"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "7.473"
                },
                "CurrentYear": {
                    "val": "9.659"
                },
                "BudgetYearOneBase": {
                    "val": "9.646"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "9.646"
                },
                "BudgetYearTwo": {
                    "val": "9.28"
                },
                "BudgetYearThree": {
                    "val": "9.446"
                },
                "BudgetYearFour": {
                    "val": "9.617"
                },
                "BudgetYearFive": {
                    "val": "9.792"
                },
                "Total": {
                    "val": "64.913"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0207410F"
                }
            ]
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0207410F"
                }
            ]
        },
        "Description": {
            "val": "Theater Battle Management Core Systems Force Level (TBMCS FL): An integrated battle management system used to plan, execute, and assess an air campaign.  It provides automated planning tools enabling consistent, coordinated battle management at both Air and Space Operations Centers (AOC) and non-AOC entities for operations and intelligence functions.  TBMCS FL is a United States Air Force lead system with joint interest responsible for generation and dissemination of the Air Tasking Order and interoperates with allied units. \n\nUnit Command and Control (UC2): Provides the wing and base commanders, and their battle staffs with timely and accurate information for effective decision making.  UC2 also provides secure, automated, deployable, and distributed wing-level command and control system with connectivity to TBMCS systems. \n\nPersonnel Recovery Command and Control (PRC2): Provides PRC2 services supporting all Combatant Commands, Joint Services and other government agencies.  Capabilities include web-based access to isolated personnel reports for all Department of Defense (DoD) personnel, C2 tools for performing command and control of recovery efforts for downed airmen\/isolated ground troops, and rapid identification of personnel in distress.  PRC2 is used within AOC\/Areas Of Responsibility (AOR), Joint Personnel Recovery Centers, and Rescue Coordination Centers to provide the capabilities and services for planning and executing recovery of isolated personnel, and rapidly collaborate, disseminate, and store time-sensitive personnel recovery information.\n\nIn FY 2018, Personnel Recovery Command and Control (PRC2) efforts were transferred from PE 0207410F, Air & Space Operations Center (AOC) to PE 0305984F, Personnel Recovery Command & Ctrl (PRC2), in order to improve visibility on Service's fair share of procurement funding for this joint interest program. \n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities. \n\nFunding for this exhibit contained in PE 0207410F and PE 0305984F."
        },
        "Justification": {
            "val": "1.  TBMCS FL: Provides the Joint and Combined Air Component Commander with the automated tools necessary to effectively and efficiently plan, monitor, and execute the air campaign.  This includes planning and issuing the Air Tasking and Airspace Control Orders that ensure the theater commander's intent is supported through the application of airpower using the latest intelligence.  FY18 funding will continue fielding TBMCS FL to include security patches, vendor update patches, operating system upgrades, and DoD mandated policy updates.  TBMCS FL will also continue Capital Equipment Replacement (CER) to the systems to maintain security posture and field updates to more than 40 locations.\n\n     a.  TBMCS FL PROGRAM MANAGEMENT ADMINISTRATION (PMA): FY18 funding includes provisions for government contract oversight, technical expertise, and program office support associated with the fielding of TBMCS FL.  \n\n     b.  TBMCS FL TRAINING & FIELDING: FY18 funding will continue to support fielding of the TBMCS FL upgrades and specialized training at each location.\n\n     c.  TBMCS FL: FY18 funds will continue to be used to procure hardware and associated software licenses for fielding to various sites.\n\n2.  UNIT COMMAND AND CONTROL (UC2): Provides the wing and base commanders and their battle staffs with timely and accurate information for effective decision making.  UC2 also provides secure, automated, deployable, and distributed wing-level command and control system with connectivity to TBMCS FL systems.  Enhanced unit-level operations capabilities will be provided through the UC2 project.  FY18 funding will continue to support fielding of modernized equipment at 16 active duty locations.\n\n     a.  UC2 HARDWARE AND COMMERCIAL-OFF-THE-SHELF (COTS) SOFTWARE: FY18 funds will continue to replace clients, servers, miscellaneous hardware, and associated software licenses for UC2 sites.\n\n     b.  UC2 PMA: FY18 funding includes provisions for government contract oversight, technical expertise, and program office support associated with the fielding of UC2.\n\n3.  PERSONNEL RECOVERY COMMAND AND CONTROL (PRC2): Provides PRC2 services supporting all Combatant Commands, Joint Services and other government agencies.  Capabilities include web-based access to isolated personnel reports for all DoD personnel, C2 tools for performing command and control of recovery efforts for downed airmen\/isolated ground troops, and rapid identification of personnel in distress.  PRC2 is used within AOC\/AOR, Joint Personnel Recovery Centers, and Rescue Coordination Centers to provide the capabilities and services for planning and executing recovery of isolated personnel, and rapidly collaborate, disseminate, and store time-sensitive personnel recovery information.  FY18 funding will continue to support PRC2 operations.\n\n     a.  PRC2 HARDWARE AND COTS SOFTWARE: FY18 funding will continue procure various hardware pieces and associated software licenses for fielding to various sites.\n\n     b.  PRC2 PMA: FY18 funding will provide for government program oversight, technical expertise, and program office support associated with the fielding of PRC2."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}