{
    "id": "2018-Army-PB-2035A-JBOOK-377d93ca794817f44e4b0e8b6a4ac9da01254c9911de0ea9a8ab395d402568a9-73",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_OTHER_2-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "B28501"
        },
        "LineItemTitle": {
            "val": "Fire Support C2 Family"
        },
        "P1LineNumber": {
            "val": "99"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "89"
        },
        "BudgetSubActivityTitle": {
            "val": "Elect Equip - Tactical C2 Systems"
        },
        "ResourceSummary": {
            "Quantity": {
                "AllPriorYears": {
                    "val": "961"
                },
                "PriorYear": {
                    "val": "2"
                },
                "Total": {
                    "val": "963"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "503.515"
                },
                "PriorYear": {
                    "val": "1.238"
                },
                "CurrentYear": {
                    "val": "8.66"
                },
                "BudgetYearOneBase": {
                    "val": "8.7"
                },
                "BudgetYearOne": {
                    "val": "8.7"
                },
                "BudgetYearTwo": {
                    "val": "14.736"
                },
                "BudgetYearThree": {
                    "val": "22.629"
                },
                "BudgetYearFour": {
                    "val": "16.236"
                },
                "BudgetYearFive": {
                    "val": "8.621"
                },
                "Total": {
                    "val": "584.335"
                }
            },
            "UnitCost": {
                "AllPriorYears": {
                    "val": "523.949"
                },
                "PriorYear": {
                    "val": "619"
                },
                "Total": {
                    "val": "606.786"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "503.515"
                },
                "PriorYear": {
                    "val": "1.238"
                },
                "CurrentYear": {
                    "val": "8.66"
                },
                "BudgetYearOneBase": {
                    "val": "8.7"
                },
                "BudgetYearOne": {
                    "val": "8.7"
                },
                "BudgetYearTwo": {
                    "val": "14.736"
                },
                "BudgetYearThree": {
                    "val": "22.629"
                },
                "BudgetYearFour": {
                    "val": "16.236"
                },
                "BudgetYearFive": {
                    "val": "8.621"
                },
                "Total": {
                    "val": "584.335"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "503.515"
                },
                "PriorYear": {
                    "val": "1.238"
                },
                "CurrentYear": {
                    "val": "8.66"
                },
                "BudgetYearOneBase": {
                    "val": "8.7"
                },
                "BudgetYearOne": {
                    "val": "8.7"
                },
                "BudgetYearTwo": {
                    "val": "14.736"
                },
                "BudgetYearThree": {
                    "val": "22.629"
                },
                "BudgetYearFour": {
                    "val": "16.236"
                },
                "BudgetYearFive": {
                    "val": "8.621"
                },
                "Total": {
                    "val": "584.335"
                }
            }
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0203726A"
                },
                {
                    "val": "0203728A"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "1.238"
                                },
                                "CurrentYear": {
                                    "val": "7.023"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.014"
                                },
                                "BudgetYearOne": {
                                    "val": "7.014"
                                },
                                "BudgetYearTwo": {
                                    "val": "14.736"
                                },
                                "BudgetYearThree": {
                                    "val": "22.629"
                                },
                                "BudgetYearFour": {
                                    "val": "16.236"
                                },
                                "BudgetYearFive": {
                                    "val": "8.621"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army National Guard"
                        },
                        "Cost": {
                            "TotalCost": {
                                "CurrentYear": {
                                    "val": "1.637"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.686"
                                },
                                "BudgetYearOne": {
                                    "val": "1.686"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "1.238"
                    },
                    "CurrentYear": {
                        "val": "8.66"
                    },
                    "BudgetYearOneBase": {
                        "val": "8.7"
                    },
                    "BudgetYearOne": {
                        "val": "8.7"
                    },
                    "BudgetYearTwo": {
                        "val": "14.736"
                    },
                    "BudgetYearThree": {
                        "val": "22.629"
                    },
                    "BudgetYearFour": {
                        "val": "16.236"
                    },
                    "BudgetYearFive": {
                        "val": "8.621"
                    }
                }
            }
        },
        "Description": {
            "val": "Fire Support Command and Control (FSC2) systems automate the planning and execution of fire support operations so that a suitable weapon or group of weapons adequately covers targets. Fire support is the effects of lethal and non-lethal weapons (fires) that directly support land, maritime, amphibious and special operation forces to engage enemy forces, combat formations, and facilities in pursuit of tactical and operational objectives. FSC2 family consists of Advanced Field Artillery Tactical Data System (AFATDS), Joint Automated Deep Operations Coordination System (JADOCS), and Pocket-sized Forward Entry Device (PFED).\n\nJoint Automated Deep Operations Coordination System (JADOCS) is a Joint and Coalition targeting, coordination mission management software application. It links Command and Control (C2), Intelligence, and Air Operations information with execution systems using real time collaborative targeting managers, customized for each service or specific functional area. JADOCS is used to significantly enhance the Joint Force and Component Command's capability to simultaneously develop, coordinate and execute Dynamic and Time Sensitive targets and fire missions, as well as battle space coordination worldwide. JADOCS provides coordination and de-confliction of targeting information at all levels of command structure for the military.  JADOCS is used by Air, Ground, Maritime, and Special Operations forces. It provides horizontal (across Services) as well as vertical (within Services) coordination of missions to ensure a common picture of targeting operational status across the entire joint force. As a software application, JADOCS can be configured and customized for each user and location. \n\nThe Advanced Field Artillery Tactical Data System (AFATDS) provides the Army, Navy, and Marine Corps automated fire support command, control and communications. AFATDS is used to plan, execute,  and deliver lethal and non-lethal effects. AFATDS provides Joint\/Coalition Situational Awareness for fires execution and mission management. The system interoperates and integrates with over 80 different battlefield systems, including Navy and Air Force command and control weapons systems. As a member of the Artillery System Cooperation Agreement (ASCA), AFATDS is interoperable with coalition partner fire support systems. AFATDS automates the planning, coordination, and control of all fire support assets (field artillery, mortars, close air support, naval gunfire, attack helicopters, offensive electronic warfare, fire support meteorological systems, forward observers, and fire support radars).\n\nThe Pocket-sized Forward Entry Device (PFED) (Inc I) is a handheld hardware device that enables rapid precision Sensor-to-Shooter and Surveillance capabilities.  PFED is fully interoperable with AFATDS and current fire support systems.  Pocket-sized Forward Entry Device (PFED) Increment II is a software application that operates on the Nett Warrior End User Device (EUD). It will provide the dismounted Forward Observer (FO) and Fire Support Teams (FISTs) the capability and functionality to accurately and rapidly locate ground targets and digitally process a Call For Fire. PFED Increment II answers the Mobile Handheld Computing Environment requirement that all handheld applications reside on the Nett Warrior EUD."
        },
        "Justification": {
            "val": "FY18 Base procurement dollars in the amount of $1.722million will be used to continue fielding and training efforts for Joint Automated Deep Operations Coordination System (JADOCS) V2.0.\n\nFY18 Base procurement dollars in the amount of $2.765 million will be used to complete fielding, integration and New Equipment Training (NET) of Advanced Field Artillery Tactical Data System (AFATDS) V6.8.x.\n\nFY18 Base procurement dollars in the amount of $4.213 million funds procurement of fielding services, ancillary items required for initial fielding, and New Equipment Training (NET) support for Pocket-sized Forward Entry Device (PFED Increment II software. Ancillary equipment includes TACLINKs, cables, and hubs.\n\nIn accordance with Section 1815 of the FY2008 National Defense Authorization Act (P. L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}