{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-32",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2845"
        },
        "LineItemTitle": {
            "val": "Fleet Air Traffic Control Systems"
        },
        "P1LineNumber": {
            "val": "75"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "9"
        },
        "BudgetSubActivityTitle": {
            "val": "Aviation Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "203.43"
                },
                "PriorYear": {
                    "val": "8.249"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "211.679"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "203.43"
                },
                "PriorYear": {
                    "val": "8.249"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "211.679"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "203.43"
                },
                "PriorYear": {
                    "val": "8.249"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "211.679"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.699"
                },
                "Total": {
                    "val": "0.699"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "NAVAIR provides shore based Air Traffic Control (ATC) terminal facilities and equipment that are required in joint efforts to efficiently and safely monitor and direct military and commercial air traffic in national and international air space.   Many of these systems are required to interface through automated means with the Federal Aviation Administration (FAA).  Additionally, NAVAIR has material support responsibility for Air Navigation Aid Systems, Mobile ATC Equipment, Special Instrumentation Systems, and Ancillary Equipment used at Navy and Marine Corps Aviation Shore activities in the continental United States and overseas.\n\nEngineering Change Proposal (ECP)\/Operational Capability Improvement Request (OCIR) modernization (MR069) -  The ECP\/OCIR program provides for the procurement and\/or modification of critically needed communications, radar, displays, data processors, and other electronic systems\/equipment at Navy\/Marine Corps ATC facilities worldwide.  ECP\/OCIR procurements replace and modernize costly-to-maintain systems and equipment in order to increase ATC efficiency and safety, and reduce total ownership costs. \n\nCommunications Systems Upgrade Program (MR408) - This program procures and installs advanced commercial state-of-the-art ATC voice switching and recording\/reproduction equipment.\n\nFiber Optic Intersite System (FOIS) Upgrade Program (MR430) - FOIS is required for Precision Approach Radar (PAR) operations and the AN\/FAC-6(V)4 FOIS is required for ATC voice communications at Naval and Marine Corps ATC facilities.  This program ensures continued capability of these critical ATC systems.\n\nUHF\/VHF Transceiver Replacement Program (MR440)  - This program modernizes aging Navy and Marine Corps UHF\/VHF Transceivers that are the central core of all ATC emergency communications. \n\nEmergency Communication System (ECS) Upgrade Program (MR445)  - This program modernizes obsolete and unsupportable ECS equipment.  Voice Switches, Recorders, Reproducers, Uninterruptable Power Supplies, and Built-In Test Equipment will be replaced with modern, supportable components.\n\nRecorder Upgrade Program (MR455) - This program procures and installs state-of-the-art ATC recording\/reproducing equipment which will be used to replace aging ATC recorder systems through participation in the FAA's Next Generation Recorder Program.\n\nAir Field Lighting Control System (AFLCS) (MR510) - This program modernizes obsolete and unsupportable AFLCS equipment which will be replaced with modern, supportable components.\n\nFleet Area Control and Surveillance Facilities (FACSFAC) Tech Refresh (MR515) - This program modernizes obsolete and unsupportable Commercial Off The Shelf (COTS) equipment in the AN\/FYK-39 FACSFAC Air Control and Tracking System (FACTS).  FACSFAC Tech Refresh will be funded under the NASMOD STARS program under Air Traffic Equipment (ATC) BLI 2820 beginning in FY2016.\n\nOperational Communication System (OCS)\/Emergency Communication System (ECS) Air Traffic Control (ATC) Recorder replacement program (MR520), through participation in the Federal Aviation Administration's (FAA) ATC recorder replacement program will replace aging and obsolete ATC OCS and ECS ATC recorders with state of the art ATC recording\/reproducing technology.  \n\n* Prior year total amount accounts for items funded in the current FYDP.\n\nFunding for procurements, support costs and associated installs for FY17 and beyond have been realigned to Ashore ATC Equipment (BLI 2820)."
        },
        "Justification": {
            "val": "The basis for the budget request is to continue modernizing aging Navy and Marine Corps ATC facilities and equipment in order to safely monitor and direct military and commercial air traffic in national and international air space.  This equipment must continue to interface through automated means with the Federal Aviation Administration."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}