{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-49",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "3057"
        },
        "LineItemTitle": {
            "val": "Communications Items under $5M"
        },
        "P1LineNumber": {
            "val": "92"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "11"
        },
        "BudgetSubActivityTitle": {
            "val": "Shipboard Communications"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "114.987"
                },
                "PriorYear": {
                    "val": "17.025"
                },
                "CurrentYear": {
                    "val": "10.403"
                },
                "BudgetYearOneBase": {
                    "val": "18.577"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "18.577"
                },
                "BudgetYearTwo": {
                    "val": "26.511"
                },
                "BudgetYearThree": {
                    "val": "20.707"
                },
                "BudgetYearFour": {
                    "val": "28.66"
                },
                "BudgetYearFive": {
                    "val": "29.173"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "114.987"
                },
                "PriorYear": {
                    "val": "17.025"
                },
                "CurrentYear": {
                    "val": "10.403"
                },
                "BudgetYearOneBase": {
                    "val": "18.577"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "18.577"
                },
                "BudgetYearTwo": {
                    "val": "26.511"
                },
                "BudgetYearThree": {
                    "val": "20.707"
                },
                "BudgetYearFour": {
                    "val": "28.66"
                },
                "BudgetYearFive": {
                    "val": "29.173"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "114.987"
                },
                "PriorYear": {
                    "val": "17.025"
                },
                "CurrentYear": {
                    "val": "10.403"
                },
                "BudgetYearOneBase": {
                    "val": "18.577"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "18.577"
                },
                "BudgetYearTwo": {
                    "val": "26.511"
                },
                "BudgetYearThree": {
                    "val": "20.707"
                },
                "BudgetYearFour": {
                    "val": "28.66"
                },
                "BudgetYearFive": {
                    "val": "29.173"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.513"
                },
                "CurrentYear": {
                    "val": "0.024"
                },
                "Total": {
                    "val": "0.537"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0604280N"
                }
            ]
        },
        "Description": {
            "val": "[P5 \/ NU019 EPLRS-DR\/EMUT]: Enhanced Position Location Reporting System - Data Radio (EPLRS-DR)\/Enhanced Man-Pack UHF Tactical (EMUT) is a Blue in Support of Green (BISOG) program that provides secure Anti-Jam (AJ), Ultra High Frequency (UHF) (420-450 MHz) and Line of Sight (LOS) data communications in support of amphibious operations at throughputs of up to 54Kbps. EPLRS-DR provides embedded Position Location Information (PLI) between shipboard networks and the shore-based Marine Tactical Data Network (TDN) and the Army Tactical Internet (TI). To meet a National Security Agency (NSA) mandate, KOK13 cryptographic equipment will be replaced with KOK23\/CKG cryptographic equipment. The AN\/PRC 117G integration will provide the embarked USMC landing force with ANW2 Wideband Tactical Radio Communications capability as well as the interoperability between the existing EPLRS-DR radio network with AN\/PRC-117G ANW2 tactical radio network.\n\n[P5 \/ NU239 PORT NSW]: Portable Radio\/Naval Special Warfare (PORT NSW) tactical radio:  PORT NSW procures hand held and man pack\/vehicular radios for NSW.  Procurement needed to support Force Protection operations, especially with joint forces.  NSW operational elements (SEAL platoons and Combatant Craft Detachments) rely on tactical communications and electronics equipment to accomplish all missions assigned in support of the Joint and Fleet commanders.  Navy resourced tactical communications equipment is considered mission essential and will be employed by individual SEAL personnel and NSW combat elements in man pack configurations as well as onboard tactical vehicles and NSW combatant craft in tactical operations centers in fixed mount configurations.\n\n[P5 \/ NU245 HYDRA]: Hierarchial Yet Dynamic Reprogrammable Architecture (HYDRA):  HYDRA AN\/SRC-55 will replace stovepipe wireless shipboard systems with an integrated system.  HYDRA is a wireless digital voice and data communication system using Commercial off the Shelf (COTS) trunking technology.  HYDRA is capable of interfacing with Private Branch Exchange\/Battle Group (PBX\/BG) Cellular\/radio frequency (RF) systems.\n\n[P5 \/ NU295 BFTN]: Battle Force Tactical Network (BFTN): BFTN enables delivery of Internet Protocol (IP) based collaboration services over legacy High Frequency (HF) assets. The intent is to provide an interoperable, low data rate, multi-node, Beyond-Line-of-Sight tactical edge networking capability using existing HF radio infrastructure. Supports Tactical Edge Networking and provides data path backbone for both airborne and afloat forces and supports increased data exchange with Allied Coalition forces. BFTN provides National, Allied, and Coalition maritime units with a medium band IP-based, tactical ship-ship at-sea networking capability, using legacy half-duplex UHF Line-of-Sight. BFTN will provide a bridge between legacy radio systems and future emerging wideband networking technologies.\n\n[P5 \/ NU790 Navy Expeditionary C4I]: Navy Expeditionary Command, Control, Communications, Computers, & Intelligence (C4I): Provides procurement and integration for outfitting Table of Allowance (TOA) buy lists within the Expeditionary forces.  Ensures common C4I solutions are being coordinated, tracked, procured and integrated across Navy Expeditionary Combat Command (NECC) forces.\n\n[P5 \/ ESB SOF (BSO 24)]: Expeditionary Mobile Base Special Operations Forces (ESB SOF) - The SOF component requires an ESB to have the capability for planning and conducting Intelligence, Surveillance, and Reconnaissance (ISR) and Boat Assault Force (BAF) and Helicopter Assault Force (HAF) missions. These funds procure identical sets of equipment to support SOF communications, consisting of a radio backbone infrastructure and increasing the bandwidth to support SOF missions. These additional capabilities will be back fitted during each ship's Post Shakedown Availability.Funding procures identical sets of equipment to support SOF communications, consisting of a radio backbone infrastructure and increasing the bandwidth to support SOF missions.\n\n[P5 \/ HF SAR Installations FMP (Prior Years)]: High Frequency Shipboard Automatic Link Establishment Radio (HF SAR) [Previously known as High Frequency Automatic Link Establishment (HF-ALE)]: Provides 3G HF-ALE capabilities to the Embarked Marines aboard L-Class ships. HF SAR is a stand alone menu driven system providing voice, data and chat capabilities via Line of Sight (LOS) and Beyond Line of Sight (BLOS)."
        },
        "Justification": {
            "val": "NU239 - PORT NSW:  FY18 funding procures 136 portable Hand Held and 61 Man Pack radios. \n\nNU295 - Battle Force Tactical Network (BFTN):  FY18 OPN funding procures and installs 1 unit.\n\nNU019 - EPLRS-DR\/EMUT: FY18 funding procures and installs 8 units. A complete unit consists of one AN\/VRC-114(V)2 radio mount, two RT-1949 (PRC-117G) radios, one RF-5055PS power supply, and associated equipment.  The quantity procured in any given year is determined by the fleet's demand signal and platform availability. In FY18, 8 platforms will receive the installation for additional capabilities. FY18 unit cost increase per radio is due to a cost increase on the PRP contract to cover the MUOS Firmware required for the radios.\n\nNU385 - Expeditionary Mobile Base Special Operations Forces (ESB SOF):  FY 18 funding procures and installs radio antennas and bandwidth increase equipment (total of 13 antennas) in support of SOF upgrade for ESB 4.  The cost delta between the ESB 3 and ESB 4 are for the refurbished CBSP asset (ESB 3) vs new system (ESB 4) and the difference in labor rates (East Coast vs West Coast) for the Post Shakedown Availability (PSA) efforts.\n\nNU790 - Navy Expeditionary FY18 funding is for procurement of service-common support communications and Automated Data Processing (ADP) equipment directly supports forward deployed SEALs.  Investment in communications equipment, to include but not limited to, portable hand held devices, man pack radios, ruggedized laptops, and encryption-decryption devices are essential to the readiness and battlefield effectiveness of NSW in winning the current fight against ISIS and other extremist elements.  Additionally, it  ensures the warfighter is optimally equipped with cutting edge communications equipment for the future fight.  \n\nIncrease reflects establishment and funding of Naval Special Warfare (NSW) service-common table of allowance (TOA) to begin correcting shortfalls and bring NSW forces into alignment with required outfitting standards in accordance with SOCOM-USN Memorandum of Agreement.  Naval Special Warfare requires an immediate  increase in procurement of tactical communications radios to replace legacy equipment that are rapidly approaching obsolescence and, more importantly, are in many cases, incompatible with modern communication devices in use by sister services and coalition forces."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}