{
    "id": "2018-Army-PB-2034A-JBOOK-5aee815d00f2743bc26b1fd362b1fa251ab1150ad3a4a9b16cb13a13bf67f3ad-23",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_AMMO-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "E46900"
        },
        "LineItemTitle": {
            "val": "Signals, All Types"
        },
        "P1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "47"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Ammunition"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "648.514"
                },
                "PriorYear": {
                    "val": "17.761"
                },
                "CurrentYear": {
                    "val": "12.518"
                },
                "BudgetYearOneBase": {
                    "val": "2.583"
                },
                "BudgetYearOneOCO": {
                    "val": "1.013"
                },
                "BudgetYearOne": {
                    "val": "3.596"
                },
                "BudgetYearTwo": {
                    "val": "17.502"
                },
                "BudgetYearThree": {
                    "val": "19.024"
                },
                "BudgetYearFour": {
                    "val": "18.089"
                },
                "BudgetYearFive": {
                    "val": "34.489"
                },
                "Total": {
                    "val": "771.493"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "648.514"
                },
                "PriorYear": {
                    "val": "17.761"
                },
                "CurrentYear": {
                    "val": "12.518"
                },
                "BudgetYearOneBase": {
                    "val": "2.583"
                },
                "BudgetYearOneOCO": {
                    "val": "1.013"
                },
                "BudgetYearOne": {
                    "val": "3.596"
                },
                "BudgetYearTwo": {
                    "val": "17.502"
                },
                "BudgetYearThree": {
                    "val": "19.024"
                },
                "BudgetYearFour": {
                    "val": "18.089"
                },
                "BudgetYearFive": {
                    "val": "34.489"
                },
                "Total": {
                    "val": "771.493"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "648.514"
                },
                "PriorYear": {
                    "val": "17.761"
                },
                "CurrentYear": {
                    "val": "12.518"
                },
                "BudgetYearOneBase": {
                    "val": "2.583"
                },
                "BudgetYearOneOCO": {
                    "val": "1.013"
                },
                "BudgetYearOne": {
                    "val": "3.596"
                },
                "BudgetYearTwo": {
                    "val": "17.502"
                },
                "BudgetYearThree": {
                    "val": "19.024"
                },
                "BudgetYearFour": {
                    "val": "18.089"
                },
                "BudgetYearFive": {
                    "val": "34.489"
                },
                "Total": {
                    "val": "771.493"
                }
            }
        },
        "Description": {
            "val": "This budget line includes Signals, All Types.\n\n(E49500) FUSEE WARNING RR RED 20 MIN M72\nCOTS item. Item is a red railroad or highway flare and available commercially. The purpose of the M72 is to outline emergency airfield boundaries under poor visibility conditions, as well as for recognition and signaling along railroads rights-of-way. This item is Code A, approved for service use.\n\n(E42010) Flares And Markers, Watercraft\nThe marker is launched from high-speed aircraft or helicopters in either day or night to mark the course of enemy submarines in antisubmarine warfare operations.  They can be used for any type of air to sea surface marking that are referenced by smoke and flame.  This item is Code A, approved for service use.\n\n(E62900) SMOKE POT PRACTICE M8\nThe M8 Smoke Pot is a five-gallon metal pail containing about 25 pounds of environmentally acceptable smoke mixture.  It is initiated by a pyrotechnic delay igniting fuze.  After ignition and about a 25-second delay, a dense smoke cloud is produced for screening purposes to conceal troop, vehicle, or other march movements.  It is deployed in a similar manner as the service smoke pots, M4 series and M5.  It is used by the individual Soldier in squad, company and battalion units.  This item is Code A, approved for service use.\n\n(E46400) Signal, Hand Held Red Star Cluster M158\nThe Family of Hand Held Signals are individually launched pyrotechnics used for signaling and illumination.  The payload is launched by a small, fin stabilized rocket and reaches a height of 725 feet.  The M158 is the red star cluster signal used primarily as a distress signal.  The payload is a cluster of five flares that burn for approximately 10 seconds.  This item is Code A, approved for service use.\n\n(E46500) Signal, Hand Held White Star Cluster M159\nThe Family of Hand Held Signals are individually launched pyrotechnics used for signaling and illumination.  The payload is launched by a small, fin stabilized rocket and reaches a height of 725 feet.  The M159 is a white star cluster used primarily for signaling.  The payload is a cluster of five flares that burn for approximately 10 seconds.  This item is Code A, approved for service use.\n\n(E46700) Signal, Hand Held Red parachute Flare M126A1\nThe Family of Hand Held Signals are individually launched pyrotechnics used for signaling and illumination.  The payload is launched by a small, fin stabilized rocket and reaches a height of 725 feet.  The M126A1 is a red parachute flare used primarily as a distress signal.  The flare burns for approximately 30 seconds.   This item is Code A, approved for service use.\n\n(E46800) Signal, Hand Held White Parachute Flare M127\nThe Family of Hand Held Signals are individually launched pyrotechnics used for signaling and illumination.  The payload is launched by a small, fin stabilized rocket and reaches a height of 725 feet.  The M127A1 is a white parachute flare used primarily for illumination.  The flare burns for approximately 30 seconds.  This item is Code A, approved for service use.\n\n(E47000) Signal, Hand Held Green Star Cluster M125A1\nThe Family of Hand Held Signals which are individually launched pyrotechnics used for signaling and illumination.  The payload is launched by a small, fin stabilized rocket and reaches a height of 725 feet.  M125A1 is a green star cluster signal used for signaling and illuminating missions.  The payload is a cluster of five flares that burn for approximately 10 seconds.  This item is Code A, approved for service use.\n\n(E49100) Flare, AC Countermeasure, M206 Magnesium Teflon IR\nThe M206 flares are part of a family of advanced IR decoy flares designed for use by Army helicopters and fixed wing aircraft to meet advanced threats in current and future operational environments.  This flare is a Magnesium Teflon Viton flare.  When used together with the M212, a spectrally matched flare, and the M211, a pyrophoric alloy material payload that reacts with air to emit intense IR radiation, it provides protection against a wide range of surface to air threats.  This item is Code A, approved for service use.\n\n(E57600) CTG 25.4 MM DECOY CHAFF M839 \nThe M839 is part of a family of advanced radar frequency (RF) Chaff decoys designed for use by Army helicopters and fixed wing aircraft against radar controlled weapon systems.  The M839 is in a 1x1x8 form factor in a plastic case.  The decoy payload is composed of strands of aluminum coated glass fibers and dipoles.  The M839 is delivered with the BBU-35\/B and\/or M796 impulse cartridge by electrical initiation of the impulse cartridge, When chaff is dispensed, it generates a reflected return signal which obstructs\/confuses enemy radar and prevents Army aircraft detection.   When used together, the RR170 and M839, provides protection against a wide range of surface-to-air missile (SAM) threats.   This item is Code A, approved for service use.\n\n(E88900) Flare AC Cntermeasure M211 Pyrophoric Msl IR Decoy\nThese flares are part of the advanced infrared (IR) decoy\/flares design, which are dispensed from Army aircraft to protect against advanced Man-portable Air Defense Systems (MANPADS) in current and future operational environments.  The M211 uses a special high surface area metal foil, which rapidly oxidizes when exposed to oxygen.  When one of the flares is dispensed from the host aircraft, the special pyrophoric material payload reacts with air to emit intense IR radiation that is not visible to the naked eye.  The IR radiation diverts heat-seeking missiles away from the aircraft.  When used together with the M212, a spectrally matched flare, and the M206, a Magnesium Teflon Viton flare, the flares provide protection against a wide range MANPADS.  This item is Code A, approved for service use.\n\n(E57605) CTG, 25.4mm, Decoy,Chaff,RR170 (w\/Mk1 impulse ctg) \nThe RR170 is part of a family of advanced Radar Frequency (RF) chaff decoys designed for use by both rotary and fixed wing Army aircraft to defeat advance threats in current and future operational environments.    The RR170 payload is made up of strands of aluminum coated glass fibers and loaded into a plastic outer case.  When chaff is dispensed, it generates a reflected return signal which obstructs\/confuses enemy radar and prevents Army aircraft detection.   When used together, the RR170 and M839, provides protection against a wide range of surface-to-air missile (SAM) threats.   This item is Code A, approved for service use."
        },
        "Justification": {
            "val": "FY 2018 Base Budget supports critical Army Title 10 war reserve\/operational, training, and test requirements IAW DoD Instruction 3000.04 (Munitions Requirements Process) and AR 5-13 (Total Army Munitions Requirements Process and Prioritization System).  War reserve requirements support OSD-approved Combatant Commander Operational Plans, Homeland Defense, and other OSD-directed missions.  Training requirements support individual and collective training of Active and Reserve Component forces at Army schools, home station, and the combined training centers.  Test requirements support the development, fielding, safety, and quality assurance of Army munitions and equipment throughout their life-cycle.  \n\nFY 2018 OCO funds are required to replenish munitions expended in combat operations in OFS-Afghanistan Theater\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\n\nFY 2018 Base procurement dollars in the amount of $2.583 million supports production of 3 variants of Signals.\nFY 2018 OCO procurement dollars in the amount of $1.013 million supports production of 1 variant of Signals.\n\n(E49500) FUSEE WARNING RR RED 20 MIN M72\nThis is a training standard item used in both training and combat. The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goal.\nTYPE CLASSIFICATION DATE:  NA\n\n(E42010) Flares and Markers, Watercraft\nThis is a training standard item used in both training and combat.  FY 2018 request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals.\nThe FY 2018 Base procurement dollars in the amount of $1.101 million supports the procurement of 2,826 markers.\nTYPE CLASSIFICATION DATE:  2011\n\n(E62900) Smoke Pot Practice M8\nThis is a training standard item used in both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goal.\nTYPE CLASSIFICATION DATE:  1994\n\n(E46400) Signal, Hand Held Red Star Cluster M158 \nThis is a training standard item used in both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with the Army procurement goals.\nTYPE CLASSIFICATION DATE:  1983\n\n(E46500) Signal, Hand Held White Star Cluster M159\nThis is a training standard item used in both training and in combat. The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goal.\nTYPE CLASSIFICATION DATE:  1983\n\n(E46700) Signal, Hand Held Red parachute Flare M126A1\nThis is a training standard item used in both training and combat.  FY 2018 procurement supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nThe FY 2018 Base procurement dollars in the amount of $0.463 million supports the procurement of 3,954 hand held signals. E46700 is a new start in FY 2018.\nTYPE CLASSIFICATION DATE:  1983\n\n(E46800) Signal, Hand Held White Parachute Flare M127A1 \nThis is a training standard item used both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nThe FY 2018 Base procurement dollars in the amount of $1.019 million supports the procurement of 8,873 Signals.\nTYPE CLASSIFICATION DATE:  1983\n\n(E47000) Signal, Hand Held Green Star Cluster M125A1\nThis is a training standard item used in both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goal.\nTYPE CLASSIFICATION DATE:  1983\n\n(E49100) Flare, AC Countermeasure, M206 Magnesium Teflon IR\nThis is a training standard item used in both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goal.\nFY 2018 OCO funds are required to replenish munitions expended in combat operations by Apache helicopters in OFS-Afghanistan. The FY 2018 OCO procurement dollars in the amount of $1.013 million support the procurement of 28,834 Signals.\nTYPE CLASSIFICATION DATE:  1978\n\n(E57600) CTG, 25.4mm, Decoy,Chaff,M839 Series (Ctg+Chaff) \nThis is a training standard item used in both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goal.\nTYPE CLASSIFICATION DATE:  Prior to 1980\n\n(E88900) AC Countermeasure M211Pyrophoric Msl IR Decoy\nThis is a training standard item used in both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goal.\nTYPE CLASSIFICATION DATE:  2002\n\n(E57605) CTG, 25.4mm, Decoy,Chaff,RR170 (w\/Mk1 impulse ctg)\nThis is a training standard item used in both training and combat. The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goal.\nTYPE CLASSIFICATION DATE:  Prior to 1980"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}