{
    "id": "2018-Army-PB-2034A-JBOOK-5aee815d00f2743bc26b1fd362b1fa251ab1150ad3a4a9b16cb13a13bf67f3ad-26",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_AMMO-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "E91901"
        },
        "LineItemTitle": {
            "val": "Non-Lethal Ammunition, All Types"
        },
        "P1LineNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "50"
        },
        "BudgetSubActivityTitle": {
            "val": "Miscellaneous"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "15.296"
                },
                "PriorYear": {
                    "val": "1.7"
                },
                "CurrentYear": {
                    "val": "6.873"
                },
                "BudgetYearOneBase": {
                    "val": "1.5"
                },
                "BudgetYearOne": {
                    "val": "1.5"
                },
                "BudgetYearTwo": {
                    "val": "1.4"
                },
                "BudgetYearThree": {
                    "val": "0.3"
                },
                "BudgetYearFive": {
                    "val": "3.295"
                },
                "Total": {
                    "val": "30.364"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "15.296"
                },
                "PriorYear": {
                    "val": "1.7"
                },
                "CurrentYear": {
                    "val": "6.873"
                },
                "BudgetYearOneBase": {
                    "val": "1.5"
                },
                "BudgetYearOne": {
                    "val": "1.5"
                },
                "BudgetYearTwo": {
                    "val": "1.4"
                },
                "BudgetYearThree": {
                    "val": "0.3"
                },
                "BudgetYearFive": {
                    "val": "3.295"
                },
                "Total": {
                    "val": "30.364"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "15.296"
                },
                "PriorYear": {
                    "val": "1.7"
                },
                "CurrentYear": {
                    "val": "6.873"
                },
                "BudgetYearOneBase": {
                    "val": "1.5"
                },
                "BudgetYearOne": {
                    "val": "1.5"
                },
                "BudgetYearTwo": {
                    "val": "1.4"
                },
                "BudgetYearThree": {
                    "val": "0.3"
                },
                "BudgetYearFive": {
                    "val": "3.295"
                },
                "Total": {
                    "val": "30.364"
                }
            }
        },
        "Description": {
            "val": "This budget line item procures Non-Lethal Ammunition, All Types.\n\n(E86401) CTG 12 GA NL, EXT RG, MARK XM1116\nThe XM1116 is a 12 gauge low velocity cartridge fired from a standard, 3 inch chamber, manually operated shotgun.  It utilizes a drag stabilized bean bag design with fluorescent green marking powder to deliver a strong, non-penetrating blow to the body.  This cartridge has an effective range of approximately 30 to 50 meters.  This item is Code B, not approved for service use.\n\n(E89002) CTG, 40MM AIRBURST F M203 XM1112\nThe Cartridge 40 Millimeter Airburst for M203 XM1112 is intended to have an effective range between 35 to 300 meters.  It contains a proximity fuze with programmable option.  It is intended to deliver multiple non-lethal effects:  flash-blindness, temporary hearing shift.  The XM1112 is intended to deliver consistent non-lethal effects regardless of range setting.  It will have a user settable delay option for room clearing.  It is fully compatible with existing 40 millimeter M203\/M320 weapons platforms without any modifications.  The XM1112 will deliver non-lethal effects lasting at least 20 seconds.  This item is Code A, approved for service use.\n\n(E91505) CTG NL FIRING DEVICE: TASER, XP25\nThe Cartridge, NL Firing Device is a 25-foot single shot fired from the Launched Electrode Stun Device (LESD), which is a hand held device used for Electro-Muscular Incapacitation (EMI).  This cartridge is a conducted energy weapon that delivers an incapacitating electrical shock capable of arcing through 2 inches of clothing.  Maximum effective range is 15 feet.  This item is Code A, approved for service use."
        },
        "Justification": {
            "val": "FY 2018 Base Budget supports critical Army Title 10 war reserve\/operational, training, and test requirements IAW DoD Instruction 3000.04 (Munitions Requirements Process) and AR 5-13 (Total Army Munitions Requirements Process and Prioritization System).  War reserve requirements support OSD-approved Combatant Commander Operational Plans, Homeland Defense, and other OSD-directed missions.  Training requirements support individual and collective training of Active and Reserve Component forces at Army schools, home station, and the combined training centers.  Test requirements support the development, fielding, safety, and quality assurance of Army munitions and equipment throughout their life-cycle.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\n\nThe FY 2018 Base procurement dollars in the amount of $1.500 million supports production of 2 variants of Non-Lethal Ammunition.\n\n(E86401) Ctg, 12G, Non-Lethal, Ext RG, Marking M1116 Series\nThis is a training standard item used in both training and combat.  The procurement supports annual training and builds a war reserve inventory in accordance with Army's procurement goals. FY 2018 Base procurement dollars in the amount of $1.200 million will procure 136,339 units.\nTYPE CLASSIFICATION DATE: October 2015\n\n(E89002) CTG, 40MM AIRBURST F M203 XM1112\nThis is a training standard item used in both training and combat.  The procurement supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals.  TYPE CLASSIFICATION DATE: TBD\n\n(E91505) Ctg, NL Firing Device: Taser XP25 f\/X26E Taser\nThis is a training standard item used in both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goal. FY 2018 Base procurement dollars in the amount of $0.300 million will procure 5,384 units.\nTYPE CLASSIFICATION DATE: August 2011"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}