{
    "id": "2018-Army-PB-2034A-JBOOK-5aee815d00f2743bc26b1fd362b1fa251ab1150ad3a4a9b16cb13a13bf67f3ad-2",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_AMMO-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "EA3000"
        },
        "LineItemTitle": {
            "val": "CTG, Handgun, All Types"
        },
        "P1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "30"
        },
        "BudgetSubActivityTitle": {
            "val": "Small\/Medium Cal Ammunition"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "129.015"
                },
                "PriorYear": {
                    "val": "6.801"
                },
                "CurrentYear": {
                    "val": "9.193"
                },
                "BudgetYearOneBase": {
                    "val": "10.413"
                },
                "BudgetYearOneOCO": {
                    "val": "0.005"
                },
                "BudgetYearOne": {
                    "val": "10.418"
                },
                "BudgetYearTwo": {
                    "val": "12.011"
                },
                "BudgetYearThree": {
                    "val": "12.692"
                },
                "BudgetYearFour": {
                    "val": "13.365"
                },
                "BudgetYearFive": {
                    "val": "7.785"
                },
                "Total": {
                    "val": "201.28"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "129.015"
                },
                "PriorYear": {
                    "val": "6.801"
                },
                "CurrentYear": {
                    "val": "9.193"
                },
                "BudgetYearOneBase": {
                    "val": "10.413"
                },
                "BudgetYearOneOCO": {
                    "val": "0.005"
                },
                "BudgetYearOne": {
                    "val": "10.418"
                },
                "BudgetYearTwo": {
                    "val": "12.011"
                },
                "BudgetYearThree": {
                    "val": "12.692"
                },
                "BudgetYearFour": {
                    "val": "13.365"
                },
                "BudgetYearFive": {
                    "val": "7.785"
                },
                "Total": {
                    "val": "201.28"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "129.015"
                },
                "PriorYear": {
                    "val": "6.801"
                },
                "CurrentYear": {
                    "val": "9.193"
                },
                "BudgetYearOneBase": {
                    "val": "10.413"
                },
                "BudgetYearOneOCO": {
                    "val": "0.005"
                },
                "BudgetYearOne": {
                    "val": "10.418"
                },
                "BudgetYearTwo": {
                    "val": "12.011"
                },
                "BudgetYearThree": {
                    "val": "12.692"
                },
                "BudgetYearFour": {
                    "val": "13.365"
                },
                "BudgetYearFive": {
                    "val": "7.785"
                },
                "Total": {
                    "val": "201.28"
                }
            }
        },
        "Description": {
            "val": "This budget line includes CTG, Handgun, ALL TYPES.\n\n(E96105) CTG, 9MM MARKING, M1041 (BLUE) is used for force on force training engagements.  The cartridge can be fired with existing M9\/M11 pistols and M4 rifles with use of a conversion kit.  The M9 kit consists of a replacement barrel only.  The M11 kit consists of a replacement barrel and recoil spring guide.  The M4 kit consist of a replacement upper receiver for 9mm.  A blue enameled portion of the M9, M11, and M4 barrels is visible through the ejection port of the weapons.  The projectile leaves a mark upon impact (similar to paintball), enabling after action evaluation of training scenarios.  It differs from paintball in that it is a full complete cartridge with projectile and cartridge case containing a propulsion system for a low velocity launch.  The M1041 is required to hit targets accurately out to 12 meters.  The cartridge has been safety certified to be fired in close proximity at properly protected human subjects.  This item is Code A, approved for service use.\n\n(E96107) CTG, 9MM MARKING, M1041 (RED) is used for force on force training engagements.  The cartridge can be fired with existing M9\/M11 pistols and M4 rifles with use of a conversion kit.  The M9 kit consists of a replacement barrel only.  The M11 kit consists of a replacement barrel and recoil spring guide.  The M4 kit consist of a replacement upper receiver for 9mm.  A blue enameled portion of the M9, M11 and M4 barrels is visible through the ejection port of the weapons.  The projectile leaves a mark upon impact (similar to paintball), enabling after action evaluation of training scenarios.  It differs from paintball in that it is a full complete cartridge with projectile and cartridge case containing a propulsion system for a low velocity launch.  The M1041 is required to hit targets accurately out to 12 meters.  The cartridge has been safety certified to be fired in close proximity at properly protected human subjects.  This item is Code A, approved for service use.\n\n(E05218) CTG, MODULAR HANDGUN SYSTEM AMMUNITION consists of four new cartridges – Ball XM1152, Special Purpose XM1153, Drilled Dummy Inert (DDI) XM1156 and Blank XM1157.  The Ball cartridge is intended for use against enemy personnel, for training, and for force protection.  The Special Purpose cartridge is required for use in situations where limited over-penetration of targets is necessary to reduce collateral damage.  DDI cartridges are completely inert.  They are plated and drilled for easy identification and used for training and weapon familiarization.  Blank cartridges are used for K-9 training.  These items are not yet type classified or approved for service use.  The Modular Handgun System will also utilize three M1041 cartridges - Blue, Red and Yellow through the use of a weapon adapter kit.  This item is Code B, not approved for service use. \n\n(E05217) CTG, 9MM SINGLE CARTRIDGE, Dummy Drill and Inert (DDI), M917A1 ammunition cartridge is an inert (no energetic) dummy cartridge used as an ammunition training aid and for weapon familiarization.  This item is Code A, approved for service use.  \n\n(E05210) CTG, 9MM BALL M882 (Combat Pack) cartridge contains a bullet comprised of a copper alloy jacket and a lead alloy core.  The cartridge is identified by the plain bullet tip.  The ammunition complies with NATO STANAG 4090 and is packed in military type packaging.  It is used in M9 and M11 pistols.  This item is Code A, approved for service use.\n\n(E99900) CTG, 9MM BALL M882 (Commercial Pack) cartridge contains a bullet comprised of a copper alloy jacket and a lead alloy core.  The cartridge is identified by the plain bullet tip.  It is packed in commercial type packaging and is not intended for OCONUS shipment.  It is used in the M9 and M11 pistols.  This item is Code A, approved for service use."
        },
        "Justification": {
            "val": "FY 2018 Base Budget supports critical Army Title 10 war reserve\/operational, training, and test requirements IAW DoD Instruction 3000.04 (Munitions Requirements Process) and AR 5-13 (Total Army Munitions Requirements Process and Prioritization System).  War reserve requirements support OSD-approved Combatant Commander Operational Plans, Homeland Defense, and other OSD-directed missions.  Training requirements support individual and collective training of Active and Reserve Component forces at Army schools, home station, and the combined training centers.  Test requirements support the development, fielding, safety, and quality assurance of Army munitions and equipment throughout their life-cycle.\n\nThe FY 2018 OCO includes $0.005 million to support the COCOM requirement for unit equipment sets to deter potential adversaries and support the European Reassurance Initiative. The procurement includes 0.029 million M882 Ball cartridges.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities. \n\nThe FY 2018 Base procurement dollars in the amount of $10.413 million supports procurement of 42.500 million cartridges.\n\nThe FY 2018 OCO procurement dollars in the amount of $0.005 million supports the procurement of 0.029 million cartridges.\n\n(E96105) CTG 9MM MARKING, M1041 (BLUE) is a training unique item not used in combat.  The FY 2018 request supports annual training and builds a depot level in accordance with the Army's procurement goals.  FY 2018 Base procurement dollars in the amount of $0.168 million supports the procurement of 0.270 million M1041 (Blue) cartridges.\nType Classification Date: 2009\n\n(E96107) CTG, 9MM MARKING, M1041 (RED) is a training unique item not used in combat.  The FY 2018 request supports annual training and builds a depot level in accordance with the Army's procurement goals.  FY 2018 Base procurement dollars in the amount of $0.037 million supports the procurement of 0.059 million M1041 (Red) cartridges.\nType Classification Date: 2009\n\n(E05218) CTG MODULAR HANDGUN SYSTEM AMMUNITION is a training standard item used in both training and combat.  The FY 2018 request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals.  FY 2018 Base procurement dollars in the amount of $4.258 million supports the procurement of 12.688 million Modular Handgun cartridges.  E05218 is a new start in FY 2018.\nType Classification Date: Pending\n\n(E05217) CTG, 9MM SINGLE CARTRIDGE, (DDI), M917A1 is a training unique item not used in combat.  The request supports annual training and builds a depot level in accordance with the Army's procurement goals.\nType Classification Date: 1975\n\n(E05210) CTG 9MM BALL, M882 (Combat Pack) is a training standard item used in both training and combat.  The FY 2018 request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals.  FY 2018 Base procurement dollars in the amount of $2.000 million supports the procurement of 9.410 million M882 Ball cartridges.  FY 2018 OCO procurement dollars in the amount of $0.005 million supports the procurement of 0.029 million M882 Ball cartridges.\nType Classification Date: 1985\n\n(E99900) CTG 9MM BALL M882 (Commercial Pack) is a training standard item packed commercially for training.  The FY 2018 request supports annual training and builds a depot level in accordance with the Army's procurement goals.  FY 2018 Base procurement dollars in the amount of $3.950 million supports the procurement of 20.073 million M882 Ball cartridges.\nType Classification Date: 1985"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}