{
    "id": "2018-AirForce-PB-3080F-JBOOK-05a2d26f6f9e68574bbd94928aef3d85085dcd287dab5f2b545ee87588cfad99-17",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-AIRFORCE_OTHER-U_PROCUREMENT_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "833030"
        },
        "LineItemTitle": {
            "val": "Battle Control System - Fixed"
        },
        "P1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Electronics Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "2.704"
                },
                "PriorYear": {
                    "val": "2.018"
                },
                "CurrentYear": {
                    "val": "5.677"
                },
                "BudgetYearOneBase": {
                    "val": "6.415"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "6.415"
                },
                "BudgetYearTwo": {
                    "val": "3.033"
                },
                "BudgetYearThree": {
                    "val": "3.086"
                },
                "BudgetYearFour": {
                    "val": "3.142"
                },
                "BudgetYearFive": {
                    "val": "3.199"
                },
                "Total": {
                    "val": "29.274"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "2.704"
                },
                "PriorYear": {
                    "val": "2.018"
                },
                "CurrentYear": {
                    "val": "5.677"
                },
                "BudgetYearOneBase": {
                    "val": "6.415"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "6.415"
                },
                "BudgetYearTwo": {
                    "val": "3.033"
                },
                "BudgetYearThree": {
                    "val": "3.086"
                },
                "BudgetYearFour": {
                    "val": "3.142"
                },
                "BudgetYearFive": {
                    "val": "3.199"
                },
                "Total": {
                    "val": "29.274"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "2.704"
                },
                "PriorYear": {
                    "val": "2.018"
                },
                "CurrentYear": {
                    "val": "5.677"
                },
                "BudgetYearOneBase": {
                    "val": "6.415"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "6.415"
                },
                "BudgetYearTwo": {
                    "val": "3.033"
                },
                "BudgetYearThree": {
                    "val": "3.086"
                },
                "BudgetYearFour": {
                    "val": "3.142"
                },
                "BudgetYearFive": {
                    "val": "3.199"
                },
                "Total": {
                    "val": "29.274"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0102326F"
                }
            ]
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0102326F"
                }
            ]
        },
        "Description": {
            "val": "BCS-F supports the North American Aerospace Defense Command\/ Northern Command (NORAD\/NORTHCOM) homeland defense and air sovereignty mission for fixed Air Defense Sectors.\n\nBATTLE CONTROL SYSTEM-FIXED (BCS-F): BCS-F is a Bi-national program with Canada. The BCS-F Program is an AF Homeland Defense battle management command and control system with the capability to integrate data from existing and future civil and military defense surveillance systems into a comprehensive air picture. BCS-F provides tactical communications and data link capabilities with other military and civil systems responsible for planning, directing, coordinating and controlling forces for air surveillance, air defense, and control of sovereign US air space. This integrated air picture enhances the capability to conduct peacetime air sovereignty operations and transition to active air defense operations in the event of aggression. The BCS-F baseline expanded in FY2014 to include the Remote Tactical Air Picture\/Remote Work Station (RTAP\/RWS). Tech refresh will be required, to prevent system obsolescence, account for new cyber-security requirements and will posture the program to seamlessly integrate future capabilities.\n\nNATIONAL CAPITOL REGION - INTEGRATED AIR DEFENSE SYSTEM (NCR-IADS): NCR-IADS is a post-September 11, 2001 rapidly fielded capability that improves low altitude detection capability in order to prosecute airborne threats to the NCR. NCR-IADS provides ground-based air defense of the National Capitol Region airspace, and provides an integrated air picture, ground air defense weapons, enhanced regional situational awareness and forensic data collection capabilities for the war-fighter mission to protect the NCR. Tech refresh will be required, to prevent system obsolescence, account for new cyber- security requirements and will posture the program to seamlessly integrate future capabilities.\n\nBATTLE CONTROL SYSTEM MODIFICATION: Provides for capital equipment replacement activities at the fixed Air Defense Sector under the modification efforts for Release 3.2.4 and beyond, which include, but are not limited to: infrastructure upgrades, future Diminishing Manufacturing Sources (DMS), and replacement of other equipment that does not qualify for Centralized Asset Management (CAM) funding.  Tech refresh will be required, to prevent system obsolescence, account for new cyber-security requirements and will posture the program to seamlessly integrate future capabilities."
        },
        "Justification": {
            "val": "- Battle Control System-Fixed (BCS-F) INC 3 program ended after reaching full deployment in November 2012: No FY2018 funds requested.\n- National Capitol Region - Integrated Air Defense System (NCR-IADS): Tech refresh will be required to prevent system obsolescence, account for new cyber- security requirements and will posture the program to seamlessly integrate future capabilities.\n- BATTLE CONTROL SYSTEM MODIFICATION UPGRADES: FY2018 funds will support hardware upgrades for G7 servers. Funds will also provide hardware upgrades and spares that do not qualify for Centralized Asset Management (CAM) funding, to include, but not limited to: updated configurations of existing sites to match the modified baseline, and hardware for increased cyber security capability to maintain Authority to Operate (ATO).\n- PROGRAM MANAGEMENT ADMINISTRATION (PMA): FY2018 funds for PMA costs provide the management, engineering and technical support for the program office.\n- This funding request supports potential Diminishing Manufacturing Sources (DMS) and obsolescence solutions, to include if optimal, life of type buys or bridge buys limited to the program of record quantity."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}