{
    "id": "2018-Navy-PB-1810N-MJBOOK-4-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-3",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "6027"
        },
        "LineItemTitle": {
            "val": "Fire Fighting Equipment"
        },
        "P1LineNumber": {
            "val": "134"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "Civil Engineering Support Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Civil Engineering Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "14.705"
                },
                "CurrentYear": {
                    "val": "14.199"
                },
                "BudgetYearOneBase": {
                    "val": "2.541"
                },
                "BudgetYearOneOCO": {
                    "val": "2.304"
                },
                "BudgetYearOne": {
                    "val": "4.845"
                },
                "BudgetYearTwo": {
                    "val": "6.195"
                },
                "BudgetYearThree": {
                    "val": "14.207"
                },
                "BudgetYearFour": {
                    "val": "15.452"
                },
                "BudgetYearFive": {
                    "val": "15.504"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "14.705"
                },
                "CurrentYear": {
                    "val": "14.199"
                },
                "BudgetYearOneBase": {
                    "val": "2.541"
                },
                "BudgetYearOneOCO": {
                    "val": "2.304"
                },
                "BudgetYearOne": {
                    "val": "4.845"
                },
                "BudgetYearTwo": {
                    "val": "6.195"
                },
                "BudgetYearThree": {
                    "val": "14.207"
                },
                "BudgetYearFour": {
                    "val": "15.452"
                },
                "BudgetYearFive": {
                    "val": "15.504"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "14.705"
                },
                "CurrentYear": {
                    "val": "14.199"
                },
                "BudgetYearOneBase": {
                    "val": "2.541"
                },
                "BudgetYearOneOCO": {
                    "val": "2.304"
                },
                "BudgetYearOne": {
                    "val": "4.845"
                },
                "BudgetYearTwo": {
                    "val": "6.195"
                },
                "BudgetYearThree": {
                    "val": "14.207"
                },
                "BudgetYearFour": {
                    "val": "15.452"
                },
                "BudgetYearFive": {
                    "val": "15.504"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This budget line item funds procurement of aircraft fire\/rescue trucks and structural\/brush fire trucks. \n\nThe aircraft fire\/rescue trucks are used at Naval Air Stations for combating aircraft fires and rescue of aircraft crews. The trucks range in size from a small 11,000 pound Gross Vehicle Weight Rating (GVWR) pickup with utility body and twin engine fire fighting unit to the 68,000 pound GVWR crash truck which carries 3,000 gallons of water and 200 gallons of AFFF (foam). The structural\/brush fire trucks are used at Naval activities in the same manner as municipal fire trucks in fighting structural and grass fires.\n\nThe Navy's investment in ships, aircraft, facilities, personnel and equipment mandates having adequate fire protection. The requested funds are needed to comply with current National Fire Protection Association (NFPA) standards, sustain the Navy Firefighting Fleet and maintain an effective Firefighting Fleet Modernization Program consistent with findings identified in the DoD IG Report: D-2003-121 DoD Fire and Emergency Services Program.  The Firefighting Fleet requires annual investments to ensure emergency response vehicles are within specified service life for safety, technological improvements, and maintenance sustainability.  Highly reliable trucks are required as the emergency vehicles are key to success.  Some older crash response trucks do not meet roll safety criteria, and require continued replacement to ensure safe working limits. As firefighter staffing is reduced and the all-hazards emergency response mission expands, the Navy's firefighting apparatus must evolve to provide additional capabilities for emergency medical services, rescue, confined space, hazardous materials, etc.  The ability to save lives and protect property is essential in supporting the Navy's mission. The role of these trucks is to provide the Navy's response to structural fire emergencies, aircraft rescue fire fighting crashes, emergency medical services incidents, all hazards public safety, and emergency response to terrorism incidents, and weapons of mass destruction."
        },
        "Justification": {
            "val": "The funds requested in FY 2018 will provide for recapitalization requirements to support fielding a fleet of equipment within useful life expectancy.\n\nFY 2017 decrease in Fire Fighting Equipment OPN by $0.572M as required for the Department of the Navy to comply with the Bipartisan Budget Act of 2015.\n\nOCO: \nIncluded in this request is FY 2018 Overseas Contingency Operations (OCO) funding for Operation Freedom's Sentinel in the amount of $.572M for Isa Air Base, Bahrain and for Operation Enduring Freedom - Horn of Africa (OEF-H) in the amount of $1.732M for Camp Lemonnier, Djibouti. \n\nFunds requested are for replacement fire fighting vehicles (beyond serviceable life) at core installations that provide key logistics services supporting ship and aircraft movements and command and control services for the warfighter in support of Overseas Contingency Operations. The life expectancy of fire fighting equipment used in OCO locations is 10 years given the harsh expeditionary type conditions, reduced maintenance support and the lack of proper fire station facilities. The trucks being replaced have met their life expectancy. \n\nIsa Air Force Base:\nTruck A\/C Crash Fire Rescue 1500 GAL, QTY=1, $0.572M\n\nCamp Lemonnier, Djibouti:\nTruck Water Tanker, QTY=1, $0.630M\nTruck Fire Fighting Structural Pumper, QTY=1, $0.381M\nTruck A\/C Crash Fire Rescue 3000 GAL, QTY=1, $0.721M"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}