{
    "id": "2018-Navy-PB-1810N-JBOOK-d28d83334f9383e77611ff4064e40d00fd933e9ab87acc3419c09665f6cb2c63-13",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA1-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "0935"
        },
        "LineItemTitle": {
            "val": "Pollution Control Equipment"
        },
        "P1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "9"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shipboard Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "413.585"
                },
                "PriorYear": {
                    "val": "16.609"
                },
                "CurrentYear": {
                    "val": "20.191"
                },
                "BudgetYearOneBase": {
                    "val": "17.293"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "17.293"
                },
                "BudgetYearTwo": {
                    "val": "21.59"
                },
                "BudgetYearThree": {
                    "val": "25.302"
                },
                "BudgetYearFour": {
                    "val": "24.397"
                },
                "BudgetYearFive": {
                    "val": "24.885"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "413.585"
                },
                "PriorYear": {
                    "val": "16.609"
                },
                "CurrentYear": {
                    "val": "20.191"
                },
                "BudgetYearOneBase": {
                    "val": "17.293"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "17.293"
                },
                "BudgetYearTwo": {
                    "val": "21.59"
                },
                "BudgetYearThree": {
                    "val": "25.302"
                },
                "BudgetYearFour": {
                    "val": "24.397"
                },
                "BudgetYearFive": {
                    "val": "24.885"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "413.585"
                },
                "PriorYear": {
                    "val": "16.609"
                },
                "CurrentYear": {
                    "val": "20.191"
                },
                "BudgetYearOneBase": {
                    "val": "17.293"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "17.293"
                },
                "BudgetYearTwo": {
                    "val": "21.59"
                },
                "BudgetYearThree": {
                    "val": "25.302"
                },
                "BudgetYearFour": {
                    "val": "24.397"
                },
                "BudgetYearFive": {
                    "val": "24.885"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.206"
                },
                "CurrentYear": {
                    "val": "0.078"
                },
                "BudgetYearOneBase": {
                    "val": "0.129"
                },
                "BudgetYearOne": {
                    "val": "0.129"
                },
                "BudgetYearTwo": {
                    "val": "0.045"
                },
                "Total": {
                    "val": "0.458"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "FY 2018 funding request reflect a reduction of $3.171 million to account for the availability of prior year funds.\n\nPOLLUTION CONTROL SYSTEMS\/EQUIPMENT:  This item provides funds for the procurement of pollution control systems and equipment that are required by Navy ships in order for them to comply with international regulations, federal laws, DOD Directives and Navy environmental protection regulations.  These regulations, laws and directives restrict the discharge of oily waste, sewage, solid waste, plastic waste, medical waste and hazardous waste.  Most of these applicable regulations require Navy ships to comply by fixed deadlines.  Failure to comply carries potential personal, civil, and criminal liability, and significantly imposes constraints on the operational capabilities of Navy ships.  In some instances, the compliance schedule has required an acceleration of the normal schedules in the procurement process.\n\nSHORE BASED POLLUTION EQUIPMENT - (Logistics)\nThe shore based funds provide for equipment required to clean up Navy oil spills on the open sea as required by the Federal Water Pollution Control Act - Public Law 92-500.  The law created a National Oil and Hazardous Substance Pollution Contingency Plan, and designates the Department of Defense as one of the primary agencies responsible for promotion of effective operation of the plan.  The Supervisor of Salvage is assigned the responsibility to provide technical expertise, resources, and equipment for cleaning Navy-originated spills of oil and other hazardous material in coastal waters or the open sea.  Major items of procurement are:\n\n[P40A \/ HF040 FIELD SUPPORT SYSTEMS]: These systems provide the auxiliary support required to keep Navy oil spill responders operating in the field without significant lapse of response time in all Navy Areas of Responsibility (AoR) according to Federal Law 33 CFR 155 and 154 and implemented by OPNAV5090.1D. As such, many Navy areas of operation are in remote and austere parts of the world with little to no operational support available, therefore the inventory objectives of equipment procured under this cost code are set to support emergency personnel in responding to the Navy's worst case oil or hazardous substance (OHS) discharge scenario in all AoR's and to be pre-positioned in the Emergency Ship Salvage Material (ESSM) Bases world-wide. Systems include Boom Handling Boats, Boom Tending Boats, Personnel Transfer Boats, Field Command & Control Centers, Field Conference Centers, Field Rigging Lockers, Field Repair Workshops, Personnel Berthing Modules, Field-grade Satellite Communications Systems, and Oil Spill Aerial Surveillance Systems. Unit cost varies greatly between systems.\n\n[P40A \/ HF051 OIL BOOM SYSTEMS]: These systems consist of inflatable or foam-filled oil booms of various sizes (18 inch, 26 inch, 42 inch).  Inventory is based on the Federal requirements for Oil Spill Response Organizations (OSROs). Boom systems range in unit cost based on size (18 inch, 26 inch, 42 inch) and type (inflatable or non-inflatable). These systems include all associated equipment required to store, inflate, deploy, recover, and repair the boom, including lighting systems to mark the boom in navigable waterways. All inflatable boom systems also include shoreline transition booms to seal across beach areas. These systems are packaged in 8 foot x 8 foot x 20 foot standard shipping containers.\n\n[P40A \/ HF055 SALVAGE SUPPORT SYSTEMS]: These systems are a collection of small, special-purpose oil skimmers, containment booms, shoreline transition booms, transfer pumps, temporary oil storage, sorbents, and ancillary equipment intended as a stand-alone response package for small, salvage-related spills inside and adjacent to ships in distress or inland (river and lake) spills.  These systems are packaged in an 8 foot x 8 foot x 20 foot standard shipping container.\n\n[P40A \/ HF056 EQUIPMENT CLEAN-UP SYSTEMS]: These systems provide a full array of tools and materials required to perform the extensive decontamination needed for oil spill and hazardous chemical response equipment and personnel during an operation and prior to demobilization once a spill has been contained and recovered.\n\n[P40A \/ HF057 OIL HANDLING SYSTEMS]: Oil handling systems provide the capability to recover and dispose of oil and debris during emergency oil spill response operations including temporary oil storage as required by 33 CFR 155 and 154. Equipment missions additionally include moving heavy oil or oil in cold conditions that exceed the capability of conventional skimmer systems and providing means of transferring oil from skimmers to temporary oil storage.  Systems include Vacuum Pump Systems, Oil Bladder Transfer Systems, Annular Water Injection Systems, At-Sea Bladder Pumping Systems, and Temporary Oil Storage Systems (Bladders, Tanks, etc.)These different systems can range greatly in individual unit cost.\n\n[P40A \/ HF062 LIGHTERING SYSTEMS]: These systems are specially designed for lightering oil from aboard ships in distress whose transfer systems are inoperative or inaccessible or for extracting oil from sunken vessels where drilling and pumping through the hull of the vessel is often necessary at depths up to 20,000 feet. Various pump sizes and types as well as extraction tools are packaged together in fly-away systems meant to pump oil product in almost any emergency scenario. These systems are packaged in 8 foot x 8 foot x 20 foot standard shipping containers.\n\n[P40A \/ HF063 VESSEL OF OPPORTUNITY SKIMMER SYSTEMS]: The Vessel of Opportunity Skimmer Systems are oil skimmers designed and packaged to be deployed aboard any vessel that is available during an emergency oil spill response operation with enough deck space to support the operating equipment.  These systems allow for mechanical recovery of oil on the water in situations where traditional skimmers may not be practical, such as far offshore or in inclement weather or high currents. These systems include all the ancillary support equipment required to maintain oil spill recovery operations onboard a vessel for an extended period of time. These systems are packaged in an 8 foot x 8 foot x 20 foot standard shipping container with an 8 foot x 8 foot x 8 foot support container.\n\n[P40A \/ HF067 VESSEL SKIMMER SYSTEMS]: These systems are self-propelled skimmers designed for near-shore and low sea-state open ocean environments and are used in conjunction with oil containment boom for mechanical recovery of oil on the water. They are designed to be rapidly transportable to the scene of an oil spill.\n\n[P40A \/ HF031 POLLLUTION CONTROL EQUIPMENT FIELD CHANGES]: HF031 - POLLUTION CONTROL EQUIPMENT FIELD CHANGES - Funds field changes for reliability and maintainability improvements and corrections of conventional pollution control equipment systems.  \n\nOil Pollution Abatement (OPA) Systems Improvements: Existing OPA systems have demonstrated poor operational availability, maintainability, and reliability. This comprehensive effort addresses the entire OPA system, from holding tanks to overboard discharge, leveraging recommended improvements new to the Fleet and approved, partially completed alterations. The alterations needed to correct design deficiencies are ship specific and require ship checks to confirm the current configuration as prior alterations may have completed one or several of the recommended improvements. The alterations may include, but are not limited to: installation of new tank level sensors; upgrades to the Oily Water Separator (OWS) and the Oil Content Monitor (OCM), correction of OWS suction problems, correction of OCM inlet & outlet piping including related of flush water piping configuration problems, and upgrade of oily waste transfer pump relief valve. Extensive work will occur with LHD-1 Class upgrades to convert the existing OWS to the VS-50 OWS and DDG-51 through DDG-88 ships will receive the Oily Waste Membrane System to produce an effluent that meets the 15 ppm maximum oil discharge requirement.\n\n[P40A \/ HF830 PRODUCTION ENGINEERING]: HF830 PRODUCTION ENGINEERING:  Air conditioning plant kit and software quality control, technical manual and complete conversion instruction revisions, technical reports based on investigative efforts of OEM quality assurance or obsolescence issues, and support equipment removal from inactive ships or other Navy assets.  Development of technical manuals, Planned Maintenance System (PMS), Provisioning Technical Documentation (PTD), Program Support Data (PSD) and allowance Parts List (APLs), engineering to manage procurement and material, and in support of design reviews.\n\n[P3A \/ HF024 CFC-114 (R-114) AC CONVERSION]: HF024 - CFC CONVERSION PROGRAM The production of chlorofluorocarbon(CFC)-based refrigerants (including CFC-12 and CFC R-114) was prohibited after 31 DEC 95 by the Clean Air Act of 1990. Presidential Executive Order 13693 calls for federal agencies to \" promote sustainable acquisition and procurement by ensuring that each of the following environmental performance and sustainability factors are included ... alternatives to ozone-depleting substances\".  The Navy is currently dependent on CFC-based refrigerants for the mission-critical cooling of (1) vital electronics and weapon systems, (2) food and medical stowage, and (3) inhabited spaces aboard surface ships and submarines. To counter the immediate threat of production cessation on uninterrupted Fleet operations, DoD directed the Defense Logistics Agency to establish a stockpile of CFC-based refrigerants. The stockpile was sized to support Fleet operations until the last CFC-based systems are retired or converted to ozone-friendly refrigerants. This program procures and installs conversion kits on existing CFC R-114 Air-Conditioning (A\/C) plants onboard surface ships. The CFC R-114 conversion program began in FY 99 and is expected to complete FY2021. The inventory objective for CFC R-114 is 402 converted units.\n\n[P3A \/ HF024 CFC-114 (R-114) AC CONVERSION]: HF5IN - INSTALLATION OF EQUIPMENT\nFunding is for installation of equipment for the Fleet Modernization Program installations.\n\nHF6IN - INSTALLATION OF EQUIPMENT\nFunding is for installation of equipment for the Fleet Modernization Program installations."
        },
        "Justification": {
            "val": "FY 2018 funding request reflect a reduction of $3.171 million to account for the availability of prior year funds."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}