{
    "id": "2018-Army-PB-2035A-JBOOK-377d93ca794817f44e4b0e8b6a4ac9da01254c9911de0ea9a8ab395d402568a9-83",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_OTHER_2-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "BE4169"
        },
        "LineItemTitle": {
            "val": "Army Training Modernization"
        },
        "P1LineNumber": {
            "val": "109"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "92"
        },
        "BudgetSubActivityTitle": {
            "val": "Elect Equip - Automation"
        },
        "ResourceSummary": {
            "Quantity": {
                "PriorYear": {
                    "val": "9597"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "305.051"
                },
                "PriorYear": {
                    "val": "12.089"
                },
                "CurrentYear": {
                    "val": "17.693"
                },
                "BudgetYearOneBase": {
                    "val": "11.575"
                },
                "BudgetYearOne": {
                    "val": "11.575"
                },
                "BudgetYearTwo": {
                    "val": "17.018"
                },
                "BudgetYearThree": {
                    "val": "17.792"
                },
                "BudgetYearFour": {
                    "val": "16.148"
                },
                "BudgetYearFive": {
                    "val": "15.687"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "UnitCost": {
                "PriorYear": {
                    "val": "1.26"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "305.051"
                },
                "PriorYear": {
                    "val": "12.089"
                },
                "CurrentYear": {
                    "val": "17.693"
                },
                "BudgetYearOneBase": {
                    "val": "11.575"
                },
                "BudgetYearOne": {
                    "val": "11.575"
                },
                "BudgetYearTwo": {
                    "val": "17.018"
                },
                "BudgetYearThree": {
                    "val": "17.792"
                },
                "BudgetYearFour": {
                    "val": "16.148"
                },
                "BudgetYearFive": {
                    "val": "15.687"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "305.051"
                },
                "PriorYear": {
                    "val": "12.089"
                },
                "CurrentYear": {
                    "val": "17.693"
                },
                "BudgetYearOneBase": {
                    "val": "11.575"
                },
                "BudgetYearOne": {
                    "val": "11.575"
                },
                "BudgetYearTwo": {
                    "val": "17.018"
                },
                "BudgetYearThree": {
                    "val": "17.792"
                },
                "BudgetYearFour": {
                    "val": "16.148"
                },
                "BudgetYearFive": {
                    "val": "15.687"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "9597"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "12.089"
                                },
                                "CurrentYear": {
                                    "val": "17.693"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11.575"
                                },
                                "BudgetYearOne": {
                                    "val": "11.575"
                                },
                                "BudgetYearTwo": {
                                    "val": "17.018"
                                },
                                "BudgetYearThree": {
                                    "val": "17.792"
                                },
                                "BudgetYearFour": {
                                    "val": "16.148"
                                },
                                "BudgetYearFive": {
                                    "val": "15.687"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "Quantity": {
                    "PriorYear": {
                        "val": "9597"
                    }
                },
                "TotalCost": {
                    "PriorYear": {
                        "val": "12.089"
                    },
                    "CurrentYear": {
                        "val": "17.693"
                    },
                    "BudgetYearOneBase": {
                        "val": "11.575"
                    },
                    "BudgetYearOne": {
                        "val": "11.575"
                    },
                    "BudgetYearTwo": {
                        "val": "17.018"
                    },
                    "BudgetYearThree": {
                        "val": "17.792"
                    },
                    "BudgetYearFour": {
                        "val": "16.148"
                    },
                    "BudgetYearFive": {
                        "val": "15.687"
                    }
                }
            }
        },
        "Description": {
            "val": "Army Training Modernization (ATM) consists of three related efforts to include Distributive Training Technology Project (DTTP), Other Training Modernization, and the Distributed Learning System (DLS) to acquire Digital Training Facilities (DTF).  DTFs allow rapid delivery of high quality instruction to Army personnel. Infrastructure acquired is based on industry standards and complies with the Joint Technical Architecture (JTA) and Defense Information Infrastructure Common Operating Environment (DII COE), where applicable. This assures compatibility with other military services and that commercial, state, and other resources can be leveraged to achieve cost effective solutions to support all Army components.\n\nATM provides a cost effective solution for training Army personnel. Supported training enhancements will help reduce the current backlog of Military Operational Specialty (MOS) training. Army can significantly increase levels of MOS qualification, hence readiness, with standardized Army courseware delivered through Distributed Learning (DL) technology. Implementation of these technology enablers reduce resident training requirements and Soldiers spend less time in the training base and more time in units, thereby increasing readiness. ATM delivers standardized training to Active Component (AC) and Reserve Component (RC) Soldiers and Department of the Army Civilians (DAC). \n\nThe DTTP\/DLS provide infrastructure for Soldiers to train at or near their assigned station in lieu of resident training at Army schools.  DTTP and DLS will provide approximately 549 modern distance learning (DL) enabled DTFs and associated supporting infrastructure to augment training at existing resident Army schools. Moreover, DLS has fielded 30 Deployed Digital Training Campus (DDTC) to allow training while units are deployed. This allows Army to both increase the number of Army personnel receiving required training and the amount of training that can be provided to each individual. \n\nDLS provides the information technology for delivery and management of training in support of individual and collective task training.  Benefits include increased training effectiveness and efficiency, improved readiness, and increased training for customers. Key customers: Soldiers (Active, National Guard, and Reserve) and Army Civilians.  Key Stakeholders: Army Training and Doctrine Command (Functional Proponent Agent), all other Army Commands, Program Executive Officer - Enterprise Information Systems, and Army General Staff.  DLS provides capabilities using Commercial-Off-The-Shelf (COTS) solutions: (1) Digital Training Facilities (DTF): electronic classrooms that deliver multimedia courseware for self-paced training or group training events; (2) Enterprise Management Center (EMC): centralized system management of the DLS information resources; (3) Army Learning Management System (ALMS): a web-based information system for centralizing, standardizing, and optimizing training, training management, and training delivery functions; (4) Deployed Digital Training Campuses (DDTC): electronic transportable classrooms that deliver multimedia courseware for self-paced instruction or group training events in a deployed location; and,  (5) Army e-Learning: web-based training products used to acquire and sustain business, information technology or foreign language skills.  As a whole, DLS facilitates the Training Mission Area mission to teach technical and tactical proficiency, develop military occupational specialty (MOS) skills, develop Leaders, support Army Training Transformation, Army Force Generation (ARFORGEN) and Lifelong Learning, promote self-development, and sustain individual and unit combat skills.\n\nThe United States Army Intelligence Center of Excellence (USAICoE) trains Military Intelligence (MI) Soldiers, Leaders from all services, the professional civilian Intelligence workforce and mobilized reserve components as a power support platform for the Active Army.  Because of Military Intelligence’s reliance on Information Technology, information systems are the primary weapons for the Military Intelligence Corps, and a digital infrastructure that comprises the systems, networks, and databases that MI Soldiers and Leaders will use in the Force is required for training.  The USAICoE G-6 is chartered with continuously maintaining and improving this vital digital training infrastructure, which encompasses 5 discreet network enclaves, each operating at different levels of classification, 25 training buildings, 4 field sites, 325 digital classrooms, and 3 data centers.  The USAICoE G-6 operates and maintains the largest single site installation of Distributed Common Ground System-Army (DCGS-A)."
        },
        "Justification": {
            "val": "FY 2018 (BE4171) Base procurement dollars in the amount of $4.710 million supports system integration and technical refresh for 18 of the Program’s 334 DL Classrooms. Many of the DL Classrooms have workstations, audio\/video equipment, and printers that are well past their end of life and need technical refresh to comply with heightened Cybersecurity standards and new network infrastructure to ensure their continued availability and capability to meet current and emerging training and readiness requirements for the ARNG’s State and Federal missions.\n\nFY 2018 (BE4172) Base procurement dollars in the amount of $4.382 million supports the United States Army Intelligence Center of Excellence Soldiers and Leaders from all services with network equipment including servers, firewalls, and other related hardware for the Distributed Common Ground System-Army infrastructure. \n\nFY 2018 (BE4173) Base procurement dollars in the amount of $2.483 million funds the DLS Enterprise Technology Refreshment (Tech Refresh) program in support of all increments (Digital Training Facilities (DTF), Enterprise Management Center (EMC), Army Learning Management System (ALMS), and Deployed Digital Training Campus (DDTC)).  Tech Refresh extends the service life by staying ahead of the obsolescence curve with cost-effective planned technology upgrades, refreshers, and insertions, based on market research and system performance requirements (current and projected).  With the advance of information technology, it is critical that Tech Refresh be maintained to assure continued supportability of the DLS Enterprise and to avoid disruption of Army Training.  Funds are also needed for software and engineering changes required to enhance the ALMS assessment capabilities.  This will expand the automated capability for the creation, storage, management, and administration of online testing and course product evaluations (including surveys) to support Army Soldier and civilian training and education.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}