{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-2",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2147"
        },
        "LineItemTitle": {
            "val": "SSN Acoustics"
        },
        "P1LineNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Ship Sonars"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "1324.13"
                },
                "PriorYear": {
                    "val": "232.134"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "1556.264"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "1324.13"
                },
                "PriorYear": {
                    "val": "232.134"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "1556.264"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "1324.13"
                },
                "PriorYear": {
                    "val": "232.134"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "1556.264"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "15.391"
                },
                "Total": {
                    "val": "15.391"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "Description": {
            "val": "*Note - In FY17 and out, BLI's 2147 and 2181 have been consolidated into BLI 2150.  BLI 2147 reflects the FY16 procurements (costs and quantities) for the associated FY17 installations shown in the BLI 2150 exhibit. \n\nA.  MISSION DESCRIPTION AND BUDGET ITEM JUSTIFICATION:   This program procures submarine systems and equipment for installation on all classes of submarines to maintain clear acoustical, tactical, and operational superiority over submarine and surface combatants in all scenarios through detection, classification, localization, and contact following.  All future acoustic upgrades of Acoustic Rapid COTS Insertion (A-RCI) equipment are incorporated into this budget item.  Future procurements, detailed below, are focused on supporting Littoral Warfare, Regional Sea Denial, Strike Group Support, Diesel Submarine Detection, Surveillance, and Peacetime Engagement.  A-RCI is a multi-phased, evolutionary development effort geared toward addressing acoustic superiority issues through the rapid introduction of interim products applicable to SSN 688, 688I Flight, SSN21, SSGN, VA Class, and SSBN 726 Class Submarines.  A-RCI Phase II provided towed array processing improvements; A-RCI Phase III provides spherical array processing improvements, and A-RCI Phase IV provides AN\/BSY-1 High Frequency Upgrades for SSN 688I, SSGN, and Seawolf Classes.  As part of Navy's plan to maintain acoustic superiority for in-service submarines, reduce obsolescence, and provide increased capability, the A-RCI program will modernize and sustain approximately 8-12 SSNs and 2-3 SSBNs per year through executing bi-annual software Advanced Processing Builds (APBs) and bi-annual hardware Technical Insertions (TIs).   \n\nTowed system procurements of TB-29X and  TB-34X provide reliability improvements to maintain acoustic superiority, increase the service life, reduce failures, and maintain the inventory of arrays available for fleet use.  Towed Array Refurbishment & Reliability Upgrades sustain current in-service TB-16\/34 fat line and TB-23\/29A thin line towed arrays.  Towed System procurements provide upgrade\/support for OK-276, OK-634, OK-542 and OA-9070 Series Towed Array Handlers installed on SSN688, SSN 688I, SSN21, SSGN, VA Class, and SSBN 726 Class Submarines. \n\nProcurement of Low Cost Conformal Array (LCCA) provides enhanced situational awareness and collision avoidance capability in high contact density environments experienced in the littorals.  Procurement of VA Unique Sensors sustains unique hull sensor systems for the VA platforms under the Critical Transducer Program as VA Class submarines transition into fleet service.\n\nInstallation funds are for actual hardware installations during shipyard and pier-side availabilities.  Procurements support a 12-15 month lead time for installations.\n\n[P40A \/ SA102 TOWED SYSTEMS]: Procures TB-34X Fatline and TB-29X Thinline Arrays to provide increase acoustic capability and reliability to the fleet.  The program supports N8's response to the Fleet Forces Command's Urgent Operational Needs Statement message (dated 15 June 2009) which requests that a reliable Thinline Towed Array is critically needed to support submarine operations in the Western Pacific Area of Operations, refurbishment\/upgrades reliability improvements to TB-16 series, TB-23, TB-29A to maintain in-service Towed Array inventory and increased array availability.  Reliability improvements include new telemetry, hose material, improved internal connectors, hydrophones, tow cables, and Vibration Isolation Modules (VIMS), and Heading Sensors.\n\n[P40A \/ SA105 SONAR SUPPORT EQUIPMENT]: Funds provided to procure BQN-17(A) and associated equipment.\n\n[P40A \/ SA106 HULL SENSORS]: Procurement of Low Cost Conformal Array (LCCA) provides enhanced situational awareness and collision avoidance capability, and VA Unique Sensors required to sustain unique hull sensor systems for the VA platforms under the Critical Transducer Program.\n\n[P40A \/ SA201 BLOCK CHANGES]: Minor Engineering Change Proposals (ECP's) and hardware changes affecting all classes of submarines are procured through this line.  Funding will be used to support non-recurring first article test efforts associated with the changing COTS environment as well as Reliability, Maintainability, and Availability modifications requested by the Fleet.  This line also supports the procurement of hardware necessary to implement the ECP's into the System or end item being procured.\n\n[P40A \/ SA202 PRODUCTION\/ENGINEERING SUPPORT]: Funding supports the procurement of Acoustics Upgrades equipment and Towed System hardware.\n\n[P40A \/ SA203 TOWED ARRAY UNIQUE TEST EQUIPMENT]: Funding procures various towed array test equipment simulators and handling system\/stowage tube inspection test equipment.\n\n[P40A \/ SA302 OP TRAINER UPGRADES]: Funding procures hardware upgrades and production engineering for Acoustic Upgrades operational trainer sites.\n\n[P40A \/ SA303 COTS SUPPORTABILITY UPGRADES]: Provides for Technology Refresh\/Insertion for A-RCI kits.  Tech Refresh provides for Software and Hardware updates to accommodate shifts in technology to the execution procurement years' \"current state-of-the-practice\" hardware. A-RCI has already undergone several technology insertion phases to accommodate integrating Advanced Processing Builds (APBs). Updates are necessary for signal and display processing hardware as APBs are introduced or as commercial support for the hardware is phased out.  Tech Insertion procures the hardware necessary to upgrade and back fit the A-RCI kits.  When A-RCI systems are being upgraded to subsequent phases of A-RCI, signal processing and display hardware will be procured from this line to accommodate common technology consistent with the APB being implemented in the year of introduction.  In future years, requirements include additional equipment in technology insertion to prevent COTS hardware from becoming unsupportable\/obsolete.  Funding also supports the procurement and engineering for COTS Underwater Comms.\n\n[P40A \/ SA401 INITIAL TRAINING]: Provides for initial training curriculum development, training management materials, exercise control group development, pilot services, and services to the Fleet.\n\n[P40A \/ SA900 CONSULTING SERVICES]: Includes specification validation, contract deliverable monitoring, prime contractor monitoring for cost, schedule, and performance slips, ILS planning, and coordination of GFI.  Additional support will include production planning, business case analysis, technical refresh and insertion planning and market analysis to review implementation strategies for procurement of current year \"state of the practice\" hardware in Acoustics programs.  Consulting services will also provide production monitoring, installation planning and coordination support."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}