{
    "id": "2018-AirForce-PB-3021F-MJBOOK-0-0-fe08711101115a5e77dadd421d060e07622aefe5146cd33d2cd44a3559033105-4",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-AIRFORCE_SPACE-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3021F",
        "appropriation_name": "Space Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "GAP000"
        },
        "LineItemTitle": {
            "val": "Wideband Gapfiller Satellites(Space)"
        },
        "P1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3021F"
        },
        "AppropriationTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "74.476"
                },
                "CurrentYear": {
                    "val": "86.272"
                },
                "BudgetYearOneBase": {
                    "val": "80.849"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "80.849"
                },
                "BudgetYearTwo": {
                    "val": "62.112"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "303.709"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "74.476"
                },
                "CurrentYear": {
                    "val": "86.272"
                },
                "BudgetYearOneBase": {
                    "val": "80.849"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "80.849"
                },
                "BudgetYearTwo": {
                    "val": "62.112"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "303.709"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "74.476"
                },
                "CurrentYear": {
                    "val": "86.272"
                },
                "BudgetYearOneBase": {
                    "val": "80.849"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "80.849"
                },
                "BudgetYearTwo": {
                    "val": "62.112"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "303.709"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0605433F"
                }
            ]
        },
        "Description": {
            "val": "The Wideband Global SATCOM (WGS) System provides the DoD with high data rate military satellite communication (MILSATCOM) services in accordance with the Joint Space Management Board-approved MILSATCOM architecture (August 1996), the Joint Requirements Oversight Council (JROC)-approved MILSATCOM Capstone Requirements Document (October 1997), and JROC-approved WGS Operational Requirements Document (May 2000).  This program was originally conceived to augment the near-term \"bandwidth gap\" in warfighter communications needs.  Dual-frequency WGS satellites augment, then replace the DoD's Defense Satellite Communications System X-band service and augment one-way Global Broadcast Service Ka-band capabilities.  In addition, WGS provides a high capacity two-way Ka-band service.\n\nWGS Block I consists of satellites 1-3.  These satellites were successfully launched on 10 October 2007, 3 April 2009, and 5 December  2009, respectively.   \n\nWGS Block II consists of satellites 4-6.  Block II satellites are designed with slight modifications to better support the Airborne Intelligence, Surveillance and Reconnaissance mission.  Satellite 4 was successfully launched on 19 January 2012.  Satellite 5 was successfully launched on 24 May 2013.\n\nA United States-Australia WGS partnership was codified in a Memorandum of Understanding (MOU) dated 14 November 2007.  Australia provides funds needed to buy Space Vehicle-6 (SV-6) in exchange for access to constellation-wide (SVs 1-6) resources.  Satellite 6 was successfully launched on 7 August 2013.  SV-6 is not included in the Procurement Quantities in these documents.\n\nWGS Block II Follow-On (B2FO) consists of satellites 7-10. The WGS procurement program element funds the Command and Control System - Consolidated (CCS-C) mission unique software and databases for the WGS B2FO satellites.  CCS-C provides launch and early orbit support and on-orbit anomaly resolution.  \n\nA multilateral partnership between the United States, Canada, Denmark, Luxembourg, the Netherlands, and New Zealand was codified in an MOU in January 2012.  The United States contributions include existing and programmed infrastructure, to include the acquisition, launch, operations, and sustainment costs of WGS 1-8, and the launch, operations, and sustainment of SV-9.  Other Partners' contributions fund SV-9 acquisition and support activities.  Each Partner provides funds needed to buy SV-9 in exchange for access to constellation-wide (SVs 1-9) resources commensurate with its level of contribution.  SV-9 is not included in the Procurement Quantities in these documents.\n\nWGS-7 was successfully launched on 23 July 2015. WGS-8 was successfully launched on 7 December 2016. WGS-9 was successfully launched on 18 March 2017. WGS-10 will be launched in FY19.\n\nDiscussions for potential future partnerships regarding the WGS program continue in support of National Space Policy and improved operational efficiency.\n\nThe Air Force has been working to identify opportunities for more affordable, efficient commercial satellite communications (COMSATCOM) business arrangements.  Specifically, the Space and Missile Systems Center (SMC), Military Satellite Communications Systems (MILSATCOM) Directorate has developed a five phase COMSATCOM pathfinder investment strategy to burn down risk targeting affordability and performance. \n\nIn an FY2014 effort to study SATCOM capabilities to support Remotely Piloted Aircraft (RPA) requirements, the WGS program invested $8.0M in what is known as COMSATCOM Pathfinder #1.  In Pathfinder #1, on-orbit commercial Ku-band transponders were purchased to support AFRICOM while demonstrating risk mitigation steps toward future innovative, affordable procurement of long term COMSATCOM capabilities. \n\nIn FY2016, Congress added $26.0M for the COMSATCOM Pathfinder effort.  Pathfinder #2 will purchase commercial pre-launch transponders that will include protection features.\n \nIn FY2017, the Air Force will execute Pathfinder #3.  Pathfinder #3 builds on the Pathfinder #2 scope and incorporates access to commercial ground stations.  The current plan for Pathfinder #3 is to use an Other Transactions Authority (OTA) contract to purchase commercial transponders and ground station hardware at a commercial site.  Under the OTA, the government and contractor team will demonstrate the ability to flexibly reassign bandwidth between multiple users and work cooperatively to refine that process over a period of five years.  As the current interpretation of the OTA statutes within the Air Force indicates that this type of OTA requires RDT&E funds, the Air Force is seeking reprogramming to re-color Pathfinder #3 funds from Procurement to RDT&E.\n\nIn FY2018-2019, the Air Force has programmed funds for Pathfinders #4-5.  Pathfinder #4 is being developed to ensure it will address portions of the five goals from the FY16 NDAA that were not addressed in Pathfinders #1-3.  Pathfinder #5 will culminate with use of commercial high-capacity satellites to demonstrate all five goals from the FY16 NDAA.  \n\nThe flyaway unit cost is not included on P-40 exhibit because there are multiple P-5 Cost Analysis exhibits.\n\nAs of the FY2016 PB submission, space programs' satellite procurement funding has been re-categorized from Appropriation 3020, Missile Procurement Air Force (MPAF), to Appropriation 3021, Space Procurement Air Force (SPAF), in FY2016 and beyond.  Total MPAF\/SPAF procurement funding is $3,322.439M.  Total WGS SV1-SV5 MPAF funds are $1,619.426M.  There are no WGS SV1-SV5 SPAF funds.\nTotal WGS Block II Follow-On (B2FO) MPAF\/SPAF funds are $1,703.013M.  \n    \nFunding for this exhibit is contained in PE 1203600F.    \n\nThis program has associated Research Development Test and Evaluation funding in PE 1206433F."
        },
        "Justification": {
            "val": "FY2018 funding includes: Continue support for Block II Follow-On (B2FO) satellite production, including Federally Funded Research and Development Center (FFRDC) technical analysis, mission assurance, test support (to include Camp Parks), technical support to include obsolescence\/Diminishing Manufacturing Sources (DMS) studies, program office and other related support activities.  Continue to expand the COMSATCOM Pathfinder investment to provide affordable, resilient, flexible, high capacity COMSATCOM capabilities to users worldwide.  Also funds the Command and Control System - Consolidated (CCS-C) mission unique software and databases for the WGS Block II Follow-On (B2FO) satellites. Continue program office and other related support activities that may include, but are not limited to studies, technical analysis, etc."
        },
        "MDAPCode": {
            "val": "326"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "WGS B2FO"
                    },
                    "ItemNumber": [],
                    "IdCode": {
                        "val": "A"
                    },
                    "Remarks": {
                        "val": "Total WGS Block II Follow-On (B2FO) 3020\/3021 funds are $1,703.013M."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "74.476"
                            },
                            "CurrentYear": {
                                "val": "86.272"
                            },
                            "BudgetYearOneBase": {
                                "val": "80.849"
                            },
                            "BudgetYearOne": {
                                "val": "80.849"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "74.476"
                            },
                            "CurrentYear": {
                                "val": "86.272"
                            },
                            "BudgetYearOneBase": {
                                "val": "80.849"
                            },
                            "BudgetYearOne": {
                                "val": "80.849"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "74.476"
                            },
                            "CurrentYear": {
                                "val": "86.272"
                            },
                            "BudgetYearOneBase": {
                                "val": "80.849"
                            },
                            "BudgetYearOne": {
                                "val": "80.849"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "CheckoutAndLaunch": {
                            "CostElementList": {
                                "CostElement": [
                                    {
                                        "Name": {
                                            "val": "WGS Block II Follow-On Checkout & Launch\/Launch Readiness"
                                        },
                                        "Cost": {
                                            "TotalCost": {
                                                "PriorYear": {
                                                    "val": "28.393"
                                                },
                                                "CurrentYear": {
                                                    "val": "23.682"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "26.878"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "26.878"
                                                }
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "WGS Block II Follow-On Storage, Reactivation and Transport"
                                        },
                                        "Cost": {
                                            "TotalCost": {
                                                "PriorYear": {
                                                    "val": "3.038"
                                                },
                                                "CurrentYear": {
                                                    "val": "17.556"
                                                }
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Command & Control System - Consolidated (CCS-C) WGS Block II Follow-On support"
                                        },
                                        "Cost": {
                                            "TotalCost": {
                                                "BudgetYearOneBase": {
                                                    "val": "0.208"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "0.208"
                                                }
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Technical Mission Analysis"
                                        },
                                        "Cost": {
                                            "TotalCost": {
                                                "PriorYear": {
                                                    "val": "9.468"
                                                },
                                                "CurrentYear": {
                                                    "val": "6.2"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "5.339"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "5.339"
                                                }
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "WGS Enterprise SE&I"
                                        },
                                        "Cost": {
                                            "TotalCost": {
                                                "PriorYear": {
                                                    "val": "1.596"
                                                },
                                                "CurrentYear": {
                                                    "val": "1.688"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "0.881"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "0.881"
                                                }
                                            }
                                        }
                                    }
                                ]
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "PriorYear": {
                                        "val": "42.495"
                                    },
                                    "CurrentYear": {
                                        "val": "49.126"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "33.306"
                                    },
                                    "BudgetYearOne": {
                                        "val": "33.306"
                                    }
                                }
                            },
                            "Name": {
                                "val": "WGS Block II Follow-On"
                            }
                        },
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "WGS Block II Follow-on Test Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.122"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.24"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.104"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.104"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "WGS Block II Follow-on Lincoln Labs"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.035"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.833"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.833"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Pathfinder COMSATCOM pooled bandwidth and demo"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "26"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "30"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "41"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "41"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "WGS Block II Follow-on A&AS"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "4.22"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "5.183"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5.011"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.011"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "FFRDC"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.639"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.688"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.595"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.595"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "31.981"
                                        },
                                        "CurrentYear": {
                                            "val": "37.146"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "47.543"
                                        },
                                        "BudgetYearOne": {
                                            "val": "47.543"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "WGS Block II Follow-On"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}