{
    "id": "2018-Navy-PB-1810N-MJBOOK-4-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-24",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "8161"
        },
        "LineItemTitle": {
            "val": "Enterprise Information Technology"
        },
        "P1LineNumber": {
            "val": "156"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Personnel & Command Support Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Command Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "274.274"
                },
                "PriorYear": {
                    "val": "95.094"
                },
                "CurrentYear": {
                    "val": "67.544"
                },
                "BudgetYearOneBase": {
                    "val": "19.789"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "19.789"
                },
                "BudgetYearTwo": {
                    "val": "22.3"
                },
                "BudgetYearThree": {
                    "val": "19.13"
                },
                "BudgetYearFour": {
                    "val": "18.547"
                },
                "BudgetYearFive": {
                    "val": "18.947"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "274.274"
                },
                "PriorYear": {
                    "val": "95.094"
                },
                "CurrentYear": {
                    "val": "67.544"
                },
                "BudgetYearOneBase": {
                    "val": "19.789"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "19.789"
                },
                "BudgetYearTwo": {
                    "val": "22.3"
                },
                "BudgetYearThree": {
                    "val": "19.13"
                },
                "BudgetYearFour": {
                    "val": "18.547"
                },
                "BudgetYearFive": {
                    "val": "18.947"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "274.274"
                },
                "PriorYear": {
                    "val": "95.094"
                },
                "CurrentYear": {
                    "val": "67.544"
                },
                "BudgetYearOneBase": {
                    "val": "19.789"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "19.789"
                },
                "BudgetYearTwo": {
                    "val": "22.3"
                },
                "BudgetYearThree": {
                    "val": "19.13"
                },
                "BudgetYearFour": {
                    "val": "18.547"
                },
                "BudgetYearFive": {
                    "val": "18.947"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "2.097"
                },
                "CurrentYear": {
                    "val": "0.172"
                },
                "BudgetYearOneBase": {
                    "val": "1.111"
                },
                "BudgetYearOne": {
                    "val": "1.111"
                },
                "BudgetYearTwo": {
                    "val": "0.154"
                },
                "BudgetYearThree": {
                    "val": "0.186"
                },
                "BudgetYearFour": {
                    "val": "0.175"
                },
                "BudgetYearFive": {
                    "val": "0.315"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Distance Support: A Navy Enterprise effort that combines people, processes and technology into a collaborative infrastructure without regard to geographic location. Distance Support (DS) is comprised of the following three components: Infrastructure, Content and Customer Relationship Management (CRM). Infrastructure provides the \"transport\" of DS applications and data to and from operating units and shore installations in support of various processes. Technology infrastructure also includes the data replication and shipboard IT servers that bring the DS functionality to the sailor. Content includes specific applications, systems and processes produced by various Navy communities of Interest. Customer Relationship Management (CRM) capabilities include the \"Navy 311\" Website, BMC Remedy Software, Shared Data Environment, Business Intelligence and Predictive Modeling software, Avaya telephony and Call Management System, and the Navy 311 Support Center, which is the hub of Distance Support, providing the single point of entry for support requests for fleet customers on a 24 hours per day, 7 days per week, 365 days per year basis (24\/7\/365).  The Navy Information Application Product Suite (NIAPS) is comprised of integrated hardware and GOTS software that coalesce various workstations, storage, servers, applications and content into a common environment for shipboard deployment.  NIAPS provides data compression and replication capability and is designed to re-host typically shore\/web-based applications afloat to minimize bandwidth and provide maximum capability.  NIAPS is comprised of nearly 40 applications and databases launched from a single Distance Support (DS) Portal on NIAPS server. NIAPS runs applications specifically tailored to individual afloat units for training, career management, maintenance, technical drawings, logistics, human resources, as well as morale and welfare support (Quality of life) which are produced by various Navy functional organizations. NIAPS gives a ship access to critical applications and data using internal shipboard networks, which is faster and cheaper than using external bandwidth and satellite time.\n  \nRisk Management Information: RMI program initiates transition of existing legacy and core safety programs and risk management systems, applications and data into a single Program of Record (POR). RMI capability consists of four distinct safety capabilities:  Streamlined Incident Reporting (SIR), Single Point of Entry (SPOE), Safety Program Management(SPM) and Analysis & Dissemination (A&D). \n\nData Center Consolidation (DCC): DCC procures and installs data center hardware, software, and licenses for established Navy Enterprise Data Centers (NEDCs) and other approved hosting locations as part of the Department of Defense's Information Technology efficiency to consolidate and standardize the Navy's Data Center footprint. DCC utilizes architecture, standards, and data strategy for enterprise solutions that leverage economies of scale for the consolidation of Navy Data Centers across the Department of the Navy. Oversight and execution of all DCC efforts are under the direction of Data Center and Application Optimization (DCAO) under Program Executive Office - Enterprise Information Systems (PEO EIS).\n\nTelephony Suite Replacement and Modernization:\nThe Department of Defense (DoD), Chief Information Officer (CIO) Memorandum of 5 November 2015 \"DoD CIO Capability Priorities for Fiscal Years 2018-2022\" lists as a priority, the modernization of network infrastructure to be regionally based, centrally managed and cyber secure. This includes migrating existing infrastructure from Time Division Multiplexing (TDM) to Internet Protocol (IP) based communications to enable Unified Capabilities (UC). Telephony procures and integrates Commercial-Off-The-Shelf (COTS) hardware and software to meet the DoD-CIO TDM to IP mandate for the Navy. All efforts are performed in accordance with policy and procedures set forth in Department of Defense Instruction (DoDI) 8100.03, Chairman of the Joint Chiefs of Staff Instruction (CJCSI) 6212.01 and CJCSI 6215.01D and DoD Unified Capabilities Requirement 2013. Program requirements include: Voice over Internet Protocol (VoIP), Voice over Secure Internet Protocol (VoSIP), Video Teleconferencing over Secure Internet Protocol (VTCoSIP), Telephony Unified Messaging System (TUMS), Regional Telephony Management System (RTMS), Navy Video Conferencing System (NVCS), NVCS Coalition (NVCS-C), Internet Protocol (IP) Trunking, Aegis Ashore, and Telephony systems infrastructure (e.g. cable plant). Telephony system installations and\/or upgrades occur at facilities in accordance with requirements as identified by Navy Information Forces (NAVIFOR), Office of the Chief of Naval Operations (OPNAV), and Missile Defense Agency (MDA) (i.e. FLTNOCs, Fleet Telecommunications sites, and Aegis Ashore Sites)."
        },
        "Justification": {
            "val": "The Base Level Information Infrastructure (BLII) nomenclature will be called Navy\/Marine Corps Intranet (NMCI) OCONUS in FY18.  NMCI OCONUS, along with related US Navy pier side infrastructure, will transition to the NGEN business model upon the award of the NGEN follow-on contract and will be executed out of LI 8164. Funding for NMCI OCONUS has been transferred to LI 8164 beginning in FY18.  This will allow the Naval Enterprise Networks (NEN) to function as common global network, through the institution of a single approved service operating model.\n\nDistance Support: In FY18, Distance Support Customer Relationship Management (DS-CRM) funds the procurement of new BMC Remedy Licenses (to support growth and use of Remedy and Shared Data Environment) for both NIPR and SIPR, Optimal Identity Management Licenses (Centralized and automated CAC authentication and authorization for all NAVY 311 applications), Hardware costs (for increased storage capacity at NEDC NOLA in support of growth of the Shared Data Environment caused by increased NAVY partnering and usage), and all the associated labor for the implementation, optimization, configuration, and integration of the listed software and hardware in environment.  FY18 also funds the procurement of Microsoft Windows 2012 and SQL Server 2012 licenses to support installation of NIAPS V3.0.  NIAPS V3.0 replaces NIAPS 2.4.X, which utilizes end-of-life software that is not PKI compliant, and meets newly established cybersecurity requirements to include renewal of ATOs within the RMF.  \n\nData Center Consolidation (DCC): In FY18, OPN funding will procure servers (encompassing both hardware and software components), ancillary equipment associated with the servers (racks, cables, switches, etc.), and integration and installation efforts as needed to meet additional hosting requirements as consolidated applications are hosted in approved hosting locations, and as a part of regular data center technical refresh. Regular technical refresh is required to maintain cyber security readiness and accreditation at the data centers under DCAO's purview.\n\nTelephony Suite Replacement and Modernization:  In FY18, the program will continue procurement and installation of Internet Protocol (IP)- based equipment in support of DoD's Everything over IP (EoIP) mandate and Telephony requirements including: Voice over Internet Protocol (VoIP), Voice over Secure Internet Protocol (VoSIP), Video Teleconferencing over Secure Internet Protocol (VTCoSIP), Telephony Unified Messaging System (TUMS), Regional Telephony Management System (RTMS), Navy Video Conferencing System (NVCS), NVCS Coalition (NVCS-C), Internet Protocol (IP) Trunking, Aegis Ashore, and Telephony systems infrastructure (e.g. cable plant). Telephony system installations and\/or upgrades occur at facilities in accordance with requirements as identified by Navy Information Forces (NAVIFOR), Office of the Chief of Naval Operations (OPNAV), and Missile Defense Agency (MDA) (i.e. FLTNOCs, Fleet Telecommunications sites, and Aegis Ashore Sites).\n\nFY18-FY22 procurement and installation unit cost variances are based on the location of the region\/site (CONUS,OCONUS), number of sites in the region, the various site architectures and requirements, the age and type of systems modernized, and user density (number of users). \n  \nTelephony quantities represent the number of regions that are being replaced\/modernized in the given Fiscal Year (FY). Each region has numerous sites with unit and installation costs varying based on the location of the region\/site (CONUS,OCONUS), number of sites in the region, the various site architectures and requirements, the age and type of systems modernized, and user density (number of users). Regions: CONUS: Southwest, Pacific Northwest, Southeast, Northeast, Mid-Atlantic. OCONUS: Western Pacific, Guantanamo, Europe, Middle East - Installation schedule reflects 6 months of integration and PITCO after delivery and prior to installation."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}