{
    "id": "2018-Navy-PB-1810N-MJBOOK-0-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-0",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "0110"
        },
        "LineItemTitle": {
            "val": "LM-2500 Gas Turbine"
        },
        "P1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Ship Propulsion Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "147.659"
                },
                "PriorYear": {
                    "val": "4.881"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "152.54"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "147.659"
                },
                "PriorYear": {
                    "val": "4.881"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "152.54"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "147.659"
                },
                "PriorYear": {
                    "val": "4.881"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "152.54"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Beginning in FY17 and out, The Department has consolidated all BLI 0110 LM2500 Gas Turbine requirements and efforts into the Surface Power Equipment (BLI 0131). \n\nThe FY 2016 funding request was reduced by $3.208 million to account for the availability of prior year execution balances.\n\nThe LM2500 Marine Gas Turbine and its associated Engineering Control Systems provide main propulsion for the Navy's surface combatants including the FFG 7 OLIVER HAZARD PERRY Class, CG 47 TICONDEROGA Class, DDG 51 ARLEIGH BURKE Class, and LCS Class. The LM2500 is composed of two major sub-assemblies: the gas generator and power turbine sections. It is coupled to the ship drive-train by a high speed coupling shaft. The LM2500+ Marine Gas Turbine and its associated Engineering Control Systems provide main propulsion power for the Navy's amphibious assault ships including the LHD-8 MAKIN ISLAND, LHA-6 and LHA-7.  The LM2500+ is composed of two major sub-assemblies: the gas generator and power turbine sections.  It is coupled to the ship drive-train by a high speed coupling shaft.  The control system for both engines provides for both local and remote engine operations. The budget funds the following:\n\n[P40A \/ GA009 MODIFICATION PROGRAM]: GA009 - MODIFICATION KIT PROGRAM\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nThis cost code procures modification kits listed below for the LM2500 Gas Turbine Engine. These modifications increase reliability and fleet readiness through component upgrades which improves the Mean Time Between Failure (MTBF). The modification kits are procured based on historical usage rates, re-packaged into individual kits, and sent to either a depot to be installed during engine overhauls or to Regional Maintenance Centers for installation. No procurement quantities are a result of procuring various kits of various costs. The kits included in the cost code are as follows:\n--Accelerometers (Vibration Monitor)\n-- Compressor Rear Frame Mid-flange Fastener installation \n-- C-Sump Lubrication Supply Line\n-- Power Turbine Upgraded Speed Sensor\n-- Improved Drain Shutoff Valve\n-- Turbine Mid-Frame Modification\n-- 7B Piping Modification\n--5-Element to 6-Element Pump Conversion\n--T5.4 Flexible Thermo Harness\n--Mid Flange Fastener\n\n[P40A \/ GA010 GAS GENERATOR]: GA010 - GAS GENERATOR\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nThis cost element procures the LM2500 single shank propulsion gas turbine for the DDG-51 & LCS-2 class ships and the LM2500+ single shank propulsion gas turbine for the LHD8 and LHA6-LHA8. The programs projected FY-18 in-service population of single shank propulsion gas turbine engines is estimated to be 382 due to new construction. Breakdown of ship class spare procurement is listed below. The procurement of these engines includes all required shipping\/storage containers. LM2500 gas generator procurements are presently scheduled to occur every other year. \n\nDDG LM2500 Single Shank \nBased on experience with 35 years of usage demand data on the LM2500 Engine and IAW 10 USC Sec. 2308, DFAR subpart 207.70 and DoDI 3110.06, a total of 36 spares are required to support the fleet requirements. Current onhand is 28 with a requirement for eight (8) additional gas generator units to be procured IAW projected class population in FY19.\n\nLCS 2 LM2500 Single Shank. \nBased on experience with 35 years of usage demand data on the LM2500 Engine and IAW 10 USC Sec. 2308, DFAR subpart 207.70 and DoDI 3110.06, a total of 3 spares are required to support the fleet requirements. Current onhand is 1 with one (1) procured in May FY12 which leaves the requirement for one (1) additional gas generator unit to be procured IAW projected class population in FY19.\n\nLHD8\/LHA6-LHA8 LM2500+ Single Shank.\nBased on experience with 35 years of usage demand data on the LM2500 Engine and IAW 10 USC Sec. 2308, DFAR subpart 207.70 and DoDI 3110.06, a total of 2 spares are required to support the fleet requirements. Current onhand is 1, which leaves the requirement for one (1) additional gas generator to be procured IAW projected class population. The program has budgeted to procure one (1) Power Turbine Assembly in FY18 to meet the baseline requirement. This engine represents a significantly different configuration than the standard LM2500 Single Shank Engine procured in previous fiscal years.\n\nLM2500 Hot Section Kits \nAre procured as required from the below list per quarterly failure analysis and maintained to replace High Pressure Turbine (HPT) components beyond economical repair (BER). Shortages of replacement blades increase engine repair turn-around time (RTAT) during engine refurbishment\/repair as a result of material shortages.\n\nProcurement quantities are a result of procuring various kits of various costs. The kits included in the cost code are as follows:\n--HPT Shrouds\n--HPT Seal Assembly\n--HPT Blades\n--HPT Nozzles\n--Compressor Blades\n\n[P40A \/ GA012 CONTROL SYSTEMS MODIFICATIONS]: GA012 - CONTROL SYSTEM MODIFICATIONS\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nThis cost code funds the procurement and installation of the Aft Steering Local Control Unit and Damage Control Hard Drives following control system modifications:\t\t\t\t\t\t\t\nAft steering local control unit single board computers are currently obsolete and require replacement.  \nInstallation is required to be completed on 24 ships. Installations do not require CNO availabilities.  Installations will be accomplished during pier side availability by NSWCCD Philadelphia.\t\t\t\t\t\nThere are 4 kits required per ship. The kits include the following hardware:  single board computer, daughter board, transceiver, power cables, and associated software packages.  \t\t\t\t\t\t\nCurrent Damage Control Workstation hard drives are currently obsolete and require replacement. In order to maintain commonality in configuration a one-time bulk buy in FY12 is required as vendor is phasing-out the production of this unit.\t\t\t\t\t\t\nInstallation is required to be completed on 24 ships. There are seven (7) hard drives required per ship. Installations do not require CNO availabilities.  Installations will be accomplished during pier side availability by NSWCCD Philadelphia.\n\n[P40A \/ GA015 LM2500 DIGITAL FUEL CONTROL]: GA015 - DIGITAL FUEL CONTROL (DFC)\t\t\t\t\t\t\t\t\t\t\nThis cost code procures the Digital Fuel Control (DFC) shipsets, ancillary equipment and install material to support the CG\/DDG modernization schedules. Procurement and installations are budgeted to correspond with CNO ship availabilities. One DFC Kit is required to upgrade each of the four LM2500 engines, which makes one DFC shipset.   \t\n\t\t\t\nThe DFC is the most significant change to the LM2500 engine since its inception into the USN that addresses obsolescence components which accounted for approximately 40% of all engine failures. This modification is estimated to be 75% more reliable than the old system. \n\t\t\t\t\t\t\t\t\nThis upgrade replaces the existing Hydro-mechanical main fuel control (MFC) system which was designed for aircraft; with a Digital Fuel Control (DFC) system designed for military marine environment. This modification increases engine reliability, decreases periodic maintenance, enhances operational functions, and provides an automatic stall detection and shutdown capability.\n\n[P40A \/ GA016 MANAGEMENT ENERGY INITIATIVES]: GA016 - MANAGEMENT ENERGY INITIATIVES\nFY15 funds for energy initiatives realigned to Surface Combatant HM&E, Ships Support Equipment and Maritime Energy Initiatives (BLI 0200, L7027) to more effectively meet the Departments energy initiatives goals.\n\n[P40A \/ GA830 PRODUCTION ENGINEERING]: GA830 - PRODUCTION ENGINEERING\t\t\t\t\t\t\t\t\t\nThe review and approval of any production contract technical documentation, or the separate development of this documentation to include Technical Manuals, Signal Flow Diagrams, Planned Maintenance System (PMS), Level III Production Drawings, Provisioning Technical Documentation (PTD), Program Support Data, Allowance Parts Lists (APL's) and engineering in support of final design reviews.\n\n[P3A \/ GA015 DIGITAL FUEL CONTROL SHIPSET]: GA015 - DIGITAL FUEL CONTROL (DFC)This cost element procures the Digital Fuel Control (DFC) shipsets, ancillary equipment and install material to support the CG\/DDG modernization schedules. \n\nOne DFC Kit is required to upgrade each of the four DDG class LM2500 engines, which makes one DFC shipset. \n\n  \nThe DFC is the most significant change to the LM2500 engine since its inception into the USN that addresses obsolescence components which accounted for approximately 40% of all engine failures. In summary this modification is estimated to be 75% more reliable than the old system.\n\nThis upgrade replaces the existing Hydro-mechanical main fuel control (MFC) system which was designed for aircraft; with a Digital Fuel Control (DFC) system designed for military marine environment. This modification increases engine reliability, decreases periodic maintenance, enhances operational functions, and provides an automatic stall detection and shutdown capability.\n\nDFC ship-set procurement cost are updated based on actual prior year contract award prices.\n\nGA6IN - INSTALLATION FOR DIGITAL FUEL CONTROL (DFC) GA015\nFY17 planned installation of the FY16 procured units will be reflected in the Surface Power Equipment (BLI 0131) exhibit.\n\nThis cost element funds the installation of Cost element GA015-Digital Fuel Control (DFC) shipsets as part of the CG\/DDG HM&E modernization program. This includes pre-assembly at NSWCCD Philadelphia, shipping to installation location, shipboard installation, training, post installation operational testing and associated travel cost."
        },
        "Justification": {
            "val": "Beginning in FY17 and out, The Department has consolidated all BLI 0110 LM2500 Gas Turbine requirements and efforts into the Surface Power Equipment (BLI 0131)."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}