{
    "id": "2018-WashingtonHeadquartersService-PB-0300D-JBOOK-e853ad2a7f2279ef7e034b1ceea77e383654b3270e3beb4340ad4e240297781d-0",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-DEFENSE_WHS-U_PROCUREMENT_JustificationBook_Washington_Headquarters_Service_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Washington_Headquarters_Service_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Washington Headquarters Service",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "31"
        },
        "LineItemTitle": {
            "val": "Major Equipment"
        },
        "P1LineNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Washington Headquarters Service"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, WHS"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "198.27"
                },
                "PriorYear": {
                    "val": "42.859"
                },
                "CurrentYear": {
                    "val": "24.979"
                },
                "BudgetYearOneBase": {
                    "val": "10.529"
                },
                "BudgetYearOne": {
                    "val": "10.529"
                },
                "BudgetYearTwo": {
                    "val": "0.501"
                },
                "BudgetYearThree": {
                    "val": "0.511"
                },
                "BudgetYearFour": {
                    "val": "0.521"
                },
                "BudgetYearFive": {
                    "val": "0.531"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "198.27"
                },
                "PriorYear": {
                    "val": "42.859"
                },
                "CurrentYear": {
                    "val": "24.979"
                },
                "BudgetYearOneBase": {
                    "val": "10.529"
                },
                "BudgetYearOne": {
                    "val": "10.529"
                },
                "BudgetYearTwo": {
                    "val": "0.501"
                },
                "BudgetYearThree": {
                    "val": "0.511"
                },
                "BudgetYearFour": {
                    "val": "0.521"
                },
                "BudgetYearFive": {
                    "val": "0.531"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "198.27"
                },
                "PriorYear": {
                    "val": "42.859"
                },
                "CurrentYear": {
                    "val": "24.979"
                },
                "BudgetYearOneBase": {
                    "val": "10.529"
                },
                "BudgetYearOne": {
                    "val": "10.529"
                },
                "BudgetYearTwo": {
                    "val": "0.501"
                },
                "BudgetYearThree": {
                    "val": "0.511"
                },
                "BudgetYearFour": {
                    "val": "0.521"
                },
                "BudgetYearFive": {
                    "val": "0.531"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "The program decrease reflects the functional transfer of resources ($-24.446 million) to the Defense Information System Agency (DISA) as they assume operational control of the Joint Information Technology Service Provider - Pentagon (JSP) in accordance with Deputy Secretary of Defense Directive Memorandum, Consolidation of Pentagon Information Technology Operations, dated, May 1, 2015.\n \nThis FY 2018 budget request funds procurement of physical security vehicles assigned to missions in high threat OCONUS locations.  Request reflects the life-cycle replacement cost for one Commercial Heavy Armored Vehicle (CHAV) that supports the Secretary of Defense, Deputy Secretary of Defense, and OSD Senior officials providing a secure and reliable ground transportation capability.  CHAVs are armored to various levels of protection and are on platforms of varying sizes and gross vehicle weights, dependent upon the level of threat and the operating environment.  In addition to the CHAVs request, the line item includes life-cycle replacement cost of information technology (IT) equipment which directly supports the mission of the Washington Headquarters Services White House Military Office (WHMO) that provides essential services to the President that helps to maintain continuity of operations (COOP).\n\nThis budget request also support a one-time FY 2018 increase of $10.0 million for near term requirements to protect critical facilities, assets, and mission from Unmanned Aircraft Systems (UAS) threats.  Funding will support capability development of a Counter-Unmanned Aircraft Systems (C-UAS);  documentation; operating concepts development; system and operation integration; employment tactics, and training at a Pentagon site.\n\nThe FY 2016 request includes $15.000 million for the Indian Financing Act.  The DOD Indian Incentive Program (IIP) is authorized by Section 504 of the Indian Financing Act of 1974 (U.S.C 1544).  In 1989, Congress began providing annual funds through the DOD Appropriation Act for the DOD Indian Incentive Program.  The program motivates prime contractors to utilize Indian organizations and Indian-owned economic enterprises by providing a 5% rebate on subcontracted work performed by those companies that fall into the following categories:  Federally Recognized American Indian Organizations, Indian-Owned economics enterprises and small businesses owned by members of recognized tribes, Alaskan Natives or Native Hawaiians.  Through the generation of subcontracts to the above mentioned entities, the IIP fulfills its purpose as an economic multiplier for Native American communities.  The Office of Small Business Programs has processed 120 rebate requests to contractors for utilizing Native American firms in 2016."
        },
        "Justification": {
            "val": "The FY 2018 budget request reflects the life-cycle replacement cost for one Commercial Heavy Armored Vehicle (CHAV) that supports the Secretary of Defense, Deputy Secretary of Defense, and OSD Senior officials.  The CHAVs provide a secure, protective and reliable ground transportation capability for the Secretary and Deputy Secretary of Defense.  Budget request also includes the modernization and life-cycle refresh cost of major information technology (IT) systems which are required to support the business and operational requirements of the Washington Headquarters Services White House Military Office (WHMO).  Additionally, the request include the one-time FY 2018 increase of $10.0 million required by the Department to comply with the FY 2017 National Defense Authorization Act (NDAA) which authorized protection of vital national strategic assets from Unmanned Aircraft Systems (UAS).  The funding will be applied to procure capabilities necessary to mitigate the threat that an unmanned aircraft poses to the safety and security of the Pentagon.  These capabilities include technologies that will facilitate the detection, monitoring, and tracking of UAS; issuance of warnings to a UAS operator; disruption of control of the UAS; and seizure of the UAS when appropriate.  Specifically, funding will address the emerging C-UAS force protection threat within the National Capital Region (NCR).  The Pentagon Force Protection Agency's (PFPA) C-UAS program will provide the capability to mitigate UAS threats within the NCR and will operate under three lines of effort: \n(1) Use of detection systems which will scan the airspace for low, slow and small (LSS) airborne targets and collect information such as radio frequency signatures. \n(2) Identification of radar signature data and electronic surveillance information essential to positive identification of UAS targets.  Once identification is made PFPA operators can confidently decide on which, if any, actions to take against the threat.  \n(3) Mitigation of hostile UAS using a variety of low-cost, low-risk ways using systems, which will jam communication links of the UAS and cause it to perform an emergency landing or return to its point of origin."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}