{
    "id": "2018-Army-PB-2033A-JBOOK-97766fb5efc36974a03ffece59c3d5581ef4425fe875bd1f1fb7d73a21f355ae-2",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_WTCV-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2033A",
        "appropriation_name": "Procurement of W&TCV, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "G85100"
        },
        "LineItemTitle": {
            "val": "Stryker Vehicle"
        },
        "P1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2033A"
        },
        "AppropriationTitle": {
            "val": "Procurement of W&TCV, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Tracked Combat Vehicles"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Tracked Combat Vehicles"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "14977.899"
                },
                "PriorYear": {
                    "val": "175.474"
                },
                "CurrentYear": {
                    "val": "71.68"
                },
                "Total": {
                    "val": "15225.053"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "14977.899"
                },
                "PriorYear": {
                    "val": "175.474"
                },
                "CurrentYear": {
                    "val": "71.68"
                },
                "Total": {
                    "val": "15225.053"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "14977.899"
                },
                "PriorYear": {
                    "val": "175.474"
                },
                "CurrentYear": {
                    "val": "71.68"
                },
                "Total": {
                    "val": "15225.053"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0203735A"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "175.474"
                                },
                                "CurrentYear": {
                                    "val": "71.68"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "175.474"
                    },
                    "CurrentYear": {
                        "val": "71.68"
                    }
                }
            }
        },
        "Description": {
            "val": "A dynamic asymmetric threat and operational environment demands full spectrum, strategically responsive, agile and dominant land forces.  Immediate response by a lethal, versatile, tactically agile joint force capable of operational maneuver is essential to fulfilling the Army's Warfighting needs.  The Stryker-equipped Brigade Combat Team (BCT) is this force.  The use of a common platform\/common chassis design reduces requirements for repair parts and logistics support in the area of operations.\nThe Stryker Brigade Combat Team (SBCT), equipped with Stryker Vehicles, can be used across the full spectrum of military operations.  The SBCT deploys rapidly and conducts effective combat operations immediately on arrival to prevent, contain, stabilize, or resolve a conflict through shaping and decisive operations.  Configurations of Stryker Vehicles are:\nInfantry Carrier:  The Infantry Carrier Vehicle (ICV) carries an infantry squad with individual equipment.  The ICV also provides protected transport and supporting fires for the infantry squad during dismounted assault.  \nReconnaissance Vehicle:  The Reconnaissance Vehicle (RV) provides force situational awareness, gathering and transmitting real time intelligence while moving throughout the battlefield in close, complex, and urban terrain.\nMobile Gun System:  The Mobile Gun System (MGS) supports dismounted infantry and engages the enemy in close combat in order to clear opposition and permit rapid movement, allowing the force to maintain the initiative, occupy and\/or secure key objectives, and defeat strong points.\nMortar Carrier:  The Mortar Carrier (MC) supports infantry units with screening obscurants, suppressive forces and on-call supporting fires.  120mm, 81mm, and 60mm mortars provide complementary capabilities with responsive, accurate and lethal indirect fire support to the dismounted infantry assault.\nCommander's Vehicle:  The Commander's Vehicle (CV) provides the brigade commanders and infantry battalion commanders with the means to receive data, analyze, prepare and transmit data, and control the forces\/functions carrying out combat missions.\nFire Support Vehicle:  The Fire Support Vehicle (FSV) provides automated enhanced surveillance, target acquisition, target identification, target tracking, target designation, position location, and communications functionality.  Targets will be transmitted instantly to the fire support system and shooter.\nEngineer Squad Vehicle:  The Engineer Squad Vehicle (ESV) provides maneuver\/mobility support capabilities which include obstacle clearing, in-stride breaching of surface mines, proofing of subsurface mines, and smoke generation for local protection.\nMedical Evacuation Vehicle:  The Medical Evacuation Vehicle (MEV) is the Battalion Aid Station for brigade units, providing treatment for serious injury and advanced trauma cases.\nAntitank Guided Missile Vehicle:  The Antitank Guided Missile Vehicle (ATGM) is the brigade's primary tank killing system.  The ATGM reinforces the brigade's infantry battalion, reinforces the brigade reconnaissance squadron, and provides long-range direct fire.\nNuclear, Biological, Chemical Reconnaissance Vehicle:  The Nuclear, Biological, Chemical Reconnaissance Vehicle (NBCRV) provides on the move and remote near-real-time nuclear, biological and chemical detection and surveillance to supply battlefield visualization of NBC hazards."
        },
        "Justification": {
            "val": "FY 2018 Base procurement dollars are in the amount of $.000 millions.\n\nDVH exchange vehicles procured in FY 2016 and prior did not increase the Stryker Family of Vehicles Army Acquisition Objective (AAO) of 3,788.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}