{
    "id": "2018-Army-PB-2034A-JBOOK-5aee815d00f2743bc26b1fd362b1fa251ab1150ad3a4a9b16cb13a13bf67f3ad-21",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_AMMO-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "E55400"
        },
        "LineItemTitle": {
            "val": "Demolition Munitions, All Types"
        },
        "P1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "47"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Ammunition"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "398.336"
                },
                "PriorYear": {
                    "val": "13.751"
                },
                "CurrentYear": {
                    "val": "12.753"
                },
                "BudgetYearOneBase": {
                    "val": "19.345"
                },
                "BudgetYearOne": {
                    "val": "19.345"
                },
                "BudgetYearTwo": {
                    "val": "40.575"
                },
                "BudgetYearThree": {
                    "val": "24.468"
                },
                "BudgetYearFour": {
                    "val": "20.739"
                },
                "BudgetYearFive": {
                    "val": "19.137"
                },
                "Total": {
                    "val": "549.104"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "398.336"
                },
                "PriorYear": {
                    "val": "13.751"
                },
                "CurrentYear": {
                    "val": "12.753"
                },
                "BudgetYearOneBase": {
                    "val": "19.345"
                },
                "BudgetYearOne": {
                    "val": "19.345"
                },
                "BudgetYearTwo": {
                    "val": "40.575"
                },
                "BudgetYearThree": {
                    "val": "24.468"
                },
                "BudgetYearFour": {
                    "val": "20.739"
                },
                "BudgetYearFive": {
                    "val": "19.137"
                },
                "Total": {
                    "val": "549.104"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "398.336"
                },
                "PriorYear": {
                    "val": "13.751"
                },
                "CurrentYear": {
                    "val": "12.753"
                },
                "BudgetYearOneBase": {
                    "val": "19.345"
                },
                "BudgetYearOne": {
                    "val": "19.345"
                },
                "BudgetYearTwo": {
                    "val": "40.575"
                },
                "BudgetYearThree": {
                    "val": "24.468"
                },
                "BudgetYearFour": {
                    "val": "20.739"
                },
                "BudgetYearFive": {
                    "val": "19.137"
                },
                "Total": {
                    "val": "549.104"
                }
            }
        },
        "Description": {
            "val": "This budget line includes Demolition Munitions, All Types.\n\n(E45403) Magneto-Inductive (MI) Firing Device Receiver (M40) has the capability of detonating a secondary explosive lead, an M7 non-electric military blasting cap or Modernized Demolition Initiator.  It is the receiver for the M156 Remote Firing Device, which can provide reliable wireless initiation of demolition charges through all mediums.  This items is Code A, approved for service use.\n\n(E45404) The M17A1 Receiver, Radio Frequency Remote Activation Munition System (RF-RAMS) (DODIC MP47) is a one-time use receiver that provides the un-tethered capability to wirelessly function\/initiate demolition charges or munitions up to and beyond 5 KM line-of-sight\/non line-of-sight, once it receives the correct programmed coded signal from the MK152 RF-RAMS transmitter.  The Receiver is programmed in the field by an RF-RAMS Transmitter and subsequently responds only to that transmitter.  The M17A1 Receiver is a single use item, which is capable of functioning non electric blasting caps or detonation cord.  This item is Code B, not approved for service use. \n\n(E50510) Demo Kit, Blasting:  Munition Array Charge, XM335, is the neutralizing component to the Standoff Robotic Explosive Hazard Detection System (SREHD), formerly known as the Autonomous Mine Detection System (AMDS).  SREHD provides increased survivability through mine and explosive hazards stand-off detection, marking and neutralization capability for the dismounted soldier.  The SREHD system is a single payload mounted on a Man Transportable Robotic System (MTRS) platform to conduct all phases of counter explosive hazard detection, marking, and neutralization missions without reconfiguration by combining the detect\/mark system with the ability to deploy a neutralizer.  To neutralize explosive hazards, the SREHD payload deploys the XM335, a three shape charge array, on top of the target.  The shape charges are tailored to penetrate overburden, casing and impact detonate the explosive fill.  The neutralizer is detonated using the existing Remote Activation Munition System (RAMS), along with the M50 Shock Tube Initiator.  The SREHD system is currently in Engineering Manufacturing Development (EMD), with Milestone (MS) C\/Type Classification (TC) Standard in 4th Quarter FY 2017 for Low Rate Initial Production (LRIP) and Full Material Release (FMR) in 4th Quarter FY 2018 for Full Rate Production (FRP).  This item is Code B, not approved for service use until Type Classification Standard and Full Material Release.\n\n(E50601) Charge Demolition Block Comp C-4 1-1\/4 LB M112 is the primary demolition explosive used by the U.S. Army.  The M112 Demolition Block is used for general demolition and, in particular, for destruction of captured enemy ammunition.  The block demolition charge consists of 1-1\/4 pounds of composition C-4 plastic explosive packed in a Mylar-film bag.  Pressure sensitive adhesive tape is provided on one of the rectangular surfaces, allowing quick emplacement by the individual soldier on the object to be destroyed.  The explosive may be cut and\/or removed from its wrapper and hand molded into a desired shape suited to the target.  Upon detonation, the shock wave destroys the target by cutting, breaching or cratering.  This item is Code A, approved for service use.\n\n(E51400) M186 Demolition Charge is a 50 foot roll of flexible explosive.  It is 3 inches wide and 1\/4 inch thick.  It can be easily cut and formed into various shapes and is primarily used as a cutting charge.  This item is Code A, approved for service use.\n\n(E52000) The M4A1 Selectable Light Weight Attack Munition (SLAM) is a multipurpose munition designed to be readily portable and hand-emplaced against lightly armored vehicles, parked aircraft, wheeled or tracked support vehicles, and ammunition or fuel storage sites.  The SLAM can be used either day or night during all weather conditions. Man-in-the-loop is required in all attack modes.  The improved M4A1 SLAM has several producibility  and safety enhancements; these include charges to the mode\/time selector switch, housing base and cover assembly and passive sensor assembly.  A battery bleed resistor was added for improved safety.  This item is Code A, approved for service use.\n\n(E52500) Cap Blasting Electric M6 is used to initiate high explosives.  It is initiated by an electrical charge from a blasting machine or other source of electric power.  Blasting cap M6 consists of a base charge of RDX, an intermediate charge of lead azide and an ignition charge of smokeless powder, potassium chlorate and lead salt of dinitro cresol in an aluminum alloy cup.  Two 12-foot lead wires, connected by a bridge wire in the ignition charge, extend through a rubber plug assembly in the open end of the cup.  This item is Code A, approved for service use.\n\n(E54100) Detonating Cord is used to prime and detonate explosive charges.  Unlike the time fuze, which burns slowly, detonating cord burns almost instantaneously.  It is used to link a series of near simultaneous charges.  The Type 1, Class E detonating cord consists of a core of high velocity explosive in a seamless textile tube.  The tube is covered with a thin layer of asphalt and sheathed in an outer cover of plastic coated textile.  The plastic outer cover is smooth and colored olive drab.  This item is Code A, approved for service use.\n\n(E56500) Time Blasting Fuze M700 is used to initiate an M7 non-electric blasting cap, which in turn initiates a main charge.  It is ignited with an M60 or M81 firing device.  The fuze is olive drab with a single yellow band spaced every 18 inches, and a double yellow band spaced every 90 inches to enable the soldier to cut the desired length of fuze without additional measuring tolls.  The soldier attaches the fuze to the blasting cap with crimping pliers.  This item is Code A, Approved for service use.\n\n(E59100) The Cartridge Impulse Electrically Initiated is used in Explosive Ordnance Disposal (EOD) tools and equipment.  It is an electrically initiated, gas producing device.  It is initiated with an MK1-2 squib in place of the percussion primer.  This item is Code A, approved for service use.\n\n(E76701) The Cutter, High Explosive MK23 MOD 1, is an Explosive Ordnance Disposal (EOD) tool.  It is initiated with a blasting cap and uses an explosive formed penetrator to disable a target munition.  This item is restricted in the Army to EOD use only.  This item is Code A, approved for service use.\n\n(E76702) The Cutter, High Explosive MK24 MOD 1, is an Explosive Ordnance Disposal (EOD) tool.  It is initiated with a blasting cap and uses an explosive formed penetrator to disable a target munition.  This item is restricted in the Army to EOD use only.  This item is Code A, approved for service use.\n\n(E76728) MK 788-0, Main Charge Disrupter is a device used to render-safe unexploded ordnance (UXO).  Upon initiation, the device attacks and neutralizes the main charge explosive by generating reactions up to and including low-order detonations. It is a non-developmental item (NDI) consisting of an energetic tool (ET), a demolition material interface adapter, and an emplacement stand.   The MCD provides EOD with an improved neutralization capability in situations where the use of more traditional methods (attacking the fuzing mechanism or high-order detonation) is not possible or desired.  This item is Code B, not approved for service use.\n\n(E78201) The M980 Demolition Charge is a 20 pound, 38 foot roll of flexible explosive.  It is 10 inches wide and .083 inches thick.  It can be easily cut and formed into various shapes and is primarily used as a cutting charge.  This item is Code A, approved for service use.\n\n(E81302) Cap Blasting Non-Elec, W\/30 ft Shock Tube is part of the family of Modern Demolition Initiators (MDI).  It consists of a blasting cap which is factory sealed to a length of shock tube.  The tube is activated using an M81 igniter.  A shock wave travels the length of the tube, with a delay measured in milliseconds, and ignites the blasting cap which in turn initiates the main charge.  The MDI is not susceptible to electrostatic discharge or Radio Frequency (RF) jamming.  The 30 foot length is generally used as a linking charge for a series of demolitions.  This item is Code A, approved for service use.\n\n(E81307) Igniter, Time Fuze and Shock Tube, M81 is a device, hand held by the individual Soldier, with a small primer charge that will activate the M700 Time Fuze as well as a shock tube.  It is the primary device for all non-electrical demolition initiation.  This item is Code A, approved for service use.\n\n(E99903) Blast Cap, Non-Elec: 500Ft Minitube, M21 is part of the family of Modern Demolition Initiators (MDI).  It consists of an initiating component used to activate standard military explosives and demolition devices.  The MDI is not susceptible to electrostatic discharge or Radio Frequency (RF) jamming.  This item is Code A, approved for service use.\n\n(E99905) Blast Cap, Non-Elec, 1000Ft Minitube, M23 is part of the family of Modern Demolition Initiators (MDI).  It consists of an initiating component used to activate standard military explosives and demolition devices.  The MDI is not susceptible to electrostatic discharge or Radio Frequency (RF) jamming.  This item is Code A, approved for service use."
        },
        "Justification": {
            "val": "2018 Base Budget support critical Army Title 10 war reserve\/operational, training, and test requirements IAW DoD Instruction 3000.04 (Munitions Requirements Process) and AR 5-13 (Total Army Munitions Requirements Process and Prioritization System).  War reserve requirements support OSD-approved Combatant Commander Operational Plans, Homeland Defense, and other OSD-directed missions.  Training requirements support individual and collective training of Active and Reserve Component forces at Army schools, home station and the combined training centers.  Test requirements support the development, fielding, safety and quality assurance of Army munitions and equipment throughout their life-cycle.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities. \n\nThe FY 2018 Base procurement dollars in the amount of $19.345 million supports production of 14 variants of Demolitions.\n\n(E45403) Magneto-Inductive (MI) Firing Device Receiver (M40) \nThis is a training standard item used in training and combat. Request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals.\nTYPE CLASSIFICATION DATE:  June 2011  \n\n(E45404) M17A1 Receiver, Radio Frequency Remote Activation Munition System (RF-RAMS)\nThis is a training standard item used in training and combat.  The FY 2018 request supports annual training and builds a war reserve in accordance with the Army's procurement goals.\nFY 2018  Base procurement dollars in the amount of $1.200 million supports the production of RF-RAMS.\nTYPE CLASSIFICATION DATE: 2001\n\n(E50510) Demo Kit, Blasting:  Munition Array Charge, XM335\nThis is a training standard item used in both training and combat.  The FY 2018 request supports annual training and builds a war reserve inventory in accordance with Army’s procurement goals.\nFY 2018 Base procurement dollars in the amount of $1.586 million supports the production of 348 XM335 Munition Array Charges. E50510 is a new start in FY 2018.\nTYPE CLASSIFICATION DATE: 2019\n\n(E50601) Charge Demo BLK Comp C-4 1-1\/4 LB M112\nThis is a training standard item used in training and combat.  FY 2018 request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals.\nFY 2018  Base procurement dollars in the amount of $0.200 million supports the production of 4,535 Demolitions Blocks, C-4.\nTYPE CLASSIFICATION DATE:  1964\n\n(E51400) M186 Demolition Charge\nThis is a training standard item used in training and combat.  The FY 2018 request supports annual training and builds a war reserve in accordance with the Army's procurement goals.\nFY 2018  Base procurement dollars in the amount of $1.500 million supports the production of 19,959 Demolition Charges. E51400 is a new start in FY 2018.\nTYPE CLASSIFICATION DATE:  1968\n\n(E52000) Selectable Light Weight Attack Munition (SLAM) \nThis is a training standard item used in training and combat.  The FY 2018 request supports annual training and builds a war reserve in accordance with the Army's procurement goals.\nFY 2018  Base procurement dollars in the amount of $0.816 million supports the production of SLAMs. E52000 is a new start in FY 2018.\nTYPE CLASSIFICATION DATE:  2011\n\n(E52500) Cap, Blasting Electric M6\nThis is a training standard item used in training and combat.  The FY 2018 request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nFY 2018  Base procurement dollars in the amount of $1.641 million supports the production of 43,501 Blasting Caps.\nTYPE CLASSIFICATION DATE:  January 1960\n\n(E54100) Detonating Cord, Type 1\nThis is a training standard item used in training and combat.  FY 2018 request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals. \nFY 2018 Base procurement dollars in the amount of $3.300 million supports the production of 7.114 million feet of Type 1 Detonating Cord.\nTYPE CLASSIFICATION DATE:  1958\n\n(E56500) Time Blasting Fuze M700\nThis is a training standard item used in training and combat.  The FY 2018 request supports annual training and builds a war reserve in accordance with the Army's procurement goals.\nFY 2018  Base procurement dollars in the amount of $0.350 million supports the production of 269,829 Blasting Fuzes. E56500 is a new start in FY 2018.\nTYPE CLASSIFICATION DATE:  January 1958\n\n(E59100) The Cartridge Impulse Electrically Initiated is used in Explosive Ordnance Disposal (EOD) tools and equipment.\nThis is a training standard item used in training and combat.  FY 2018 request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals. \nFY 2018 Base procurement dollars in the amount of $1.033 million supports production of 8,131 Cartridges.\nTYPE CLASSIFICATION DATE:  EOD Item Navy Configured\n\n(E76701) Cutter High Explosive MK23, MOD 1, is an Explosive Ordnance Disposal (EOD) tool.\nThis is a training standard item used in training and combat. Request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nTYPE CLASSIFICATION DATE:  EOD Item Navy Configured\n\n(E76702) Cutter High Explosive MK24, MOD 1, is an Explosive Ordnance Disposal (EOD) tool.  \nThis is a training standard  item used in training and combat. Request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nTYPE CLASSIFICATION DATE:  EOD Item Navy Configured\n\n(E76728) MK 788-0, Main Charge Disrupter \nThis is a training standard item used in training and combat.  FY 2018 request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals.\nFY 2018 Base procurement dollars in the amount of $0.064 million supports procurement of 94 Disrupters.\nTYPE CLASSIFICATION DATE:  EOD Item Navy Configured\n\n(E78201) M980 Demolition Charge, 38 foot Sheet Explosive\nThis is a training standard item used in training and combat. FY 2018 request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nFY 2018 Base procurement dollars in the amount of $1.200 million supports production of 34,235 feet of Sheet Explosive.\nTYPE CLASSIFICATION DATE:  EOD Item Navy Configured\n\n(E81302) Cap Blasting Non-Electric, W\/30 ft Shock Tube is part of the family of Modernized Demolition Initiators.\nThis is a training standard item used in training and combat.  Request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nTYPE CLASSIFICATION DATE:  April 1996\n\n(E81307) Igniter, Time Fuze and Shock Tube, M81\nThis is a training standard item used in training and combat.  FY 2018 request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nFY 2018 Base procurement dollars in the amount of $1.058 million supports production of 155,992 Igniters.\nTYPE CLASSIFICATION DATE:  April 1996\n\n(E99903) Blast Cap, Non-Elec: 500Ft Minitube, M21 is part of the family of Modern Demolition Initiators (MDI).\nThis is a training standard item used in training and combat.  FY 2018 request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nFY 2018 Base procurement dollars in the amount of $2.647 million supports production of 34,555 Blasting Caps.\nTYPE CLASSIFICATION DATE:  April 1996\n\n(E99905) Blast Cap, Non-Elec, 1000Ft Minitube, M23 is part of the family of Modern Demolition Initiators (MDI).\nThis is a training standard item used in training and combat.  FY 2018 request supports annual training and builds a war reserve inventory in accordance with Army's procurement goals.\nFY 2018 Base procurement dollars in the amount of $2.750 million supports production of 23,999 Blasting Caps.\nTYPE CLASSIFICATION DATE:  April 1996"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}