{
    "id": "2018-DefenseInformationSystemsAgency-PB-0300D-MJBOOK-0-4-f493bd49acb663123319abf9e9622e7af0a48001ec2f966bf479cfd2f59006dd-3",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-DEFENSE_VOL1_ALL-U_PROCUREMENT_MasterJustificationBook_Defense-Wide_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Defense-Wide_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "17"
        },
        "LineItemTitle": {
            "val": "Net Centric Enterprise Services (NCES)"
        },
        "P1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DISA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "16.06"
                },
                "PriorYear": {
                    "val": "1.819"
                },
                "CurrentYear": {
                    "val": "1.634"
                },
                "BudgetYearOneBase": {
                    "val": "1.161"
                },
                "BudgetYearOne": {
                    "val": "1.161"
                },
                "BudgetYearTwo": {
                    "val": "1.026"
                },
                "BudgetYearThree": {
                    "val": "0.969"
                },
                "BudgetYearFour": {
                    "val": "1.085"
                },
                "BudgetYearFive": {
                    "val": "1.346"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "16.06"
                },
                "PriorYear": {
                    "val": "1.819"
                },
                "CurrentYear": {
                    "val": "1.634"
                },
                "BudgetYearOneBase": {
                    "val": "1.161"
                },
                "BudgetYearOne": {
                    "val": "1.161"
                },
                "BudgetYearTwo": {
                    "val": "1.026"
                },
                "BudgetYearThree": {
                    "val": "0.969"
                },
                "BudgetYearFour": {
                    "val": "1.085"
                },
                "BudgetYearFive": {
                    "val": "1.346"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "16.06"
                },
                "PriorYear": {
                    "val": "1.819"
                },
                "CurrentYear": {
                    "val": "1.634"
                },
                "BudgetYearOneBase": {
                    "val": "1.161"
                },
                "BudgetYearOne": {
                    "val": "1.161"
                },
                "BudgetYearTwo": {
                    "val": "1.026"
                },
                "BudgetYearThree": {
                    "val": "0.969"
                },
                "BudgetYearFour": {
                    "val": "1.085"
                },
                "BudgetYearFive": {
                    "val": "1.346"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0303170K"
                }
            ]
        },
        "Description": {
            "val": "DISA provides a portfolio of services that includes legacy capabilities delivered by the Net-Centric Enterprise Services (NCES) Program supporting a resilient and flexible infrastructure that enables a collaborative environment for secure information sharing across the Department of Defense (DoD). These critical warfighter, Business, and Intelligence Mission Area services enable more than two million authorized DoD users to collaborate across the Combatant Commands (COCOMs)\/Services\/Joint Staff\/Agency\/Mission Partners using a suite of web-accessible services. The portfolio also includes the DoD Visitor service that transitioned from a Government developed service to a Commercial-Off-the-Shelf annual right-to-use licensed service operating on domain controllers throughout the DoD.  This service allows personnel to \"go anywhere within the DoD, login, and be productive\".  It includes the privilege management Authentication Gateway Services (AGS) and the DoD Enterprise Portal Service.  The AGS is integrated with the Identity and Access Management services supporting brokered Public Key Infrastructure (PKI) authentication for DoD applications without a native PKI authentication capability.  The DoD Enterprise Portal Service provides users with a flexible web-based hosting solution to create and manage mission, community, organization, and user focused sites.  The individual suite of capabilities within the portfolio of services provides the user with the flexibility to couple the services in varying ways to support their mission needs. This flexibility provides unprecedented secure access to web and application content, critical imagery, intelligence and warfighter information from anywhere, at any time, on any DoD authorized device. The portfolio of enterprise services delivers tangible benefits to the Department by providing capabilities that are applied by the US Forces, Coalition forces, and Allied forces to support full spectrum joint and expeditionary campaign operations. These enabling benefits include the ability to:\n\n• Enhance collaborative decision-making processes\n• Improve information sharing and integrated situational awareness\n• Share and exchange knowledge and services between enterprise units and commands\n• Share and exchange information between previously unreachable and unconnected sources\n• Schedule and coordinate meetings with people across the DoD Components\n• \"Go anywhere in the DoD, login, and be productive\"\n• Create and manage mission, community, organization, and user-focused sites from global locations\n• Exchange knowledge to enable situational awareness, determine the effects desired, select a course of action, the forces to execute it, and accurately assess the effects of that action\n\nThe portfolio contains capabilities that are also key enablers to the Defense Information Systems Agency's (DISA) mission of providing a global net-centric enterprise infrastructure in direct support of joint Warfighter, National level leaders, and other mission and coalition partners across the full spectrum of operations."
        },
        "Justification": {
            "val": "FY 2016: ($1.819)  Procured the two-year full text search licenses to maintain the Enterprise Search centralized and federated discovery capabilities at their current levels and the Enterprise Catalog hosting for the current number of document artifacts on the Secret IP Data network.\n\nFY 2017: ($1.634) Will procure the annual right-to-use license for DoD Visitor that is provided for use on domain controllers throughout the Department and supports the users ability to go anywhere within the DoD, login, and be productive on the Classified and Unclassified networks.\n\nExplanation of Change from FY 2016 to FY 2017: The decrease of -$0.185 between FY 2016 and FY 2017 is attributable to the decommissioning of Enterprise Search\/Catalog along with a projected reduction in license cost for the DoD Visitor right-to-use licenses.\n\nFY 2018: ($1.161) Will procure the annual right-to-use license for DoD Visitor that is provided for use on domain controllers throughout the Department and supports the users ability to go anywhere within the DoD, login, and be productive on the Classified and Unclassified networks.\n\nExplanation of Change from FY 2017 to FY 2018: The decrease of -$0.473 between FY 2017 and FY 2018 is attributable to completing the transition to the COTS solution on the Classified and Unclassified Networks and projected reduction in license costs as the contract is recompeted.\n\nPerformance Metrics:\nUsage - Transition all domain controllers using the DoD Visitor Government-Off-the-Shelf DoD Visitor software solution throughout the Department to the commercial solution, Pro-V, without impacting the users ability to go anywhere in the DoD, get access to the local network, and access services from their home station using a web browser.\n\nFY 2016 (Results): While the number of artifacts in the Enterprise Catalog remained stable, the usage declined as customers prepared for the services decommissioning. However, the performance remained at the same high level as before. Customers began registering on the DoD Visitor team site as plans for the transition to the DoD Visitor commercial solution got underway.\n\nFY 2017 (Plan): Complete the transition of DoD Visitor software on the Classified and Unclassified Networks.\n\nFY 2018 (Estimated): Monitor the DoD Visitor team site for the identification of needed enhancements and the collection of those requirements by the contractor; ensure the enhancements are delivered on the 6-month schedule and that they meet the customer's requirements and cybersecurity expectations. \n\nIncreased Usage - Scale the enterprise service to meet data owner's demand for usage of the Enterprise Catalog, users demand for stable and improved search performance, and integration of additional federated endpoints into the Enterprise Search service."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}