{
    "id": "2018-DefenseThreatReductionAgency-PB-0300D-MJBOOK-0-0-096c1483006bda142416187e5d3c2873f7a4d7a227a00334f3efcc942962cf18-1",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-DEFENSE_DTRA-U_PROCUREMENT_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "30"
        },
        "LineItemTitle": {
            "val": "Other Major Equipment"
        },
        "P1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "23"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, Defense Threat Reduction Agency"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "58.146"
                },
                "PriorYear": {
                    "val": "5.474"
                },
                "CurrentYear": {
                    "val": "6.437"
                },
                "BudgetYearOneBase": {
                    "val": "12.363"
                },
                "BudgetYearOne": {
                    "val": "12.363"
                },
                "BudgetYearTwo": {
                    "val": "6.448"
                },
                "BudgetYearThree": {
                    "val": "6.551"
                },
                "BudgetYearFour": {
                    "val": "6.684"
                },
                "BudgetYearFive": {
                    "val": "6.819"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "58.146"
                },
                "PriorYear": {
                    "val": "5.474"
                },
                "CurrentYear": {
                    "val": "6.437"
                },
                "BudgetYearOneBase": {
                    "val": "12.363"
                },
                "BudgetYearOne": {
                    "val": "12.363"
                },
                "BudgetYearTwo": {
                    "val": "6.448"
                },
                "BudgetYearThree": {
                    "val": "6.551"
                },
                "BudgetYearFour": {
                    "val": "6.684"
                },
                "BudgetYearFive": {
                    "val": "6.819"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "58.146"
                },
                "PriorYear": {
                    "val": "5.474"
                },
                "CurrentYear": {
                    "val": "6.437"
                },
                "BudgetYearOneBase": {
                    "val": "12.363"
                },
                "BudgetYearOne": {
                    "val": "12.363"
                },
                "BudgetYearTwo": {
                    "val": "6.448"
                },
                "BudgetYearThree": {
                    "val": "6.551"
                },
                "BudgetYearFour": {
                    "val": "6.684"
                },
                "BudgetYearFive": {
                    "val": "6.819"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Other Major Equipment Procurement Program provides for the modernization of DTRA core computing technologies, including information technology infrastructure upgrades to ensure interoperability and compliance with the Joint Information Environment Regional Security Stacks.  The investment allows for focused enhancement of the Agency-wide Cybersecurity, Computer Network Defense, Network Operations and Security Center capabilities in compliance with Department of Defense Directive 8500.01, \"Cybersecurity,\" dated March 14, 2014, and the continuous monitoring capabilities mandated by Department of Defense Instruction 8510.01, Change 1, \"Risk Management Framework,\" dated May 24, 2016."
        },
        "Justification": {
            "val": "FY 2016 funding of $5,474 thousand resourced the procurement and integration of an Audio Visual\/Video Teleconference (AV\/VTC) Knowledge Wall (KW) system in the Alternate Joint Operations Center for support of contingency operations.  Deliverables included load balancers supporting backup capability and information assurance related equipment for enhanced Defense Integration and Management of Nuclear Data Services (DIAMONDS) system audit and forensics capabilities.  This budget also supported procurement of graphic processing unit capable servers, enhancements for mission-scalable and rapidly deployable computational capability of virtualized applications, desktops, and associated capabilities to make better use of the DoD high performance computing assets.  The FY 2016 budget provided continued support to the Nuclear Arms Control Technology (NACT) program for International Monitoring System (IMS) recapitalization, component replenishment\/replacement, and monitoring system acquisition to meet on-going operational responsibilities.\n\nFY 2017 funding of $6,437 thousand supports acquisition of Information Technology Infrastructure core routing and switching required to maintain basic connectivity integrity to ensure domain security and viability.  FY 2017 resources also support DTRA Experimentation Lab\/Reachback systems to conduct experimental computing, procurement of Chemical Biological (CB) analytical equipment for CB WMD search missions, and lifecycle replacement of the primary DIAMONDS Enterprise server equipment located at DTRA, Fort Belvoir, Virginia.  The FY 2017 budget continues to support the NACT program for IMS component replenishment and monitoring system acquisition necessary to meet on-going operational responsibilities.\n\nThe FY 2018 budget will resource a one-time replacement of DTRA's classified network cable plant infrastructure that is obsolete.  FY 2018 funding will continue to support acquisition of Information Technology Infrastructure core routing and switching, DTRA Experimentation Lab\/Reachback systems, CB analytical equipment for CB WMD search missions, and the life-cycle replacement of DIAMONDS Enterprise server equipment located at Kirtland Air Force Base, New Mexico.  In FY 2018, DTRA will continue its support for the NACT program's IMS component replenishment and monitoring system acquisition.  This is necessary to meet on-going operational responsibilities in support of the Comprehensive Nuclear Test Ban Treaty's IMS and the U.S. Government's nonproliferation objectives related to implementation, compliance, monitoring, and inspection for nuclear arms control activities.\n\nThe increase from FY 2017 to FY 2018 is due to a one-time cost for cable plant infrastructure life-cycle replacement necessary to bring the cable plant up to current industry standards.  The existing cable connectors, which were installed in DTRA facilities a decade ago, are no longer manufactured, supported, or available on the market, causing compatibility issues with new end-user devices as well as network switching and routing equipment."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "category"
            }
        }
    }
}