{
    "id": "2018-Navy-PB-1109N-MJBOOK-0-0-6b2000f9111b6178e144100c1843f0feab54d2ff64037d5a22d994b135e5a122-55",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_MARINECORPS-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "6545"
        },
        "LineItemTitle": {
            "val": "Family of Internally Trans Veh (ITV)"
        },
        "P1LineNumber": {
            "val": "59"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "General Property"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "82.4"
                },
                "PriorYear": {
                    "val": "18.638"
                },
                "CurrentYear": {
                    "val": "9.654"
                },
                "BudgetYearOneBase": {
                    "val": "1.583"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.583"
                },
                "BudgetYearTwo": {
                    "val": "0.633"
                },
                "BudgetYearThree": {
                    "val": "0.669"
                },
                "BudgetYearFour": {
                    "val": "6.691"
                },
                "BudgetYearFive": {
                    "val": "8.713"
                },
                "Total": {
                    "val": "128.981"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "82.4"
                },
                "PriorYear": {
                    "val": "18.638"
                },
                "CurrentYear": {
                    "val": "9.654"
                },
                "BudgetYearOneBase": {
                    "val": "1.583"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.583"
                },
                "BudgetYearTwo": {
                    "val": "0.633"
                },
                "BudgetYearThree": {
                    "val": "0.669"
                },
                "BudgetYearFour": {
                    "val": "6.691"
                },
                "BudgetYearFive": {
                    "val": "8.713"
                },
                "Total": {
                    "val": "128.981"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "82.4"
                },
                "PriorYear": {
                    "val": "18.638"
                },
                "CurrentYear": {
                    "val": "9.654"
                },
                "BudgetYearOneBase": {
                    "val": "1.583"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.583"
                },
                "BudgetYearTwo": {
                    "val": "0.633"
                },
                "BudgetYearThree": {
                    "val": "0.669"
                },
                "BudgetYearFour": {
                    "val": "6.691"
                },
                "BudgetYearFive": {
                    "val": "8.713"
                },
                "Total": {
                    "val": "128.981"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206623M"
                }
            ]
        },
        "Description": {
            "val": "The Family of Internally Transportable Vehicles (FITV) are light weight and internally transportable in the V-22, CH-53D & CH53E helos. The FITV provides deployed Marine Air-Ground Task Force (MAGTF) and Marine Expeditionary Unit (Special Operations Capable) (MEU SOC) with vehicles which are internally transportable in selected rotary and fixed wing aircraft.  The FITV expeditionary vehicles supporting over-the-horizon amphibious operations, irregular warfare and enhanced company operations.  The vehicles are fielded to infantry and reconnaissance, Marine Corps Forces Special Operations Command (MARSOC), and artillery batteries as part of the Expeditionary Fire Support System (EFSS). The FITV also provides Special Operations Forces (SOF) with a platform to support their primary and secondary missions.  Speed, maneuverability, and the use of cover and concealment are the crew's primary means of survival. \n \nThe ITV Improvement Initiative (I-Cubed) is an Abbreviated Acquisition Program (AAP) that provides product improvement to the FITV Fleet to address safety and reliability issues. Pre-induction repairs will bring the vehicle to condition code A. The ITV modification kits consist of upgrades such as cable assemblies, occupant restraint system, suspension and drivetrain. Condition code A and the ITV modification kits will maintain or improve readiness, and safety to the fleet. \n\nIn FY20 the Marine Corps will establish the Internally Transportable Vehicle Replacement (ITV-R) initiative. The ITV-R will begin to replace the current Family of Internally Transportable Vehicles (FITV) and  Utility Task Vehicle (UTV).The ITV-R will be a multirole vehicle providing a deployed Special Purpose Marine Air-Ground Task Force (SP MAGTF) and Marine Expeditionary Unit(Special Operations Capable) (MEU (SOC)) with an internally transportable vehicle to support over-the-horizon amphibious operations, irregular warfare and enhanced company operations. It will provide support to the Artillery Expeditionary Fire Support System (EFSS), Reconnaissance, Infantry and Marine Corps Forces Special Operations Command (MARSOC).  This capability will be employed by Marine Corps forces they execute heliborne and tiltrotor operations.\n\nIn FY16, Congress approved an Above Threshold Reprogramming (ATR) to procure Utility Task Vehicle (UTV) to fill a capability gap in motorized logistics sustainment\/casualty evacuation (CASEVAC) for Marine Corps infantry units.  The UTV provides infantry battalions with a reliable, easily maintained, inexpensive vehicle to support dispersed and disaggregated operations in support of the future concepts outlined in Expeditionary Force-21 (EF-21).  This capability will be employed by the helo companies of the MEUs and SP MAGTFs as they execute heliborne and tiltrotor operations.  This commercial off the shelf (COTS) solution will mitigate the infantry battalion support gap, with the ability to operate in remote, rural regions where currently fielded ground mobility platforms are unsuitable due to size, weight, and safety concerns."
        },
        "Justification": {
            "val": "FY 2018 Base Appropriation Request: $1.583M active\n\nFunding will provide for the pre-induction repairs and the kit installations for the final ITV Improvement Initiative (I-Cubed) vehicles, as well as technical documentation, which provide product improvement to the FITV Fleet to address safety and reliability issues. The decrease of ($8.071M) from FY17 to FY18 is due to the completion of kit procurements in FY17."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}