{
    "id": "2018-Navy-PB-1810N-MJBOOK-3-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-7",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "5543"
        },
        "LineItemTitle": {
            "val": "Items Less Than $5 Million"
        },
        "P1LineNumber": {
            "val": "127"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Ordnance Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "6"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Ordnance Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "65.447"
                },
                "PriorYear": {
                    "val": "9.906"
                },
                "CurrentYear": {
                    "val": "6.243"
                },
                "BudgetYearOneBase": {
                    "val": "5.981"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "5.981"
                },
                "BudgetYearTwo": {
                    "val": "5.559"
                },
                "BudgetYearThree": {
                    "val": "5.659"
                },
                "BudgetYearFour": {
                    "val": "5.913"
                },
                "BudgetYearFive": {
                    "val": "6.032"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "65.447"
                },
                "PriorYear": {
                    "val": "9.906"
                },
                "CurrentYear": {
                    "val": "6.243"
                },
                "BudgetYearOneBase": {
                    "val": "5.981"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "5.981"
                },
                "BudgetYearTwo": {
                    "val": "5.559"
                },
                "BudgetYearThree": {
                    "val": "5.659"
                },
                "BudgetYearFour": {
                    "val": "5.913"
                },
                "BudgetYearFive": {
                    "val": "6.032"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "65.447"
                },
                "PriorYear": {
                    "val": "9.906"
                },
                "CurrentYear": {
                    "val": "6.243"
                },
                "BudgetYearOneBase": {
                    "val": "5.981"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "5.981"
                },
                "BudgetYearTwo": {
                    "val": "5.559"
                },
                "BudgetYearThree": {
                    "val": "5.659"
                },
                "BudgetYearFour": {
                    "val": "5.913"
                },
                "BudgetYearFive": {
                    "val": "6.032"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "Description": {
            "val": "[P40A \/ RA004 - QUALITY EVAL TECH & EQUIPMENT (QETE)]: Provides funding to procure test systems and equipment in support of the Navy weapons systems and ordnance Quality Evaluation (QE) Program. The purpose of the Navy QE Program is to insure that only safe, quality, reliable, and ready Navy and Marine Corps weapons systems and ordnance items are provided to the Fleet. The results of the QE stock surveillance testing is technical readiness data used to predict when items degrade to the point where they become unsafe to store or would fail to function (unreliable) when needed and should be removed from service.\n\nThis generic (non-weapons systems specific) test equipment is needed to assess the effects of aging and exposure to environmental conditions on Navy weapons systems and ordnance such as mines, gun ammunition, missiles, pyrotechnics, demolition systems\/devices, bombs, and torpedoes throughout the in-service portion of their life cycle and will be located at NAVSEA engineering field activities. Requirements for the test equipment come from a need to replace or modernize obsolete or economically non-repairable equipment or to acquire new or expanded generic test capabilities when new evaluation techniques or process are needed. The equipments procured by these funds are generally \"one of a kind\" and are used to support generic Navy weapons systems and ordnance types. Weapons systems specific equipment is procured\/funded via the individual weapons system Program Management offices. After the weapon specific equipment has entered the inventory, these funds adapt the capability, if feasible, to become more generic and support more than one weapon system. This reduces the overall economic burden to the Navy.\n\n[P40A \/ RA005 - FLEET MINE SUPPORT EQUIPMENT]: Mine Countermeasure Targets are used to emulate both physically and electronically Foreign mine threats for Fleet training, exercises, ranges, and platform and system validation. Instrumented Mine Countermeasures (MCM) Targets can be programmed to behave and function like real foreign mine threats for mine sweeping and platform validation where non-instrumented Mine Countermeasure Targets emulate foreign threats physically for mine hunting training and system validation. Non-instrumented MCM Targets are also used for mine neutralization training and validation.\n\n[P40A \/ RA001 - FLT SUPPORT ORDALT PROCUREMENT (MK92)]: Provides hardware and related materials to modify Fire Control System MK92 Mod 2\/6 installed onboard FFG 7 Class ships. Modifications correct safety, environmental, Reliability, Maintainability and Availability (RM&A), cost of ownership and obsolescence deficiencies to maintain the readiness of the Anti-Aircraft Warfare\/Anti-Surface Warfare (AAW\/ASUW) Weapons System mission for self and area defense against hostile air and surface threats, including anti-ship missile threats. Hardware is procured as Ordnance Alterations (ORDALTs). Installation of ORDALTs will be accomplished by either AIT (Alteration Installation Teams) or in conjunction with routine repair actions planned in the fiscal years following the procurement.\n\n[P40A \/ RA4M6 - FMP INSTALLATION]: Provides funding to install procured MK92 ORDALTs into FFG 7 Class ships by AIT.\n\n[P40A \/ RA006 - GRIFFIN MISSILE SYSTEM (GMS)]: The Griffin Missile System (GMS) will provide precision, short range, anti-surface warfare attack capability against  Fast Inshore Attack Craft (FIAC) targets.  The GMS provides these capabilities through the use of Griffin Missile (procured separately with WPN funding) and GMS ship set integrated on a Patrol Coastal (PC).  A GMS ship set consists of the following components: Electro-Optical Infra-Red sensor with laser designator, two Launchers and associated equipment, Weapons Control System including cabling, connectors, graphical user interface, and Operator Interface Station.  System Install & Check-Out is included.\n\n[P40A \/ RA007 - GRIFFIN MISSILE SYSTEM (GMS) INITIAL TECHNICAL REFRESH]: This line supports major initial replacement systems for the Griffin Missile (GMS) Program to include Electro-Optical Infra-Red sensor with laser designator, battle management system, launcher\/Launcher components. Funding also procures all technical refresh upgrades of the GMS hardware and software aboard Patrol Coastal (PC) ships.  Upgrades will include: Battlefield Management System (BMS) workstation hardware, latest version of BMS system software, and refresher training.  Funds will also support management of contractor efforts, preparation of installation plans, performance of ship checks, procurement of materials, oversight of shipboard installation and Quality Assurance (QA), installation and testing of all software and shipboard training.\n\n[P40A \/ RA007 - GRIFFIN MISSILE SYSTEM (GMS) INITIAL TECHNICAL REFRESH]: This line continues funding for Griffin Missile System under a new grouping, Patrol Combatants. This is a technical adjustment to move non-frigate funding out of the Frigate Missile funding group. RA007 funding supports major initial replacement systems for the Griffin Missile (GMS) Program to include Electro-Optical Infra-Red sensor with laser designator, Battlefield Management System, Launcher\/Launcher components. Funding also procures all technical refresh upgrades of the GMS hardware and software aboard Patrol Coastal (PC) ships.  Upgrades will include: Battlefield Management System (BMS) workstation hardware, latest version of BMS system software, and refresher training.  Funds will also support management of contractor efforts, preparation of installation plans, performance of ship checks, procurement of materials, oversight of shipboard installation and Quality Assurance (QA), conduct of sparing analysis, reliability analysis, system safety analysis, logistical support, installation and testing of all software and shipboard training.\n\n[P40A \/ RA003 - INDUSTRIAL FACILITIES]: Provides funding for capital type rehabilitation projects at two (2) government-owned, contractor- operated (GOCO) plants for weapon systems.  Federal Acquisition Regulation Part 52.245-7 specifies facilities use contracts require government funding of capital type rehabilitation projects to support and maintain these facilities.  These plants have an average age of 45 years and lack of proper maintenance will severely limit capabilities to maintain scheduled production rates and overall productivity.  Estimates support environmental, safety, energy conservation, and major repair at the GOCO facilities."
        },
        "Justification": {
            "val": "Increase of $0.500M in FY18 to cost element 5, TOMAHAWK AND TOMAHAWK MISSILE PLANNING CENTER, Ordnance Support Equipment, Industrial Facilities (RA003) will address critical upgrades to environmental units that support the operation of energetics production lines and mitigate safety and health concerns at Naval Industrial Reserve Ordnance Plant (NIROP), Allegany Ballistics Laboratory (ABL), Rocket Center, WV. \n\nFY 2017 decrease in Items Less Than $5 Million OPN by $0.262M as required for the Department of the Navy to comply with the Bipartisan Budget Act of 2015."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}