{
    "id": "2018-Army-PB-2035A-JBOOK-47aba4e61a9576ce00f42879503931d6f46619e32b635c55302b3bc83156cbe1-63",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_OTHER_3-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "MA0450"
        },
        "LineItemTitle": {
            "val": "Production Base Support (OTH)"
        },
        "P1LineNumber": {
            "val": "182"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "90"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "237.947"
                },
                "PriorYear": {
                    "val": "1.525"
                },
                "CurrentYear": {
                    "val": "1.528"
                },
                "BudgetYearOneBase": {
                    "val": "2.271"
                },
                "BudgetYearOne": {
                    "val": "2.271"
                },
                "BudgetYearTwo": {
                    "val": "2.33"
                },
                "BudgetYearThree": {
                    "val": "2.373"
                },
                "BudgetYearFour": {
                    "val": "2.441"
                },
                "BudgetYearFive": {
                    "val": "2.509"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "237.947"
                },
                "PriorYear": {
                    "val": "1.525"
                },
                "CurrentYear": {
                    "val": "1.528"
                },
                "BudgetYearOneBase": {
                    "val": "2.271"
                },
                "BudgetYearOne": {
                    "val": "2.271"
                },
                "BudgetYearTwo": {
                    "val": "2.33"
                },
                "BudgetYearThree": {
                    "val": "2.373"
                },
                "BudgetYearFour": {
                    "val": "2.441"
                },
                "BudgetYearFive": {
                    "val": "2.509"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "237.947"
                },
                "PriorYear": {
                    "val": "1.525"
                },
                "CurrentYear": {
                    "val": "1.528"
                },
                "BudgetYearOneBase": {
                    "val": "2.271"
                },
                "BudgetYearOne": {
                    "val": "2.271"
                },
                "BudgetYearTwo": {
                    "val": "2.33"
                },
                "BudgetYearThree": {
                    "val": "2.373"
                },
                "BudgetYearFour": {
                    "val": "2.441"
                },
                "BudgetYearFive": {
                    "val": "2.509"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "This program provides funding to the Army Test and Evaluation Command (ATEC) to establish, modernize, expand or replace test facilities used in production testing of General Support Equipment (including trucks, trailers, generators, soldier support equipment, etc.).  It sustains Army production test capabilities through upgrade and replacement of instrumentation and equipment that is technologically and\/or economically obsolete. Modernization of test instrumentation and equipment provides increased automation and efficiencies, improved data quality and quantity and cost avoidances to Army Program Managers. Programmed funding will be used to upgrade or replace production test instrumentation and equipment at Aberdeen Test Center (ATC), Aberdeen Proving Ground, MD; and Yuma Test Center (YTC), Yuma Proving Ground, AZ (including YTCs Cold Regions Test Center (CRTC), Fort Greely, AK)."
        },
        "Justification": {
            "val": "FY 2018 Base procurement dollars in the amount of $2.271 million support the following: At ATC, procures modern industrial shop equipment (welding and cutting machines) used in fabrication of support items required for Production Qualification Testing (such as rotors, stands, sleighs, camera mounts and instrumentation brackets); replaces old surveying equipment with modern digital systems used for surveying test sites; provides lifecycle replacement of analytical chemistry laboratory equipment used to characterize test item materials and support failure analysis and procures new robust laptop PCs to provide data collectors with the capability to support activities involving the acquisition, review, and processing of reliability, availability and maintainability (RAM), Integrated Logistics Support (ILS) and performance test data.  PCs will give ATC the capability to use \"State-of-the-Art\" technologies to streamline the process involved in the acquisition, processing, and distribution of test data At YTC, procures replacement transducers used to collect performance data during automotive tests (including sensors, load cells, thermocouple amplifiers, pressure transducers, embedded wireless sensors, strain gages, current transducers and thermocouples); replaces obsolete air delivery aircraft and airdrop load instrumentation in the areas of aircraft telemetry, aircraft on board video, payload telemetry, and payload data recorders and purchases on board data acquisition and recording equipment for collecting vehicle performance data in harsh desert environments.\n\nThe majority of the instrumentation being upgraded or replaced is obsolete and has met or exceeded its economic life. This instrumentation is required to ensure complete and accurate test data is collected and safety and environmental hazards are minimized. Benefits of this project include increased test efficiencies and decreased costs and risks to Army Program Managers.\n.\n\n.All funding goes to the Active Army Component."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}