{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-19",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2618"
        },
        "LineItemTitle": {
            "val": "Navy Command and Control System (NCCS)"
        },
        "P1LineNumber": {
            "val": "62"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "7"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Ship Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "35.192"
                },
                "PriorYear": {
                    "val": "4.054"
                },
                "CurrentYear": {
                    "val": "4.556"
                },
                "BudgetYearOneBase": {
                    "val": "4.512"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.512"
                },
                "BudgetYearTwo": {
                    "val": "3.87"
                },
                "BudgetYearThree": {
                    "val": "3.986"
                },
                "BudgetYearFour": {
                    "val": "4.073"
                },
                "BudgetYearFive": {
                    "val": "4.155"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "35.192"
                },
                "PriorYear": {
                    "val": "4.054"
                },
                "CurrentYear": {
                    "val": "4.556"
                },
                "BudgetYearOneBase": {
                    "val": "4.512"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.512"
                },
                "BudgetYearTwo": {
                    "val": "3.87"
                },
                "BudgetYearThree": {
                    "val": "3.986"
                },
                "BudgetYearFour": {
                    "val": "4.073"
                },
                "BudgetYearFive": {
                    "val": "4.155"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "35.192"
                },
                "PriorYear": {
                    "val": "4.054"
                },
                "CurrentYear": {
                    "val": "4.556"
                },
                "BudgetYearOneBase": {
                    "val": "4.512"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.512"
                },
                "BudgetYearTwo": {
                    "val": "3.87"
                },
                "BudgetYearThree": {
                    "val": "3.986"
                },
                "BudgetYearFour": {
                    "val": "4.073"
                },
                "BudgetYearFive": {
                    "val": "4.155"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.182"
                },
                "CurrentYear": {
                    "val": "0.029"
                },
                "BudgetYearOneBase": {
                    "val": "0.15"
                },
                "BudgetYearOne": {
                    "val": "0.15"
                },
                "BudgetYearTwo": {
                    "val": "0.147"
                },
                "BudgetYearThree": {
                    "val": "0.093"
                },
                "BudgetYearFour": {
                    "val": "0.097"
                },
                "Total": {
                    "val": "0.698"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Funding includes Global Command and Control System-Maritime (GCCS-M), the Navy fielded portions of GCCS-Joint, and Joint Automated Deep Operations Coordination System (JADOCS).  GCCS-M is further delineated by Afloat and Ashore.\n\nGCCS-M is the Maritime implementation of the United States (U.S.) Global Command and Control System (GCCS).  It provides Maritime Commanders at all echelons of command with a single, integrated, scalable Command, Control, Communication, Computers and Intelligence (C4I) system that fuses, correlates, filters, maintains and displays location, and attribute information on friendly, hostile and neutral land, sea and air forces.  It takes this information and integrates it with available intelligence and environmental information to support commander decision making.  It operates in near real-time, constantly updating unit positions and other situational awareness data.  GCCS-M also records data in appropriate databases and maintains a history of changes to those records.  System operators use the data to construct relevant tactical pictures using maps, charts, topography overlays, oceanographic overlays, meteorological overlays, imagery and all-source intelligence information coordinated into a Common Operational Picture (COP) that can be shared locally and with other sites.  GCCS-M is not a weapon system, but receives data from, and interfaces with Navy integrated weapons systems.  Navy Commanders review and evaluate the general tactical situation, plan actions and operations, direct forces, synchronize tactical movements, and integrate force maneuver with firepower.  GCCS-M operates on General Service (GENSER) Secret networks in a variety of environments and supports joint, coalition and allied forces.  GCCS-M is implemented Afloat and at Ashore fixed command centers.  Increment 1 includes all GCCS-M software versions 4.0 and earlier.  Increment 2 is GCCS-M 4.1.\n\n[P5 \/ FA010 GCCS-M Afloat]: GCCS-M Afloat provides Command and Control capability to Force Level Ships (e.g., CVN Carriers, LCC Command Ships, LHA and LHD Amphibious Ships), Unit Level Ships (e.g., CG Cruisers, DDG Destroyers, MCM Mine Countermeasure Ships, LPD and LSD Amphibious Ships, FF\/LCS Littoral Combat Ships, PC Coastal Patrol Ships), Submarines (e.g., SSN\/SSBN\/SSGN Submarines), the Software Support Activity (SSA), and the In-Service Engineering Activity (ISEA).\n\n[P5 \/ FA020 GCCS-M Ashore]: GCCS-M Ashore provides evolutionary systems and ancillary equipment upgrades to support Fleet Commanders, Force Anti-Submarine Warfare Commanders, Submarine Operating Authorities, Aegis Ashore Missile Defense Systems, and Technical Training Equipment Sites worldwide.  GCCS-M Ashore provides systems that receive, process, display, maintain and\/or assess unit characteristics, employment scheduling, material condition, combat readiness, war fighting capabilities, and positional information of own, allied, and hostile forces.  GCCS-M Ashore provides the tools necessary for fleet and Shore based Commanders to execute plans, transmit tasking, and provide tactical information to subordinate forces.\n\n[P5 \/ FA040 GCCS (Joint) Support Equipment]: Global Command and Control System- Joint (GCCS-J) is a Department of Defense (DoD) Program of Record managed by the Defense Information Systems Agency (DISA) GCCS-J Program Management Office (PMO).   The  GCCS-J system requirements, software release schedule, and system fielding plan are determined by the DISA GCCS-J PMO in coordination with the Joint Staff.  GCCS-J supports the Joint Staff and Combatant Commanders  by providing Command, Control, Communication, Computers and Intelligence (C4I) data processing capabilities, including status of forces and support requirements for use in national security decision making, force preparation and operational planning and execution. Global Command and Control System- Joint (GCCS-J) provides support for Fleet Communications Center interfacing with deployed units and other fixed Fleet and Joint Command Centers.\n\n[P5 \/ FA060 Joint Automated Deep Operations Coordination System (JADOCS)]: Provide funding for the fielding of JADOCS software on new installation hardware. JADOCS is required to provide the capability to coordinate joint targeting and mission assignment for time sensitive targets and other rapid-response missions across Functional Component Commanders, Joint and Combined Force Commanders, Geographic Combatant Commanders, and Special Operations Commanders."
        },
        "Justification": {
            "val": "The FY 2018 budget procures and installs Global Command and Control System - Joint (GCCS-J) Ashore workstations, servers, Local Area Network (LAN) hardware and software, communications equipment; and Joint Automated Deep Operations Coordination System (JADOCS)and Global Command and Control System - Maritime (GCCS-M) software, to include Windows XP eradication efforts on GCCS-M afloat platforms."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}