{
    "id": "2018-Navy-PB-1810N-MJBOOK-0-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-20",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "0950"
        },
        "LineItemTitle": {
            "val": "Strategic Platform Support Equip"
        },
        "P1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "9"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shipboard Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "89.169"
                },
                "PriorYear": {
                    "val": "18.563"
                },
                "CurrentYear": {
                    "val": "15.836"
                },
                "BudgetYearOneBase": {
                    "val": "15.812"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "15.812"
                },
                "BudgetYearTwo": {
                    "val": "14.409"
                },
                "BudgetYearThree": {
                    "val": "9.89"
                },
                "BudgetYearFour": {
                    "val": "10.099"
                },
                "BudgetYearFive": {
                    "val": "10.3"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "89.169"
                },
                "PriorYear": {
                    "val": "18.563"
                },
                "CurrentYear": {
                    "val": "15.836"
                },
                "BudgetYearOneBase": {
                    "val": "15.812"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "15.812"
                },
                "BudgetYearTwo": {
                    "val": "14.409"
                },
                "BudgetYearThree": {
                    "val": "9.89"
                },
                "BudgetYearFour": {
                    "val": "10.099"
                },
                "BudgetYearFive": {
                    "val": "10.3"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "89.169"
                },
                "PriorYear": {
                    "val": "18.563"
                },
                "CurrentYear": {
                    "val": "15.836"
                },
                "BudgetYearOneBase": {
                    "val": "15.812"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "15.812"
                },
                "BudgetYearTwo": {
                    "val": "14.409"
                },
                "BudgetYearThree": {
                    "val": "9.89"
                },
                "BudgetYearFour": {
                    "val": "10.099"
                },
                "BudgetYearFive": {
                    "val": "10.3"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Funding in this P-1 line provides for the procurement of tactical Hull, Mechanical and Electrical (HM&E) equipment that will be installed aboard ships and in the facilities at the TRIDENT Refit Facility (TRIREFFAC), Navy Intermediate Maintenance Facility (NAVIMFAC) and TRIDENT Training Facility (TRITRAFAC).  The TRIDENT Refit Facility and Navy Intermediate Maintenance Facility (NAVIMFAC) are dedicated shore support facilities providing a full range of industrial support.  The TRITRAFAC provides the crews for the OHIO Class (SSBN\/SSGN) Submarines with realistic training experience in operating and maintaining shipboard equipment.\n\n[P40A \/ HH009 EQUIPMENT HM&E & SWS\/SS ALTERATION]: This provides for the replacement of obsolete equipment on board of OHIO Class Submarines and at dedicated Shore Support Facilities (TLCSF, TRITRAFAC (B), NAVIMFAC (B), TRITRAFAC (KB), TRIREFFAC (KB), Major Shore Spares (MSS)).  These alterations are necessary in order to replace obsolete\/outdated equipment with new equipment to maintain or increase mission capabilities, replace or modify components\/systems which have proven to be unreliable, correct design and safety problems and reduce fleet maintenance burdens.  Funds provide for multiple efforts to ensure that the OHIO Class Ship Control Subsystem, both hardware and software components, support the extended life of the OHIO Class submarine platforms.  In FY99 and again in FY06 a NUWC KEYPORT study identified a number of obsolete electronic components in the Ship Control Station (27 out of 107) that are no longer available. The FY06 study recommended that the Ship Control ISEA develop and execute a program that would address the near term obsolescence issues and ensure the continued availability of the subsystem in the out years.  Alterations and actions are done at the lowest practicable and authorized level (taking into consideration urgency, priority, capability, capacity and cost).  Alterations to OHIO Class Submarines are scheduled for accomplishment at the TRIREFFAC, Kings Bay, NAVIMFAC, Bangor, and at Naval Shipyards during Depot Availabilities.  This requires equipment procurement and installation, technical planning, training, and associated resources.  This line provides for material procurement necessary to install the required alterations to OHIO Class Submarines. \n                                                                                                               Additionally, this line provides for the utilization of specially trained and dedicated installation teams to ensure accelerated and correct installation of complex and high priority alterations within specific time frames.  Provided are comprehensive program management and execution, including planning, direction, control, installation, integration, and coordination of specifically selected safety related, mission enhancement or technical HM&E alterations. Starting in FY12, SSBN Strategic Weapon Support Systems (SWSS) OER Upgrades are planned for Ventilation Alarm Monitoring Panel (VAMP) and the Missile Heating and Cooling Proportional Controllers.   Both upgrades are required to support Strategic Systems Programs' Strategic Weapon Systems (SWS) Integration program (Mod6\/Mod7) which replaces the current Launcher, Fire Control and Weapons Support electronics.  Starting in FY16, two SSBN\/GN OER transducer upgrade programs are planned, one for Hovering Transducers and the second for MDD\/MHC Differential Pressure Transducers.  Both transducer types are estimated to be out of spares by 2018 and will require form\/fit\/function replacement.  The Hovering System on both SSBNs and SSGNs is experiencing obsolescence issues due to aging technology and terminated vendor component production as of 2000.  The Missile Drying and Dehumidification (MDD) system and Missile Heating and Cooling (MHC) system on both SSBNs and SSGNs provides a stable temperature and humidity environment for the missile tubes, and has similar obsolescence issues, with terminated vendor component production as of 2009.\n\n[P40A \/ HH012 EQUIPMENT HM&E TRIDENT ENGINGEERING AVAILABILITY]: TRIDENT Engineered Availability (EA) material support funding is required to provide replacement and contingency material to support the critical path schedule during the SSBN 726 Class Submarine Engineered Availabilities (EAs) commencing in FY93 and continuing through the operational life of the submarine.  Funding is also required to formulate or procure complex tools and fixtures required to reduce EA scheduled durations.  This program also provides funding for installation of Depot level alterations packages, Quality Assurance (QA) oversight and certification by Supervisor Of Shipbuilding, Groton (SOS Groton) of OPN SHIPALTS performed by Electric Boat Corporation (EB), Liaison Action Requests and Selected Record Drawings (LAR\/SRD) mark ups for Shipalt related work, NUWC Newport test support and deck plate coordination of Alteration Installation Team (AIT) work during both Engineered Refueling Overhauls (ERO) and Extended Refit Periods (ERPs)\/ modernization periods.\n\n[P40A \/ HH0GN SSGN MODIFICATIONS]: Provides for procurement of SSGN unique system components that will be installed during planned modernization periods.  Also provides funding to perform integrated testing of these unique systems to ensure satisfactory operation with other HM&E and Combat Systems.  Beginning in FY11, funds are provided for procurement of Submarine Special Operations Forces (SOF) unique system components that will be installed during planned modernization periods.\n\n[P40A \/ SOF HH0GN]: Additionally beginning in FY11, funds are provided for installation of Submarine Special Operations Forces (SOF) unique system components."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}