{
    "id": "2018-Navy-PB-1810N-MJBOOK-2-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-4",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "4226"
        },
        "LineItemTitle": {
            "val": "Meteorological Equipment"
        },
        "P1LineNumber": {
            "val": "116"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Aviation Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Aircraft Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "94.704"
                },
                "PriorYear": {
                    "val": "14.997"
                },
                "CurrentYear": {
                    "val": "29.253"
                },
                "BudgetYearOneBase": {
                    "val": "21.137"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "21.137"
                },
                "BudgetYearTwo": {
                    "val": "21.669"
                },
                "BudgetYearThree": {
                    "val": "40.947"
                },
                "BudgetYearFour": {
                    "val": "46.331"
                },
                "BudgetYearFive": {
                    "val": "26.091"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "94.704"
                },
                "PriorYear": {
                    "val": "14.997"
                },
                "CurrentYear": {
                    "val": "29.253"
                },
                "BudgetYearOneBase": {
                    "val": "21.137"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "21.137"
                },
                "BudgetYearTwo": {
                    "val": "21.669"
                },
                "BudgetYearThree": {
                    "val": "40.947"
                },
                "BudgetYearFour": {
                    "val": "46.331"
                },
                "BudgetYearFive": {
                    "val": "26.091"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "94.704"
                },
                "PriorYear": {
                    "val": "14.997"
                },
                "CurrentYear": {
                    "val": "29.253"
                },
                "BudgetYearOneBase": {
                    "val": "21.137"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "21.137"
                },
                "BudgetYearTwo": {
                    "val": "21.669"
                },
                "BudgetYearThree": {
                    "val": "40.947"
                },
                "BudgetYearFour": {
                    "val": "46.331"
                },
                "BudgetYearFive": {
                    "val": "26.091"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.267"
                },
                "CurrentYear": {
                    "val": "0.169"
                },
                "BudgetYearOneBase": {
                    "val": "0.001"
                },
                "BudgetYearOne": {
                    "val": "0.001"
                },
                "BudgetYearTwo": {
                    "val": "0.216"
                },
                "BudgetYearThree": {
                    "val": "0.256"
                },
                "BudgetYearFour": {
                    "val": "0.309"
                },
                "BudgetYearFive": {
                    "val": "0.276"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Meteorological Equipment budget line item provides new and replacement meteorological equipment for Navy and Marine Corps Air Stations, Navy ships, United States Marine Corps (USMC) Operational Force units and other activities required to provide weather observations and provide safety of flight capabilities. It also provides new Intelligence Preparation of the Operational Environment (IPOE) equipment for submarines.  The Meteorological Equipment procurement has been coordinated with other Department of Defense (DoD) and civilian agencies. Equipment is funded under the following programs:\n\n[P40A \/ SP051 Satellite Receiver Upgrades (Space)]: Environmental satellite receivers used to receive and process remotely sensed data from the Defense Meteorological Satellite Program (DMSP) satellites, the National Oceanic and Atmospheric Administration (NOAA) satellites, the Defense Weather Satellite System (DWSS), which has replaced Joint Polar-orbiting Satellite System (JPSS), the Geostationary Operational Environmental Satellites (GEOSAT), the GEOSAT Follow-On satellite, and the Geostationary Satellite Families (GOES-R).  The evolutionary upgrades will enhance weather service capabilities to receive and pre-process additional environmental satellite data, comply with open systems architecture standards, and provide for antenna and processor replacement.  Specifically, in the remote sensing efforts, integration of next generation of polar and geostationary orbiting satellite families and new sensors of opportunity are incorporated in hardware design and software development into existing systems.\n\n[P40A \/ SP190 TESS\/NITES]: Tactical Environmental Support System\/Naval Integrated Tactical Environmental System (TESS\/NITES), procurement of Mobile Tactical Systems technology refresh and rapidly deploy highly specialized Government Owned Tactical Software to USN and USMC forward deployed units around the globe. TESS\/NITES systems provide support to aviation flight safety, operations strike missions, shipboard safety of navigation, USMC ground forces, special operations, and multi-spectral asymmetric warfare.\n\n[P40A \/ SP400 METOC Satellite Data Exploitation Readiness]: Readiness for planned next-generation polar-orbiting and geostationary satellites will require the procurement and installation of software and hardware products necessary to accommodate the significantly increased data stream from advanced instruments as compared with the previous Defense Meteorological Satellite Program, Polar-orbiting Operational Environmental Satellite, and geostationary satellites. The Navy Production Centers at Fleet Numerical Meteorology and Oceanography Center (FLENUMMETOCCEN), Monterey, CA, and the Naval Oceanographic Office (NAVOCEANO), Stennis Space Center, MS, require upgrades of their Storage Area Networks (SAN) and increased data processing capability for their assimilation, analysis and forecasting systems. Procurements concluded in FY16.\n\n[P40A \/ SP550 METOC SASC Upgrades]: Procurement of Government Off-The-Shelf\/Commercial Off-The-Shelf hardware, associated software upgrades for the 67 fielded Automated Surface Observing Systems (ASOS), and the 9 fielded Supplemental Weather Radars (SWR). Both atmospheric sensing systems are essential for aviation safety, Naval Aviation operations, and resource protection. ASOS procurements under this project will provide required system upgrades as required by the National Weather Service Interagency Agreement.\n\n[P40A \/ SP600 Littoral Battlespace Sensors - Unmanned Undersea Vehicles (LBS-UUV)]: Procures Unmanned Undersea Vehicle (UUV) ocean sensor systems. These include electrical powered, short duration (~days) Autonomous Undersea Vehicles (AUV) and long duration (~months) buoyancy driven ocean Gliders which carry sensors that characterize the ocean bottom (bathymetry, imagery, etc.) and sense ocean volume parameters (conductivity, temperature, depth, optical clarity, currents, etc.). The AUV submarine variant (AUV(S)) will provide Intelligence Preperation of the Operational Environment (IPOE) payload capabilities for submarine launched missions. The AUVs are preprogrammed with mission profiles and once launched are totally autonomous. The Ocean Gliders are controlled remotely from the Naval Oceanographic Office (NAVOCEANO), Stennis Space Center, Mississippi from the Glider Operations Center (GOC)."
        },
        "Justification": {
            "val": "The primary focus of FY18 request is the Littoral Battlespace Sensors-Unmanned Undersea Vehicles (LBS-UUV) which consist of 18 ocean Gliders, 2 LBS-Autonomous Undersea Vehicle (Submarine variant) (LBS-AUV(S)) and one Dry Deck Shelter (DDS) Submarine Support Systems.  The program will continue upgrades\/backfits for LBS Gliders and Glider replacement units.  The FY18 request supports procurements of Satellite Receiver Upgrades (Space) for Environmental Satellite data Receivers\/Processers.  Funds also support the Meteorological and Oceanographic Surface-based Atmospheric Sensing Capability (METOC SASC) family of systems."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Meteorological Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "@footnote": "SP051\/SP555\/SP776\/SP777 Satellite Receiver Upgrades (Space) has changed PB 16 and PB 17 Average Unit Cost (AUC) and quantities for AN\/FMQ-17 and AN\/SMQ-11 Satellite Receiver Upgrade Kits and Antenna Positioner\/Pedestal Upgrade Kits to correct erroneous reporting and incorporate a program re-baseline.    The Program re-baseline reflects the realigning of costs to new hardware for AN\/FMQ-17 GOES-R Antenna\/Pedestal and AN\/FMQ-17 Himawari Receiver Processor since new hardware was needed to support new sensor and view capability.  A redirection of resources from SP400 METOC Satellite Data Exploitation Readiness to SP051 Satellite Receiver Upgrades (Space) was needed to support the new sensor and view capability for the Satellite Receiver Upgrades.  Quantities represent the number of sites\/platforms upgraded annually.",
                                    "val": "1) SP051 Satellite Receiver Upgrades (Space)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) AN\/FMQ-17 GOES-R Antenna\/Pedestal"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.789"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.789"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "789"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "789"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "The FY18 Average Unit Cost (AUC) for the AN\/FMQ-17 Himawari Receiver Processor represents the initial procurement cost for this receiver.",
                                                "val": "1.2) AN\/FMQ-17 Himawari Receiver Processor"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.196"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.196"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "196"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "196"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "FY18 AN\/FMQ-17 Satellite Receiver Upgrade Kits costs are realigned to the new cost elements for AN\/FMQ-17 GOES-R and AN\/FMQ-17 Himawari Receiver Processor since new hardware was needed to support sensor and view capability.",
                                                "val": "1.3) AN\/FMQ-17 Satellite Receiver Upgrade Kit"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "18"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.263"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.44"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.449"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "70.167"
                                                    },
                                                    "PriorYear": {
                                                        "val": "440"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "449"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.4) AN\/SMQ-11 Satellite Receiver Upgrade Kit"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "23"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.167"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.551"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.524"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.524"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "50.739"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "551"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "524"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "524"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.5) AN\/FMQ-17 Antenna Positioner Upgrade Kit"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.245"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.251"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "245"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "251"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.6) AN\/SMQ-11 Antenna Pedestal Upgrade Kit"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "27"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "4.68"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.962"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.077"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.939"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.939"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "173.333"
                                                    },
                                                    "PriorYear": {
                                                        "val": "962"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1077"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "939"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "939"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "7.11"
                                        },
                                        "PriorYear": {
                                            "val": "1.647"
                                        },
                                        "CurrentYear": {
                                            "val": "2.328"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.448"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.448"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "TESS\/NITES Mobile Tactical Systems and hardware components are loaded and configured with specialized GOTS METOC Tactical Decision Aid software and forward deployed with USN and USMC forward operating units afloat and ashore.",
                                    "val": "2) SP190 TESS\/NITES"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Mobile Tactical System"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "457"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "2.224"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "4.867"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) Hardware Components"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "154"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.155"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "1.007"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "2.379"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) SP200 Hazardous Weather Detection & Display Capability (HWDDC)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) SPS-48E\/G Variant"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "10"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.3"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "230"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.3"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "Quantities and unit costs represent upgrades to the super computers at the two METOC Production Centers: the Fleet Numerical Meteorology and Oceanography Center (FLENUMMETOCCEN) and the Naval Oceanographic Office (NAVOCEANO). Upgrades consist of data processing and communications hardware and vary annually depending on the launch of various Navy, joint, interagency, and international METOC satellite systems. Unit costs represent the average unit cost of each planned Hardware\/Software procurement or refresh procured from various vendors which varies based on subsystem, site or platform. NAVOCEANO and FLENUMMETOCCEN procure computer system hardware through SPAWAR 2.0 via 8a vendor contracts.",
                                    "val": "4) SP400 METOC Satellite Data Exploitation Readiness"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) FNMOC Upgrades"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "5"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.584"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.114"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1316.8"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1114"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.2) NAVOCEANO Upgrades"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "5"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.739"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.902"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "747.8"
                                                    },
                                                    "PriorYear": {
                                                        "val": "902"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "10.323"
                                        },
                                        "PriorYear": {
                                            "val": "2.016"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) SP550 METOC SASC Upgrades"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Quantities represent the number of GOTS\/COTS hardware and associated software for installed Automated Surface Observing System (ASOS) equipment upgrades.  Multiple upgrades may occur at a single site in a given year.  The variance in unit costs between FY17 and FY18 is due to additional DISA cyber-security requirements needed for the ACU Phase I (hardware and software) upgrades.  In FY17, 48 ACU Phase I upgrades were procured for an average unit cost of $49K.  However, beginning in FY18, the ACU Phase I upgrades include additional Data Center Processing (DCP) hardware and software, as well as upgraded ACU software and firmware, thereby increasing the unit cost of the ACU Phase I upgrades.  In FY18, 33 ACU Phase I (hardware and software) upgrades will be procured for an average unit cost of $78K.",
                                                "val": "5.1) ASOS Upgrades"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "275"
                                                    },
                                                    "PriorYear": {
                                                        "val": "50"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "48"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "33"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "33"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "11.307"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.794"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.341"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.561"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.561"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "41.116"
                                                    },
                                                    "PriorYear": {
                                                        "val": "55.88"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "48.771"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "77.606"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "77.606"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Quantities represent the number of GOTS\/COTS hardware and associated software for installed Supplemental Weather Radar (SWR) equipment upgrades.  Multiple upgrades may occur at a single site in a given year.  SWR Upgrades - FY 2018 quantities represent 2 RCU replacements and 10 replacement workstation procurements.  The variance in unit costs between FY17 and FY18 is due to the additional requirement to procure workstations that can process Dopler Radar data beginning in FY18.  FY17 procurements included Digital Stalo Upgrades, which have a lower unit cost than the workstations.  FY 18 procurements include replacement workstations, along with RCU replacements.  The unit cost for RCU replacements is $145K.",
                                                "val": "5.2) SWR Upgrades"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "63"
                                                    },
                                                    "PriorYear": {
                                                        "val": "16"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "15"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "12"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "12"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.672"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.816"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.878"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.422"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.422"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "42.413"
                                                    },
                                                    "PriorYear": {
                                                        "val": "51"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "58.533"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "118.5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "118.5"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "13.979"
                                        },
                                        "PriorYear": {
                                            "val": "3.61"
                                        },
                                        "CurrentYear": {
                                            "val": "3.219"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.983"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.983"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "Littoral Battlespace Sensors - Autonomous Undersea Vehicles (LBS-AUV) are broken out between AUV units and AUV Shipsets.  Shipsets consist of the operation van, maintenance van, and launch & recovery system. AUV (Submarine) (AUV(S)) launched variants include AUV(S) vehicles, AUV(S) Dry-deck Shelter (DDS) Submarine Support Systems, Torpedo-tube Launch (TTL) Submarine Support Systems and TTL Safecaps. AUV(S) DDS Submarine Support Systems consist of operational and maintenance equipment including launch, mooring and submarine modification kits for DDS operations.  AUV(S) TTL Submarine Support Systems consist of operational and maintenance equipment including launch, mooring and submarine modification kits for TTL operations.  The AUV(S) TTL Safecap consists of operational and maintenance equipment required to safely ship, stow, and deploy an AUV with lithium batteries from a submarine torpedo tube.  Littoral Battlespace Sensors - Gliders (LBS-G) FY18 quantities represent replacement units.    LBS-UUV Upgrades\/Backfits represent AUV and Glider system improvements via back-fits and forward-fits.",
                                    "val": "6) SP600 Littoral Battlespace Sensors - Unmanned Undersea Vehicles (LBS-UUV)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "6.1) Littoral Battlespace Sensors - Gliders (LBS-G)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "142"
                                                    },
                                                    "PriorYear": {
                                                        "val": "22"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "20"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "18"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "18"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "23.5"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.74"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.748"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.487"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.487"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "165.493"
                                                    },
                                                    "PriorYear": {
                                                        "val": "170"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "187.398"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "193.717"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "193.717"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "6.2) Littoral Battlespace Sensors - Autonomous Undersea Vehicles (LBS-AUV)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "5"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "14.885"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "2977"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "6.3) Autonomous Undersea Vehicles (Submarine) AUV(S)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "4"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "8.24"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.196"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.196"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "2060"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2098"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2098"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "6.4) Littoral Battlespace Sensors - (LBS-AUV) Shipset"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.9"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1950"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "6.5) Autonomous Undersea Vehicles (Submarine) - AUV(S) DDS Sub Spt Sys"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "3"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "9.09"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.091"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.091"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "3030"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3090.6"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3090.6"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "6.8) UUV Upgrades\/Backfits"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.825"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.113"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.501"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.884"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.884"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "44.11"
                                        },
                                        "PriorYear": {
                                            "val": "4.853"
                                        },
                                        "CurrentYear": {
                                            "val": "21.579"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.658"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.658"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "7) METMF (R) NEXGEN"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "7.1) METMF (R) NEXGEN\/Subsystems"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "7"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "10.8"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1542.857"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "10.8"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "8) SP555 Production Support"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "8.1) TESS\/NITES"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.121"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "8.2) Satellite Receiver Upgrades"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.36"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.076"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.129"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.147"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.147"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "8.3) LBS-UUV"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.392"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.208"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.867"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.785"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.785"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.752"
                                        },
                                        "PriorYear": {
                                            "val": "0.405"
                                        },
                                        "CurrentYear": {
                                            "val": "0.996"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.932"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.932"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "9) SP776 Non-FMP"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "9.1) Satellite Receiver Upgrades"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.238"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.701"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.051"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.051"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "1.238"
                                        },
                                        "CurrentYear": {
                                            "val": "0.701"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.051"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.051"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "10) SP777 FMP"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "10.1) LBS-AUV(S) DSA"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.291"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.291"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "10.3) Satellite Receiver Upgrades"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.092"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.086"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.43"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.774"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.774"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.092"
                                        },
                                        "PriorYear": {
                                            "val": "0.086"
                                        },
                                        "CurrentYear": {
                                            "val": "0.43"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.065"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.065"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "94.704"
                            },
                            "PriorYear": {
                                "val": "14.996"
                            },
                            "CurrentYear": {
                                "val": "29.253"
                            },
                            "BudgetYearOneBase": {
                                "val": "21.137"
                            },
                            "BudgetYearOne": {
                                "val": "21.137"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}