{
    "id": "2018-Navy-PB-1109N-MJBOOK-0-0-6b2000f9111b6178e144100c1843f0feab54d2ff64037d5a22d994b135e5a122-6",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_MARINECORPS-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2220"
        },
        "LineItemTitle": {
            "val": "Wpns & Cmbt Vehs under $5 million"
        },
        "P1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Weapons and combat vehicles"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Artillery and Other Weapons"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "91.95"
                },
                "PriorYear": {
                    "val": "7.845"
                },
                "CurrentYear": {
                    "val": "9.442"
                },
                "BudgetYearOneBase": {
                    "val": "19.616"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "19.616"
                },
                "BudgetYearTwo": {
                    "val": "32.727"
                },
                "BudgetYearThree": {
                    "val": "22.805"
                },
                "BudgetYearFour": {
                    "val": "11.708"
                },
                "BudgetYearFive": {
                    "val": "11.971"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "91.95"
                },
                "PriorYear": {
                    "val": "7.845"
                },
                "CurrentYear": {
                    "val": "9.442"
                },
                "BudgetYearOneBase": {
                    "val": "19.616"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "19.616"
                },
                "BudgetYearTwo": {
                    "val": "32.727"
                },
                "BudgetYearThree": {
                    "val": "22.805"
                },
                "BudgetYearFour": {
                    "val": "11.708"
                },
                "BudgetYearFive": {
                    "val": "11.971"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "91.95"
                },
                "PriorYear": {
                    "val": "7.845"
                },
                "CurrentYear": {
                    "val": "9.442"
                },
                "BudgetYearOneBase": {
                    "val": "19.616"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "19.616"
                },
                "BudgetYearTwo": {
                    "val": "32.727"
                },
                "BudgetYearThree": {
                    "val": "22.805"
                },
                "BudgetYearFour": {
                    "val": "11.708"
                },
                "BudgetYearFive": {
                    "val": "11.971"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206623M"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "7.722"
                                },
                                "CurrentYear": {
                                    "val": "9.442"
                                },
                                "BudgetYearOneBase": {
                                    "val": "19.616"
                                },
                                "BudgetYearOne": {
                                    "val": "19.616"
                                },
                                "BudgetYearTwo": {
                                    "val": "32.727"
                                },
                                "BudgetYearThree": {
                                    "val": "22.805"
                                },
                                "BudgetYearFour": {
                                    "val": "11.708"
                                },
                                "BudgetYearFive": {
                                    "val": "11.971"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "0.123"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "7.845"
                    },
                    "CurrentYear": {
                        "val": "9.442"
                    },
                    "BudgetYearOneBase": {
                        "val": "19.616"
                    },
                    "BudgetYearOne": {
                        "val": "19.616"
                    },
                    "BudgetYearTwo": {
                        "val": "32.727"
                    },
                    "BudgetYearThree": {
                        "val": "22.805"
                    },
                    "BudgetYearFour": {
                        "val": "11.708"
                    },
                    "BudgetYearFive": {
                        "val": "11.971"
                    }
                }
            }
        },
        "Description": {
            "val": "This line item supports multiple Weapons and Tracked Combat Vehicle requirements to enhance the existing systems and kits within the USMC inventory with improved, state-of-the-art electronics and tools for units that have been added or changed due to Table of Organizational and Table of Equipment changes. The line item also supports the ongoing changes to the various stock lists prescribing those components of sets of test equipment and tools.\n\nThis line also provides funding for the Weapons Enhancement Program for various force protection items and Marine upgrades. The program funds urgently required commercially available equipment and non-developmental items (NDI) that can be rapidly fielded to support the Operating Forces such as the Family of Ballistic Protection Systems which includes Full Spectrum Battlefield Equipment (FSBE), Marine Enhancement Program (MEP), Escalation of Force - Equipment (EoF-E), Ocular Interruption (OI), and Family of Incident Response Systems (FIRS). FSBE is used to address the needs of Marines performing Special Operations Capable missions in Maritime Special Purpose Force (MSPF) (i.e. MSPF detachment and helicopter Assault Company). Less weight, increased positive buoyancy, spare air source, and a cutaway system are all desired quality changes under this program. MEP is a Congressionally initiated program that provides an avenue for obtaining equipment and end items that would otherwise be considered low visibility, low cost. The MEP Program funding focuses on equipment that will benefit the individual Marine by reducing load, increasing survivability, enhancing safety, and improving combat effectiveness. EoF-E funding provides support and sustainment of all fielded equipment and capabilities. Additionally, EoF-E supports type-classification, testing and procurement of new advancements and technologies to provide an increased capability over existing or outdated equipment currently or associated in the Escalation of Force-Mission Modules (EoF-MMs). OI is the replacement of the 'Dazzling Laser' program for the LA-9\/P and the Non Glare Mount 532P-M (Mini Green) laser. OI is a \"Non-damaging\" dazzling system that will be used in Escalation of Force-Missions to provide a non-lethal, force protection capability to warn and visually suppress targeted personnel at ranges from 10 to 500 meters. FIRS supports Countering Weapons of Mass Destruction (CWMD) and Chemical, Biological, Radiological and Nuclear (CBRN) mission areas by providing first response protection, detection, identification, and decontamination equipment to the Marine Air-Ground Task Force (MAGTF) and the Chemical Biological Incident Response Force (CBIRF).\n\nIncreases in funding beginning in FY 2017 are attributed to the addition of funding from BLI 2208."
        },
        "Justification": {
            "val": "FY 2018 Base Appropriation: $19.616M \n\nThe increase of $10.174M from FY17 to FY18 is due to the FIRS program being added to procure Prime Movers and Unified Command Suit (UCS); Company and Battalion Mortars to support mortar systems; and Ocular Interruption to procure OI systems.\n\nFamily of Infantry Weapons Systems - $5.331M will provide for continuous monitoring, assessment of and implementation of Joint Service and USMC unique system modifications. This includes efforts such as: sustain weapon capability and\/or improve the operation, maintainability, supportability, service life, ergonomics, and safety enhancements. Funding supports the continued multiple year procurement of Lightweight Machinegun Tripods (LMT) (Traverse and Elevation (T&E) Mechanisms), the MK 13 Rifle with associated optic, and principle end items (PEI) due to combat losses, wash-outs, and increases in AAO, as well as continuing product improvement and modernization of sniper and special purpose weapons, and support equipment.  Funding also supports various program\/acquisition support activities, such as ammunition costs related to those production verification activities.\n\nFamily of Incident Response Systems (FIRS) - $0.806M will facilitate procurement of two Prime Movers needed for CBIRF's Common Analytical Laboratory System (CALS) and the modernization of CBIRF's legacy Unified Command Suit (UCS) which is facing obsolescence in FY18.\n\nCompany and Battalion Mortars - $0.810M will support the capability of indirect fire systems to the Marine Corps inventory of 60mm and 81mm mortar systems and incorporate component product improvements, ammunition costs related to mortar production verification activities, as well as procurement of hardware for integration with the Lightweight Handheld Mortar Ballistic Computer (LHMBC) upgrade.\n\nEscalation of Force Equipment (EoF-E) - $1.748M will be used to procure EoF-MM upgraded components such as the Improved Voice Translation Device. Funding for EoF-E moved from BLI 2208 beginning in FY17.\n\nOcular Interruption (OI) - $10.921M will be used to procure OI Systems. Funding for OI moved from BLI 2208 beginning in FY17."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}