{
    "id": "2018-Navy-PB-1810N-JBOOK-86dcb7cde9c6096ba835dc0bb88e12bdad2d586c6c58ccdff71f0e33da4e3769-7",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA2-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2213"
        },
        "LineItemTitle": {
            "val": "Surface Ship Torpedo Def (SSTD)"
        },
        "P1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "ASW Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "149.835"
                },
                "PriorYear": {
                    "val": "8.396"
                },
                "CurrentYear": {
                    "val": "6.893"
                },
                "BudgetYearOneBase": {
                    "val": "12.867"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "12.867"
                },
                "BudgetYearTwo": {
                    "val": "11.688"
                },
                "BudgetYearThree": {
                    "val": "13.659"
                },
                "BudgetYearFour": {
                    "val": "13.934"
                },
                "BudgetYearFive": {
                    "val": "14.214"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "149.835"
                },
                "PriorYear": {
                    "val": "8.396"
                },
                "CurrentYear": {
                    "val": "6.893"
                },
                "BudgetYearOneBase": {
                    "val": "12.867"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "12.867"
                },
                "BudgetYearTwo": {
                    "val": "11.688"
                },
                "BudgetYearThree": {
                    "val": "13.659"
                },
                "BudgetYearFour": {
                    "val": "13.934"
                },
                "BudgetYearFive": {
                    "val": "14.214"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "149.835"
                },
                "PriorYear": {
                    "val": "8.396"
                },
                "CurrentYear": {
                    "val": "6.893"
                },
                "BudgetYearOneBase": {
                    "val": "12.867"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "12.867"
                },
                "BudgetYearTwo": {
                    "val": "11.688"
                },
                "BudgetYearThree": {
                    "val": "13.659"
                },
                "BudgetYearFour": {
                    "val": "13.934"
                },
                "BudgetYearFive": {
                    "val": "14.214"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.753"
                },
                "CurrentYear": {
                    "val": "0.535"
                },
                "BudgetYearOneBase": {
                    "val": "0.853"
                },
                "BudgetYearOne": {
                    "val": "0.853"
                },
                "BudgetYearTwo": {
                    "val": "0.813"
                },
                "BudgetYearThree": {
                    "val": "1.862"
                },
                "BudgetYearFour": {
                    "val": "2.325"
                },
                "BudgetYearFive": {
                    "val": "2.052"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "Description": {
            "val": "The Surface Ship Torpedo Defense (SSTD) OPN account procures layered torpedo defense systems to protect surface ships.  The account is comprised of the AN\/SLQ-25 (NIXIE) system and the Torpedo Warning System (TWS).  The AN\/SLQ-25 (NIXIE) system provides towed persistent countermeasure capability.  The TWS provides automated torpedo detection, classification, localization, and alertment capability.  \n\nWL101 AN\/SLQ-25A UPGRADE KITS\nProcures the upgrade to the AN\/SLQ-25 (NIXIE) towed acoustic countermeasure system.  Upgraded AN\/SLQ-25A System to AN\/SLQ-25C. The AN\/SLQ-25C enhances ship survivability against future torpedo threats.  Upgrade kits include the following engineering changes: EC-4\/9\/10\/12\/13\/14\/15\/16\/17.  The upgrades include a more reliable power amplifier, Commercial-off-the-shelf (COTS) Signal Generator with new operational capability, a new Littoral Fiber Optic Tow Cable (LFOTC) for operations in shallow water, and enhanced EC-16 capability (details classified).\n    \nWL102 Torpedo Warning System (TWS)\nProcures the Torpedo Warning System (TWS).  TWS is an automated Torpedo Detection, Classification, and Localization (TDCL) system that generates warning alerts on incoming threat torpedoes.  The TWS consists of towed active acoustic source and receive sensors, processing cabinets and workstations, and Countermeasure Anti-Torpedo (CAT) ready stows mounted port and starboard.  The TWS subfunctional groups are called the Target Acquisition Group (TAG), Tactical Control Group (TCG), and Ready Stow Group (RSG).\n\nWL104  AN\/SLQ-25C EC-2\nIn FY 2016 this effort moved to WL106 Engineering Changes, and has dropped the EC-2 modifier. \n\nWL106 AN\/SLQ-25 ENGINEERING CHANGES\nAN\/SLQ-25 Engineering Changes consists of three major efforts: (a) Tech Refresh, (b) Software Updates, and (c) Upgrade Kits.  (a) Tech Refresh enables response to service identified issues and provides for obsolescence and limiting component availability monitoring.  Tech refresh funds hardware and software configuration changes to the production baseline of the AN\/SLQ-25 system.  These are Fact of Life Technical Insertions to sustain the military service life of the system and reduce the electronics parts count within the current system performance envelope.  In FY 2018, nonrecurring effort on the AN\/SLQ-25E hardware tech refresh will begin after award of a full and open competitive contract in the 3rd quarter.  Nonrecurring software effort will implement a modular software architecture to interface with refreshed commercial hardware.  The AN\/SLQ-25E sustains production to meet torpedo defense commitments in FY 2020 and beyond.  (b) Software Updates provides for continued fielding of the Engineering Change (EC) updates, including EC-1 and EC-3, to the AN\/SLQ-25C system to address outstanding issues that could render key functions inoperable without modification. Software Updates provides for investigation and resolution of AN\/SLQ-25C Trouble Reports.  (c) Upgrade Kit procurement upgrades to the AN\/SLQ-25C to resolve obsolescence and modernize baselines.  Upgrade Kits provides for cyber security and program protection updates. Upgrade Kit provides for investigation and resolution of AN\/SLQ-25C Trouble Reports.\n\nThe Surface Ship Torpedo Defense program uses P-40 resources to fund In-Service Engineering Agent (ISEA) support to the Fleet, government oversight of contractor production and contractor consulting services in FY17 and prior. In FY18 and out production support costs below are included in the P3a exhibits to show total costs of the systems.\n\nWL830  PRODUCTION ENGINEERING (IN-HOUSE)\nFunding provides specification preparation and validation, production planning, contract deliverable monitoring, prime contractor monitoring for cost, schedule, and performance and ILS planning, review and evaluation of obsolescence issues, and coordination of government furnished information (GFI) and government furnished equipment (GFE).\n\nWL840  QUALITY ASSURANCE \nFunding under this cost code provides for quality assurance efforts including conducting quality assurance reviews of the contractor and subcontractors, documentation indicating contractor conformity to product performance requirements, and review of objective quality evidence. In FY17 the Torpedo Warning System  (TWS)  manufacture quality will be assessed and evaluated for the five systems that have been installed on CVNs.    \n\nWL860  ACCEPTANCE TEST & ENGINEERING\nFunding under this cost code provides for production acceptance of contractor hardware.  In FY17 the Torpedo Warning System functionality and acceptance testing will be completed on the five systems that have been installed on CVNs.  Acceptance testing includes government acceptance testing support with operationally trained subject matter experts  and software support engineers.  System functionality support after CVN install is required on both coasts of the United States.\n\nWL900  PRODUCTION ENGINEERING (OUT-HOUSE)\nConsulting services for FY 2012 and prior provide production monitoring, installation planning and coordination support.\n\nWL900  CONSULTING SERVICES\nFunding under this cost code provides for contractor support to the program office for production monitoring, installation planning and coordination support.\n\nWL905  PRODUCTION ENGINEERING CONTRACTOR\nFunding under this cost code provides for production engineering tasks performed by the hardware contractor."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}