{
    "id": "2018-Army-PB-2034A-JBOOK-5aee815d00f2743bc26b1fd362b1fa251ab1150ad3a4a9b16cb13a13bf67f3ad-27",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_AMMO-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "EA0055"
        },
        "LineItemTitle": {
            "val": "Items Less Than $5 Million (AMMO)"
        },
        "P1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "50"
        },
        "BudgetSubActivityTitle": {
            "val": "Miscellaneous"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "153.902"
                },
                "PriorYear": {
                    "val": "4.945"
                },
                "CurrentYear": {
                    "val": "10.006"
                },
                "BudgetYearOneBase": {
                    "val": "10.73"
                },
                "BudgetYearOne": {
                    "val": "10.73"
                },
                "BudgetYearTwo": {
                    "val": "9.668"
                },
                "BudgetYearThree": {
                    "val": "10.196"
                },
                "BudgetYearFour": {
                    "val": "10.087"
                },
                "BudgetYearFive": {
                    "val": "9.572"
                },
                "Total": {
                    "val": "219.106"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "153.902"
                },
                "PriorYear": {
                    "val": "4.945"
                },
                "CurrentYear": {
                    "val": "10.006"
                },
                "BudgetYearOneBase": {
                    "val": "10.73"
                },
                "BudgetYearOne": {
                    "val": "10.73"
                },
                "BudgetYearTwo": {
                    "val": "9.668"
                },
                "BudgetYearThree": {
                    "val": "10.196"
                },
                "BudgetYearFour": {
                    "val": "10.087"
                },
                "BudgetYearFive": {
                    "val": "9.572"
                },
                "Total": {
                    "val": "219.106"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "153.902"
                },
                "PriorYear": {
                    "val": "4.945"
                },
                "CurrentYear": {
                    "val": "10.006"
                },
                "BudgetYearOneBase": {
                    "val": "10.73"
                },
                "BudgetYearOne": {
                    "val": "10.73"
                },
                "BudgetYearTwo": {
                    "val": "9.668"
                },
                "BudgetYearThree": {
                    "val": "10.196"
                },
                "BudgetYearFour": {
                    "val": "10.087"
                },
                "BudgetYearFive": {
                    "val": "9.572"
                },
                "Total": {
                    "val": "219.106"
                }
            }
        },
        "Description": {
            "val": "This budget line includes Miscellaneous Ammunition Items Under $5 million.\n\n(E01700) CTG CAL .22 LR MATCH F\/PISTOL is used in .22 caliber Remington Model 40X-H1 rifles for military marksmanship training.  This item is Code A, approved for service use.\n\n(E03001) CTG, CAL .30 BLANK is used for ceremonial purposes and training in the M1 Garand rifles.  It can be identified by the absence of a bullet and a rosette crimped casemouth.  This item is Code A, approved for service use. \n\n(E03710) CTG .338 Lapua Magnum XM1154 procurement supports the Precision Sniper Rifle.  It consists of an Armor Piercing (AP) Bullet, brass cartridge case, large rifle lead, styphnate primer, and smokeless small arms propellant.  This item is Code B, not approved for service use.\n\n(E03715) CTG .338 Lapua Magnum MK330 procurement supports the Precision Sniper Rifle.  It consists of an Open Tip Match (OTM) Bullet, brass cartridge case, large rifle lead, styphnate primer, and smokeless small arms propellant.  This item is Code B, not approved for service use.\n\n(E99101) Special Training Ammo includes non-standard munitions and energetic materials to support the training of US Army troops in accordance with HQDA G3 approved authorizations.\n\n(E99105) Soldier Enhancement Program Ammo.  The Soldier Enhancement Program (SEP) was established by the National Defense Authorization Act for Fiscal Year 1990 and 1991.  The SEP evaluates available Commercial Off the Shelf (COTS), Government Off the Shelf (GOTS) and Non-Developmental Items (NDI) equipment to determine if items have the potential to provide increased combat effectiveness to the Soldier.  The SEP procures selected types of equipment designed to increase Soldiers' mission command, situational awareness and operational effectiveness. SEP AMMO provides a means of procuring COTS\/GOTS\/NDI ammunition to be evaluated by Soldiers for potential Army use. \n\n(E99222) Foreign Weapons Training Ammunition.  Foreign weapons ammunition is munitions that has not been Type Classified, Materiel Released or Fielded for standard use by US Army or other DoD services.  It is not stocked\/procured in standard DoD supply system.  Funds will be used to purchase foreign (Non NATO) standard munitions, training devices and materials, shipping, conduct safety and quality assessments, and market research.\n\n(EA0600) Ammunition Program Support includes ammunition program support to enhance the management of ammunition.\n\n(EA0960) USAMTU FT BENNING. This budget line funds procurement of non-standard munitions and energetic materials to support marksmanship training throughout the US Army, in accordance with HQDA G3 approved authorizations."
        },
        "Justification": {
            "val": "FY 2018 Base Budget supports critical Army Title 10 war reserve\/operational, training, and test requirements IAW DoD Instruction 3000.04 (Munitions Requirements Process) and AR 5-13 (Total Army Munitions Requirements Process and Prioritization System).  War reserve requirements support OSD-approved Combatant Commander Operational Plans, Homeland Defense, and other OSD-directed missions.  Training requirements support individual and collective training of Active and Reserve Component forces at Army schools, home station, and the combined training centers.  Test requirements support the development, fielding, safety, and quality assurance of Army munitions and equipment throughout their life-cycle.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities. \n\nThe FY 2018 Base procurement dollars in the amount of $10.730 million supports procurement of 2.718 million cartridges.\n\n(E01700) CTG CAL .22 LR MATCH F\/PISTOL is a training standard item used in training and combat. The FY 2018 request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals.  FY 2018 Base procurement dollars in the amount of $0.074 million supports the procurement of 0.324 million .22 LR MATCH cartridges.\nType classification date:  April 1988\n\n(E03001) CTG, CAL .30 BLANK is a training unique item not used in combat. The FY 2018 request supports annual training and builds a depot level in accordance with the Army's procurement goals.  FY 2018 Base procurement dollars in the amount of $1.000 million supports the procurement of 2.394 million CAL .30 BLANK cartridges.   E03001 is a new start in FY 2018.\n\nType classification date: 1917 \n\n(E03710) CTG .338 Lapua Magnum XM1154 is a training standard item used in both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals. \nType classification date: Pending\n\n(E03715) CTG .338 Lapua Magnum MK330 is a training standard item used in both training and combat.  The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals. \nType classification date: Pending\n\n(E99101) Special Training Ammunition. The FY 2018 funds will procure non-standard munitions and energetic materials to support the training of US Army troops in accordance with HQDA G3 approved authorizations.  FY 2018 Base procurement dollars in the amount of $1.582 million supports Special Training Ammunition initiatives.\n\n(E99105) Soldier Enhancement Program Ammunition. The FY 2018 request procures approved COTS, GOTS, and NDIs ammunition that will be evaluated by Soldiers for potential use by the Army or used for evaluation of SEP weapons.  FY 2018 Base procurement dollars in the amount of $0.248 million supports Soldier Enhancement Program Ammunition initiatives.\n\n(E99222) Foreign Weapons Training Ammunition. FY 2018 funds will be used to procure Non Standard Ammunition (NSA), related Non Standard Weapons Systems (NSWS), as well as related training aids for Army units supporting the Regionally Aligned Forces (RAF) mission.  Army units will conduct preparation training with Nonstandard weapons and munitions before deployment in order to be trained to support requirements, including operational missions, bilateral and multilateral military exercises and security cooperation activities.  FY 2018 Base procurement dollars in the amount of $0.500 million supports Non Standard Ammunition initiatives.\n\n(EA0960) USAMTU Ft. BENNING. The FY 2018 $1.811 million request supports the procurement of non-standard munitions and energetic materials to support marksmanship training throughout the US. Army, in accordance with HQDA G3 approved authorizations.  \n\n(EA0600) Ammunition Program Support.  The FY 2018 request in the amount of $5.515 million supports Ammunition Program Support activities that focus on enhancing the management of ammunition."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}