{
    "id": "2018-AirForce-PB-3020F-JBOOK-2e5ba368b6eeb2158c21cac0fe823f1171b0fce77999f8bdb65cdff29e65ae4b-0",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-AIRFORCE_MISSILE-U_PROCUREMENT_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3020F",
        "appropriation_name": "Missile Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "00099L"
        },
        "LineItemTitle": {
            "val": "Missile Replacement Eq-Ballistic"
        },
        "P1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3020F"
        },
        "AppropriationTitle": {
            "val": "Missile Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ballistic Missiles"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Missile Replacement Equipment - Ballistic"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "93.715"
                },
                "CurrentYear": {
                    "val": "70.247"
                },
                "BudgetYearOneBase": {
                    "val": "99.098"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "99.098"
                },
                "BudgetYearTwo": {
                    "val": "50.529"
                },
                "BudgetYearThree": {
                    "val": "22.049"
                },
                "BudgetYearFour": {
                    "val": "12.757"
                },
                "BudgetYearFive": {
                    "val": "4.742"
                },
                "Total": {
                    "val": "353.137"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "93.715"
                },
                "CurrentYear": {
                    "val": "70.247"
                },
                "BudgetYearOneBase": {
                    "val": "99.098"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "99.098"
                },
                "BudgetYearTwo": {
                    "val": "50.529"
                },
                "BudgetYearThree": {
                    "val": "22.049"
                },
                "BudgetYearFour": {
                    "val": "12.757"
                },
                "BudgetYearFive": {
                    "val": "4.742"
                },
                "Total": {
                    "val": "353.137"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "93.715"
                },
                "CurrentYear": {
                    "val": "70.247"
                },
                "BudgetYearOneBase": {
                    "val": "99.098"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "99.098"
                },
                "BudgetYearTwo": {
                    "val": "50.529"
                },
                "BudgetYearThree": {
                    "val": "22.049"
                },
                "BudgetYearFour": {
                    "val": "12.757"
                },
                "BudgetYearFive": {
                    "val": "4.742"
                },
                "Total": {
                    "val": "353.137"
                }
            },
            "InitialSpares": {
                "BudgetYearOneBase": {
                    "val": "0.224"
                },
                "BudgetYearOne": {
                    "val": "0.224"
                },
                "Total": {
                    "val": "0.224"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0101213F"
                }
            ]
        },
        "Description": {
            "val": "This program funds replacement of organizational and intermediate level support equipment for all out-of-production missile systems, including ballistic, tactical and other missile weapon systems. Equipment procured is used for missile weapon systems maintenance and testing at organizational\/intermediate (base\/field) launch control facilities, as well as missile testing facilities. Programs will include analysis of Diminishing Manufacturing Sources and Material Shortages (DMSMS) risks and procurement activities related to DMSMS.\n\nFunding for this exhibit is contained in PE 0101213F.\n\nBallistic Missile Items Less Than $5 Million:  Support Equipment Less Than $5M procures low cost new, modified or replacement support equipment.\n\nMM Power Panels (PPM):  Minuteman Power Panels replaces obsolete and unsupportable power distribution panels within Launch Control Centers and Launch Facilities.\n\nPayload Transporter Replacement (PTR):  Provides nuclear certified tractor and trailer to emplace, extract and transport the reentry system, Propulsion System Rocket Engine, and guidance systems. Replaces current payload transporter to meet USSTRATCOM security requirements and addresses supportability issues. Required to sustain Minuteman III operations through fielding of Ground Based Strategic Deterrent (GBSD).\n\nPerf Assess Data Sys Comm Equip Interface Unit (PADS CEIU II):  Performance Assessment Data System (PADS) is used to collect and analyze Missile Guidance Computer (MGC) data, Launch Facility (LF) faults and anomalies, as well as LF security and Environmental Control System (ECS) data. PADS is a critical MM III legacy data system, developed in the late 1970s and redesigned in 1996—1999, using commercial software. This program addresses PADS reliability, by updating software to meet Air Force software security requirements and to conform to the Air Force standard desktop configuration.\n\nReentry Field Support Equipment (RFSE):  RFSE replaces the current reentry system test set. RFSE will increase the Mean Time Between Failure, eliminate unneeded Mk12 functions, and add new Mk21 functions. It will provide capability to meet Department of Energy mandated Limited Life Component warhead swaps and to test electrical continuity during buildup of Minuteman III reentry systems.\n\nSquadron Data Simulator (SDS):  The SDS simulates the command and control message traffic between a MM squadron of Launch Control Centers (LCCs) and the Launch Facilities (LFs). The system is used extensively to support Strategic Missile Integration Complex (SMIC) weapon system modification testing, field anomaly investigations, and the Hardened Surveillance Electromagnetic Pulse Program (HSEP). It provides extensive faulting and troubleshooting features and verifies operational status of LCCs and LFs following site modifications or extensive site maintenance.\n\nTransporter Erector Replacement Program (TERP):  The Transporter Erector Replacement Program (TERP) replaces the current transporter erector used to emplace, extract and transport MM III boosters to and from launch facilities. TERP will update existing drawings, specifications and technical orders to eliminate parts obsolescence and address the intended usage through 2030."
        },
        "Justification": {
            "val": "This program, Missile Replacement Eq-Ballistic P-40A Item Performance Assessment Data System Comm Equipment Interface Unit (PADS CEIU II), is a new start.\nThis program, Missile Replacement Eq-Ballistic P-40A Item Squadron Data Simulator (SDS), is a new start.\n\nFY18 funding provides replacement support equipment items for an aging inventory of equipment which has become increasingly more costly to maintain. These items will increase ballistic missile system reliability and maintainability by providing state-of-the-art maintenance repair and testing capability. The program supports missile weapon systems such as the Minuteman III (LGM-30G), Advanced Medium Range Air-to-Air Missile (AIM-120), Air Launched Cruise Missile (AGM-86A), and High-Speed Anti-Radiation Missile (AGM-88A). Requirements are jointly determined by Headquarters United States Air Force (HQ USAF), Air Force Materiel Command (AFMC), Air Combat Command (ACC) and Air Force Global Strike Command (AFGSC) and are based on established allowance standards.\n\nItems requested in FY18 are displayed on the attached P-40A. Items procured during execution may change based on critical equipment needed to support current Air Force mission requirements.\n\nBallistic Missile Items Less Than $5 Million:  Procures low cost support equipment required to sustain Minuteman III operations through fielding of the Ground Based Strategic Deterrent (GBSD).\n\nMM Power Panels (PPM):  Procures power panel replacements required to sustain Minuteman III operations through fielding of the Ground Based Strategic Deterrent (GBSD).\n\nPayload Transporter Replacement (PTR):  Procures replacement payload transporters required to sustain Minuteman III operations through fielding of the Ground Based Strategic Deterrent (GBSD).\n\nPerf Assess Data Sys Comm Equip Interface Unit (PADS CEIU II):  PADS Communications Equipment Interface Unit (CEIU) is used to transmit MM III Inertial Measurement Unit (IMU) Performance Data (IPD) from the Launch Control Center (LCC) to the PADS at the support base via telephone lines. CEIU is unclassified equipment, but interfaces with both classified and non-classified systems. This program will update the current CEIU. No modem will be needed for the updated version.\n\nReentry Field Support Equipment (RFSE):  The RFSE replaces unsupportable and unreliable support equipment and is required to sustain Minuteman III operations through fielding of Ground Based Strategic Deterrent (GBSD).\n\nSquadron Data Simulator (SDS):  SMIC SDS Replacement Program replaces failing SDS assets (a total of 12 systems). It is critical to operational certification of field LCCs and LFs, weapon system testing for modification programs, anomaly investigations, and HSEP.\n\nTransporter Erector Replacement Program (TERP):  Transporter Erector Replacement Program (TERP) replaces current transporter erectors exhibiting structural integrity issues and addresses supportability issues. TERP is required to sustain Minuteman III operations through fielding of Ground Based Strategic Deterrent (GBSD)."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Ballistic Missile Items Less Than $5 Million"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Various"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Various"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "27.997"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.108"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.685"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.685"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "27.997"
                                        },
                                        "CurrentYear": {
                                            "val": "2.108"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.685"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.685"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Support Equipment Less Than $5M procures low cost new, modified or replacement support equipment."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "27.997"
                            },
                            "CurrentYear": {
                                "val": "2.108"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.685"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "8.685"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "MM Power Panels (PPM)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "LGM-30G"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "LGM-30G Minuteman III Power Panels (MMPP)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "11.195"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "12.123"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9.197"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9.197"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "11.195"
                                        },
                                        "CurrentYear": {
                                            "val": "12.123"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.197"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.197"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "The LGM-30G Power Panels Modification (PPM) modernizes the antiquated power distribution system to improve reliability and sustainability at each of the three wings: Malmstrom, Minot, and FE Warren. Installation of the power panels requires extensive demolition of existing components, relocation of all electrical equipment and installation of the new equipment."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "11.195"
                            },
                            "CurrentYear": {
                                "val": "12.123"
                            },
                            "BudgetYearOneBase": {
                                "val": "9.197"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "9.197"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Payload Transporter Replacement (PTR)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "LGM-30G"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "LGM-30G Payload Transporter Replacement (PTR)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "10"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "10"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.005"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "24.304"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "20.216"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "20.216"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "12.152"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.022"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.022"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0.005"
                                        },
                                        "CurrentYear": {
                                            "val": "24.304"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.216"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.216"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "The LGM-30G Payload Transporter Replacement (PTR) provides nuclear certified tractor and trailer to emplace, extract, and transport the reentry system, Propulsion System Rocket Engine, and guidance systems. Replaces current payload transporter to meet USSTRATCOM security requirements and addresses supportability issues. This support equipment is required to sustain Minuteman III operations through fielding of the Ground Based Strategic Deterrent (GBSD). PTR initial costs in FY 16-17 include special tools for manufacturing."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0.005"
                            },
                            "CurrentYear": {
                                "val": "24.304"
                            },
                            "BudgetYearOneBase": {
                                "val": "20.216"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "20.216"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Perf Assess Data Sys Comm Equip Interface Unit (PADS CEIU II)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "LGM-30G"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Performance Assessment Data System Comm Equipment Interface Unit (PADS CEIU II)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "27"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "27"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.024"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.024"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.038"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.038"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.024"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.024"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "This program, PADS CEIU II, is a FY18 Procurement New Start.\n\nPerformance Assessment Data System (PADS) is used to collect and analyze Missile Guidance Computer (MGC) data, Launch Facility (LF) faults and anomalies, as well as LF security and Environmental Control System (ECS) data. PADS is a critical MM III legacy data system, developed in the late 1970s and redesigned in 1996—1999, using commercial software. This program addresses PADS reliability, by updating software to meet Air Force software security requirements and to conform to the Air Force standard desktop configuration.\n\nPADS Communications Equipment Interface Unit (CEIU) is used to transmit MM III Inertial Measurement Unit (IMU) Performance Data (IPD) from the Launch Control Center (LCC) to the PADS at the support base via telephone lines. CEIU is unclassified equipment, but interfaces with both classified and non-classified systems. This program will update the current CEIU. No modem will be needed for the updated version."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.024"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "1.024"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Reentry Field Support Equipment (RFSE)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "LGM-30G"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "LGM-30G Reentry Field Support Equipment (RFSE)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "7"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "44.518"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.663"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.31"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.31"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "6.36"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "44.518"
                                        },
                                        "CurrentYear": {
                                            "val": "0.663"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.31"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.31"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "The Reentry System Field Support Equipment (RFSE) program is producing test sets to replace the aging and obsolete Reentry System Test Set (RSTS) and the Safety Enhanced Reentry Vehicle (SERV) Field Test Set (SFTS).  The RSTS was built in the late 1960s, using early 1960s technology.  The RSTS was designed to have a Mean Time Between Failures (MBTF) of approximately 3000 hours but has degraded to about 24 hours at RFSE program initiation.  The replacement effort will consist of procuring Reentry System Test Consoles (RSTC), Forward Section Test Sets (FSTS), and sets of support equipment consisting of a RSTC Alignment Console and two FSTS calibration boxes per set.  This procurement action will be done to fulfill the requirements of AFGSC. \n\nThe test sets will be used to test and functionally check out the MK12A and MK21 Reentry Systems and the MK12A Reentry Vehicle's Forward Sections.  The test sets support the Minuteman III Intercontinental Ballistic Missile (ICBM) weapon system ensuring its viability to 2030 and beyond. The RSTC will be able to check-out all possible SERV RS configurations.  The MK12A Forward Section will be checked-out by the FSTS, allowing simultaneous processing efforts to take place, reducing overall processing time in the Weapon Storage Area.  The MK21 Forward Sections will continue to be checked by the current SERV Arming and Fuzing Assembly Test Set (AFATS)."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "44.518"
                            },
                            "CurrentYear": {
                                "val": "0.663"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.31"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.31"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Squadron Data Simulator (SDS)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "LGM-30G"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Squadron Data Simulator (SDS)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5.205"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.205"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.205"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.205"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "This program, Squadron Data Simulator (SDS) is a FY18 Procurement New Start\n\nThe SDS simulates the command and control message traffic between a MM squadron of Launch Control Centers (LCCs) and the Launch Facilities (LFs). The system is used extensively to support Strategic Missile Integration Complex (SMIC) weapon system modification testing, field anomaly investigations, and the Hardened Surveillance Electromagnetic Pulse Program (HSEP). It provides extensive faulting and troubleshooting features and verifies operational status of LCCs and LFs following site modifications or extensive site maintenance.\nSMIC SDS Replacement Program replaces failing SDS assets (a total of 12 systems). It is critical to operational certification of field LCCs and LFs, weapon system testing for modification programs, anomaly investigations, and HSEP."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "5.205"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "5.205"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Transporter Erector Replacement Program (TERP)"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "LGM-30G"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "LGM-30G Transporter Erector Replacement Program (TERP)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "3"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "6"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "10"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "10"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "10"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "31.049"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "54.461"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "54.461"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "3.333"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "5.175"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5.446"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.446"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "10"
                                        },
                                        "CurrentYear": {
                                            "val": "31.049"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "54.461"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "54.461"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "The Transporter Erector Replacement Program (TERP) replaces the current transporter erector used to emplace, extract and transport MM III boosters to and from launch facilities. TERP will update existing drawings, specifications and technical orders to eliminate parts obsolescence and address the intended usage through fielding of Ground Based Strategic Deterrent (GBSD). The development contract, awarded 22 May 2013, included five pre-priced annual production options. Option 1 will be exercised in FY17 using FY16 and FY17 funding after successful completion of first article qualification. Options 2, 3, and 4 will be awarded in FY18 using FY17 and FY18 funding for a total procurement of 19 units over FY17-18."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "10"
                            },
                            "CurrentYear": {
                                "val": "31.049"
                            },
                            "BudgetYearOneBase": {
                                "val": "54.461"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "54.461"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}