{
    "id": "2018-Navy-PB-1109N-JBOOK-17739c5c620c15f539dc8999b4e6e3d77ad81ce51089eece75bc6066efab4ac2-49",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "6520"
        },
        "LineItemTitle": {
            "val": "EOD Systems"
        },
        "P1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "6460.081"
                },
                "PriorYear": {
                    "val": "5.165"
                },
                "CurrentYear": {
                    "val": "110.321"
                },
                "BudgetYearOneBase": {
                    "val": "27.24"
                },
                "BudgetYearOneOCO": {
                    "val": "21"
                },
                "BudgetYearOne": {
                    "val": "48.24"
                },
                "BudgetYearTwo": {
                    "val": "37.046"
                },
                "BudgetYearThree": {
                    "val": "22.832"
                },
                "BudgetYearFour": {
                    "val": "23.212"
                },
                "BudgetYearFive": {
                    "val": "23.6"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "6460.081"
                },
                "PriorYear": {
                    "val": "5.165"
                },
                "CurrentYear": {
                    "val": "110.321"
                },
                "BudgetYearOneBase": {
                    "val": "27.24"
                },
                "BudgetYearOneOCO": {
                    "val": "21"
                },
                "BudgetYearOne": {
                    "val": "48.24"
                },
                "BudgetYearTwo": {
                    "val": "37.046"
                },
                "BudgetYearThree": {
                    "val": "22.832"
                },
                "BudgetYearFour": {
                    "val": "23.212"
                },
                "BudgetYearFive": {
                    "val": "23.6"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "6460.081"
                },
                "PriorYear": {
                    "val": "5.165"
                },
                "CurrentYear": {
                    "val": "110.321"
                },
                "BudgetYearOneBase": {
                    "val": "27.24"
                },
                "BudgetYearOneOCO": {
                    "val": "21"
                },
                "BudgetYearOne": {
                    "val": "48.24"
                },
                "BudgetYearTwo": {
                    "val": "37.046"
                },
                "BudgetYearThree": {
                    "val": "22.832"
                },
                "BudgetYearFour": {
                    "val": "23.212"
                },
                "BudgetYearFive": {
                    "val": "23.6"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206211M"
                },
                {
                    "val": "0206313M"
                },
                {
                    "val": "0206623M"
                },
                {
                    "val": "0206315M"
                },
                {
                    "val": "0502511M"
                },
                {
                    "val": "0206624M"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "5.165"
                                },
                                "CurrentYear": {
                                    "val": "107.471"
                                },
                                "BudgetYearOneBase": {
                                    "val": "27.24"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "21"
                                },
                                "BudgetYearOne": {
                                    "val": "48.24"
                                },
                                "BudgetYearTwo": {
                                    "val": "37.046"
                                },
                                "BudgetYearThree": {
                                    "val": "22.832"
                                },
                                "BudgetYearFour": {
                                    "val": "23.212"
                                },
                                "BudgetYearFive": {
                                    "val": "23.6"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "CurrentYear": {
                                    "val": "2.85"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "5.165"
                    },
                    "CurrentYear": {
                        "val": "110.321"
                    },
                    "BudgetYearOneBase": {
                        "val": "27.24"
                    },
                    "BudgetYearOneOCO": {
                        "val": "21"
                    },
                    "BudgetYearOne": {
                        "val": "48.24"
                    },
                    "BudgetYearTwo": {
                        "val": "37.046"
                    },
                    "BudgetYearThree": {
                        "val": "22.832"
                    },
                    "BudgetYearFour": {
                        "val": "23.212"
                    },
                    "BudgetYearFive": {
                        "val": "23.6"
                    }
                }
            }
        },
        "Description": {
            "val": "ASSAULT BREACHER VEHICLE (ABV) is a tracked, armored combat engineer vehicle designed to breach minefields and complex obstacles and provide a deliberate and in-stride breaching capability. ABV consists of a rebuilt and upgraded M1A1 Tank chassis with the integration of Non-Developmental Items (NDI), which includes a Full-Width Mine Plow, a Dozer Blade, a Surface Mine Plow, a Rapid Ordnance Removal System, two M58 Linear Demolition Charges, a lane marking system and a self-defense weapon system. The ABV will provide crew protection and vehicle survivability while having the speed and mobility to keep pace with the maneuver force. The M1A1 Tank Chassis will provide economic supportability of the system through its commonality with the tank fleet and armor protection for survivability.\n\nMK 154 MODERNIZATION is a line charge launcher system installed in the Amphibious Assault Vehicle Personnel variant (AAVP7) used to breach mine fields in shallow water and inland areas, providing the USMC with an amphibious operations breaching capability.\n\nFAMILY OF EOD EQUIPMENT supports Marine operating forces, national security strategy, and force protection by locating, accessing, identifying, rendering safe, neutralizing, and disposing of hazards from foreign and domestic, conventional, chemical, biological, radiological, nuclear, and high yield explosives (CBRNE), unexploded explosive ordnance (UXO), improvised explosive devices (IEDs), and weapons of mass destruction (WMD) that present a threat to operations, installations, personnel, or materiel. The Explosive Ordnance Disposal (EOD) mission provides a means to neutralize the hazards associated with explosive ordnance that are beyond the normal capabilities of other specialties that present a threat to operations, installations, personnel and material. The Family of EOD Equipment accomplishes this mission by detecting, identifying, rendering safe, recovering, evacuating and disassembling, and\/or disposing of unexploded ordnance with a variety of EOD specialized equipment and tool kits.\n\nMINE RESISTANT AMBUSH PROTECTED (MRAP) Family of Vehicles (FoV) provides Warfighters multi-mission platforms capable of mitigating Improvised Explosive Devices (IEDs), underbody mines, and small arms fire threats, which are currently the greatest casualty producers in Overseas Contingency Operations (OCO). Multiple vehicle categories (CATs) have been procured, fielded, and sustained: MRAP-All Terrain Vehicle (M-ATV) - Combat operations (ops) in rural, mountainous, urban terrain.  Category I - Urban combat operations, ambulance. Category II - Multi-mission ops-convoy lead, troop transport, ambulance, utility vehicle. Category III - Mine\/IED clearance ops, explosive ordnance disposal. Funding includes required Government Furnished Equipment (GFE)\/subsystems and Engineering Change Proposal (ECP)\/Capability Insertion in response to an UUNS\/JUONS and Warfighter safety and survivability requirements.\n\nCOUNTER RADIO-CONTROLLED IMPROVISED EXPLOSIVE DEVICE (RCIED) ELECTRONIC WARFARE (USMC CREW) SYSTEMS are vehicle mounted and dismounted modular programmable multi-band radio frequency jammers designed to deny enemy use of selected portions of the radio frequency spectrum in the vicinity of the jammer to counter the RCIED threat. The mounted and dismounted systems provide Marines in vehicle convoys and on foot with the necessary protection from the continued and evolving threat of deadly RCIEDs.  Legacy CREW systems are currently deployed to meet threats in the multiple theaters of operation and fielded to selected Marine Expeditionary Units (MEU)\/Marine Expeditionary Forces (MEF) in support of worldwide deployment. The mounted CREW Systems will receive a performance upgrade with contracting efforts starting in FY17 using OCO funding."
        },
        "Justification": {
            "val": "FY2018 Base Appropriation Request: $27.240M \n\nCREW Systems: The decrease in funding from FY2017 to FY2018 ($75.00M) completes procurement of 1,845 Mounted CREW Systems using FY17 OCO funding.\n\nMINE RESISTANT AMBUSH PROTECTED (MRAP) VEHICLES: ($1.152M) Funds ECP upgrades for the enduring MRAP vehicle requirement.  The increase from FY17 to FY18 ($0.806M) continues ECP Block III Upgrades and Egress Installations to maintain vehicle relevancy in meeting force protection threats, such as blast, rollover or water submersion events, and responding to operational needs.\n\nFAMILY OF EOD EQUIPMENT: ($26.087M) Funds Supply Stock Lists (SL-3) Kits to include specialized tools.  The decrease of $8.495 from FY 2017 to FY 2018 is attributed to the $21.300 million required in FY2017 to upgrade critical equipment required to mitigate significant risk to EOD Technicians executing tasks within an explosive hazardous serious injury zone.  Supports the procurement of AN\/PVS-31 Optic Sights (with helmet mounts) and AN\/PAS-29 Enhanced Clip-On Thermal Imagers (ECOTI) as well as various specialized EOD kits and EOD equipment.\n\n\nASSAULT BREACHER VEHICLE MODIFICATION:  ($00.001M)  Funds support M1A1 Upgrade.\n\nOCO: \nFY 2018 Overseas Contingency Operations (OCO) Request: $21.000M\n\nMINE RESISTANT AMBUSH PROTECTED(MRAP) Family of Vehicles(FOV):$4,000 Funds the installation of Egress kits procured in response to UUUNS 08275UC and 10215UC the MARCENT Enduring requirements.  The Egress kit increases force protection on all Cougar CAT I and CAT II variants by ensuring that vehicle occupants can safely exit the vehicle after blast, rollover or water submersion events.\n\nFAMILY OF EOD EQUIPMENT: ($17.000M) - Procures Commercial Off the Shelf (COTS) equipment to include sensor detectors, video fiber optic scopes, Improvised Explosive Devices (IED)\/Weapons of Mass Destruction (WMD) diagnostic kits and fusion optics. These capabilities will give the EOD technician precision capabilities to counter IEDs\/WMDs during category \"A\" incidents where the EOD technician is required to assume a grave and immediate risk and physically operate within the very serious injury zone. Continue to provide support to EOD operations currently in support of U.S. Forces Central Command (CENT) and other \"new norm\" (ONN) Special Purpose Marine Air Ground Task Forces (SPMAGTFs) Crisis Response (CR) postured world-wide require a multitude of EOD specific equipment items to achieve full readiness, enabling supported units and nations engaged against the threat and use of IEDs, WMDs, and Unexploded Explosive Ordnance (UXO)."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "EOD Systems"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Assault Breacher Vehicle (ABV)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Assault Breacher Vehicle (ABV) Modification"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.13"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.568"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.393"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.001"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.001"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "6.13"
                                        },
                                        "PriorYear": {
                                            "val": "0.568"
                                        },
                                        "CurrentYear": {
                                            "val": "0.393"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.001"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.001"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Family of EOD Systems"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Various tool kits are procured.  EOD tool kits include CBNRE kits, Search kits, Tech kits, Tool kits, SL3 kits, GO kits, and IED kits. FY18 base and OCO will procure sensor detectors, video fiber optic scopes, Improvised Explosive Devices (IED)\/Weapons of Mass Destruction (WMD) diagnostic kits and fusion optics.",
                                                "val": "2.1) EOD Specialized Equipment and Tool Kits"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "119.969"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.294"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "31.732"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "26.087"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "17"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "43.087"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) EOD Reserves"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "2.85"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "119.969"
                                        },
                                        "PriorYear": {
                                            "val": "3.294"
                                        },
                                        "CurrentYear": {
                                            "val": "34.582"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "26.087"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "17"
                                        },
                                        "BudgetYearOne": {
                                            "val": "43.087"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) MK 154 Remanufacture"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) MK 154 Remanufacture"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "48"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.761"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.795"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "182520.83"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "8.761"
                                        },
                                        "PriorYear": {
                                            "val": "0.795"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) Mine Resistant Ambush Protected (MRAP)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) Upgrades"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.508"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.346"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.152"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "4"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.152"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.2) Prior Years Cumulative Funding"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6296.296"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "6296.296"
                                        },
                                        "PriorYear": {
                                            "val": "0.508"
                                        },
                                        "CurrentYear": {
                                            "val": "0.346"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.152"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "4"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.152"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) COUNTER RCIED ELECTRONIC WARFARE (USMC CREW)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) CVRJ Augmentation Program"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "75"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "75"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "7) Prior Years Cumulative Funding"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "7.1) Other Prior Year"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "28.925"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "28.925"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "6460.081"
                            },
                            "PriorYear": {
                                "val": "5.165"
                            },
                            "CurrentYear": {
                                "val": "110.321"
                            },
                            "BudgetYearOneBase": {
                                "val": "27.24"
                            },
                            "BudgetYearOneOCO": {
                                "val": "21"
                            },
                            "BudgetYearOne": {
                                "val": "48.24"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}