{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-6",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2210"
        },
        "LineItemTitle": {
            "val": "Submarine Acoustic Warfare System"
        },
        "P1LineNumber": {
            "val": "49"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "ASW Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "94.341"
                },
                "PriorYear": {
                    "val": "19.718"
                },
                "CurrentYear": {
                    "val": "21.291"
                },
                "BudgetYearOneBase": {
                    "val": "21.449"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "21.449"
                },
                "BudgetYearTwo": {
                    "val": "24.09"
                },
                "BudgetYearThree": {
                    "val": "26.218"
                },
                "BudgetYearFour": {
                    "val": "26.738"
                },
                "BudgetYearFive": {
                    "val": "27.272"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "94.341"
                },
                "PriorYear": {
                    "val": "19.718"
                },
                "CurrentYear": {
                    "val": "21.291"
                },
                "BudgetYearOneBase": {
                    "val": "21.449"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "21.449"
                },
                "BudgetYearTwo": {
                    "val": "24.09"
                },
                "BudgetYearThree": {
                    "val": "26.218"
                },
                "BudgetYearFour": {
                    "val": "26.738"
                },
                "BudgetYearFive": {
                    "val": "27.272"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "94.341"
                },
                "PriorYear": {
                    "val": "19.718"
                },
                "CurrentYear": {
                    "val": "21.291"
                },
                "BudgetYearOneBase": {
                    "val": "21.449"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "21.449"
                },
                "BudgetYearTwo": {
                    "val": "24.09"
                },
                "BudgetYearThree": {
                    "val": "26.218"
                },
                "BudgetYearFour": {
                    "val": "26.738"
                },
                "BudgetYearFive": {
                    "val": "27.272"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.401"
                },
                "CurrentYear": {
                    "val": "0.366"
                },
                "BudgetYearOneBase": {
                    "val": "2.023"
                },
                "BudgetYearOne": {
                    "val": "2.023"
                },
                "BudgetYearTwo": {
                    "val": "0.998"
                },
                "BudgetYearThree": {
                    "val": "1.349"
                },
                "BudgetYearFour": {
                    "val": "1.188"
                },
                "BudgetYearFive": {
                    "val": "1.046"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Submarine Acoustic Warfare System (SAWS) program provides submarines with expendable defensive countermeasures and the systems necessary to externally launch them against torpedo and acoustic sensor threats. This program provides ongoing production of countermeasure devices needed to sustain fleet inventories, improvements to enhance the readiness and effectiveness of countermeasure devices and associated external countermeasure launcher (ECL) systems on all U.S. submarines. The expendable devices, Acoustic Device Countermeasures (ADC) are produced in two primary versions 3\" ADC's are launched through the Internal Countermeasure Launcher (ICL) and 6\" devices are launched through ECL Systems. An updated increased Acoustic Augmentation Support Program(AASP)SHIPALT installation cost estimate has slowed installs through FYDP and funds are shifted to accommodate increases in CSA engineering technology refresh and insertion costs, driven by ADC MK5 (NGCM) testing, and introduction in FY22-24.\n\nWM018 - The Acoustic Augmentation Support Program (AASP) provides acoustic augmenting systems in appropriate configurations for all submarine classes (except SEAWOLF) installed as temporary equipment (a TEMPALT). A permanently installed Ship Alteration (SHIPALT)configuration for VIRGINIA Class Block I\/II\/III was developed and installations will start in FY17 (delayed from FY16 because budget insufficient for initial installation cost estimates). A permanent SHIPALT for VIRGINIA Class Block IV will be developed in FY17 and installations will start in FY26, gradually phasing out the TEMPALTs on VIRGINIA Class. Reliability and refresh upgrades sustain current in-service AASP systems with new components and software updates to maintain reliability.\n\n\nWM019 - The Countermeasure Set, Acoustic (CSA) program procures and supports the inboard electronic system necessary for preparing and launching 6\" Acoustic Device Countermeasures (ADCs) from all 688i and newer U.S. submarines. This inboard system consists of the Torpedo Defense Controller (TDC), Launch Control Panels (LCPs), and associated cabling, in a class-by-class configuration. The CSA program provides obsolescence support for legacy systems and engineering changes to accommodate modified and planned new devices, such as the ADC MK5. Four efforts are supported: (1) the \"Technology Refresh\" effort is designing, building, testing and certifying replacement components for obsolete CSA MK2 systems (MOD0\/3\/4) on 688i SSN and OHIO SSBN submarines, with the refresh occurring in FY16-FY20. (2) The \"CSA MK3 Technology Insertion\" effort is federating the CSA MK3 system with Submarine Warfare Federated Tactical System (SWFTS) to facilitate the ADC MK5 and Submarine Torpedo Defense Tactical Decision Aid (SubTDS TacDA) upon introduction. A phased approach was taken to allow a more efficient incremental implementation of initial capabilities. Required funding is expected to level off after ADC MK5 device fielding and address recurring upgrades with Advanced Processor Build\/ Technology Insertion (APB\/TI) cycles. (3) The \"CSA MK4 Technology Insertion\" effort replaces CSA MK2 MOD2 with CSA MK4 as a \"SWFTS-federated\" system on VIRGINIA Class Block I and II submarines (10 hulls) to accommodate the introduction of ADC MK5 devices. Non-recurring engineering will complete, with installs starting in FY19. (4) The fourth effort is the ongoing support of engineering issues across all CSA systems as they arise.\n\n[P40A \/ WM014 6 INCH]: WM014 6 INCH - The 6\" Countermeasures program procures, reworks, and refreshes ADC MK3 (torpedo countermeasure) devices, ADC MK4 (SONAR countermeasure) devices, and associated Launch Tubes in order to maintain submarine fleet countermeasure device inventory levels in accordance with the Naval Munition Requirements Process\n(NMRP). The 6\" Countermeasure program tracks and implements device improvements through configuration control and an Engineering Change Proposal (ECP) process. A Service Life Extension Program (SLEP) was initiated in FY14 for ADC MK3 and MK4 devices to extend the usability of 6\" devices. The next projected procurement contract will occur in FY19.\n\n[P40A \/ WM015 3 INCH]: WM015 3 INCH - The 3\" Countermeasures program procures NAE Beacon MK3 MODs 3 and 4, and ADC MK2 MODs 3, 5, and 7 countermeasure devices in order to maintain submarine fleet countermeasure device inventory levels in accordance with the Naval Munition Requirements Process (NMRP). The 3\" Countermeasures program tracks and implements device improvements through configuration control and the ECP process. The Next Generation Countermeasure (NGCM) Program will transition the ADC MK5 into production outside of the FYDP, nominally starting in FY25, to become a part of the 3\" countermeasure program. A shelf life extension completed in FY16, resulted in extending the shelf life from eight (8) to ten (10) years for ADC MK2 MODs 3,5 with set shelf life for ADC MK2 MOD 7 at 12years\n\n[P40A \/ WM022 GAS GENERATOR MK77]: WM022 Gas Generator MK 77 - The MK77 Gas Generator (GG) program procures the energetic components required to launch the ADC MK3 and ADC MK4 countermeasure devices from the External Countermeasure Launchers (ECLs). The GG program also reworks existing devices to extend their service life, and tracks and implements device improvements through configuration control and ECP process. A SLEP for MK77 MOD0 devices was completed in FY16, resulted in extending the service life from two (2) to four (4) years for all devices except those installed aboard SSGN class submarines.\n\n[P40A \/ WM830 PRODUCTION ENGINEERING]: WM830 -  Production Engineering - The Production Engineering line provides production engineering services for SAWS Technical Design Agent (TDA) and In-Service Engineering Agent (ISEA) across all SAWS systems, including AASP.\n\n[P40A \/ PRODUCTION ENGINEERING]: Production Engineering adjustment commensurate with anticipated work.  To support the ordnance assessment that is planned to extend the service life.\n\n[P40A \/ WM900 CONSULTING SERVICES]: WM900 Consulting Services - The Consulting Services line procures contractor support services for all SAWS programs."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Submarine Acoustic Warfare System"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) WM014 6 INCH"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Rework of launch tubes (LT) assumed in FY17 and FY18 in conjunction with rework and production of ADC MK3 and MK4 at OEM. Starting in FY19, LT's are included in next contract for ADC MK3 and MK4. Quantities reduced in FY18 from PB17 estimate to balance with MK3 and MK4 quantities.",
                                                "val": "1.1) 6\" Countermeasure Launch Tube"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "628"
                                                    },
                                                    "PriorYear": {
                                                        "val": "200"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "177"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "125"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "125"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.553"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.907"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.721"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.721"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "10434.71"
                                                    },
                                                    "PriorYear": {
                                                        "val": "5000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "5125"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5770"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5770"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Procures new and rework ADC MK3 Acoustic Device Countermeasures. Plans FY19 contract for ADC MK3 and ADC MK4, including launch tubes, assuming one year of NRE and follow-on production orders for new units in FY20. In FY17 and FY18 ADC MK3 Shelf Life Extension Program (SLEP) rework cost is broken out from ADC MK3 \"new\" cost for clarification of units and unit cost from PB17 estimate. Ratio of SLEP to new procurement units may vary due to the variation in SLEP unit costs dependent on unit condition. Identified budget will balance new procurement units with SLEP rework units to maximize inventory. Planned quantities of new production increased in FY18 from PB17 due to limitation of units suitable for SLEP. The unit price is based on step ladder quantity pricing in the contractor's proposal.  The Government added an additional cost of 10% to cover the In-Service Engineering Agent (ISEA) and Technical Direction Agent (TDA).   The FY19 ADC MK3 and ADC MK4 contract was calculated with NRE cost for startup, including First Article Testing of $7.2 million, which was based on historical expenditure in previous competitive startup efforts.",
                                                "val": "1.2) ADC MK3 (TORPEDO) NEW"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "532"
                                                    },
                                                    "PriorYear": {
                                                        "val": "40"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "32"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "32"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "32"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "16.639"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.193"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.41"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.41"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "31276.32"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "37275"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "44056"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "44056"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "ADC MK3 SLEP broken out from ADC MK3 new cost element for clarification of units and unit cost in FY17 and FY18. SLEP unit refresh\/rework actual quantities and unit cost may vary based on availability and condition of units to be refreshed. Identified budget will balance new procurement with SLEP rework to maximize inventory. Plan quantities of SLEP decreased in FY18 due to limitation of suitable units. Budget transferred to new procurements of ADC MK3. The increase in APUC by 10% is the historical amount that has been added to the unit price to cover the engineering efforts of the ISEA and TDA. This has normally been spread out across the units. The engineering cost is imbedded in the unit price. Historically it has been at 10% but for FY18, 19, and 20 it is 18% to cover the cost of the ordnance assessment that is planned for these years to extend the service life.",
                                                "val": "1.4) MK 3 ADC SLEP"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "88"
                                                    },
                                                    "PriorYear": {
                                                        "val": "150"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "88"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "52"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "52"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.53"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.8"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.448"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.297"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.297"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "6022.73"
                                                    },
                                                    "PriorYear": {
                                                        "val": "12000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "5090.91"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5720"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5720"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "ADC MK4 SLEP broken out from ADC MK4 cost element for clarification of units and unit cost in FY17 through FY18. SLEP unit refresh\/rework actual quantities and unit cost may vary based on 2018 Budget Descriptions & Notes availability and condition of units to be refreshed. The increase in APUC by 10% is the historical amount that has been added to the unit price to cover the engineering efforts of the ISEA and TDA.  This has normally been spread out across the units.",
                                                "val": "1.6) ADC MK 4 SLEP"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "24"
                                                    },
                                                    "PriorYear": {
                                                        "val": "50"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "52"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "36"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "36"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.413"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.6"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.441"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.352"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.352"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "17208.33"
                                                    },
                                                    "PriorYear": {
                                                        "val": "12000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "8472"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9791"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9791"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "24.135"
                                        },
                                        "PriorYear": {
                                            "val": "3.4"
                                        },
                                        "CurrentYear": {
                                            "val": "2.989"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.78"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.78"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) WM015 3 INCH"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "NAE Beacon contract awarded in May 2014 changed unit cost which was used in FY16. Previously planned follow on production contract in FY20 for NAE Beacons is no longer necessary due to ADC MK2 MOD7 incorporating NAE Beacon functionality.",
                                                "val": "2.1) NAE BEACON"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1907"
                                                    },
                                                    "PriorYear": {
                                                        "val": "514"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "11.234"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.519"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "5890.93"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4900"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "New contract awarded in FY16 for MK2 MOD7 production and the current costs identified are based on actual contract pricing. The FY17 unit cost was an estimate. Since the contract has been awarded the current costs identified are based on actual contract pricing.  Increased quantities necessary starting in FY19 to replace prior planned NAE Beacon procurements units in FY20-22 as ADC MK2 MOD7 replaces NAE Beacon function. The increase in APUC by 10% is the historical amount that has been added to the unit price to cover the engineering efforts of the ISEA and TDA.  This has normally been spread out across the units.",
                                                "val": "2.2) ADC MK2"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1442"
                                                    },
                                                    "PriorYear": {
                                                        "val": "88"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "100"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "100"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "100"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.919"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.511"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.6"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.619"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.619"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "5491.68"
                                                    },
                                                    "PriorYear": {
                                                        "val": "5802"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "6000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "6185"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6185"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "19.153"
                                        },
                                        "PriorYear": {
                                            "val": "3.03"
                                        },
                                        "CurrentYear": {
                                            "val": "0.6"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.619"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.619"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) WM022 GAS GENERATOR MK77"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Cost increase of MK77 beginning FY17 is due to reflecting only unit cost increase of MK77 MOD1 in new production. MK77 MOD1 GGs are procured as wholly new devices; obsolete components are not used for this unit. Unit cost includes prorated share of management and engineering oversight. MK77 MOD1 new production is broken out for clarification of units and unit cost where MK77 MOD0 rework is planned. The engineering cost is imbedded in the unit price. The increase in APUC by 10% is the historical amount that has been added to the unit price to cover the engineering efforts of the ISEA and TDA.  This has normally been spread out across the units.",
                                                "val": "3.1) GAS GENERATOR MK77 MOD 1 NEW PRODUCTION"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1416"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "138"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "80"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "80"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "15.266"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.828"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.518"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.518"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "10781.07"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "20492.75"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "18975"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "18975"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "MK77 GGs are broken out for clarification of units and unit cost. In FY16, single unit cost includes cost of management and engineering oversight. In FY18 and beyond, engineering and management costs are prorated to Mod 0 and Mod 1 production costs. MK77 MOD0 are reworked gas generators - reuse of energetics to end of life (22 to 32 years).",
                                                "val": "3.2) Gas Generator MK77 Mod 0"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "270"
                                                    },
                                                    "PriorYear": {
                                                        "val": "300"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "41"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "40"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "40"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.962"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.274"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.508"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.499"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.499"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "7266.67"
                                                    },
                                                    "PriorYear": {
                                                        "val": "10911.67"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "12390.24"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "12463"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "12463"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "17.228"
                                        },
                                        "PriorYear": {
                                            "val": "3.274"
                                        },
                                        "CurrentYear": {
                                            "val": "3.336"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.017"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.017"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) WM830 PRODUCTION ENGINEERING"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) PRODUCTION ENGINEERING"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.081"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.947"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.894"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.758"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.758"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "7.081"
                                        },
                                        "PriorYear": {
                                            "val": "0.947"
                                        },
                                        "CurrentYear": {
                                            "val": "1.894"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.758"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.758"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) WM900 CONSULTING SERVICES"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) CONSULTING SERVICES"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.858"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.349"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.46"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.469"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.469"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "1.858"
                                        },
                                        "PriorYear": {
                                            "val": "0.349"
                                        },
                                        "CurrentYear": {
                                            "val": "0.46"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.469"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.469"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "69.455"
                            },
                            "PriorYear": {
                                "val": "11"
                            },
                            "CurrentYear": {
                                "val": "9.279"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.643"
                            },
                            "BudgetYearOne": {
                                "val": "7.643"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "AASP WM018"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "B Kits\/Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Includes production support for SHIPALT 4678.  FY17 Increased 1.1.1 with funds from 1.1.3.  This increase is due to the Information Assurance effort.  FY19 increase in 1.1.1 is due to installations and support.  These costs are for 2 FTE to manage the effort (including the IA requirements) and match with the SWFTS upgrade cycle.",
                                                "val": "WM018 AASP Support"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.165"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.274"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.175"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.175"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "An additional HLF-1 transducer is procured in FY19 ($610K) which increases the unit cost per system. Anticipated cost for installation in FY16 exceeded available funds, consequently, the installation was shifted to FY17 with the additional funding identified.",
                                                "val": "WM018 AASP (Acoustic Augmentation Support Program) -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.864"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.879"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.821"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.821"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "863600"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "879000"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "910500"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "910500"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "WM018 AASP (Acoustic Augmentation Support Program) -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.39"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.026"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.026"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Installations will occur one or two years after procurement due to long term availabilities scheduling. Installation quantities updated in order to accommodate the current budget with the new increased installation cost.",
                                                "val": "WM018 AASP Reliability and Refurbishment Upgrade -- Procurement"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.1"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "100000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "WM018 AASP Reliability and Refurbishment Upgrade -- Installation"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.375"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0.1"
                                        },
                                        "PriorYear": {
                                            "val": "1.404"
                                        },
                                        "CurrentYear": {
                                            "val": "1.543"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.022"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.022"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "B Kits\/Non-Recurrring"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "FY17 Installations will use FY16 funds for installation (.758) on FY17 Installation funds.",
                                                "val": "WM018 AASP (Acoustic Augmentation Support Program)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.95"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.3"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "3.95"
                                        },
                                        "CurrentYear": {
                                            "val": "1.3"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "The Acoustic Augmentation Support Program (AASP) provides acoustic augmenting systems in appropriate configurations for all submarine classes (except SEAWOLF) installed as temporary equipment (a TEMPALT). A permanently installed Ship Alteration (SHIPALT) configuration for VIRGINIA Class Block I\/II\/III was developed and installations will start in FY17 (delayed from FY16 due because budget insufficient for installation cost estimates). A permanent SHIPALT for VIRGINIA Class Block IV will be developed in FY17 and installations will start in FY26, gradually phasing out the TEMPALTs on VIRGINIA Class. Reliability and refresh upgrades sustain current in-service AASP systems with new components and software updates to maintain reliability.\nIncludes production support for BLK I-IV SHIPALTS and the AASP reliability and refurbishment upgrade.\nAASP includes costs of procuring new systems and reuse of available components, including the HLF-1, for SHIPALT installation such that \"unit cost\" is a mix of new and used components. An additional HLF-1 transducer (not a complete full system) is procured in FY17 ($587K) and FY19 ($610K).\nReliability and refurbishment upgrade to sustain current in-service AASP systems.\nNon-recurring costs to produce AASP SHIPALT Package."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "4.05"
                            },
                            "PriorYear": {
                                "val": "1.404"
                            },
                            "CurrentYear": {
                                "val": "2.843"
                            },
                            "BudgetYearOneBase": {
                                "val": "3.022"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "3.022"
                            }
                        }
                    }
                }
            ],
            "P3AModificationItemGroup": [
                {
                    "ModificationTitle": {
                        "val": "CSA WM019"
                    },
                    "ModificationNumber": {
                        "val": "2"
                    },
                    "ModificationType": {
                        "val": "TBD"
                    },
                    "Model": {
                        "val": "[No Model Specified]"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "20.836"
                            },
                            "PriorYear": {
                                "val": "7.314"
                            },
                            "CurrentYear": {
                                "val": "9.169"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.784"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "10.784"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "20.836"
                            },
                            "PriorYear": {
                                "val": "7.314"
                            },
                            "CurrentYear": {
                                "val": "9.169"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.784"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "10.784"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "20.836"
                            },
                            "PriorYear": {
                                "val": "7.314"
                            },
                            "CurrentYear": {
                                "val": "9.169"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.784"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "10.784"
                            }
                        }
                    },
                    "SupportCost": {
                        "CostElementList": {
                            "CostElement": [
                                {
                                    "Name": {
                                        "@footnote": "Installations were updated to reflect the current install schedule on Naval Tool for Interoperability Risk Assessment (NTIRA).                                                                                                                                                                       (22)VIRGINIA Block I\/II OPN procurements of initial CSA MK4 to maximize the Economical Order Quantities (EOQ) from 10 systems in FY17-FY20 at $5.65M to equivalent 10 systems in FY17-FY19 at $4.65M.",
                                        "val": "2.1) WM019 CSA ISEA"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "4.409"
                                            },
                                            "PriorYear": {
                                                "val": "0.739"
                                            },
                                            "CurrentYear": {
                                                "val": "0.752"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.771"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.771"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "CategorySubtotal": {
                            "TotalCost": {
                                "AllPriorYears": {
                                    "val": "4.409"
                                },
                                "PriorYear": {
                                    "val": "0.739"
                                },
                                "CurrentYear": {
                                    "val": "0.752"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.771"
                                },
                                "BudgetYearOne": {
                                    "val": "0.771"
                                }
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "CSA WM019"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "@footnote": "For FY18, CSA MK2 MOD2 Conversion to MK4 funds were reduced to accommodate: 1) Increase to CSA MK3 Engineering Changes in FY18 ($1.3M) to address continuing TI\/APB changes;[Line 1.1.1] We will be required to maintain compatibility with SWFTS this includes software development efforts, Environmental Qualification Testing (EQT), NUWC (Newport and Keyport support)and integration with NGCM. This will also develop the Engineering Change Instruction and ShipALT development associated with this effort.   2) Increase to VIRGINIA Block I\/II OPN procurements of CSA MK4 systems in FY18 ($1M) as part of Economical Order Quantity (EOQ) maximization (refer to Footnote 22);and [Line 1.1.4] 3)Increase to CSA MK4 non-recurring costs ($1.4M)(refer to Footnote 20).[Line 1.2.1].",
                                                            "val": "1.1.1) WM019 CSA MK3 Engineering Changes (LAN, SWFTS, TDA) - Organic"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "7.591"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "1.754"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "0.711"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "1.813"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1.813"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "@footnote": "The changes needed to include SEAWOLF submarine class to the CSA MK3 connection to SWFTS in FY21.",
                                                            "val": "1.1.2) WM019 ECPs CSA MK2 MOD 2 Conversion to MK 4 - Organic"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "CurrentYear": {
                                                                    "val": "4.579"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "2.515"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "2.515"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "@footnote": "Increase to CSA MK2 MOD0 Obsolescence in FY18 ($0.5M) to address increase in labor needs for logistics preparation in support of installation and Check out (INCO) spares associated with the FY18 installations onboard 688i and SSBN classes [Line 1.1.3]",
                                                            "val": "1.1.3) WM019 CSA MK2 MOD 0 OBSOLESCENCE - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "42"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "3.706"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "0.4"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "0.65"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "0.663"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "0.663"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "@footnote": "Procurement of initial CSA MK4 was updated and shifted to maximize the Economical Order of Quantity (EOQ) for VIRGINIA Block I\/II. Furthermore, the line was updated to account for System Kits procurements starting in FY20 at lower unit cost vice the complete systems procured in FY16-19. Also, the CSA MK4 complete system cut from FY17 in earlier budgets is being restored in FY20 to allow completion of the CSA MK 4 on the final VIRGINIA platform. CSA systems after initial suite installation will be updated using hardware kits and software. The kits procurements were added to the line to allow CSA to meet upgrade\/modernization schedules for VIRGINIA Blocks I\/II.  There was a pricing consideration to buy in better Economic Order Quantities (combining with SCN funding), and so the funding in FY18 was realigned such that the installations are starting in FY19 because they better align to the major availabilities and to accommodate in FY18 planned NRE, EQT (Environmental Quality Testing) of prototype units and SHIPALT and Logistics documentation. Increase to VIRGINIA Block I\/II OPN procurements of CSA MK4 systems in FY18 ($1M) as part of Economical Order Quantity (EOQ) maximization.",
                                                            "val": "1.1.4) WM019 CSAMK2 MOD2 CONVERSION to CSA MK4 - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "PriorYear": {
                                                                    "val": "2"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "3"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "5"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "5"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "PriorYear": {
                                                                    "val": "1.08"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "1.652"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "2.142"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "2.142"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "@footnote": "Procurement of CSA MK3 kits was updated in order to support planned installations, upgrades and modernizations of fielded systems on SSGN and VIRGINIA Block III\/IV. The procurement of an additional CSA MK3 kit in FY18 ($0.4M) to support planned installations in FY20. [Line 1.1.5]  Note that two systems procured in FY21 for SEAWOLF class are complete systems vice kits, accounting for the difference in unit costs. The next complete system planned procurement for SEAWOLF class is FY24.   There was a pricing consideration to buy in better Economic Order Quantities (combining with SCN funding), and so the funding in FY18 was realigned such that the installations are starting in FY19 because they better align to the major availabilities and to accommodate in FY18 planned NRE, EQT (Environmental Quality Testing) of prototype units and SHIPALT and Logistics documentation.",
                                                            "val": "1.1.5) WM019 CSAMK3 Kits and Systems - NonOrganic"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "2"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "4"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "4"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "0.3"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "0.13"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "0.76"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "0.76"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "11.597"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.364"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "7.592"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7.893"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7.893"
                                                    }
                                                }
                                            }
                                        },
                                        "NonRecurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "@footnote": "Funding was moved from (line 1.1.2) Increase to CSA MK4 non-recurring costs ($1.4M). Initial prototyping and the ShipAlt\/Logistics documentation.",
                                                            "val": "1.2.1) WM019 CSA MK2 MOD 2 Conversion to CSA MK4 - Organic"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "4.83"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "2.811"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "1.357"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1.357"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "4.83"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2.811"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.357"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.357"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "16.427"
                                                },
                                                "PriorYear": {
                                                    "val": "6.175"
                                                },
                                                "CurrentYear": {
                                                    "val": "7.592"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "9.25"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "9.25"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "CSA MK3 RAYTHEON"
                                                },
                                                "Location": {
                                                    "val": "Keyport, WA"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2016-04"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-04"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2017-10"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2019-10"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "6"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "18"
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CSA MK2 Obsolescence NUWC Keyport"
                                                },
                                                "Location": {
                                                    "val": "Keyport, WA"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2016-02"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-02"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-02"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2017-06"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2018-06"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2019-06"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "4"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "16"
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CSA MK 2 to MK4 RAYTHEON"
                                                },
                                                "Location": {
                                                    "val": "Keyport, WA"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2016-04"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2017-04"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2018-04"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2017-10"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2018-10"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2019-10"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "6"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "18"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "AllPriorYears": {
                                                "val": "44"
                                            },
                                            "PriorYear": {
                                                "val": "3"
                                            },
                                            "CurrentYear": {
                                                "val": "3"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "9"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9"
                                            }
                                        },
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "16.427"
                                            },
                                            "PriorYear": {
                                                "val": "6.175"
                                            },
                                            "CurrentYear": {
                                                "val": "7.592"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "9.25"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9.25"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "AIT:: Installation Name: WM019 CSA MK2 MOD 0 OBSOLESCENCE"
                                                    },
                                                    "InstallationCost": {
                                                        "AllPriorYears": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "PriorYear": {
                                                                        "val": "8"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "16"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "10"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "10"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "PriorYear": {
                                                                        "val": "0.4"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "0.825"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "0.563"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "0.563"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "PriorYear": {
                                                                        "val": "8"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "16"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "10"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "10"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "PriorYear": {
                                                                        "val": "0.4"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "0.825"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "0.563"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "0.563"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "PriorYear": {
                                                                "SecondQuarter": {
                                                                    "val": "8"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "ThirdQuarter": {
                                                                    "val": "16"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "ThirdQuarter": {
                                                                    "val": "10"
                                                                }
                                                            }
                                                        },
                                                        "Out": {
                                                            "PriorYear": {
                                                                "SecondQuarter": {
                                                                    "val": "8"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "ThirdQuarter": {
                                                                    "val": "16"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "ThirdQuarter": {
                                                                    "val": "10"
                                                                }
                                                            }
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "AIT:: Installation Name: WM019 CSAMK2 MOD2 CONVERSION to CSA MK4"
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": [],
                                                        "Out": []
                                                    }
                                                }
                                            },
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "AIT:: Installation Name: WM019 CSAMK3 Kits and Systems"
                                                    },
                                                    "InstallationCost": {
                                                        "AllPriorYears": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "2"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "2"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "0.2"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "0.2"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "2"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "2"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "0.2"
                                                                    },
                                                                    "BudgetYearOneOCO": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "0.2"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "2"
                                                                }
                                                            }
                                                        },
                                                        "Out": {
                                                            "BudgetYearOne": {
                                                                "SecondQuarter": {
                                                                    "val": "2"
                                                                }
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "0"
                                            },
                                            "PriorYear": {
                                                "val": "0.4"
                                            },
                                            "CurrentYear": {
                                                "val": "0.825"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.763"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.763"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "16.427"
                            },
                            "PriorYear": {
                                "val": "6.175"
                            },
                            "CurrentYear": {
                                "val": "7.592"
                            },
                            "BudgetYearOneBase": {
                                "val": "9.25"
                            },
                            "BudgetYearOne": {
                                "val": "9.25"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0.4"
                            },
                            "CurrentYear": {
                                "val": "0.825"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.763"
                            },
                            "BudgetYearOne": {
                                "val": "0.763"
                            }
                        }
                    },
                    "Description": {
                        "val": "WM019 - The Countermeasure Set, Acoustic (CSA) program procures and supports the inboard electronic system necessary for preparing and launching 6\" Acoustic Device Countermeasures (ADCs) from all 688i and newer U.S. submarines. This inboard system consists of the Torpedo Defense Controller (TDC), Launch Control Panels (LCPs), and associated cabling, in a class-by-class configuration. The CSA program provides obsolescence support for legacy systems and engineering changes to accommodate modified and planned new devices, such as the ADC MK5. Four efforts are supported: (1) the \"Technology Refresh\" effort is designing, building, testing and certifying replacement components for obsolete CSA MK2 systems (MOD0\/3\/4) on 688i SSN and OHIO SSBN submarines, with the refresh occurring in FY16-FY20. (2) The \"CSA MK3 Technology Insertion\" effort is federating the CSA MK3 system with Submarine Warfare Federated Tactical System (SWFTS) to facilitate the ADC MK5 and Submarine Torpedo Defense Tactical Decision Aid (SubTDS TacDA) upon introduction. A phased approach was taken to allow a more efficient incremental implementation of initial capabilities. Required funding is expected to level off after ADC MK5 device fielding and address recurring upgrades with Technology Insertion\/Advanced Processor Build (TI\/APB). (3) The \"CSA MK4 Technology Insertion\" effort replaces CSA MK2 MOD2 with CSA MK4 as a \"SWFTS-federated\" system on VIRGINIA Class Block I and II submarines (10 hulls) to accommodate the introduction of ADC MK5 devices. Non-recurring engineering, production testing, EQT and SHIPALT\/Logistics documentation will continue in FY18, with installs starting in FY19 to better align with overall submarine availabilities scheduling. (4) The fourth effort is the ongoing support of engineering issues across all CSA systems as they arise.\n\n[WM019 CSA MK3 Engineering Changes (LAN, SWFTS, TDA)] WM019 CSA MK3 Engineering Changes - (LAN, SWFTS, TacDA) - Organic] Technology insertion effort that supports and designs engineering changes for SSGN, SEAWOLF, and VA Blk III and follow ships, including the Countermeasures Set Acoustic (CSA) system, Torpedo Defense Controller (TDC), and Launch Control Panels (LCPs). This supports changes to correct obsolescence, and engineering changes necessary to accommodate modified devices and new devices, such as the ADC MK5.\n\n[WM019 ECPs CSA MK2 MOD 2 Conversion to MK 4] WM019 - ECPs CSA MK2 MOD2 Conversion to CSA MK4 - Organic] Technology insertion effort that converts CSA MK2 MOD2 to CSA MK4 to accommodate introduction of ADC MK5 to Virginia Class Block 1 and 2 Ships (10 hulls). Proofing will complete in FY18, with replacement installations starting in FY19 to better align with overall submarine availabilities scheduling.\n\n[WM019 CSA MK2 MOD 0 OBSOLESCENCE] WM019 - CSA MK2 MOD0 Obsolescence - NonOrganic Technical refresh effort that designs, builds, tests and certifies replacement components for obsolete CSA MK2 MOD4 on 688i ships and CSA MK2 MOD0 and 3 on SSBNs. Upgrades will occur in FY16-FY20.\n\n[WM019 CSAMK2 MOD2 CONVERSION to CSA MK4] WM019 - CSA MK2 MOD2 Conversion to CSA MK4 - Non Organic Technology Insertion effort that procures engineering change kits and systems including Countermeasures Set Acoustic (CSA) system, Torpedo Defense Controller (TDC), Launch Control Panels (LCPs), and CSA support system assets to correct obsolescence, including engineering changes necessary to accommodate modified devices and new devices, such as the ADC MK5.\n\n[WM019 CSAMK3 Kits and Systems] WM019 - CSA MK3 Kits and Systems - NonOrganic Procures engineering change kits and systems in support of SAWS including Countermeasures Set Acoustic (CSA) system, Torpedo Defense Controller (TDC), Launch Control Panels (LCPs), CSA support system assets to correct obsolescence, including engineering changes necessary to accommodate modified devices and new devices, such as the ADC MK5.\n\n[WM019 CSA MK2 MOD 2 Conversion to CSA MK4] WM019 - CSA MK2 MOD2 Conversion to CSA MK4 - Organic Nonrecurring costs for the Technology Insertion CSA MK4.\n\n[WM019 CSA ISEA] WM019 - CSA ISEA Supports engineering issues across all systems and platforms as they arise, using ISEA support."
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}