{
    "id": "2018-Navy-PB-1810N-JBOOK-86dcb7cde9c6096ba835dc0bb88e12bdad2d586c6c58ccdff71f0e33da4e3769-23",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA2-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2666"
        },
        "LineItemTitle": {
            "val": "American Forces Radio and TV Service (AFRTS)"
        },
        "P1LineNumber": {
            "val": "66"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "7"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Ship Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "29.11"
                },
                "PriorYear": {
                    "val": "4.24"
                },
                "CurrentYear": {
                    "val": "4.577"
                },
                "BudgetYearOneBase": {
                    "val": "2.73"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "2.73"
                },
                "BudgetYearTwo": {
                    "val": "2.67"
                },
                "BudgetYearThree": {
                    "val": "2.803"
                },
                "BudgetYearFour": {
                    "val": "2.853"
                },
                "BudgetYearFive": {
                    "val": "2.798"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "29.11"
                },
                "PriorYear": {
                    "val": "4.24"
                },
                "CurrentYear": {
                    "val": "4.577"
                },
                "BudgetYearOneBase": {
                    "val": "2.73"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "2.73"
                },
                "BudgetYearTwo": {
                    "val": "2.67"
                },
                "BudgetYearThree": {
                    "val": "2.803"
                },
                "BudgetYearFour": {
                    "val": "2.853"
                },
                "BudgetYearFive": {
                    "val": "2.798"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "29.11"
                },
                "PriorYear": {
                    "val": "4.24"
                },
                "CurrentYear": {
                    "val": "4.577"
                },
                "BudgetYearOneBase": {
                    "val": "2.73"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "2.73"
                },
                "BudgetYearTwo": {
                    "val": "2.67"
                },
                "BudgetYearThree": {
                    "val": "2.803"
                },
                "BudgetYearFour": {
                    "val": "2.853"
                },
                "BudgetYearFive": {
                    "val": "2.798"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "K0001:  American Forces Radio and Television Service (AFRTS) Program - AFRTS shipboard systems provide command information to deployed Sailors and Marines and allow for the distribution of AFRTS programming in order to provide situational awareness for forward deployed commanders with real-time news and information.  The systems also provide programming to Sailors and Marines at sea worldwide as a Navy Quality of Life (QOL) initiative, staying in compliance with the Chief of Naval Operations (CNO) Shipboard Habitability Program. These systems contribute significantly to the habitability of Navy ships by providing and distributing news, command information, training, and entertainment programming using the latest technology available. These systems improve morale, combat effectiveness and retention rates of deployed personnel.  All AFRTS systems use Commercial-Off-the-Shelf (COTS) equipment. Fleet Support Detachments (FSDs) are the installing agents for these systems.  Each component replacement is made based on ship availability, condition of system, and is coordinated through the Type Commanders (TYCOMs).\n\n[P5 \/ Site CCTV - Digital\/300]: K0001 - Shipboard Information, Training and Entertainment (SITE) Closed Circuit Television (CCTV) - Digital\/300 - Digital\/300 is the next generation of the SITE 2000\/300. This system is a digitally-based replacement for the 2000\/300 playback. Each system is comprised of Commercial Off-The-Shelf (COTS) components that take three to twelve months to procure. Each component upgrade\/replacement is made based on ship availability, by the Fleet Support Detachments (FSDs) as the installing\/replacement agents and condition of the system.\n\n[P5 \/ Site CCTV - Digital\/400]: Shipboard Information, Training and Entertainment (SITE) Closed Circuit Television (CCTV) - Digital\/400 - is the next generation of the SITE 2000\/400. This system is a digitally-based replacement for the 2000\/400 playback. Requires manpower of one dedicated technician and operator. Each system is comprised of Commercial Off-The-Shelf (COTS) components that take three to twelve months to procure. Each component upgrade\/replacement is made based on ship availability, by the Fleet Support Detachments (FSDs) as the installing\/replacement agents and condition of the system.\n\n[P5 \/ Site CCTV - Digital\/501]: Digital\/500 - is the next generation of the Shipboard Information, Training and Entertainment (SITE) 2000\/500. This system is a digitally-based replacement for the 2000\/500 playback. Requires manpower of two dedicated technicians and three operators. Each system is comprised of Commercial Off-The-Shelf (COTS) components that take three to twelve months to procure. Each component upgrade\/replacement is made based on ship availability, by the Fleet Support Detachments (FSDs) as the installing\/repair agents and condition of the system.\n\n[P5 \/ Circuit 27TV Upgrade]: Circuit 27TV Upgrade - Upgrade to 14TV head end only that will allow the onboard Shipboard Information, Training and Entertainment (SITE) system to distribute Television Direct To Sailors (TV-DTS), AFRTS, and pier-side cable commercial programming. Each component upgrade\/replacement is made based on ship availability by the Fleet Support Detachments (FSDs) as the installing\/replacement agents and the condition of the system.\n\n[P5 \/ Shipboard Broadcast System (SBS)]: K0001-Shipboard Broadcast System (SBS):  The SBS system replaces the Shipboard Information, Training and Entertainment (SITE) 300\/400\/501 systems with an  Internet Protocol (IP) video system.  It collects and converts video content from several sources: Navy Motion Picture Services (NMPS) programming via encrypted DVDs (nDVD), Video Server, and shipboard surveillance cameras; and distributes the signals via Circuit 30 in Standard or High Definition.  Each system is comprised of Commercial Off-The-Shelf (COTS) equipment that takes six to twelve months to procure.  Each system upgrade is done based on ship availability by the Fleet Support Detachments (FSDs) as the installing\/replacing agent and condition of the system.\n\n[P5 \/ K0830 - Production Engineering]: Supports review and approval of any production contract technical documentation or the separate development of this documentation to include:  signal flow diagrams, Preventive Maintenance Services (PMS), production drawings, provisioning technical documentation (PTD), Integrated Logistic Support (ILS), Program Support Data (PSD), Allowance Parts List (APL's), and engineering in support of final design reviews.\n\n[P5 \/ K0INS - Non-FMP Installation]: Supports the installation of Shipboard Information, Training and Entertainment (SITE), TV-DTS (TV-Direct to Sailor) system onboard Navy ships.  Installations are performed by Defense Media Activity Agency (DMAA) Fleet Support Detachments (FSDs) and are based on Type Commander (TYCOM) nominations."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}