{
    "id": "2018-DefenseInformationSystemsAgency-PB-0300D-JBOOK-a42b2f9d8655cbede486cb1d0eacf561ba653cffdf998e4e13e0848d0815dca8-2",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-DEFENSE_DISA-U_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "16"
        },
        "LineItemTitle": {
            "val": "Items Less Than $5 Million"
        },
        "P1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DISA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "511.458"
                },
                "PriorYear": {
                    "val": "10.555"
                },
                "CurrentYear": {
                    "val": "17.493"
                },
                "BudgetYearOneBase": {
                    "val": "15.541"
                },
                "BudgetYearOne": {
                    "val": "15.541"
                },
                "BudgetYearTwo": {
                    "val": "12.683"
                },
                "BudgetYearThree": {
                    "val": "12.74"
                },
                "BudgetYearFour": {
                    "val": "12.971"
                },
                "BudgetYearFive": {
                    "val": "13.295"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "511.458"
                },
                "PriorYear": {
                    "val": "10.555"
                },
                "CurrentYear": {
                    "val": "17.493"
                },
                "BudgetYearOneBase": {
                    "val": "15.541"
                },
                "BudgetYearOne": {
                    "val": "15.541"
                },
                "BudgetYearTwo": {
                    "val": "12.683"
                },
                "BudgetYearThree": {
                    "val": "12.74"
                },
                "BudgetYearFour": {
                    "val": "12.971"
                },
                "BudgetYearFive": {
                    "val": "13.295"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "511.458"
                },
                "PriorYear": {
                    "val": "10.555"
                },
                "CurrentYear": {
                    "val": "17.493"
                },
                "BudgetYearOneBase": {
                    "val": "15.541"
                },
                "BudgetYearOne": {
                    "val": "15.541"
                },
                "BudgetYearTwo": {
                    "val": "12.683"
                },
                "BudgetYearThree": {
                    "val": "12.74"
                },
                "BudgetYearFour": {
                    "val": "12.971"
                },
                "BudgetYearFive": {
                    "val": "13.295"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0303134K"
                },
                {
                    "val": "0701113K"
                },
                {
                    "val": "0303122K"
                },
                {
                    "val": "0301144K"
                },
                {
                    "val": "0303149K"
                }
            ]
        },
        "Description": {
            "val": "Multinational Information Sharing (MNIS):\n\nMNIS is a portfolio of three coalition information sharing capabilities (Combined Enterprise Regional Information Exchange System (CENTRIXS), Pegasus, and the Combined Federated Battle Laboratory Network (CFBLNet) designed to enable and improve sharing of operational and intelligence among United States (US) forces and multinational partners.  This program directly supports five combatant commands and is critical because US forces no longer fight and win independently but rely on close coordination and collaboration with allies and other mission partners.  MNIS increases overall combat effectiveness by leveraging capabilities and information from all partners and reducing the possibility of fratricide. \n \n• CENTRIXS consists of multiple, isolated Communities of Interest (COI) that support multinational efforts including Overseas Contingency Operations and counter-narcotics operations.  Common Mission Network Transport (CMNT) provides the backbone that enables Network Operations (NETOPS) centers to manage individual networks more efficiently.  CMNT provides a common transport for encrypted traffic to meet mission partner communication requirements and facilitate the movement of Virtual Private Network traffic between segments.  This capability supports Department of Defense (DoD) Instruction 8110.1 guidance to integrate CENTRIXS and other operational networks into existing DoD general service communications infrastructure as a separate network servicing all DoD MNIS requirements.\n\n• Pegasus interconnects the National Command and Control (C2) systems of Australia, Canada, New Zealand, United Kingdom and the United States using Cross Domain Solutions to enable information sharing in facilitating situational awareness and strategic planning as well as operational execution. \n  \n• CFBLNet provides a controlled Research, Development, Trials and Assessment coalition information sharing sandbox is used to evaluate new technologies and to develop tactics, techniques, and procedures that facilitate the transition of promising technologies and capabilities into operational multinational information sharing capability enhancements.\n\nFY 2016: ($0.596) Procured and upgraded End of Life (EOL) NSA approved encryptor hardware for cryptographically isolated classified multinational networks.\n\nFY 2017: ($0.623) Will procure NSA encryptor hardware to support classified networks on two Service Delivery Node (SDN) locations.  \n\nExplanation of Change from FY 2016 to FY 2017: The increase +$0.027 is from FY 2016 to FY 2017 to support additional cryptographic hardware devices from the NSA to support MNIS coalition network infrastructure capabilities.  \n\nFY 2018: ($0.708)  Will perform technical refresh of NSA cryptographic equipment at two coalition node locations that support cryptographically isolated network data traffic for Coalition Allies and Mission Partners.\n\t\t\t\t\t\t\t\t\t\t\t\nExplanation of Change from FY 2017 to FY 2018: The increase  of +$0.085 between FY 2017 and FY 2018 is to support additional cryptographic COMSEC hardware devices from NSA that support coalition information sharing at infrastructure node locations \t\t\t\t\t\t\t\t\t\t\t\n\nPerformance Metrics:  \n\nMeasure: (Ongoing) \n-Functional and\/or Security Test & Evaluation (ST&E) test cases.                                  \n\nPerformance Metric:\n-  System provides 99.99% data integrity for authorized users sharing information cross COI.                 \nFY16 (Planned): N\/A\nFY17 (Estimated): N\/A\n\n-  Maintain 99.99% Confidentiality for users, by Nation between COIs.                                         \nFY16 (Planned): N\/A\nFY17 (Estimated): N\/A\n\n-  Direct traffic with 99.99% accuracy for chat, email, VoIP, file transfer, data storage and web service.\nFY16 (Planned): N\/A\nFY17 (Estimated): N\/A\n   \nMethodology:   \n-  Assessment Plan \n-  Sample ≥ 10K transactions (email, chat & file storage\/transfer)                                         \n-  Conduct selected ST&E test cases \n                                                                           \nMeasure: (Ongoing) \n-Security \n  \nPerformance Metric:   \n-  Deny 98.5% of unauthorized user attempts                                                                 \nFY16 (Planned): N\/A\nFY17 (Estimated): N\/A\n\nMethodology:   \n-  Assessment Plan                                                                                         \n-  DISA Field Security Operations (FSO) will conduct penetration testing\n                                    \nMeasure: (Ongoing) \n-Security \n  \nPerformance Metric:   \n-  Audit log captured 99.99% of any unauthorized user activity                                                 \nFY16 (Planned): N\/A\nFY17 (Estimated): N\/A\n   \nMethodology:   \n-  Assessment Plan                                                                                         \n-  Conduct audit log reviews in conjunction                                                                 \n-  FSO penetration tests \n\nMeasure: (Ongoing) \n-Cryptographic Tech Refresh \n  \nPerformance Metric: \n- 2 sites receiving cryptographic tech refresh and\/or hardware replaced prior to End of Life (EOL) per FY.\n                                            \nFY16: 2 Planned \/ 2 Met\nFY17: 2 Planned\nFY18: 2 Planned\n   \n\nWhite House Situation Support Staff (WHSSS):  \n \nWHSSS provides classified communications, computer, and intelligence for the White House Situation Room, the National Security Staff, and other White House offices. WHSSS delivers the ability to meet and maintain a rate of 99.99% reliable telecommunications and information services through state-of-the-art equipment and technology, at the best possible price to the public.   \n \nFY 2016:  ($4.617)  Continued to upgrade and secure critical systems that support classified voice, data and video used in the White House Situation Room and throughout the National Security Council (NSC) for the President, Vice-President, White House Senior Staff, Executive Office of the President and the inter-agency as directed by the Assistant to the President for National Security Affairs.  These systems are also used at White House Continuity of Operations Plan (COOP) and Continuity of Government (COG) locations, Trip Sites and residences. \n\nFY 2017: ($8.329) Will continue to upgrade and secure critical systems that support classified voice, data and video used in the White House Situation Room and throughout the NSC for the President, Vice President, White House Senior Staff, Executive Office of the President and the inter-agency as directed by the Assistant to the President for National Security Affairs.  These systems are also used at White House COOP and COG locations, Trip Sites and residences.  Funding will also support costs associated with increased NSC mission requirements related to the Presidential Information Technology Community (PITC) initiative.  PITC requires WHSSS to support an additional 1700 classified accounts, 400 classified workstations, and 10 geographically separated units.\n\nExplanation of change from FY 2016 to FY 2017:  The increase of +$3.712 from FY 2016 to FY 2017 is attributed to an increase in equipment costs associated with PITC initiative (+$4.073) and is offset by decrease of -$0.361 attributed to savings in licensing costs associated with NSC mission requirements.\n     \nFY 2018: ($8.750) Will continue to upgrade and secure critical systems that support classified voice, data and video used in the White House Situation Room and throughout the NSC for the President, Vice President, White House Senior Staff, Executive Office of the President and the inter-agency as directed by the Assistant to the President for National Security Affairs.  These systems are also used at White House COOP and COG locations, Trip Sites and residences.  Also, funding will continue to support costs associated with increased NSC mission requirements related to the Presidential Information Technology Community (PITC) initiative. \n\nExplanation of change from FY 2017 to FY 2018:  The increase of +$0.421 is to procure additional secure voice infrastructure, equipment and capacity requirements within the NSC required to maintain COOP\/COG capabilities.\n\nPerformance Metrics: Conducts quarterly Independent Process Reviews to maximize performance.  Status is electronically monitored for outages to ensure 99.99% reliable classified telecommunications and information services.\n\nFY16 (Actuals): Met\nFY17 (Target): 99.99%\nFY18 (Target): 99.99%\n\n \nCrisis Management System (CMS) and National Leadership Communications:  \n\nThe CMS is a high performance network that provides classified multi-media teleconferencing for the President, Cabinet Secretaries, designated agency directors, and their staff.  CMS provides near perfect reliability and communications survivability expected by national decision makers.  The expansion of the Executive Voice over Secure IP (VoSIP) telephone network will continue at Presidential locations and other key CMS sites.  \n \nFY 2016:  ($4.786) Continued router and switch replacement of equipment reaching end-of-life to enhance system reliability, availability, and security. Continued to upgrade major consolidated communications site infrastructure for redundancy to serve multiple agency partners.\n\nFY 2017: ($8.507)  Will continue replacement of router, switch, and codec replacement of equipment reaching EOL to enhance system reliability, availability, and security.  Will replace system call manager reaching EOL.  Will continue phases of CMS installation at Western Watch Center as directed by National Security Council.  Will upgrade CMS equipment and capabilities for systems security.  Will deploy next generation TEMPEST executive travel kit for use by executive principals and staff.  Will support implementation of CMS aboard executive aircraft.  Complete change of administration tasks required by Executive Office of the President (EOP). \n\nExplanation of Change from FY 2016 to FY 2017: An increase of +$3.721  from FY 2016 to FY 2017 is due to increased equipment purchases for the Presidential election and administration change in FY 2017, to provide Secure Mobile Communications for Senior National Leaders for the White House, and purchased CMS Mobility infrastructure equipment and the installation on the CMS network.\n\nFY 2018: ($6.025)   Will continue replacement of router, switch, and codec replacement of equipment reaching EOL to enhance system reliability, availability, and security.  Will continue phases of CMS installation at Western Watch Center as directed by National Security Council.\n\nExplanation of Change from FY 2017 to FY 2018: The decrease of -$2.482 from FY 2017 to FY 2018 is due one-time funding for the completion of Secure Mobile Communications for Senior National Leaders  (+$3.000).  This is offset by an increase of +$0.518 to procure equipment required for system security upgrades to meet accreditations as well as perform necessary security upgrades and improvements requested by Program Stakeholders and Mission Partners.\n\nPerformance Metrics: CMS primary performance metrics will include:\n\n1. System availability                                                                                 \nFY 2016   Planned 98%  \/ 99% Achieved\nFY 2017   Target 98%\nFY 2018   Target 98%\n\n2. System emergency repair response time within guideline                    \nFY 2016   Planned 95%  \/ 98% Achieved\nFY 2017   Target 95%\nFY 2018   Target 95%\n\n3. System technology refreshment routers\/switches accomplished \nFY 2016   Planned 100%  \/ 100% Achieved\nFY 2017   Target 100%\nFY 2018   Target 100%  \n\nDISA Europe (DISA-EUR) and DISA Pacific (DISA-PAC):\n\nThe DISA Europe and DISA Pacific Field Commands support the deployment, sustainment and agile operation of the DISA Enterprise to provide critical capabilities in the US European Command (USEUCOM) and US Pacific Command (USPACOM) theaters.  DISA EUR and DISA PAC funding procures cargo carrying vehicles to transport personnel and equipment to perform various tasks to include network outages, performance evaluations, site surveys, and equipment installations and upgrades.  Personnel are required to use the government vehicles for Temporary Duty (TDY) purposes, which decreases cost of commercial transportation while on TDY status.  The planned replacement cycle between DISA EUR and DISA PAC is to alternate years.  Odd years a vehicle in DISA EUR will be replaced and in the even years, two vehicles will be replaced in DISA PAC.\n  \nFY 2016:   ($0.060)  Two cargo carrying vehicles were planned to be replaced for DISA PAC; one in Japan and one in Korea.   \n\nFY 2017:   ($0.034)  One cargo carrying vehicle will be replaced for DISA EUR.\n\nExplanation of Change from FY 2016 to FY 2017:  The decrease of -$0.026 from FY 2016 to FY 2017 is due to the replacment of one cargo vehicle in DISA EUR versus two in DISA PAC.\n\nFY 2018 : ($0.058)  Two cargo carrying vehicles will be replaced for DISA PAC; one in Japan and one in Korea.  \n\nExplanation of Change from FY 2017 to FY 2018:  The increase of +$0.024 from FY 2017 to FY 2018 is due to different configurations and specific vehicle types for two vehicle purchases in Japan and Korea.\n\nPerformance Metrics: \nFY16 (Actual): 2 vehicles planned; 1 purchased\nFY17 (Planned) 1 vehicle \nFY18 (Planned) 2 vehicles \n\n\nLSA COOP Program\n\nThis program supports National Leadership Command Capabilities and is classified. Additional detail provided upon request.\n\nFY2016: ($0.496)\nFY2017: ($0.000)\n\nExplanation of Change from FY 2016 to FY 2017: The decrease of -$0.496 from FY 2016 to FY 2017 is due to the program being moved to sustainment.\n\nFY2018: ($0.000)"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "category"
            }
        }
    }
}