{
    "id": "2018-Navy-PB-1506N-MJBOOK-1-0-5ea2f438963948473b8daff67b53c95cecd8858bfe37150609ec53575abaa4df-26",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_AIRCRAFT_BA5-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1506N",
        "appropriation_name": "Aircraft Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "0586"
        },
        "LineItemTitle": {
            "val": "P-8 Series"
        },
        "P1LineNumber": {
            "val": "55"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1506N"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "Modification of Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Modification of Aircraft"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "42.281"
                },
                "PriorYear": {
                    "val": "28.092"
                },
                "CurrentYear": {
                    "val": "18.836"
                },
                "BudgetYearOneBase": {
                    "val": "18.665"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "18.665"
                },
                "BudgetYearTwo": {
                    "val": "186.99"
                },
                "BudgetYearThree": {
                    "val": "215.321"
                },
                "BudgetYearFour": {
                    "val": "212.427"
                },
                "BudgetYearFive": {
                    "val": "210.566"
                },
                "ToComplete": {
                    "val": "2135.144"
                },
                "Total": {
                    "val": "3068.322"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "42.281"
                },
                "PriorYear": {
                    "val": "28.092"
                },
                "CurrentYear": {
                    "val": "18.836"
                },
                "BudgetYearOneBase": {
                    "val": "18.665"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "18.665"
                },
                "BudgetYearTwo": {
                    "val": "186.99"
                },
                "BudgetYearThree": {
                    "val": "215.321"
                },
                "BudgetYearFour": {
                    "val": "212.427"
                },
                "BudgetYearFive": {
                    "val": "210.566"
                },
                "ToComplete": {
                    "val": "2135.144"
                },
                "Total": {
                    "val": "3068.322"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "42.281"
                },
                "PriorYear": {
                    "val": "28.092"
                },
                "CurrentYear": {
                    "val": "18.836"
                },
                "BudgetYearOneBase": {
                    "val": "18.665"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "18.665"
                },
                "BudgetYearTwo": {
                    "val": "186.99"
                },
                "BudgetYearThree": {
                    "val": "215.321"
                },
                "BudgetYearFour": {
                    "val": "212.427"
                },
                "BudgetYearFive": {
                    "val": "210.566"
                },
                "ToComplete": {
                    "val": "2135.144"
                },
                "Total": {
                    "val": "3068.322"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The P-8A is a commercial Boeing 737 derivative that provides Broad Area Maritime and Littoral Armed multi-mission support. The P-8A Multi-mission Maritime Aircraft (MMA) will replace the P-3 aircraft. OSIP 026-12 funds correction of design deficiencies revealed during post production Test and Evaluation (T&E) and discovered during fleet operations that have resulted in safety and reliability degradation.  Changes to TACMOBILE, Increment 2 ECP 2, and Increment 3 ECP 3 Systems will improve reliability, maintainability and aircraft availability, eliminate component interferences, improve suitability and correct safety related issues.  This OSIP corrects aircraft deficiencies resulting from readiness, obsolescence, safety and Diminishing Manufacturing Sources and Material Shortages (DMSMS). It also provides for Pre-Planned Product Improvement (P3I) efforts that will improve and modernize system performance, improve aircrew safety, sonobuoy launch system improvements, incorporates structural enhancements to enable the airframe to reach its designed\/extended service life.  Modification improvement via engineering changes to increase maintainability of sensors, avionics, and airframe components to support both Navy and urgent operational requirements. Increment 2 ECP 2 includes upgrades to the Automatic Identification System (AIS), Full Multi-Static Active Coherent Capability, Acoustic Processor Tech Refresh and includes upgrades to High Altitude Anti-Submarine Warfare Weapon Capability. Increment 2 ECP 3 includes upgrades to High Altitude Anti-Submarine Warfare Weapon Capability (HAAWC), Full Multi-Static Active Coherent, HAAWC Mid-Course guidance, and NEW Link-16 message implementation. The P-8A Mission Systems Upgrade program (OSIP 006-18) will ensure that the P-8A continues to meet the Navy's requirement to perform Anti-Submarine Warfare (ASW) and Anti-Surface Warfare (ASuW) and ISR Sea Control objectives by upgrading P-8A hardware, software, and firmware mission systems components.  OSIP 006-18 funds P-8A Increment 3 and other Mission Systems improvements. The Increment 3 program consists of a series of Engineering Change Proposals (ECPs) to incorporate system capabilities that will retain cost-wise effectiveness for major combat operations. Increment 3 includes upgrades to P-8A systems including Combat System architecture improvements, ASW and ASuW sensor improvements, communication capability upgrades, ASuW Net Enabled Weapon (NEW), Higher-Than-Secret (HTS) security capability.  OSIP 002-15 funds Chief of Naval Operations Project K-0416 program which provides a rapid response ASW intelligence collection, analysis, and reporting system program. The P-8A Aircraft Systems Upgrade Program (OSIP 001-19) will ensure that the P-8A incorporates modifications to improve aircrew safety, supports changes in engines, weapons and stores requirements, sonobouy launch system improvements and incorporates structural enhancements to enable the airframe to reach its designed\/extended service life."
        },
        "Justification": {
            "val": "FY 18 funds are for the retrofit of changes related to safety, modernization, obsolescence, and readiness\/life cycle cost improvements. Program is currently budgeted to procure a total of 117 aircraft.\n\nProcurements and installs are based on Aircraft and Trainer availability."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}