{
    "id": "2018-Navy-PB-1109N-JBOOK-17739c5c620c15f539dc8999b4e6e3d77ad81ce51089eece75bc6066efab4ac2-27",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "4757"
        },
        "LineItemTitle": {
            "val": "Unmanned Air Systems"
        },
        "P1LineNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "16"
        },
        "BudgetSubActivityTitle": {
            "val": "Intell\/Comm Equipment (Non-Tel)"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "96.87"
                },
                "PriorYear": {
                    "val": "13.43"
                },
                "CurrentYear": {
                    "val": "19.293"
                },
                "BudgetYearOneBase": {
                    "val": "10.154"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "10.154"
                },
                "BudgetYearTwo": {
                    "val": "2.757"
                },
                "BudgetYearThree": {
                    "val": "2.868"
                },
                "BudgetYearFour": {
                    "val": "2.977"
                },
                "BudgetYearFive": {
                    "val": "3.002"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "96.87"
                },
                "PriorYear": {
                    "val": "13.43"
                },
                "CurrentYear": {
                    "val": "19.293"
                },
                "BudgetYearOneBase": {
                    "val": "10.154"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "10.154"
                },
                "BudgetYearTwo": {
                    "val": "2.757"
                },
                "BudgetYearThree": {
                    "val": "2.868"
                },
                "BudgetYearFour": {
                    "val": "2.977"
                },
                "BudgetYearFive": {
                    "val": "3.002"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "96.87"
                },
                "PriorYear": {
                    "val": "13.43"
                },
                "CurrentYear": {
                    "val": "19.293"
                },
                "BudgetYearOneBase": {
                    "val": "10.154"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "10.154"
                },
                "BudgetYearTwo": {
                    "val": "2.757"
                },
                "BudgetYearThree": {
                    "val": "2.868"
                },
                "BudgetYearFour": {
                    "val": "2.977"
                },
                "BudgetYearFive": {
                    "val": "3.002"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0305232M"
                }
            ]
        },
        "Description": {
            "val": "The Small Unit Remote Scouting System (SURSS) - The SURSS program procures unmanned aircraft systems (UAS) to provide battalion\/company\/detachment level units with scalable airborne reconnaissance and surveillance\nto aid in detecting, identifying, engaging, or avoiding enemy units. Multiple systems, to include RQ-12 Wasp, RQ-11 Raven, RQ-20 Puma and various Nano\/VTOL UAS's are required to meet operational requirements\ndelineated in the Operational Requirements Document. The SURSS program also conducts Field User Evaluations (FUEs) to support Universal Urgent Needs Statements (UUNS) that inform future USMC system procurement and\nensure Marines have the most current technology available.\n\nRQ-12 Wasp (Block 0) - Wasp is a small, all environment UAS with a wingspan of 3.3 feet weight of 2.25 pounds and endurance of 60 minutes. The payload consists of a gimbaled turret with Electro Optical\/Infrared (EO\/IR) sensor. It allows maximum portability and provides near real time reconnaissance required by the platoon and rifle squad which reduces the Intelligence, Surveillance, and Reconnaissance (ISR) request-to-response timeframe and eliminates delays or denials for coverage due to an imbalance of unmanned air systems to requests. Wasp is used for remote reconnaissance and surveillance, force protection, convoy security, target acquisition, and battle damage assessment. A Wasp system consists of two air vehicles, two Ground Control Stations (GCSs), and one reconnaissance, surveillance, and target acquisition (RSTA) kit.\n\nRQ-11 Raven (Block 1) - Raven is a small UAS with a wingspan of 4.6 feet, weight of 5 pounds and endurance of 90 minutes. The Raven employs a gimbaled EO\/IR sensor.  The Raven can be carried by personnel on foot and provides the company level unit an organic near real time ISR capability that facilitates rapid battlefield decision making.  A Raven system consists of three air vehicles, two GCS, and one RSTA kit.\n\nRQ-20 Puma (Block 2) - Puma is an all environment UAS with a wingspan of 9.2 feet, weight of 13 pounds and endurance of 2.5 hours.  The PUMA has demonstrated ranges up to 28 kilometers.  The standard payload consists of a gimbaled turret with an EO\/IR sensor.  A Signals Intelligence payload is also available.  The PUMA provides an organic, persistent ISR capability to battalion level units. Additionally, it has been used extensively by Route Clearance Platoons (RCP) and Combat Logistics Patrols (CLP) to enhance force protection and  detect Improvised Explosive Devices (IEDs). A Puma system consists of two air vehicles, two GCSs, and one RSTA kit. \n\nLong Endurance Small UAS - LE SUAS is an organic Group 1-2 UAS operated and maintained by a ground or similar tactical unit. It includes Vertical Take Off and Landing (VTOL) kit capability, quiet electric motor\/hybrid\nfuel cell technology, high definition electro optic\/infrared\/laser (marker or designator) payload, and long range antenna kit. The air vehicle travels at an altitude of about 500-1000 feet about ground level at an approximate speed\nof 35 knots with an endurance of greater than eight hours with a fuel cell, and four hours with battery. It can be launched with an optional VTOL kit or with a launcher system. Mission sets include real-time full motion video\nfor airborne intelligence, surveillance, reconnaissance (AISR), force protection, targeting, pattern of life observation, high value target tracking, control of indirect fires, full motion video to support target analysis, target package development, counter small UAS, spectrum operations (e.g. SIGINT\/Cyber\/EW) and communications relay\/extension. A system consists of three air vehicles, one ground control station, and associated equipment. Additionally, this system and similar organic small UAS require system modifications and integration to adapt for Field User Evaluations (FUE)."
        },
        "Justification": {
            "val": "FY 2018 Base Appropriation Request: $10.154M\nThe decrease from FY17 to FY18 is due to the procurement of 10 Long Endurance Small UAS, and the realignment of $3.951M to BLI 4787 UAS Payloads.  \n$6.605M procures 26 RQ-20 PUMA systems.\n$0.529M procures 31 Single Operator Man-Portable Ground Control Stations.\n$3.020M procures 40 Laser Markers."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}