{
    "id": "2018-AirForce-PB-3080F-JBOOK-05a2d26f6f9e68574bbd94928aef3d85085dcd287dab5f2b545ee87588cfad99-21",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-AIRFORCE_OTHER-U_PROCUREMENT_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "833160"
        },
        "LineItemTitle": {
            "val": "Cheyenne Mountain Complex"
        },
        "P1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Electronics Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "36.186"
                },
                "CurrentYear": {
                    "val": "24.618"
                },
                "BudgetYearOneBase": {
                    "val": "9.864"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "9.864"
                },
                "BudgetYearTwo": {
                    "val": "10.042"
                },
                "BudgetYearThree": {
                    "val": "10.221"
                },
                "BudgetYearFour": {
                    "val": "10.404"
                },
                "BudgetYearFive": {
                    "val": "10.591"
                },
                "Total": {
                    "val": "111.926"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "36.186"
                },
                "CurrentYear": {
                    "val": "24.618"
                },
                "BudgetYearOneBase": {
                    "val": "9.864"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "9.864"
                },
                "BudgetYearTwo": {
                    "val": "10.042"
                },
                "BudgetYearThree": {
                    "val": "10.221"
                },
                "BudgetYearFour": {
                    "val": "10.404"
                },
                "BudgetYearFive": {
                    "val": "10.591"
                },
                "Total": {
                    "val": "111.926"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "36.186"
                },
                "CurrentYear": {
                    "val": "24.618"
                },
                "BudgetYearOneBase": {
                    "val": "9.864"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "9.864"
                },
                "BudgetYearTwo": {
                    "val": "10.042"
                },
                "BudgetYearThree": {
                    "val": "10.221"
                },
                "BudgetYearFour": {
                    "val": "10.404"
                },
                "BudgetYearFive": {
                    "val": "10.591"
                },
                "Total": {
                    "val": "111.926"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0305903F"
                },
                {
                    "val": "0305906F"
                }
            ]
        },
        "Description": {
            "val": "Cheyenne Mountain Complex (CMC) systems provide real-time ballistic missile warning, air defense, force management, battle management and command, control and communications for the North American Air Defense (NORAD) missions. \n\nPE 0305903F - COCOM MOBILE CONSOLIDATED COMMAND CENTERS (MCCC) \n\nModification for the COMBATANT COMMANDER (COCOM), MOBILE CONSOLIDATED COMMAND CENTER (MCCC):  The COCOM's MCCC provides continuity of command capabilities to accomplish directed missions in the event primary command and control facilities are incapacitated.  It provides a survivable and endurable command, control, communications, computers, and intelligence (C4I) capability accomplishing directed COCOM missions.  The MCCC provides C4I for Homeland Support\/Homeland Defense HLS\/HLD) and U.S. Northern Command (USNORTHCOM).\n\n\nPE 0305906F - NCMC - ITW\/AA SYSTEM \n\nModification for NORAD CHEYENNE MOUNTAIN COMPLEX-INTEGRATED TACTICAL WARNING\/ATTACK ASSESSMENT(NCMC-ITW\/AA) SYSTEMS: These systems integrate and correlate missile launch, space object orbit, and air surveillance information to assess the nature of an enemy attack and issue warnings to the President of the United States, the Prime Minister of Canada, United States Secretary of Defense and warfighting Combatant Commanders (C2). Funding procures replacement for reliability and maintainability of the information systems hardware and associated systems software for Cheyenne Mountain operating locations to include legacy space defense systems at Vandenberg AFB, CA and remote interfacing sites essential for executing US Strategic Command, NORAD, Joint Force Component Commander (JFCC) space missions exercised in the Cheyenne Mountain Complex (CMC), Joint Space Program Operations Center (JSpOC), and forward operating locations."
        },
        "Justification": {
            "val": "PE 0305903F - COCOM MOBILE CONSOLIDATED COMMAND CENTERS (MCCC) \n\nThe COCOM's MCCC provides a survivable and endurable command, control, communications, computers, intelligence (C4I), reliability and maintainability while accomplishing directed COCOM missions.  The MCCC provides C4I for Homeland Security Support\/Homeland Defense (HLS\/HLD) and USNORTHCOM missions.  MCCC modification efforts funded in this line include upgrading MCCC shelters and incorporating additional C4I system capabilities via mobile Information Technology and Communication Upgrade projects; ensuring the platform's ability to rapidly deploy, re-constitute and operate.  In FY18, this line will fund the MCCC Block 01 modifications  which include but are not limited to: 1) Communication system upgrade; 2) Mission and support shelters upgrade; 3) Cyber security modernization, 4) Network upgrades; and 5) Environmental and Filtration system upgrade along with and including initial spares and test facility updates required by the fielding of these modification.  Due to the limited spares demand rates, and indefinite system lifespan, Life of Type buys may be required to support weapons system modifications across the active MCCC Block Programs.  Additionally, FY18 funding will support Program Management Administration (PMA) support for the MCCC Block 00 Program initiated in FY17, the MCCC Block 01 program initiated with FY18 funding, and finally the planning efforts for the MCCC Block 02 program.  PMA includes acquisition support\/strategy, engineering and technical expertise associated with procurement, support services, test, travel and other program related costs associated with install of procurement equipment.  Funding for this effort is in program element 0305903F and is funded IAW full funding policy.\n\n\nPE 0305906F - NCMC - ITW\/AA SYSTEM \n\nFunding procures replacement for reliability and maintainability of the information systems hardware and associated systems software for NCMC\/ITW\/AA system. This system is a C2 enterprise of various critical information technology systems comprised of communications processors, network devices, C2 services, workstations, databases, and intelligence sources that are integrated to provide the means to assess an enemy attack.  In FY18, this line will fund NCMC-ITW\/AA Block 01 modifications, which include but are not limited to the two major components: 1) Mission systems (air, missile, and space) upgrades include all subsystems within the sensor-to-operator messaging string message-processing, database, communications processing systems, C2 services, mission operations management systems, and workstations.  2). Network\/infrastructure systems for ITW\/AA and Space include but are not limited to those sub-systems that provide the fabric for the mission systems to operate within operational and security parameters such as system operations servers, security servers, backup systems, networks and network infrastructure components, support systems software and independent test systems.  Additionally, FY18 funding will support continuation of Program Management Administration (PMA) support for the NCMC-ITW\/AA Block 00 program in FY17, the NCMC-ITW\/AA Block 01 program initiated with FY18 funding and finally the planning efforts for the NCMC-ITW\/AA Block 02 program.  PMA includes acquisition support\/strategy, engineering and technical expertise associated with procurement, support services, test, travel and other program related costs associated with install of procurement equipment.  Funding for this effort is in program element 0C030906F and is funded IAW full funding policy."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}