{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-35",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2876"
        },
        "LineItemTitle": {
            "val": "Naval Mission Planning Systems"
        },
        "P1LineNumber": {
            "val": "78"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "9"
        },
        "BudgetSubActivityTitle": {
            "val": "Aviation Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "222.085"
                },
                "PriorYear": {
                    "val": "13.737"
                },
                "CurrentYear": {
                    "val": "14.273"
                },
                "BudgetYearOneBase": {
                    "val": "11.976"
                },
                "BudgetYearOneOCO": {
                    "val": "2.55"
                },
                "BudgetYearOne": {
                    "val": "14.526"
                },
                "BudgetYearTwo": {
                    "val": "12.188"
                },
                "BudgetYearThree": {
                    "val": "12.408"
                },
                "BudgetYearFour": {
                    "val": "12.66"
                },
                "BudgetYearFive": {
                    "val": "12.911"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "222.085"
                },
                "PriorYear": {
                    "val": "13.737"
                },
                "CurrentYear": {
                    "val": "14.273"
                },
                "BudgetYearOneBase": {
                    "val": "11.976"
                },
                "BudgetYearOneOCO": {
                    "val": "2.55"
                },
                "BudgetYearOne": {
                    "val": "14.526"
                },
                "BudgetYearTwo": {
                    "val": "12.188"
                },
                "BudgetYearThree": {
                    "val": "12.408"
                },
                "BudgetYearFour": {
                    "val": "12.66"
                },
                "BudgetYearFive": {
                    "val": "12.911"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "222.085"
                },
                "PriorYear": {
                    "val": "13.737"
                },
                "CurrentYear": {
                    "val": "14.273"
                },
                "BudgetYearOneBase": {
                    "val": "11.976"
                },
                "BudgetYearOneOCO": {
                    "val": "2.55"
                },
                "BudgetYearOne": {
                    "val": "14.526"
                },
                "BudgetYearTwo": {
                    "val": "12.188"
                },
                "BudgetYearThree": {
                    "val": "12.408"
                },
                "BudgetYearFour": {
                    "val": "12.66"
                },
                "BudgetYearFive": {
                    "val": "12.911"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.408"
                },
                "CurrentYear": {
                    "val": "0.377"
                },
                "BudgetYearOneBase": {
                    "val": "1.505"
                },
                "BudgetYearOneOCO": {
                    "val": "1.178"
                },
                "BudgetYearOne": {
                    "val": "2.683"
                },
                "Total": {
                    "val": "3.468"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This line item provides funding to procure Joint Mission Planning System (JMPS) workstations, Software\/Production Engineering Support and Integrated Logistics Support (ILS).  JMPS is the Chief of Naval Operation's (CNO) designated automated mission planning system for the Navy, supporting over 40 T\/M\/S.  Future JMPS platforms include: MQ-4C (Triton), P-8, C\/KC-130,and CH-53K.  JMPS enables weapon system employment by providing the information and decision aids needed to rapidly plan aircraft, weapon or sensor missions, load mission data into aircraft and weapons, conduct mission rehearsal and post mission analysis.  JMPS consists of two types of workstations - Maritime (JMPS-M) and Expeditionary (JMPS-E).  JMPS-M is the primary product within the Naval Mission Planning System (NavMPS).  The Navy's modern aircraft need data loaded from JMPS-M to fly their missions.  As weapons become increasingly advanced, they will require increased quantity and fidelity of data to support mission planning.  These data requirements will require additional advanced processors and greater amounts of continuous memory.  JMPS-M flight planning seats refer to the computer workstations that employ the JMPS framework software.  JMPS-E is a tailorable and collaborative web-based mission planning system for the Amphibious Ready Group (ARG) Amphibious Squadron (PHIBRON).  Program cost is not directly related to FY hardware quantity; software is a cost factor independent of FY hardware quantity and cost.  Funding profile accounts for required four year workstations refresh to preclude aging hardware, increased failure rates, emerging technology; such as Electronic Kneeboard (EKB) and increased memory requirements.  \n\nPrior to FY17, the EKB was funded in BLI 4268."
        },
        "Justification": {
            "val": "Items to be funded in this line include:\n\nWorkstation Components - JMPS-M and JMPS-E procure tactical computer hardware through a non-developmental item acquisition strategy.  Tactical computer equipment is used to plan and analyze expeditionary missions and aircraft routes under various mission configurations and operational threat environments.  Primary outputs are tasking orders, courses of action (COAs), route plans, and mission essential data loads for mission execution.  New workstations consist of aircraft unique data transfer devices and interfaces, Memory Data Loader Receptacles (MDLR) Small Computer Standard Interface (SCSI) (MDLR-S), Electronic Kneeboard (EKB), Common Munitions Bit Reprogramming Equipment (CMBRE), Ogden Data Device Ethernet Crypto (ODD-EC), Data Storage Unit Receptacle SCSI (DSUR-S), network hubs, printers, fleet training school workstations, JMPS Application Central Access Library (JACAL), training assets, and other peripheral devices for USN\/USNR\/USMC\/USMCR missions.  Legacy data loader receptacle failures in addition to computer interface obsolescence and an inability to influence airframe changes for legacy aircraft in sustainment, drive a need to obtain a new data loader using a more extensive interface. JMPS Authority to Operate (ATO) requires compliance with Naval Network Warfare Command (NNWC)-issued Information Assurance (IA) mandates and Communications Tasking Orders (CTOs).\n\nSoftware\/Production Engineering Support - The NavMPS program produces software releases via an evolutionary development process.  These releases contain enhancements based on fleet inputs and technology challenges.  They also contain changes required to retain compatibility with supported platforms, associated weapons, and threat and imagery databases providing input to NavMPS.  Software releases are independent of hardware buys.  Cost element includes production support services, engineering support services, independent verification and validation test and acceptance, site activation, IA compliance and quality assurance efforts.\n\nIntegrated Logistics Support - Site surveys, prepare site installation drawings, on-site engineering and logistics evaluations for installations and delivery systems comply with the specified configuration.  This includes the production and delivery of technical documentation and training materials such as OPNOTES, installation instructions, user manuals required during the fielding of NavMPS products. ILS is a cost factor independent of FY hardware quantity and cost.\n\nFY18 provides funding to procure seven hundred fifty (750) JMPS-M flight planning seats, and five (5) JMPS-E workstations, Electronic Kneeboards (EKB), training assets, and other JMPS support equipment; the continuation of enhancements of software releases based on fleet inputs, emerging technologies, IA compliance and associated logistics support.  FY18 laptop procurement supports MH-53E, CNATRA (training aircraft),C-2, E-2C, E-2D, VH-3\/60, NLH, AH-1, UH-1, AV-8B, JMPS-E, CH-53E, and CH-53K.  Additionally, funding provides for database systems with storage space capable of storing National Geospatial-Intelligence Agency (NGA) world-wide map data with associated network hardware. This will provide the Fleet with the required storage for map data, Digital Terrain Elevation Data (DTED) and imagery necessary to plan missions. EKB provides inflight mission planning, flight administration, and situational awareness data in a tablet form.\n\nFY18 OCO funding supports the Common Munitions Bit and Reprogramming Equipment (CMBRE) for the upgrade and procurement of units and spares to support fleet operations."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}