{
    "id": "2018-Army-PB-2035A-JBOOK-377d93ca794817f44e4b0e8b6a4ac9da01254c9911de0ea9a8ab395d402568a9-15",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_OTHER_2-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "B90000"
        },
        "LineItemTitle": {
            "val": "Joint Tactical Radio System"
        },
        "P1LineNumber": {
            "val": "37"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "32"
        },
        "BudgetSubActivityTitle": {
            "val": "Comm - Combat Communications"
        },
        "ResourceSummary": {
            "Quantity": {
                "AllPriorYears": {
                    "val": "26855"
                },
                "Total": {
                    "val": "26855"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "923.859"
                },
                "PriorYear": {
                    "val": "54.64"
                },
                "Total": {
                    "val": "978.499"
                }
            },
            "UnitCost": {
                "AllPriorYears": {
                    "val": "34.402"
                },
                "Total": {
                    "val": "36.436"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "923.859"
                },
                "PriorYear": {
                    "val": "54.64"
                },
                "Total": {
                    "val": "978.499"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "923.859"
                },
                "PriorYear": {
                    "val": "54.64"
                },
                "Total": {
                    "val": "978.499"
                }
            }
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0604280A"
                },
                {
                    "val": "0605042A"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "54.64"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "54.64"
                    }
                }
            }
        },
        "Description": {
            "val": "B90000 is a summary of Procurement funding for the Handheld Manpack Small Form Fit (HMS) program: B90210 (JTRS HMS - Handheld) and B90215 (JTRS HMS - Manpack); RDTE funding for the HMS program resides in Program Element 0604280A prior to FY 2017, and 0605042A in FY 2017 and out. The Manpack (MP) Radio is reflected under SSN B90210 in FY 2011 and 2012. The MP Radio is reflected under separate SSN B90215 in FY 2013 and out. As of FY 2017, HMS funding will transfer from the parent B90000 to the parent B95004. B90210 and B90215 will transfer to B95006 (Handheld), and B95007 (Manpack) respectively. This change was made in order to remove \"JTRS\" from the HMS nomenclature as the program is now Army led. Therefore, B95006 and B95007 will not be considered new starts in FY 2017.\n\nThe Handheld, Manpack, and Small Form Fit (HMS) radio program is a materiel solution meeting requirements for Software Communications Architecture (SCA) compliant hardware system hosting SCA-compliant Government Purpose Rights software waveforms (applications). HMS is an Acquisition Category IC program that encompasses specific requirements to support the U.S. Army, Air Force, Navy, Marine Corps and Special Operations Command communications needs. \n\nHMS provides voice and data communications to the tactical edge\/most disadvantaged warfighter with an on-the-move, at-the-halt, and stationary Line of Sight (LOS) \/ Beyond Line of Sight (BLOS) capability for both dismounted personnel and platforms. HMS radio systems are software reprogrammable,  networkable, multi-mode systems capable of simultaneous voice and data communications.\n\nHMS encompasses the Handheld (HH) Radios (one-channel Rifleman Radio (RR) and two-channel Leader Radio (LR)), MP, and Small Form Fit (SFF) radios. HMS radios will provide voice and support for data services such as text, control graphics, imagery, video, and telemetry to Warfighters and tactical end user devices including handheld, embedded, and larger computing devices, as well as unmanned systems.\n\nThe current HH AAO (Army Acquisition Objective) is 193,279:\n-100,000 LR\n-93,279 RR\n\nThe current MP AAO is 65,622"
        },
        "Justification": {
            "val": "Program has no FY 2018 funding request in this PE, as HMS funding has been realigned from the parent B90000 to the parent B95004. B90210 and B90215 realign to B95006 (Handheld), and B95007 (Manpack) respectively. This change was made in order to remove \"JTRS\" from the HMS nomenclature as the program is now Army led. \n\nIn accordance with Section 1815 of the FY08 National Defense Authorization Act (P.L. 110-181), these items are necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}