{
    "id": "2018-AirForce-PB-3010F-MJBOOK-1-0-9afb19bf3f616969d2ebd413c99d439b58cb0abef3fc006b887a482a0b365bac-3",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-AIRFORCE_AIRCRAFT_VOL2-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3010F",
        "appropriation_name": "Aircraft Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "LAIRCM"
        },
        "LineItemTitle": {
            "val": "Large Aircraft Infrared Countermeasures"
        },
        "P1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3010F"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "Modification of Inservice Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Strategic Aircraft"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "191.188"
                },
                "PriorYear": {
                    "val": "84.335"
                },
                "CurrentYear": {
                    "val": "135.801"
                },
                "BudgetYearOneBase": {
                    "val": "4.046"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.046"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "415.37"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "191.188"
                },
                "PriorYear": {
                    "val": "84.335"
                },
                "CurrentYear": {
                    "val": "135.801"
                },
                "BudgetYearOneBase": {
                    "val": "4.046"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.046"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "415.37"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "191.188"
                },
                "PriorYear": {
                    "val": "84.335"
                },
                "CurrentYear": {
                    "val": "135.801"
                },
                "BudgetYearOneBase": {
                    "val": "4.046"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.046"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "415.37"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0401134F"
                }
            ]
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0401134F"
                }
            ]
        },
        "Description": {
            "val": "The Large Aircraft Infrared Countermeasures (LAIRCM) system provides a significantly improved defensive capability for the Department of Defense to counter the proliferating infrared (IR) man-portable air defense systems (MANPADS) missile threats by detecting, tracking, and countering incoming IR missiles.  This system is fully autonomous following power-up and consists of Group A aircraft modification kits and Group B hardware.  Group B hardware for the LAIRCM system [AN\/AQQ-24(V)] consists of Missile Warning Sensors (MWS) either ultraviolet (UV) or the more capable infrared (IR); Guardian Laser Transmitter Assemblies (GLTA)\/Small Laser Transmitter Assemblies (SLTA); a control indicator unit (CIU); a system processor (LSP); and repeaters, as needed by the platform.\n\nLike all programs, LAIRCM faces the challenges associated with resolving Diminishing Manufacturing Sources (DMS) issues. DMS initiatives have resulted in replacement units for the CIU and the LSP.  The control indicator unit replacement (CIUR) replaces the CIU, and the LAIRCM system processor replacement (LSPR) replaces the LSP.  The CIUR will become the preferred component in FY15, and the LSPR in FY16.  The production program maintains a robust reliability program which results in the incorporation of reliability enhancements improving overall producibility, while gaining the inherent benefit of improved long-term sustainment.  There are numerous LAIRCM configurations installed on a variety of aircraft.  All configurations include a processor and a control indicator unit; however, configurations can be differentiated by the type of missile warning sensors and laser transmitter assemblies.  Configurations include SLTAs and UV sensors, GLTAs and UV sensors, and GLTAs and IR sensors.\n   \nThis program includes all efforts needed to procure, field, and support LAIRCM.  These efforts include, but are not limited to, Hardware Procurement (Group A and Group B), Installation, Installation Support, Initial Spares, Support Equipment, Government Furnished Equipment (GFE) and GFE Repairs, Line Replaceable Unit (LRU) Repairs, Interim Contractor Support (ICS), Depot Standup, Systems Engineering and Program Management (SEPM), Failure Reporting and Corrective Analysis Support (FRACAS), Other Government Costs (OGCs), Pre-Planned Product Improvements, Program Management and Administration (PMA) costs, simulators, data, and a DMS program to ensure continued production of all variants of LAIRCM components and for all LAIRCM customers.  The LAIRCM DMS program includes all activities associated with monitoring and identifying DMS issues.  It also includes all activities required to resolve DMS issues:  1) the use of existing material solutions which involves actions to secure availability of existing supply (i.e., life of need buy and extension of production or support); 2) implementing substitutes which includes engineering activities to qualify and implement the identified substitute (i.e., approved part; repair, refurbishment, or reclamation; simple substitute; and complex substitute);  and 3) redesign which includes all aspects of engineering and qualification to implement new or highly modified equipment (i.e., development of a new item or source; redesign of a next higher assembly; and redesign of a complex\/system replacement).*\n  \n*Reference SD-22 Manual Dated August 2012\n\nLAIRCM kit quantities purchased are dependent on the unit cost and\/or the installation cost of the kits.\n\nFY17 funding totals include $135.8M for Overseas Contingency Operations.\n\nFunding may be used to address Diminishing Manufacturing Sources issues.\n\nFunding for this exhibit contained in PE 0401134F."
        },
        "Justification": {
            "val": "Where applicable, justification for individual modifications is provided in the P-3A exhibits."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}