{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-58",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "3501"
        },
        "LineItemTitle": {
            "val": "Cryptologic Communications Equip"
        },
        "P1LineNumber": {
            "val": "101"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "16"
        },
        "BudgetSubActivityTitle": {
            "val": "Cryptologic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "60.554"
                },
                "PriorYear": {
                    "val": "11.433"
                },
                "CurrentYear": {
                    "val": "21.098"
                },
                "BudgetYearOneBase": {
                    "val": "11.287"
                },
                "BudgetYearOneOCO": {
                    "val": "2.28"
                },
                "BudgetYearOne": {
                    "val": "13.567"
                },
                "BudgetYearTwo": {
                    "val": "11.448"
                },
                "BudgetYearThree": {
                    "val": "12.408"
                },
                "BudgetYearFour": {
                    "val": "14.336"
                },
                "BudgetYearFive": {
                    "val": "14.258"
                },
                "Total": {
                    "val": "159.102"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "60.554"
                },
                "PriorYear": {
                    "val": "11.433"
                },
                "CurrentYear": {
                    "val": "21.098"
                },
                "BudgetYearOneBase": {
                    "val": "11.287"
                },
                "BudgetYearOneOCO": {
                    "val": "2.28"
                },
                "BudgetYearOne": {
                    "val": "13.567"
                },
                "BudgetYearTwo": {
                    "val": "11.448"
                },
                "BudgetYearThree": {
                    "val": "12.408"
                },
                "BudgetYearFour": {
                    "val": "14.336"
                },
                "BudgetYearFive": {
                    "val": "14.258"
                },
                "Total": {
                    "val": "159.102"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "60.554"
                },
                "PriorYear": {
                    "val": "11.433"
                },
                "CurrentYear": {
                    "val": "21.098"
                },
                "BudgetYearOneBase": {
                    "val": "11.287"
                },
                "BudgetYearOneOCO": {
                    "val": "2.28"
                },
                "BudgetYearOne": {
                    "val": "13.567"
                },
                "BudgetYearTwo": {
                    "val": "11.448"
                },
                "BudgetYearThree": {
                    "val": "12.408"
                },
                "BudgetYearFour": {
                    "val": "14.336"
                },
                "BudgetYearFive": {
                    "val": "14.258"
                },
                "Total": {
                    "val": "159.102"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "[P5 \/ 1V045 Access Systems & Subsystems]: Cryptologic Carry-On Equipment: The Cryptologic Carry-On Program (CCOP) procures state-of-the-art, commercial off-the-shelf signal acquisition equipment (hardware and software) in response to combatant commander requirements for a quick-reaction surface, subsurface, and airborne cryptologic carry-on capability. The equipment is procured according to the overall requirements detailed in the Shipboard Information Warfare\/Cryptologic System Operational Requirements Document and specific execution year fleet requirements as defined by the Signals Of Interest (SOI) Integrated Product Team (IPT) and in concert with Shipboard Signals Exploitation Space (SSES) programs to ensure synergy and seamless transition to permanently installed SSES systems. The IPT meets several times a year and determines which SOIs\/Targets on the SOI list need to be addressed. Due to a continually changing threat environment, detailed requirements are dynamic and equipment procured varies each year by quantity and type. Equipment suites can be configured for many targets and tasking. Target specific subsystems can either operate as stand-alone within cryptologic spaces or as an add-on to existing equipment. Hardware procurement includes: receivers, recorders, tactical computers and related peripherals, antennas, electronic-warfare support measures systems, precision geolocation equipment, advanced signal and search equipment including spectrum analyzers and associated portable special intelligence communications equipment. CCOP equipment is installed as an augment to cryptologic capabilities on subsurface, surface, and air platforms. There are approximately 124 cryptologic capable surface ships and shore sites in the current Navy inventory. Each of these are potential users of this carry-on equipment, as are subsurface and air platforms. The temporary installation of equipment is coordinated through fleet electronic support personnel; inventory allocation is managed by USFF. A primary system in inventory is the Carry On Radio Spectrum Analysis & Intelligence Reporting (CORSAIR) system.  Funds continue to procure CORSAIR core architecture system upgrades to provide additional affordable functionality to the combatant commands. Additional signal acquisition equipment to address specific combatant command requirements include such systems as Digital Receiver Technology (DRT), Hostile forces Integrated Targeting Service (HITS), Maritime Toxic Pen (MTP), TURBULENTWAVE\/TURBULENTWIND\/TURBULENTSAIL, BLUESTREAM servers, RED FALCON\/VULCAN, STINGRAY, MUDCAT, Toxic Fog, Radio Frequency Distribution Unit (RFDU), TEAPARTY\/TEALEAF, and Generic Area Limitations Environment (GALE)-Lite. This line also supports the procurement of STALLION hardware for CCOP team training.\n\n[P5 \/ Global Signal Analysis Laboratory (GSAL)]: GDX6D - GLOBAL SIGNAL ANALYSIS LABORATORY (GSAL):  The Navy GSAL program, under project name CLASSIC SENSEI, provides for the timely analysis of data derived from maritime mobile Information Warfare (IW) operations. GSAL support is conducted by Signals Analysis Laboratories (SAL) co-located with Fleet Information Operations Centers (FIOC) at theater-level analysis and processing centers and by QuickLook\/Nodes forward-based at fleet concentration areas. The GSAL program office equips the SAL's with advanced signals analysis capabilities in order to accomplish the high order analysis that is required to effectively address SAL processing and exploitation requirements in support of both maritime tactical and national strategic IW objectives. Additionally, SAL's are equipped with specialized capabilities to support FIOC maritime Signal Descriptor File (SDF) requirements. Funding is required to maintain and sustain SAL operations while allowing for upgrades required to integrate new technology to accommodate the highly technical analysis requirements attendant with a highly diverse and constantly changing electromagnetic environment. Additionally, Navy SAL's are integral components of the global collaborative enterprise architecture via the GSAL LABLINK data handling subsystem. LABLINK provides for advanced data manipulation, achieving, and forwarding\/exchange while providing connectivity and global reachback in support of analysis with collaborating military, national, and international partners via signal screening and processing tools resident in LABLINK. GSAL theater-level laboratories are located at NIOC Hawaii (Pacific SAL), and NIOC Ft Gordon, Georgia (Atlantic SAL). Forward-based screening and forwarding QuickLook\/Nodes are located at Souda Bay, Crete (potential relocation within the European theater), NIOC Bahrain, and a future installation at Kadena, Japan. Other GSAL facilities are located at NIOC Yokosuka, Japan, and at the Naval Information Warfare Activity (NIWA). \n\nGDX6D - Global Signal Analysis - The variance in unit cost between FY17 to FY18 is due to the transition from LABLINK III (existing equipment) to LABLINK IV (next generation equipment).  Increase in cost between FY17 and FY18 is due to the fact that in FY17 the program plans to procure 1 unit with an average unit cost of $746; for FY18 the program plans to procure another unit with a slightly higher cost due to advancement in technology, increased storage requirements and an increased cost to new controller which increased the cost of each system significantly. The roll out of LABLINK IV is schedule to start FY17 and will continue through FY 20.\n\n[P5 \/ GDX6D - System Integration and Installation of Hardware]: Fleet Information Operations Centers (FIOC):  There are FIOCs co-located with National Security Agency (NSA) Cryptologic Centers supporting the geographical Satellite Communication Network (SATCOM).  Each are charged with providing regionally focused Information Operation (IO) and Signal Intelligence (SIGINT) support to Fleet Commanders.  FIOCs leverage NSA capabilities, analysis, and manpower in support of Fleet requirements.   Funds are required for purchasing and maintaining life cycle support for command and control systems connected to SCI networks at the FIOCs.  Funds are also provided to develop and maintain a common baseline of analytical intelligence software tools supporting FIOC capability areas as defined in the FIOC operational strategy (OPSTRAT).\n\n[P5 \/ System Integration & Installation of Hardware (FIOC)]: \"GDX8D - NAVY ELECTRONIC INTELLIGENCE (ELINT):  Procure SECAPs a technology insertion approach, not system approach to current system capabilities.  SECAP will provide tactical commanders with enhanced Electronic Support capabilities allowing for increased search, detection and data collection in support of a variety of surface ship requirements.  Procure Network Centric Electronic Warfare Support which facilitates a fused tactical Electronic Warfare Support picture which facilitates an automated two-way intelligence feed of organic and non-organic ELINT for analysis and fusion utilizing Generic Area Limitation Environment (GALE) 5.0 software inside SLQ-32B consoles. This technology will enable deployed Strike Groups and Shore nodes to receive and transmit all forms of ELINT simultaneously which can cue overhead and organic sensors and populate a Common Intelligence\/Common Operation Picture (CIP\/COP). \"GDX6D - FLEET INFORMATION OPERATIONS CENTERS (FIOC):  There are FIOCs co-located with National Security Agency (NSA) Cryptologic Centers located at Georgia, Hawaii, Maryland, Texas, Digby, United Kingdom and High Castle\/CMASS each supporting the geographical Satellite Communication Network (SATCOM).  Each are charged with providing regionally focused Information Operation (IO) and Signal Intelligence (SIGINT) support to Fleet Commanders.  FIOCs respond to Fleet requests for IO and SIGINT personnel augmentation in theater, analytical requests, and planning in support of deliberate and crisis action planning.  FIOCs leverage NSA capabilities, analysis, and manpower in support of Fleet requirements.  Funds are required for purchasing and maintaining life cycle support for Global Command and Control Systems - Maritime (GCCS-M) connected to SCI networks at the FIOCs.  Funds are also provided to develop and maintain a common baseline of analytical intelligence software tools supporting FIOC capability areas as defined in the FIOC operational strategy (OPSTRAT).\n\nGDX6D - System Integration & Installation of Hardware (FIOC) - The variance in unit cost between FY17 to FY18, is to support Top Secret \/ Sensitive Compartmented Information (TS-SCI) operational training\/assessments, life cycle sustainment\/maintenance, shore-based architecture nodes, shoolhouse suites, SCI pack-up kits and equipment modernization.\n\n[P5 \/ Fleet Synthetic Training (FST) SIGINT\/C-ISR]: The Department's Fleet Synthetic Training (FST) (SIGINT \/ C-ISR) initiative addresses the lack of realistic SIGINT \/ C-ISR during exercises supporting the Fleet Training Continuum (FTC). Addresses critical requirements for SIGINT and C-ISR in Fleet Synthetic Training (FST) required in preparing Intelligence personnel\/teams for forward deployed operations.\n\nThis effort provides the ability to exercise shipboard TS-SCI capabilities in an environment not subject to counter-detection. Improves staff operational planning and tactical decision making combined with improvements to overall Intelligence team readiness and certification throughout the Optimized-Fleet Response Plan (O-FRP). Supports Assured C2 and Cyber Situational Awareness\/Cyber Defense and Enhanced Naval Network Environment (NNE) Information Dominance IPCLs. Builds upon GENSER NCTE (Navy Continuous Training Environment) to expand the existing GENSER NCTE with Above GENSER capabilities to include TS-SCI FST architecture\/capabilities. Provides for architecture, capabilities and scenario build-out as well as required life-cycle management.\n\nThis capability will enhance individual units and Strike Groups in exercising integrated kinetic and non-kinetic capabilities, to include operations\/intelligence fusion required for comprehensive maritime operations and operational proficiency in Electromagnetic Maneuver Warfare (EMW). In FY 18, this will fund Life Cycle Management (LCM) of the TS\/SCI NCTE node on the East Coast and 14 Portable Embarkation Kits (PEKs)."
        },
        "Justification": {
            "val": "FY18 funds will continue to satisfy signals exploitation capability gaps as determined by the Cryptologic Carry-on Program (CCOP) Signals of Interest (SOI) Integrated Product Team (IPT). At this time the recommendations for procurements that are best suited to address identified gaps may include: Digital Receiver Technology (DRT), Hostile forces Integrated Targeting Service (HITS), Maritime Toxic Pen (MTP), TURBULENTWAVE\/TURBULENTWIND\/TURBULENTSAIL, BLUESTREAM servers, RED FALCON\/VULCAN, STINGRAY, MUDCAT, Toxic Fog, Radio Frequency Distribution Unit (RFDU), TEAPARTY\/TEALEAF, and Generic Area Limitations Environment (GALE)-Lite, BLACKBIRD AND QUICKSHOT as well as Adaptive Mission Packages. This line supports the procurement of STALLION hardware for CCOP team training. \n\nFY18 funds will provide for the timely analysis of data derived from maritime mobile Information Warfare (IW) operations. GSAL support is conducted by Signals Analysis Laboratories (SAL) co-located with Fleet Information Operations Centers (FIOC) at theater-level analysis and processing centers and by QuickLook\/Nodes forward-based at fleet concentration areas. The GSAL program office equips the SALs with advanced signals analysis capabilities in order to accomplish the high order analysis that is required to effectively address SAL processing and exploitation requirements in support of both maritime tactical and national strategic IW objectives. Additionally, SALs are equipped with specialized capabilities to support FIOC maritime Signal Descriptor File (SDF) requirements. Funding will be used for the procurement of upgrades (GSAL LABLINK data handling subsystem) to integrate new technology to accommodate the highly technical analysis requirements attendant with a highly diverse and constantly changing electromagnetic environment, while providing connectivity and global reachback in support of analysis with collaborating military, national, and international partners via signal screening and processing tools resident in LABLINK.\n\nOCO: \nFY18 Other Contingency Operations (OCO) funds to procure 11 Red Falcon Systems due to shortfall of systems available for platforms deploying to the United States Central Command area of responsibility (USCENTCOM AOR)."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}