{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-25",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2762"
        },
        "LineItemTitle": {
            "val": "Other Training Equipment"
        },
        "P1LineNumber": {
            "val": "68"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "8"
        },
        "BudgetSubActivityTitle": {
            "val": "Training Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "227.759"
                },
                "PriorYear": {
                    "val": "41.314"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "9.247"
                },
                "Total": {
                    "val": "278.32"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "227.759"
                },
                "PriorYear": {
                    "val": "41.314"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "9.247"
                },
                "Total": {
                    "val": "278.32"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "227.759"
                },
                "PriorYear": {
                    "val": "41.314"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "9.247"
                },
                "Total": {
                    "val": "278.32"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.232"
                },
                "Total": {
                    "val": "0.232"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Funding referenced in project units MB044\/MB050 (submarine) was realigned into LI 5661 beginning in FY17.\n\nFunding referenced in project unit MB040 (surface) was realigned into LI 5664 beginning in FY17.\n\nOther Training Equipment line supports various types of Communication and Electronic training requirements.\n\n[P40A \/ MB044 SUBMARINE TRAINING SUPPORT EQUIPMENT]: MB044 SUBMARINE TRAINING SUPPORT EQUIPMENT\n\nThis line procures submarine Fleet and team trainers sustaining equipment and systems, which emulate ship characteristics, as approved by the CNO.  Representative training systems include, but are not limited to: Submarine Navigation Trainers which include the Virtual Environment Submarine (VESUB), Submarine Piloting and Navigation Trainers (SPAN), Reconfigurable SPAN (RSPAN), Submarine Bridge Trainer\/Integrated SPAN (SBT\/ISPAN), Navigation Databases, Ship Control Operator Trainer (SCOT), Electronic Chart Display and Information Systems-Navy (ECDIS-N) and PC-based Team Trainers which include the Mini-SPANs.  These systems and Training Enhancement Changes (TECs) are identified by the Submarine Learning Center (SLC) for training activities, which are approved by the CNO.  Supports Fleet requested updates and technical refresh of all the systems and products listed above.  The SBT\/ISPAN and upgrades to the existing navigation and mariner skills trainer in all homeports will be procured.  The ISPAN Light Emitting Diode (LED) Ring will be procured for Homeports where an SBT Dome can't be accommodated.  This line also provides configuration changes for the Voyage Management Systems (VMS), ECDIS-N, and the Submarine Multi Reconfigurable Training System (MRTS).\nThe MRTS family includes VA CLASS Torpedo Room, Emergency Diesel Generator and Weapons Launch Console Team Trainer. which includes Submarine Communications Support System \/ Common Submarine Radio Room (SCSS \/ CSRR) trainers.  SBT\/ISPAN is comprised of Virtual Tactical, Sonar Simulation, Beam Forming Sonar Simulation Trainer, VMS, ECDIS-N, Radar Simulation, Navigation Aids, and Harbor Databases.\n\n[P40A \/ SHIP CONTROL OPERATOR TRAINER]: Funds requested in FY 2016 will procure a Ships Control Operator Trainer for the Guam Training Facility.\n\n[P40A \/ MB050 SUBMARINE SONAR TRAINERS]: MB050 SUBMARINE SONAR TRAINERS\n\nThe Sonar Employment Trainer (SET) provides acoustic operator employment Fleet and team training for submarine sonar systems.  It uses entirely commercial components to contain contact and environment models, simulations of the sensors and signal processing, simulated operator consoles, and an instructional subsystem including an instructor's console.  SET is used to train advanced operators in the Advanced Sonar Employment and Sonar Supervisor courses.  The SET is periodically upgraded to support current software Advanced Processor Builds (APBs) and Technical Insertions (TIs).  The SET is an essential component of an emerging shore based training that supports the projected technology in the Fleet systems that are designed to meet current and future threats:  the Acoustics, Rapid Commercial-Off-The-Shelf (COTS) Insertion (A-RCI).   \n\nThe SET is part of the solution to increasing operator competence and data recognition through employment training by its use of 3-D graphics, animation, audio, and scientific visualization methods to illustrate highly complex displays and concepts of oceanographic physics.  The demands of curriculum and student throughout at the primary submarine training site at NAVSUBSCOL, Groton dictates the number and configuration of trainers provided. \n\nFY15: Procures one kit and implements simulation upgrades to the SET as directed by the Type Commander.\n\nFY16: Procures one kit and implements simulation upgrades to the SET as directed by the Type Commander.\n\n[P40A \/ MB040 Common IAMD & ASW Trainer (CIAT)]: Support shore based Aegis Combat Training capability that cannot be replicated inside an Aegis Ship\n\n[P40A \/ Common IAMD & ASW Trainer (CIAT)]: Support shore based Aegis Combat Training capability that cannot be replicated inside an Aegis Ship"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}