{
    "id": "2018-Army-PB-2034A-JBOOK-5aee815d00f2743bc26b1fd362b1fa251ab1150ad3a4a9b16cb13a13bf67f3ad-28",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_AMMO-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "EA0575"
        },
        "LineItemTitle": {
            "val": "Ammunition Peculiar Equipment"
        },
        "P1LineNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "50"
        },
        "BudgetSubActivityTitle": {
            "val": "Miscellaneous"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "317.256"
                },
                "PriorYear": {
                    "val": "14.249"
                },
                "CurrentYear": {
                    "val": "17.275"
                },
                "BudgetYearOneBase": {
                    "val": "16.425"
                },
                "BudgetYearOne": {
                    "val": "16.425"
                },
                "BudgetYearTwo": {
                    "val": "19.745"
                },
                "BudgetYearThree": {
                    "val": "21.787"
                },
                "BudgetYearFour": {
                    "val": "21.886"
                },
                "BudgetYearFive": {
                    "val": "23.854"
                },
                "Total": {
                    "val": "452.477"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "317.256"
                },
                "PriorYear": {
                    "val": "14.249"
                },
                "CurrentYear": {
                    "val": "17.275"
                },
                "BudgetYearOneBase": {
                    "val": "16.425"
                },
                "BudgetYearOne": {
                    "val": "16.425"
                },
                "BudgetYearTwo": {
                    "val": "19.745"
                },
                "BudgetYearThree": {
                    "val": "21.787"
                },
                "BudgetYearFour": {
                    "val": "21.886"
                },
                "BudgetYearFive": {
                    "val": "23.854"
                },
                "Total": {
                    "val": "452.477"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "317.256"
                },
                "PriorYear": {
                    "val": "14.249"
                },
                "CurrentYear": {
                    "val": "17.275"
                },
                "BudgetYearOneBase": {
                    "val": "16.425"
                },
                "BudgetYearOne": {
                    "val": "16.425"
                },
                "BudgetYearTwo": {
                    "val": "19.745"
                },
                "BudgetYearThree": {
                    "val": "21.787"
                },
                "BudgetYearFour": {
                    "val": "21.886"
                },
                "BudgetYearFive": {
                    "val": "23.854"
                },
                "Total": {
                    "val": "452.477"
                }
            }
        },
        "Description": {
            "val": "The Ammunition Peculiar Equipment (APE) program provides support for ammunition operations including surveillance, demilitarization (demil), maintenance, renovation, modification, packaging, and preservation per Army Regulation 700-20, Ammunition Peculiar Equipment.  APE is developed, acquired, and supervised through the Single Manager for Conventional Ammunition per DoD Instruction 5160.68.  APE provides equipment items specifically designed, fabricated, procured, tested, and adopted for use in worldwide United States (US) military ammunition depot operations on conventional ammunition.  APE maintains a central source of standard, modern, safe, efficient, reliable, and environmentally acceptable equipment for ammunition operations.  This equipment is different from production line plant equipment as it disassembles ammunition items into components, sorts and removes hazardous materials to reduce human interaction and improves personnel safety.  Maintenance APE is also designed to perform cleaning and renovation functions on ammunition subjected to deterioration effects (rust, corrosion, weathering, etc) during its storage life.  APE supporting surveillance is key to stockpile sampling and functional testing of the items to assure readiness for combat or training.  Demilitarization APE is similar to maintenance APE, but must go further in disassembly to destroy hazardous components, sort and reclaim salvageable parts or metals."
        },
        "Justification": {
            "val": "FY 2018 Base procurement dollars in the amount of $16.425 million will provide APE that must be available to perform ammunition depot operations for conventional ammunition.  APE is required to support the Ammunition Stockpile Reliability Program, Surveillance Program, equipment for worldwide maintenance and demilitarization, prepositioned ships, and Government-Owned, Contractor-Operated plants as Government Furnished Equipment. The APE assets maintain and verify the quality of the ammunition stockpile; thereby saving the cost of purchasing new replacement ammunition. APE proficiently executes the ammunition demilitarization mission to safely perform disassembly, destruction, or removal processes with an emphasis on recycling, re-utilization and preserving demilitarization assets in a manner that supports ammunition sustainment, safety and environmental compliance.\n\nThe program provides global support to the US Military Services for ammunition sustainment and demilitarization operations, including deployment, operations and support of the Ammunition Supply Point (ASP) suites. The ASP suites include APE, which will increase the efficiency of the receipt, inspection and issuance of ammunition to the warfighter. Deployment of APE to support ASP suites will increase efficiencies for ammunition sustainment operations by reducing logistics burdens and related risks. This allows for better primary mission readiness, enhanced hazardous operations safety and more efficient operating conditions requiring less ammunition retrograde\/demilitarization by providing capability to preserve ammunition assets.\n\nThe APE program supports multiple demilitarization processes across the Army’s organic base; one of the most widely utilized capabilities is the APE 1236 incinerator and support equipment. The program performed a downtime and efficiency study of this equipment and began implementing initial equipment upgrades and modifications in accordance with a priority roadmap. These modifications will continue throughout and beyond FY 2018.  FY 2018 dollars will be used to procure, install, integrate and test upgrades at tier 1 and 2 organic facilities. The program will also provide updated specific facility documentations including: technical drawing packages, standard operating procedures, hazard analyses and equipment maintenance responsibilities and procedures."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}