{
    "id": "2018-Navy-PB-1109N-MJBOOK-0-0-6b2000f9111b6178e144100c1843f0feab54d2ff64037d5a22d994b135e5a122-17",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_MARINECORPS-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "4617"
        },
        "LineItemTitle": {
            "val": "Combat Support System"
        },
        "P1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "9"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support (Tel)"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "117.115"
                },
                "PriorYear": {
                    "val": "0.942"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "117.115"
                },
                "PriorYear": {
                    "val": "0.942"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "117.115"
                },
                "PriorYear": {
                    "val": "0.942"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0605013M"
                },
                {
                    "val": "0206624M"
                },
                {
                    "val": "0604717M"
                },
                {
                    "val": "0604766M"
                }
            ]
        },
        "Description": {
            "val": "Global Combat Support System-Marine Corps (GCSS-MC) is comprised of a number of integrated systems that support the logistics elements of command and control, interoperability, and secure access to, and visibility of, critical data.  The GCSS-MC\/Logistics Chain Management (LCM) component is the implementation of the modern logistics operational architecture and has been designated as a Major Automated Information System (MAIS).  GCSS-MC\/LCM Increment 1 is focused on the acquisition and implementation of the initial set of integrated logistics capabilities for the Marine Corps by delivering improved support request and supply and maintenance management services.  As the technology centerpiece of the Marine Corps' overall Logistics Modernization effort, GCSS-MC\/LCM Increment 1 provides those advanced expeditionary logistics capabilities needed to ensure MAGTF combat efficiency into the future. Increment 1 is an operational Enterprise system (authorized for 36,000 users). The Mobile Field Service (MFS), Enterprise Automated Task Organization (EATO) and Riverbed Steelhead Appliance (RSA) (WAN optimization) will be provided as a deliverable in Increment 1 Release 1.1.1.  This release provides limited detached capability (store and forward), automated task organizing, and optimizes WAN throughput.  \n\nSHARED DATA ENVIRONMENT (SDE) is a component of the GCSS-MC.  It supports data warehousing technologies and products to provide one-stop shopping for data supporting Combat Service Support Element SDE  (CSSE\/SDE) decision-making processes.  It stages CSSE\/SDE data and integrate Decision Support Tools to enable Command and Control, situational awareness, and total asset visibility at all levels of command, from the Combatant Commander to the Company Commander.  The establishment of the CSSE\/SDE eliminates the need for individual applications to perform these tasks for themselves and contributes to a more cost-effective, efficient application development environment.  Supports hardware infrastructure to refresh hardware purchased in FY09 in support of deployed MAGTF users of GCSS-MC capabilities.\n\nTHEATER MEDICAL INFORMATION PROGRAM (TMIP) - The TMIP-Joint Family of Systems (FoS) is developed by the Defense for Health Affairs (DHA) in conjunction with the Services. TMIP-MC FoS consists of Joint program software employed in conjunction with Marine Corps Common Hardware Suite infrastructure equipment, which is comprised of hardware, peripheral devices and data networks. It is a comprehensive Information Technology enabler to the USMC Health Services Support and Medical Logistics communities which replaces several medical legacy systems creating an electronic medical record that spans the service member's life.  TMIP-MC provides capabilities to the organic USMC Level I & II Medical Treatment Facilities (MTF) and management of war reserve medical logistics, in support of the Marine Air\/Ground Task Force (MAGTF) to immediately document injury, illness and treatment and order labs, x-rays and pharmacy. It also electronically records, stores and transmits medical data to the Theater Medical Data Store (TMDS) and Clinical Data Repository (CDR). TMIP-MC FoS provides visibility of patient movement and health surveillance, orders and tracks medical supplies and equipment, and links in-Theater care with DoD and Veterans Affairs MTFs for enhanced medical care and readiness to the warfighter anywhere, anytime, and in support of any mission. TMIP-MC systems capabilities include:  outpatient care (AHLTA-T), enterprise management of Class VIII (DMLSS), expeditionary management of Class VIII (DCAM), limited level II+ inpatient care (FRSS or STP), medical surveillance & medical C2 (MSAT).\n\nMANPOWER OPERATIONS SYSTEMS (MOS) is a portfolio of enterprise information technology systems and modules that support manpower business operations for the Total Force (active and reserve).  The investment funding in the portfolio improves dataflow and increases reliability, functionality, and accuracy of data while reducing the manpower required to operate and maintain these systems\/operations.  Development is partially driven by regulatory and policy changes mandated by Congress, Department of Defense (DoD), Department of the Navy (DoN), and United States Marine Corps.  The systems support all five tiers of Manpower: Individual Marine; Small Unit Leader; Unit, Installation Personnel Administration Center\/Disbursing Echelon; Headquarters Marine Corps Manpower and Reserve Affairs\/ Department of Finance Accounting Service.  The MOS portfolio provides support in functional areas such as Permanent Change of Station assignments, retention, mobilization, manpower planning, line of duty determination, personnel accountability, individual augmentation, personnel records management and maintenance, management of case incidents, civilian professional development planning, pay entitlement determinations, promotion and performance evaluations and self service\/ visibility of personnel data.  MOS interfaces with other systems to provide manpower data and web services functionality for pay and personnel transactions between systems.  Systems in the portfolio include Web-enabled Manpower Assignment Support System, Performance Evaluation System, Total Force Retention System, Optical Digital Imaging- Records Management System, Automated Performance Evaluation System and the Manpower Mobilization Assignment System.  Additionally, the portfolio includes Total Force Administration System associated modules:  including Drill Management Module and Secure Personnel Accountability Module.  \n\nRADIO FREQUENCY IDENTIFICATION (RFID) - Effective FY16 this line is consolidated into the MAGTF Logistics Support Systems (MLSS). RFID devices encompass a variety of read and write data storage technologies that are used to improve accuracy, timeliness, and handling.  These technologies are key in and provide near-real time Total Asset Visibility data used to influence critical decisions by Operational Commanders. RFID enhances our force in readiness by coordinating, synchronizing and automatically transferring data by means of Active Radio Frequency Identification (aRFID), as well as the software required to create and manage the devices, collect the information and integrate that information with other logistics data. These devices can be interrogated using a variety of means, including fixed infrastructures and portable systems. The information obtained from those interrogations is provided electronically to various Automated Information Systems (AIS). The RFID project provides procurement and life cycle management of the current RFID Infrastructures, and provides RFID Hardware and Software under the Joint Army Product Director Automated Movement and Identification Solutions (PD AMIS) Procurement Office.\n\nMANPOWER PLANNING SYSTEMS (MPS) is a portfolio of systems consisting of the legacy Manpower Models and the Total Force Data Warehouse.  This portfolio provides the tools and data to support the creation of active and reserve modeling of accession, recruiting, training, classification, retention, promotion, mobilization, distribution, and assignment plans.  MPS interfaces with other systems to utilize manpower data in model analysis and future year planning efforts.\n\nTRANSPORTATION SYSTEMS PORTOFOLIO (TSP) - Effective FY16 this line is consolidated into Enterprise Logistics Support System (ELSS) with focused procurement for TSP. TSP provides funding that supports the USMC Deployment and Execution Support Systems and the Distribution Management Support Systems and Fair Share costs to Joint Program Management Office Systems.  These systems and applications support the planning, deployment, distribution, sustainment and redeployment of supplies, equipment and personnel.  The TSP portfolio applications utilize AIT read\/write devices, active radio frequency identification (aRFID) tags and satellite tracking systems. TSP applications support In-Transit Visibility (ITV) and Total Asset Visibility (TAV) initiatives to provide commanders with timely and accurate near real-time data on the location and movement of personnel, equipment and supplies that are in-process, in-transit and in-theater. \n\nITEM UNIQUE IDENTIFICATION (IUID) - Provides the necessary hardware to exploit an Item Unique Identification (IUID)-enabled ground fleet inventory of equipment and materiel.  This capability will allow for the identification and tracking of tangible items via Unique Item Identifiers (UIIs) use globally as a common key.  IUID will enable visibility and traceability of key life cycle events for individual items of equipment and will provide the primary data element for net-centric management of equipment with the Logistics Automated Information Systems (Log AISs).  IUID will improve logistics functions for operational commanders, program managers, equipment accountability managers, maintainers and force planners as well as ensure accurate system valuation to support a clean financial audit. As defined by the IUID CDD, the Tactical CONOPS and informed by market surveys conducted during the legacy marking phase of the IUID effort. \n\nFunding for this Combat Support Equipment moves to BLI 4620 beginning in FY 2017."
        },
        "Justification": {
            "val": "There are no funds budgeted in FY18 or beyond.  All funding for Combat Support Equipment moved to BLI 4620 beginning in FY17."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}