{
    "id": "2018-Navy-PB-1810N-JBOOK-d28d83334f9383e77611ff4064e40d00fd933e9ab87acc3419c09665f6cb2c63-9",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA1-U_PROCUREMENT_JustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "0910"
        },
        "LineItemTitle": {
            "val": "Firefighting Equipment"
        },
        "P1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "9"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shipboard Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "74.816"
                },
                "PriorYear": {
                    "val": "13.983"
                },
                "CurrentYear": {
                    "val": "14.743"
                },
                "BudgetYearOneBase": {
                    "val": "15.887"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "15.887"
                },
                "BudgetYearTwo": {
                    "val": "19.414"
                },
                "BudgetYearThree": {
                    "val": "17.811"
                },
                "BudgetYearFour": {
                    "val": "18.173"
                },
                "BudgetYearFive": {
                    "val": "18.538"
                },
                "ToComplete": {
                    "val": "276.92"
                },
                "Total": {
                    "val": "470.285"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "74.816"
                },
                "PriorYear": {
                    "val": "13.983"
                },
                "CurrentYear": {
                    "val": "14.743"
                },
                "BudgetYearOneBase": {
                    "val": "15.887"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "15.887"
                },
                "BudgetYearTwo": {
                    "val": "19.414"
                },
                "BudgetYearThree": {
                    "val": "17.811"
                },
                "BudgetYearFour": {
                    "val": "18.173"
                },
                "BudgetYearFive": {
                    "val": "18.538"
                },
                "ToComplete": {
                    "val": "276.92"
                },
                "Total": {
                    "val": "470.285"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "74.816"
                },
                "PriorYear": {
                    "val": "13.983"
                },
                "CurrentYear": {
                    "val": "14.743"
                },
                "BudgetYearOneBase": {
                    "val": "15.887"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "15.887"
                },
                "BudgetYearTwo": {
                    "val": "19.414"
                },
                "BudgetYearThree": {
                    "val": "17.811"
                },
                "BudgetYearFour": {
                    "val": "18.173"
                },
                "BudgetYearFive": {
                    "val": "18.538"
                },
                "ToComplete": {
                    "val": "276.92"
                },
                "Total": {
                    "val": "470.285"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Department decided that a number of survivability improvements needed to be incorporated into mission-essential ship and combat systems during their acquisition and modernization. Shipboard fires have emphasized the urgent need to upgrade features and design standards that contribute to survivability.\n\n[P40A \/ HB003 - EMERGENCY ESCAPE BREATHING DEVICE (EEBD)]: Emergency Escape Breathing Device (EEBD) breathing apparatus for firefighters are reaching their service life of 15 years and must be replaced.  EEBDs address a high priority CNO effort to replace expired breathing equipment aboard ships throughout the Fleet.  The requirement for this capability has been validated by the experience of numerous shipboard casualties.  EEBD replacement is required to ensure that ships will deploy with operational safety equipment on-board to allow for emergency escape from shipboard fires.\n\n[P40A \/ HB830 - PRODUCTION ENGINEERING (PE)]: PE includes development of technical manuals, Planned Maintenance System (PMS), Provisioning Technical Documentation (PTD), Program Support Data (PSD) and Allowance Parts List (APLs); engineering to manage procurement and material; support of design reviews.\n\n[P3A \/ HB002 - MAGAZINE SPRINKLING IMPROVEMENT]: Replaces the detection system designed in the 1960s which has performance deficiencies and is difficult to support and maintain.  Replacement includes the Fire Detection and Actuation System (FDAS) and the Motor-Operated Pilot Valves (MOPV).  When the FDAS detects a fire, the MOPV opens to provide the sprinkling for the magazine.  The FDAS consists of heat detectors, smoke detectors for amphibious ships, and associated controls.  MOPV is the same item procured under HB007 - SOPV Replacement.  FDAS\/MOPV provides increased fire performance and reduced unit and logistics costs.\n\n[P3A - 2 \/ HB007 - SOPV REPLACEMENT]: The Solenoid Operated Pilot Valve (SOPV) provides a way for remote control of the Aqueous Film Forming Foam (AFFF) and Countermeasure Wash Down (CMWD) systems.  Existing SOPVs are unreliable, costly to repair, and produce the longest downtime for the AFFF system.  Top Management Attention\/Top Management Initiative (TMA\/TMI) and INSURV interest due to impact of this item on AFFF system operation.  Replacement of the SOPV with the Motor Operated Pilot Valve (MOPV) is required to ensure these systems are operational for emergencies.  MOPV has a 50 year service life and will provide a significant reduction in preventative maintenance and cost.\n\n[P3A - 3 \/ HB008 - SCBA REPLACEMENT]: Self-Contained Breathing Apparatus (SCBA) is a compressed air breathing device compatible with a firefighter's protective wear and helmet, and other damage control equipment.  The SCBA are reaching the end of their service life of 15 years and are being replaced with 30 year cylinders.  SCBA replacement is required to ensure that ships will deploy with operational safety equipment on-board to provide breathable air while fighting shipboard fires.\n\n[P3A - 4 \/ HB009 - FIREFIGHTER ACCESS]: Funds the Firefighter Extraction System (FES) and Ladder Safety System (LSS) installations.  FES provides rescue lifting capability to remove injured or exhausted firefighters from the bottom of escape trunks.  LSS provides firefighters fall protection while using escape trunks for vertical entry firefighting."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}