{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-10",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2246"
        },
        "LineItemTitle": {
            "val": "Maritime Patrol and Reconnaisance Force"
        },
        "P1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "ASW Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "76.626"
                },
                "PriorYear": {
                    "val": "13.725"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "90.351"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "76.626"
                },
                "PriorYear": {
                    "val": "13.725"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "90.351"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "76.626"
                },
                "PriorYear": {
                    "val": "13.725"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "90.351"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.722"
                },
                "CurrentYear": {
                    "val": "0.357"
                },
                "Total": {
                    "val": "1.079"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0604231N"
                }
            ]
        },
        "Description": {
            "val": "Commencing in FY17 this line item was consolidated with OPN LI 2906 (PE 0204660N), to align TacMobile C4I procurements with TacMobile MPRF P-8A Aircraft Support Systems procurements.\n\nTactical\/Mobile (TacMobile) Maritime Patrol and Reconnaissance Force (MPRF) systems : Tactical\/Mobile (TacMobile) Maritime Patrol and Reconnaissance Force Systems provide the MPRF commanders with the capability to plan, direct, control and evaluate the tactical operations of MPRF and other assigned units within their respective area of responsibility. These operations include littoral, open ocean, and over land all sensor (e.g., Electro Optical (EO), Infrared (IR), Inverse Synthetic-Aperture Radar (ISAR)) surveillance, anti-surface warfare, over-the-horizon targeting, counter-drug operations, power projection, antisubmarine warfare, mining, search and rescue, homeland defense, and special operations.\n\nThe program includes fixed-site Tactical Operations Centers (TOCs) and Mobile Tactical Operations Centers (MTOCs) or equivalent. Each TacMobile unit is a system-of-systems. TOCs provide sensor and tactical data communications systems; mission planning\/mission support, sensor analysis capabilities; avionics and weapons system interfaces, media devices and data handling capabilities, at fixed-site locations. MTOC is a scalable, mobile version of the TOC for contingency operations and for support of operations from remote forward operating airfields.\n\nThe TacMobile program uses an evolutionary development strategy consisting of incremental upgrades to meet new and emergent Fleet requirements, while retaining current capabilities. Increments are planned and resourced to support the MPRF Family of Systems aircraft: P-8A Poseidon aircraft and its upgrades; Advanced Airborne Sensor (AAS); and MQ-4C Triton.\n\n7 TOCs: 6 operational systems (located at Jacksonville Florida, Sigonella Italy, Kaneohe Bay Hawaii, Whidbey Island Washington, Kadena Japan, and Bahrain), 1 laboratory system (the \"TacMobile Systems Integration Lab\" (TMSIL), collocated at SSC Atlantic detachment Patuxent River Maryland with PMA-290's P-8A \"Pax River Systems Integration Lab\" (PAXSIL)).\n\n15 MTOCs: 9 operational systems (homeported at Jacksonville Florida (5 sites),  Whidbey Island Washington (2 sites), and Coronado (North Island) California (2 sites)), 1 laboratory system (an aircraft integration lab located at Navy Detachment Dallas), 1 C4I engineering and maintenance support system (located at the In Service Engineering Activity (ISEA), SSC Atlantic), 1 C4I mobile systems schoolhouse (located at the Center for Naval Air Technical Training (CNATT) Jacksonville Florida) and 3 legacy systems awaiting End-to-End refresh\/recapitalization to meet current operational configuration\/requirements (SSC Lant).\n\nThis line item upgrades TOC\/MTOC sensor analysis, mission planning, in-flight mission support capabilities, avionics and weapons system interfaces, computer upgrades and associated software for interfacing, analysis and processing equipment to the supported weapons systems (aircraft).  Additionally, the line item upgrades mobility and facilities equipment necessary to power and support the processing equipment and interfaces."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}