{
    "id": "2018-Navy-PB-1109N-MJBOOK-0-0-6b2000f9111b6178e144100c1843f0feab54d2ff64037d5a22d994b135e5a122-56",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_MARINECORPS-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "6670"
        },
        "LineItemTitle": {
            "val": "Items Less Than $5 Million"
        },
        "P1LineNumber": {
            "val": "60"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "28.143"
                },
                "PriorYear": {
                    "val": "5.146"
                },
                "CurrentYear": {
                    "val": "6.326"
                },
                "BudgetYearOneBase": {
                    "val": "7.716"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.716"
                },
                "BudgetYearTwo": {
                    "val": "9.808"
                },
                "BudgetYearThree": {
                    "val": "10.049"
                },
                "BudgetYearFour": {
                    "val": "10.246"
                },
                "BudgetYearFive": {
                    "val": "10.455"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "28.143"
                },
                "PriorYear": {
                    "val": "5.146"
                },
                "CurrentYear": {
                    "val": "6.326"
                },
                "BudgetYearOneBase": {
                    "val": "7.716"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.716"
                },
                "BudgetYearTwo": {
                    "val": "9.808"
                },
                "BudgetYearThree": {
                    "val": "10.049"
                },
                "BudgetYearFour": {
                    "val": "10.246"
                },
                "BudgetYearFive": {
                    "val": "10.455"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "28.143"
                },
                "PriorYear": {
                    "val": "5.146"
                },
                "CurrentYear": {
                    "val": "6.326"
                },
                "BudgetYearOneBase": {
                    "val": "7.716"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.716"
                },
                "BudgetYearTwo": {
                    "val": "9.808"
                },
                "BudgetYearThree": {
                    "val": "10.049"
                },
                "BudgetYearFour": {
                    "val": "10.246"
                },
                "BudgetYearFive": {
                    "val": "10.455"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206624M"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "5.146"
                                },
                                "CurrentYear": {
                                    "val": "5.735"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.634"
                                },
                                "BudgetYearOne": {
                                    "val": "7.634"
                                },
                                "BudgetYearTwo": {
                                    "val": "9.288"
                                },
                                "BudgetYearThree": {
                                    "val": "9.675"
                                },
                                "BudgetYearFour": {
                                    "val": "9.865"
                                },
                                "BudgetYearFive": {
                                    "val": "10.066"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "CurrentYear": {
                                    "val": "0.591"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.082"
                                },
                                "BudgetYearOne": {
                                    "val": "0.082"
                                },
                                "BudgetYearTwo": {
                                    "val": "0.52"
                                },
                                "BudgetYearThree": {
                                    "val": "0.374"
                                },
                                "BudgetYearFour": {
                                    "val": "0.381"
                                },
                                "BudgetYearFive": {
                                    "val": "0.389"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "5.146"
                    },
                    "CurrentYear": {
                        "val": "6.326"
                    },
                    "BudgetYearOneBase": {
                        "val": "7.716"
                    },
                    "BudgetYearOne": {
                        "val": "7.716"
                    },
                    "BudgetYearTwo": {
                        "val": "9.808"
                    },
                    "BudgetYearThree": {
                        "val": "10.049"
                    },
                    "BudgetYearFour": {
                        "val": "10.246"
                    },
                    "BudgetYearFive": {
                        "val": "10.455"
                    }
                }
            }
        },
        "Description": {
            "val": "This budget line item includes various procurements such as engineering efforts, engineering change proposals, modifications, and other related items less than $5 million each.\n\nCorrosion Prevention and Control (CPAC) Program provides a comprehensive approach to extend the useful life on Marine Corps tactical ground and ground support equipment. The CPAC Program Office is responsible for the governance, oversight and management of both preventive and corrective corrosion control encompassing Acquisition Engineering, Material Development, Corrosion Service Teams, and Corrosion Repair Facility activities.  The Consolidated CPAC Program provides a total lifecycle solution focused on Total Ownership Cost reduction and improved readiness.\n\nEngineer Mods and Tool Kits funds critical improvements to various pieces of equipment by enhancing their current capabilities and expanding protection from direct and indirect fire by providing specific tool kits, including the specific chest or case to store and transport the tools, to perform specific missions assigned to engineer units, such as carpentry, grubbing or clearing areas with pioneer type tools, destruction\/demolition, masonry, electrical (base camp support), plumbing, etc. including (but not limited to) Construction Shop Kit, Pioneer Platoon Kit, Pioneer Squad Kit, Carpenter Kit, Mason Kit, and tactical weld shop upgrades.\n\nMarine Corps Family of Containers (MCFC) provides Marine Corps Operating Forces with a fully intermodal transport capability emphasizing dimensional standardization and International Organization for Standardization compatibility. Containers such as Pallet (PALCONs), Quadruple (QUADCONs), Quadruple with Roll-up door (QUADCON RUD) and Joint Modular Intermodal Container (JMIC) are procured. Containers will replace locally assembled prefabricated wooden mount out boxes and flat box pallets. The containers will be used to support storage and movement of organizational property and consumable supplies; provide field, garrison and shipboard warehousing; and facilitate ship-to-shore movement. The Joint Modular Intermodal Container (JMIC) provides efficient, seamless, and visible movement of supplies and unit equipment throughout the transportation and distribution systems.\n\nFamily of Expeditionary Water Systems (FEWS) is a family of systems line that contains items such as the Tactical Water Purification System (TWPS),  Lightweight Water Purification System (LWPS), Expeditionary Water Distribution System (EWDS), Platoon Water Purification System (PWPS), Individual Water Purification System (IWPS) as well as all the various water supply support and analysis components and equipment including Six Container (SIXCON) Pump and Tank Modules, Nozzles, Field Laundry Units, Interconnection Sets, Water Packaging Components, Shower Units, Grey Water Recycling, 3k\/5k\/25k Tanks, Hypocholorination Units, Water Quality Analysis Sets necessary to support the storage, distribution and analysis of potable water. The TWPS produces up to 1,500 gallons per hour (GPH), it is a mobile water treatment system that allows the commander to produce bulk water supplies at battalion and regimental level. The LWPS is a lightweight modular, self-contained system that uses filtration and reverse osmosis technology to produce up to 230 GPHof potable water from fresh, brackish, salt, and nuclear, biological, and chemical (NBC) contaminated water. This capability is necessary to provide safe and potable water to company units in an expeditionary environment or in extended company operations.  PWPS is a vehicle transported system with a 2 person lift capability. It purifies a minimum of 15 GPH for fresh, brackish, and salt water. IWPS is an individual water purification system that is designed to provide emergency or short term drinking water to the individual Marine from a fresh water source."
        },
        "Justification": {
            "val": "FY2018 Base Appropriation Request: $7.716M (ACTIVE: $7.634M\/RESERVE: $0.082M)\n\nCorrosion Prevention and Control (CPAC) $0.867M:  Continues to fund the procurement of equipment protective covers designed to reduce and\/or eliminate the negative effects of corrosion on USMC ground tactical and support equipment, and the replacement of aging covers that have exceeded their expected life cycle to prevent failure in the field.  The priority will be to provide equipment covers for equipment at II MEF, MARFORRES, and MARSOC for USMC equipment placed in an administrative staging program to mitigate the negative impacts of corrosion and decrease total ownership costs.  Additionally, procurement funding will used to replace aging blast and painting equipment at the Corrosion Repair Facilities (CRF's) located at I MEF, II MEF, and III MEF which are managed by the consolidated CPAC program currently monitoring the health on 92,758 tactical ground and support equipment assets.   \n\nEngineer Modification Kits (EMK) $3.541M:  Continues to fund EMK for equipment armor installations, upgrades and safety concerns to prevent deterioration in Fleet readiness for Engineer Systems inventory consisting of over 47,000 end items associated to 120 TAMCNs.  Supports modifications and upgrades to fielded legacy as well as newly fielded systems and provides quick response capability for meeting Fleet Marine Force sustainment for safety engineering, readiness, Quality Deficiency Report analysis, and legacy system modifications.\n\nMarine Corps Family of Containers (MCFC) $1.297M:  Continues to fund Joint Modular Intermodal Containers. Funding is required to meet the Approved Acquisition Objectives outlined in the Total Force Structure Management System.\n\nFamily of Expeditionary Water Systems (FEWS) $2.011M (ACTIVE: $1.929M\/RESERVES $0.082M): Funding continues to procure PWPS. This equipment will support material readiness.\n\nThe increase in funding from FY17 to FY18 $0.791M supports procurement of Lightweight Water Purification Systems(LWPS) and PWPS.\n\nOCO: \nFY2018 Overseas Contingency Operations (OCO) Request:  N\/A"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}