{
    "id": "2018-Navy-PB-1810N-MJBOOK-1-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-45",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA4-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "2970"
        },
        "LineItemTitle": {
            "val": "EMI Control Instrumentation"
        },
        "P1LineNumber": {
            "val": "88"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shore Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "132.192"
                },
                "PriorYear": {
                    "val": "4.175"
                },
                "CurrentYear": {
                    "val": "3.971"
                },
                "BudgetYearOneBase": {
                    "val": "4.188"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.188"
                },
                "BudgetYearTwo": {
                    "val": "4.331"
                },
                "BudgetYearThree": {
                    "val": "4.439"
                },
                "BudgetYearFour": {
                    "val": "4.535"
                },
                "BudgetYearFive": {
                    "val": "4.625"
                },
                "Total": {
                    "val": "162.456"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "132.192"
                },
                "PriorYear": {
                    "val": "4.175"
                },
                "CurrentYear": {
                    "val": "3.971"
                },
                "BudgetYearOneBase": {
                    "val": "4.188"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.188"
                },
                "BudgetYearTwo": {
                    "val": "4.331"
                },
                "BudgetYearThree": {
                    "val": "4.439"
                },
                "BudgetYearFour": {
                    "val": "4.535"
                },
                "BudgetYearFive": {
                    "val": "4.625"
                },
                "Total": {
                    "val": "162.456"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "132.192"
                },
                "PriorYear": {
                    "val": "4.175"
                },
                "CurrentYear": {
                    "val": "3.971"
                },
                "BudgetYearOneBase": {
                    "val": "4.188"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.188"
                },
                "BudgetYearTwo": {
                    "val": "4.331"
                },
                "BudgetYearThree": {
                    "val": "4.439"
                },
                "BudgetYearFour": {
                    "val": "4.535"
                },
                "BudgetYearFive": {
                    "val": "4.625"
                },
                "Total": {
                    "val": "162.456"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The EMI Control Instrumentation Program is supported by OPNAV N2N6, OPNAV N95, OPNAV N96, OPNAV N97 and OPNAV N98. The EMI Control Instrumentation Program provides Cradle to Grave Systems Engineering for Mission Assurance by implementing Electromagnetic Compatibility (EMC) hardware solutions, Spectrum Management (SM) software solutions, and by procuring specialized test equipment used in the characterization\/quantification of EMI problems aboard US Navy platforms. This ensures equipment, systems, and platforms meet their Operational Mission Requirements and goals within their intended operational Electromagnetic (EM) environment. \n\nMA004 - EMI (HARDWARE) FIXES: Procurement and installation of Electromagnetic Interference (EMI) Hardware Solutions (i.e. Fixes) will achieve Electromagnetic Compatibility (EMC) among and between shipboard electronic\/electric systems and\/or equipment. This will be accomplished by determining the optimal EMI fix hardware, evaluating the effectiveness of the EMI solution, then procuring and installing the required hardware with full integrated logistic support (ILS) as part of the system hardware (ECP, OA, FC, etc). The fixes may include various types of radio frequency (RF) filters, limiters, blankers, radar absorbing material (RAM) and shielding methods.  MA004 - EMI (Hardware) Fixes is supported by OPNAV N95, OPNAV N96, OPNAV N97 and OPNAV N98.\n\nMA104 - EMI (SOFTWARE) FIXES: Procurement and installation of EMI Software Fixes for platform\/strike group\/Area of Operation. These specific spectrum procedures (software application capabilities) and frequency management techniques (software modules) will be used to eliminate and reduce EMI when hardware solutions are unacceptable. Funds will also be used to provide engineering support to the enhancement of spectrum software applications through the procurement of models and other capabilities, including ILS for software tools\/utilities\/applications that correct\/mitigate operational EMI.  MA104 - EMI (Software) Fixes are supported by OPNAV N95, OPNAV N96, OPNAV N97 and OPNAV N98.\n\nMA204 - EMI CONTROL INSTRUMENTATION:  EMI Control Instrumentation will procure specialized test equipment used in the characterization and quantification of EMI problems aboard US Navy platforms. In addition, instrumentation will be procured for use in identifying the sources of EMI and determining the extent of EMI so that effective corrective measures can be applied.   The instrumentation procured will include automated and special EMI test equipment (e.g., for spectrum analysis, mapping field intensities, etc.).  EMI Control Instrumentation can include both hardware and software products that will enhance or streamline data collection efforts, including the ability to provide remote access capability.  MA204 - EMI CONTROL INSTRUMENTATION are supported by OPNAV N2N6."
        },
        "Justification": {
            "val": "OPN Funds are used to procure and install (P\/I) EMI Fixes on deploying ships and submarines.  The number of EMI Fixes procured, MA004 Hardware Fixes, are dependent on the number of ships\/subs in the fleet and when they deploy.  Between FY2017 and FY2018, according to the Ship and Aircraft Supplemental Data Tables (SASDT) force structure projections for the US Navy, there is an overall increase in commissioned ships\/subs of 8 (i.e., 296 to 304).  EMI Hardware fixes vary in cost; based on complexity, and ship\/sub class\/types.  The increase in cost for MA004 will cover the projected increase in EMI Fix P\/I requirements for FY2018."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}