{
    "id": "2018-Army-PB-2035A-JBOOK-47aba4e61a9576ce00f42879503931d6f46619e32b635c55302b3bc83156cbe1-27",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-ARMY_OTHER_3-U_PROCUREMENT_JustificationBook_Army_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "R70001"
        },
        "LineItemTitle": {
            "val": "Family Of Engr Combat and Construction Sets"
        },
        "P1LineNumber": {
            "val": "146"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "25"
        },
        "BudgetSubActivityTitle": {
            "val": "Combat Service Support Equipment"
        },
        "ResourceSummary": {
            "Quantity": {
                "AllPriorYears": {
                    "val": "482"
                },
                "PriorYear": {
                    "val": "250"
                },
                "CurrentYear": {
                    "val": "570"
                },
                "BudgetYearOneBase": {
                    "val": "157"
                },
                "BudgetYearOne": {
                    "val": "157"
                },
                "BudgetYearTwo": {
                    "val": "159"
                },
                "BudgetYearThree": {
                    "val": "363"
                },
                "BudgetYearFour": {
                    "val": "445"
                },
                "BudgetYearFive": {
                    "val": "572"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "165.829"
                },
                "PriorYear": {
                    "val": "34.544"
                },
                "CurrentYear": {
                    "val": "39.173"
                },
                "BudgetYearOneBase": {
                    "val": "10.426"
                },
                "BudgetYearOne": {
                    "val": "10.426"
                },
                "BudgetYearTwo": {
                    "val": "6.719"
                },
                "BudgetYearThree": {
                    "val": "16.529"
                },
                "BudgetYearFour": {
                    "val": "22.996"
                },
                "BudgetYearFive": {
                    "val": "31.49"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "UnitCost": {
                "AllPriorYears": {
                    "val": "344.044"
                },
                "PriorYear": {
                    "val": "138.176"
                },
                "CurrentYear": {
                    "val": "68.725"
                },
                "BudgetYearOneBase": {
                    "val": "66.408"
                },
                "BudgetYearOne": {
                    "val": "66.408"
                },
                "BudgetYearTwo": {
                    "val": "42.258"
                },
                "BudgetYearThree": {
                    "val": "45.534"
                },
                "BudgetYearFour": {
                    "val": "51.676"
                },
                "BudgetYearFive": {
                    "val": "55.052"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "165.829"
                },
                "PriorYear": {
                    "val": "34.544"
                },
                "CurrentYear": {
                    "val": "39.173"
                },
                "BudgetYearOneBase": {
                    "val": "10.426"
                },
                "BudgetYearOne": {
                    "val": "10.426"
                },
                "BudgetYearTwo": {
                    "val": "6.719"
                },
                "BudgetYearThree": {
                    "val": "16.529"
                },
                "BudgetYearFour": {
                    "val": "22.996"
                },
                "BudgetYearFive": {
                    "val": "31.49"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "165.829"
                },
                "PriorYear": {
                    "val": "34.544"
                },
                "CurrentYear": {
                    "val": "39.173"
                },
                "BudgetYearOneBase": {
                    "val": "10.426"
                },
                "BudgetYearOne": {
                    "val": "10.426"
                },
                "BudgetYearTwo": {
                    "val": "6.719"
                },
                "BudgetYearThree": {
                    "val": "16.529"
                },
                "BudgetYearFour": {
                    "val": "22.996"
                },
                "BudgetYearFive": {
                    "val": "31.49"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "7"
                                },
                                "CurrentYear": {
                                    "val": "260"
                                },
                                "BudgetYearOneBase": {
                                    "val": "157"
                                },
                                "BudgetYearOne": {
                                    "val": "157"
                                },
                                "BudgetYearTwo": {
                                    "val": "159"
                                },
                                "BudgetYearThree": {
                                    "val": "363"
                                },
                                "BudgetYearFour": {
                                    "val": "445"
                                },
                                "BudgetYearFive": {
                                    "val": "572"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "7.446"
                                },
                                "CurrentYear": {
                                    "val": "19.444"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.426"
                                },
                                "BudgetYearOne": {
                                    "val": "10.426"
                                },
                                "BudgetYearTwo": {
                                    "val": "6.719"
                                },
                                "BudgetYearThree": {
                                    "val": "16.529"
                                },
                                "BudgetYearFour": {
                                    "val": "22.996"
                                },
                                "BudgetYearFive": {
                                    "val": "31.49"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army National Guard"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "168"
                                },
                                "CurrentYear": {
                                    "val": "197"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "16.392"
                                },
                                "CurrentYear": {
                                    "val": "13.295"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army Reserve"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "75"
                                },
                                "CurrentYear": {
                                    "val": "113"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "10.706"
                                },
                                "CurrentYear": {
                                    "val": "6.434"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "Quantity": {
                    "PriorYear": {
                        "val": "250"
                    },
                    "CurrentYear": {
                        "val": "570"
                    },
                    "BudgetYearOneBase": {
                        "val": "157"
                    },
                    "BudgetYearOne": {
                        "val": "157"
                    },
                    "BudgetYearTwo": {
                        "val": "159"
                    },
                    "BudgetYearThree": {
                        "val": "363"
                    },
                    "BudgetYearFour": {
                        "val": "445"
                    },
                    "BudgetYearFive": {
                        "val": "572"
                    }
                },
                "TotalCost": {
                    "PriorYear": {
                        "val": "34.544"
                    },
                    "CurrentYear": {
                        "val": "39.173"
                    },
                    "BudgetYearOneBase": {
                        "val": "10.426"
                    },
                    "BudgetYearOne": {
                        "val": "10.426"
                    },
                    "BudgetYearTwo": {
                        "val": "6.719"
                    },
                    "BudgetYearThree": {
                        "val": "16.529"
                    },
                    "BudgetYearFour": {
                        "val": "22.996"
                    },
                    "BudgetYearFive": {
                        "val": "31.49"
                    }
                }
            }
        },
        "Description": {
            "val": "The Family Of Engineering Combat and Construction Sets (ECACS) is a family of systems that will support operations by combat and construction engineer teams in urban and rural environments. ECACS sets utilized in urban environment will aid in detection, protection, surveillance, monitoring, evacuation and clearing. ECACS sets utilized in rural environments will allow clearing and troop mobility support areas to include airfields, ports, facilities, and roads. Vertical Skills Engineer Construction Kits (VSECK)has six types which each provide tools and power equipment to meet maintenance and construction mission requirements.\n\nThe Engineer Equipment Set: Urban Operations, Platoon Set (UOpPS) consists of high technology equipment that provides soldiers with enhanced capabilities to perform missions in urbanized or complex terrain.  It provides engineers and others with specialized tools enabling them to conduct operations in urban environments in a safer, more expedient manner.  The components include thermal scopes, remote viewing instruments, detectors for explosives and gases, portable welders, metal cutting torches, rescue tools, mechanical entry tools, winch, and battery operated drills and saws.  The set will standardize tools, reducing logistical support and provide a Type Classified (TC)-standard Army system.\nArmy Acquisition Objective (AAO) for Urban Operations, Platoon Set (UOpPS) is 1952. \n\nThe Engineer Equipment Set:  Urban Operations, Squad Set (UOpSS) consists of equipment that provides Soldiers with enhanced capabilities to perform missions in urbanized or complex terrain.  Components include portal blast shield, collapsible lightweight assault ladders, mechanical entry tools, and rappelling gear.  This set supports dismounted engineer Soldiers and others in conducting Military Operations in Urban Terrain (MOUT).  The set will standardize tools, reducing logistical support and provide a Type Classified (TC)-standard Army system.\nArmy Acquisition Objective (AAO) for Urban Operations, Squad Set (UOpSS) is 772.  \n\nThe Engineer Equipment Set:  Hydraulic Electric Pneumatic Petroleum Operated Equipment (HEPPOE) supports combat and construction engineer tasks across the entire spectrum of the operation area such as clearing buildings for repair and construction, clearing areas around road constructions, port openings and any other urban areas that require operations.  The HEPPOE consists of 2 power units that provide hydraulic, electric and pneumatic power in conjunction with a rapid inventory 13 case tool load (Concrete Chain Saws, Hammer Drill, Sump Pump, Pavement Breakers, etc.) that will enhance the ability to operate in an urban area.  The HEPPOE replaces two legacy systems through modernization, consolidation and optimization.  .\nArmy Acquisition Objective (AAO) for Hydraulic Electric Pneumatic Petroleum Operated Equipment (HEPPOE) is 710.\n\nVSECK - Type I Carpenters Tool Kit Squad (CTKS)  is a new configuration containing industrial quality hand tools, safety equipment, deployment bags and tool belts for up to eight Construction Engineers secured in a waterproof rapid inventory case. Hand tools include hammers, utility knives, chisels, punches, hacksaws, hand saws, pliers, screwdrivers, squares and tape measures.  VSECK Type I replaces one legacy system through modernization, consolidation and optimization.  The legacy system this replaces does not meet current mission requirements and does not have any warranty associated with the current components. . Army Acquisition Objective for Type I is 5517.\n\nVSECK Type II Carpenters Supplemental Tool Kit (CSTK) is a new configuration containing battery powered & carpentry hand tools to increase productivity at remote sites supporting a platoon size element. The cordless tools are a minimum of 18v and standardized to use the same power source with a power management system capable of recharging multiple power sources simultaneously. Cordless power tools include: hammer drills, right angle drills, circular saws, jig saws and reciprocating saws. VSECK Type II replaces one legacy system through modernization, consolidation and optimization.  The legacy system this replaces does not meet current mission requirements and does not have any warranty associated with the current components. Army Acquisition Objective for Type II is 830.\n\nVSECK Type III Carpenters Tool Kit (CTK) is a new configuration containing commercial pneumatic, electric & hand carpentry tools that enable Soldiers to perform common carpentry tasks including construction of fighting positions, shelters, base camps, POW camps, temporary structures, bridges, ports & repair of existing structures.  Tool load includes pneumatic nailer, blow gun, router, jig saw, 10” table saw, 10” circular saw, 14” cut off saw, 12” miter saw, nibbler, electric shears and tile cutter.   VSECK Type III replaces one legacy system through modernization, consolidation and optimization.  The legacy system this replaces does not meet current mission requirements and does not have any warranty associated with the current components. Army Acquisition Objective for Type III is 314.\n\nVSECK Type IV Electricians Tool Kit (ETK) enables 3 electricians to perform construction & maintenance tasks related to distribution & transmission of electrical power: interior & exterior lighting, installation & repair of lighting & wiring aboard ships.  Kit contains conduit benders, auger bits, pliers, knives, wood chisels, crimpers, tube & PVC cutters, key sets, levels multimeter, strippers, wrenches, ladders, electric saws & drills and flood lights.   VSECK IV replaces one legacy system through modernization, consolidation and optimization.  The legacy system this replaces does not meet current mission requirements and does not have any warranty associated with the current components. Army Acquisition Objective for Type IV is 928.\n\nVSECK Type V Mason and Concrete Tool Kit (MCTK)  includes brick hammers, levels, chalk line, rulers, plumb bobs, trowels, floats, bull floats, specialized floats, screeds, edger, groover, brooms, hoses & nozzles, mortar mixer, scaffolding, sealant sprayer, pliers, vibrator, cut-off saws, grinder, rebar cutters & benders, hacksaws, knee  boards, mortar boards & stands, buckets, brushes, laser level, come-a-long, tarps, hoes, rakes & shovels.  VSECK Type V replaces one legacy system through modernization, consolidation and optimization.  The legacy system this replaces does not meet current mission requirements and does not have any warranty associated with the current components.Army Acquisition Objective for Type V is 892.\n\nVSECK Type VI Plumbers and Pipefitters Tool Kit (PPTK) is specialized equipment required by a team of plumbers and pipefitters stock to perform construction and maintenance tasks working with metal, brass, aluminum, PVC or PEX. Contains hand tools enabling performance of individual & collective tasks related to heating & air conditioning, water distribution, waste water removal & solid waste removal. The tool load includes: hammers, hack saws, chisels, wrenches, pliers, putty knives, screwdrivers, saws, level plumb bob, tool box, ladder, powered saws & drills, pry & line up bars, tubing & pipe cutters, floodlight, key set, & plunger.   VSECK VI replaces three legacy systems through modernization, consolidation and optimization.  The legacy systems this replaces do not meet current mission requirements and do not have any warranty associated with the current components. Army Acquisition Objective for Type V is 898."
        },
        "Justification": {
            "val": "FY18 Funding in the amount of $2.552 million procures 9 HEPPOE.  The Engineer Equipment Set:  Hydraulic-Electric-Pneumatic-Petroleum-Operated Equipment (HEPPOE) will enhance mission accomplishment by replacing outdated systems.  Providing this soldier portable set will allow soldiers to increase capability to complete required missions, provide support to civil authorities, and deter\/defeat hybrid threats in support of the Army process.\n\nFY18 base funding in the amount of $4.354 million procures 25 Urban Operations Platoon Sets.  The Engineer Equipment Set: Urban Operations, Platoon Set (UOpPS) uniquely fills capability gaps that exist at the platoon level for conducting operations in urban environments.  The specialized high technology tools included in this kit provide engineers, infantry, military police and other military units with enhanced capability to conduct operations in urban environments in a safe and expeditious manner.  This set will standardize the tools used for conducting urban operations thereby reducing logistical support and provide a Type Classified (TC)-standard Army system.\n\nFY18 base funding in the amount of $.567 million procures 7 Urban Operations Squad Sets.  The Engineer Equipment Set: Urban Operations, Squad Set (UOpSS) uniquely fills capability gaps that exist at the squad level for conducting operations in urban environments.  The specialized low technology tools included in this set provide engineers, infantry, military police and other military units with enhanced capability to conduct operations in urban environments in a safe and expeditious manner.  This set will standardize the tools used for conducting urban operations thereby reducing logistical support and provide a Type Classified (TC)-Army system.\n\nFY18 base funding in the amount of $.208 million procures 22 Type I VSECK assets. Currently there is a large capability gap in the field that severely needs this materiel solution for a rapidly available, portable and modernized tool kit for the Engineer community. This will increase productivity, expand capabilities, reduce risk and will contribute to rapid mobility of Construction Engineers. Providing this capability to the Soldier will increase the Soldier's ability to complete the required missions, provide support to civil authorities and deter\/defeat hybrid threats in support of the Army process.\n\nFY18 base funding in the amount of $.321 million procures 16 Type II VSECK assets. Currently there is a large capability gap in the field that severely needs this materiel solution for a rapidly available, portable and modernized tool kit for the Engineer community. This will increase productivity, expand capabilities, reduce risk and will contribute to rapid mobility of Construction Engineers. Providing this capability to the Soldier will increase the Soldier's ability to complete the required missions, provide support to civil authorities and deter\/defeat hybrid threats in support of the Army process.\n\nFY18 base funding in the amount of $.338 million procures 9 Type III VSECK assets. Currently there is a large capability gap in the field that severely needs this materiel solution for a rapidly available, portable and modernized tool kit for the Engineer community. This will increase productivity, expand capabilities, reduce risk and will contribute to rapid mobility of Construction Engineers. Providing this capability to the solider will increase the Soldier's ability to complete the required missions, provide support to civil authorities and deter\/defeat hybrid threats in support of the Army process.\n\nFY18 base funding in the amount of $.326 million procures 14 Type IV VSECK assets. Currently there is a large capability gap in the field that severely needs this materiel solution for a rapidly available, portable and modernized tool kit for the Engineer community. This will increase productivity, expand capabilities, reduce risk and will contribute to rapid mobility of Construction Engineers. Providing this capability to the Soldier will increase the Soldier's ability to complete the required missions, provide support to civil authorities and deter\/defeat hybrid threats in support of the Army process.\n\nFY18 base funding in the amount of $.348 million procures 8 Type V VSECK assets. Currently there is a large capability gap in the field that severely needs this materiel solution for a rapidly available, portable and modernized tool kit for the Engineer community. This will increase productivity, expand capabilities, reduce risk and will contribute to rapid mobility of Construction Engineers. Providing this capability to the Soldier will increase the Soldier's ability to complete the required missions, provide support to civil authorities and deter\/defeat hybrid threats in support of the Army process\n\nFY18 base funding in the amount of $1.412 million procures 47 Type VI VSECK assets. Currently there is a large capability gap in the field that severely needs this materiel solution for a rapidly available, portable and modernized tool kit for the Engineer community. This will increase productivity, expand capabilities, reduce risk and will contribute to rapid mobility of Construction Engineers. Providing this capability to the Soldier will increase the Soldier's ability to complete the required missions, provide support to civil authorities and deter\/defeat hybrid threats in support of the Army  process.\n\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), these items are necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}