{
    "id": "2018-AirForce-PB-3010F-JBOOK-5171067bc7495fedcac03b4a48b1cb1cb1152f536c419960ccbf27abff0e328c-36",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-AIRFORCE_AIRCRAFT_VOL2-U_PROCUREMENT_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3010F",
        "appropriation_name": "Aircraft Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "E00800"
        },
        "LineItemTitle": {
            "val": "E-8"
        },
        "P1LineNumber": {
            "val": "56"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3010F"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "Modification of Inservice Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Aircraft"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "105.683"
                },
                "PriorYear": {
                    "val": "18.001"
                },
                "CurrentYear": {
                    "val": "9.244"
                },
                "BudgetYearOneBase": {
                    "val": "13.232"
                },
                "BudgetYearOneOCO": {
                    "val": "3"
                },
                "BudgetYearOne": {
                    "val": "16.232"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "149.16"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "105.683"
                },
                "PriorYear": {
                    "val": "18.001"
                },
                "CurrentYear": {
                    "val": "9.244"
                },
                "BudgetYearOneBase": {
                    "val": "13.232"
                },
                "BudgetYearOneOCO": {
                    "val": "3"
                },
                "BudgetYearOne": {
                    "val": "16.232"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "149.16"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "105.683"
                },
                "PriorYear": {
                    "val": "18.001"
                },
                "CurrentYear": {
                    "val": "9.244"
                },
                "BudgetYearOneBase": {
                    "val": "13.232"
                },
                "BudgetYearOneOCO": {
                    "val": "3"
                },
                "BudgetYearOne": {
                    "val": "16.232"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "149.16"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0207581F"
                }
            ]
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0207581F"
                }
            ]
        },
        "Description": {
            "val": "This line item funds modifications to the E-8C Joint Surveillance Target Attack Radar System (JSTARS) aircraft through FY 2018. JSTARS was developed for ground surveillance, targeting, and battle management. The E-8C is a modified Boeing 707-300 airframe that provides a unique blend of Battle Management Command and Control (BMC2) and Intelligence, Surveillance, and Reconnaissance (ISR). Air Battle Managers onboard the JSTARS use its wide area ground surveillance radar to build situational awareness and identify targets which are passed to strike assets or crossed cued with ISR platforms. The capability to perform this dual mission at the tactical edge both reduces the time to execute the kill chain and improves ISR collections across the range of military options.\n\nThere are 16 E-8Cs in the inventory. Additional analysis is in work to determine the individual design service life of each of these aircraft.\n\nFY18 funds cover three modification efforts:\n\n1. Primary Mission Equipment (PME) Diminishing Manufacturing Sources (DMS)\nPME DMS is a top issue for fleet viability. PME is required for Joint STARS to maintain net-centric war fighter capabilities - Ground Moving Target Indicator (GMTI) and Battle Management Command and Control (BMC2) as specified in the Operational Requirements Document (ORD). The last major modification to the mission computing hardware took place during the Computer Replacement Program (CRP) from 1997-2005. The program has maximized 3rd party vendors and after-market suppliers for the last eight years without any additional funded capital equipment replacements. Parts obsolescence stemming from an overdue capital equipment replacement (20+ year old Commercial Off the Shelf (COTS) equipment) requires a major modification to maintain the existing processing capabilities and specification compliance.  Modification will address hardware and software DMS issues and COTS life cycle replacement for Operator Work Station (OWS), the Central Computing subsystem, and the Radar Airborne Signal Processor (RASP) subsystem. Modifications will also include but are not limited to mission and maintenance crew trainers, software maintenance, and support systems at Robins AFB GA. Installations will occur at Lake Charles, LA and the schedule is based on the Program Depot Maintenance (PDM) program. The PDM schedule is on fixed periodic time frames, however, the duration of the PDMs and platform availability are impacted by real world events therefore, the install schedule may vary.  FY18 activities include: final two aircraft modification installations, contract closeout activities, disposition of government furnished property, and advisory and assistance support.\n\n2. Combined Enterprise Regional Information Exchange System (CENTRIXs)\nCentral Command identified CENTRIXs as a requirement in Urgent Operational Need (UON) # CAF 301-10. CENTRIXs is the coalition network used by Joint Forces supporting FOL operations. It provides operational users with chat, e-mail, web browsing and processing of Microsoft Office documents received in the network. CENTRIXs is a global data network enterprise for U.S. and partner forces to share classified operational and intelligence information, region to region, for combined planning, unity of effort, and decision superiority in peacekeeping and contingency operations.\n\nFY18 activities include: procurement of 16 CENTRIXs kits and 4 installations.\n\n3.  Emergency Locator Transmitter (ELT)\n\nThe current Joint STARS ELT operates on the older 121.5\/243.0 MHz frequency that the international COSPAS-SARSAT satellite system no longer monitors. The upgraded ELT operates on 121.5\/406 MHz allowing the international satellite system to monitored the frequency. In the event of a distressed E-8C aircraft, the new frequency reduces the risk of recovery of aircrew and military equipment.\n\nFY18 OCO activities include: procurement of 16 ELT kits and 8 installations.\n\nIn accordance with Section 1815 of the FY2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for the use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.  \n\nFunding may be used to address Diminishing Manufacturing Sources (DMS) issues."
        },
        "Justification": {
            "val": "Where applicable, justification for individual modifications is provided in the P-3A exhibits."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}