{
    "id": "2018-Navy-PB-1810N-MJBOOK-0-0-fbb9e5b0d8825640b2319ff9ab04f7c60ae64a392562e3c4839b2d7fbd733f74-17",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-NAVY_OTHER_BA5-8-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "0945"
        },
        "LineItemTitle": {
            "val": "Submarine Batteries"
        },
        "P1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ships Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "9"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shipboard Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "346.436"
                },
                "PriorYear": {
                    "val": "23.072"
                },
                "CurrentYear": {
                    "val": "23.359"
                },
                "BudgetYearOneBase": {
                    "val": "17.594"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "17.594"
                },
                "BudgetYearTwo": {
                    "val": "15.332"
                },
                "BudgetYearThree": {
                    "val": "15.763"
                },
                "BudgetYearFour": {
                    "val": "16.09"
                },
                "BudgetYearFive": {
                    "val": "16.413"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "346.436"
                },
                "PriorYear": {
                    "val": "23.072"
                },
                "CurrentYear": {
                    "val": "23.359"
                },
                "BudgetYearOneBase": {
                    "val": "17.594"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "17.594"
                },
                "BudgetYearTwo": {
                    "val": "15.332"
                },
                "BudgetYearThree": {
                    "val": "15.763"
                },
                "BudgetYearFour": {
                    "val": "16.09"
                },
                "BudgetYearFive": {
                    "val": "16.413"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "346.436"
                },
                "PriorYear": {
                    "val": "23.072"
                },
                "CurrentYear": {
                    "val": "23.359"
                },
                "BudgetYearOneBase": {
                    "val": "17.594"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "17.594"
                },
                "BudgetYearTwo": {
                    "val": "15.332"
                },
                "BudgetYearThree": {
                    "val": "15.763"
                },
                "BudgetYearFour": {
                    "val": "16.09"
                },
                "BudgetYearFive": {
                    "val": "16.413"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Procurement of Valve Regulated Lead Acid (VRLA) batteries and Shipalt installation to modify submarines from use of legacy flooded battery (no longer in production at former sole source manufacturer) to new design VRLA battery.  Initial installations of VRLA battery also requires the installation of an Automatic Battery Monitoring system (ABMS).  The budget procures and installs initial and replacement VRLA batteries for SSN688 Class, SSN21 Class, SSGN726 Class,  SSBN726 Class, and SSN774 Class Submarines.  Batteries have a finite life and are consumables; therefore, the budget procures life-cycle replacement VRLA batteries at a notional 5 year replacement cycle.  Procurements with Automated Battery Monitoring System (ABMS) are new installations, and procurements without ABMS are life-cycle replacements.\n\n[P40A \/ HM002 - LOS ANGELES Class Main Storage Battery]: HM002 procures replacement low maintenance sealed lead acid batteries for LOS ANGELES Class submarines, which involves adapting commercial VRLA technology to submarines.  This replaces flooded battery technology for which the industrial base ceased manufacture and support of in FY05.  Installation unit costs vary due to the availability types, location of installation and submarine type.\n\n[P40A \/ HM008 - OHIO Class Main Storage Battery]: HM008 procures replacement low maintenance sealed lead acid batteries for OHIO Class submarines, which involves adapting commercial VRLA technology to submarines.  This replaces flooded battery technology for which the industrial base ceased manufacture and support of in FY05.  Installation unit costs vary due to the availability types, location of installation and submarine type.\n\n[P40A \/ HM009 - SEAWOLF Class Main Storage Battery]: HM009 procures replacement low maintenance sealed lead acid batteries for SEAWOLF Class submarines, which involves adapting commercial VRLA technology to submarines.  This replaces flooded battery technology for which the industrial base ceased manufacture and support of in FY05.  Installation unit costs vary due to the availability types, location of installation and submarine type.\n\n[P40A \/ HM010 - VIRGINIA Class Main Storage Battery]: HM010 procures replacement low maintenance sealed lead acid batteries for VIRGINIA Class submarines, which involves adapting commercial VRLA technology to submarines.  This replaces flooded battery technology for which the industrial base ceased manufacture and support of in FY05.  Installation unit costs vary due to the availability types, location of installation and submarine type.\n\n[P40A \/ HM830 - Production Engineering]: Naval Surface Warfare Center (NSWC) Crane, as the designated procurement activity and In-Service Engineering Agent (ISEA) monitors battery performance and establishes replacement schedules with the fleet.  NSWC Crane is also tasked with leading a Government & Industry Root Cause Analysis (RCA) team to identify and address causes for premature capacity decline seen with VLRA batteries.  NSWC Crane conducts qualification testing of VRLA cells which, in addition to being a Performance Specification requirement, has proven very beneficial to the Navy in detecting battery deficiencies that can be corrected before installation, thus alleviating critical emergent fleet impact.  Funding is provided for Puget Sound and Portsmouth Naval Shipyards responsibilities for the flooded battery inventory storage, maintenance and inventory management, SHIPALT support, and AIT management. In addition, costs for Planning Yard SHIPALT completion and Lead Yard Services are funded through this line."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}