{
    "id": "2019-TheJointStaff-PB-0300D-MJBOOK-0-12-6b022543cb6445b68117b02861c9164cb77f7bc844461a357d2dbbe76be2958d-1",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-DEFENSE_VOL1_ALL-U_PROCUREMENT_MasterJustificationBook_Defense-Wide_PB_2019.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Defense-Wide_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "80"
        },
        "LineItemTitle": {
            "val": "Major Equipment, TJS - CE2T2"
        },
        "P1LineNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "15"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, TJS"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0.903"
                },
                "BudgetYearOneBase": {
                    "val": "0.904"
                },
                "BudgetYearOne": {
                    "val": "0.904"
                },
                "BudgetYearTwo": {
                    "val": "0.912"
                },
                "BudgetYearThree": {
                    "val": "1.473"
                },
                "BudgetYearFour": {
                    "val": "1.024"
                },
                "BudgetYearFive": {
                    "val": "1.024"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0.903"
                },
                "BudgetYearOneBase": {
                    "val": "0.904"
                },
                "BudgetYearOne": {
                    "val": "0.904"
                },
                "BudgetYearTwo": {
                    "val": "0.912"
                },
                "BudgetYearThree": {
                    "val": "1.473"
                },
                "BudgetYearFour": {
                    "val": "1.024"
                },
                "BudgetYearFive": {
                    "val": "1.024"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0.903"
                },
                "BudgetYearOneBase": {
                    "val": "0.904"
                },
                "BudgetYearOne": {
                    "val": "0.904"
                },
                "BudgetYearTwo": {
                    "val": "0.912"
                },
                "BudgetYearThree": {
                    "val": "1.473"
                },
                "BudgetYearFour": {
                    "val": "1.024"
                },
                "BudgetYearFive": {
                    "val": "1.024"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "The Chairman of the Joint Chiefs of Staff (CJCS) is the principal military adviser to the President, National Security Council, and Secretary of Defense. The Chairman presides over and serves as a member of the Joint Chiefs of Staff. CJCS relies upon the Joint Staff (TJS) to craft and distribute guidance for combatant forces' unified strategic direction, operations under unified commands, and integration into effective combat forces. On behalf of the Chairman, TJS provides Combatant Commands (CCMDs), the Services, and U.S. war fighters with joint policy, strategy, and doctrine necessary to employ effective joint combat forces in contingencies worldwide."
        },
        "Justification": {
            "val": "The FY 2019 Joint Staff procurement appropriation resources mission critical hardware\/software requirements for Combatant Commander's Exercise Engagement & Training Transformation (CE2T2).\n\nThe funding profile increase between FY 2017 and FY 2018 is due to CE2T2 transferring to the Joint Staff from the Office of the Undersecretary of Defense (Personnel and Readiness) for direct execution and oversight of the program across the Services, Combatant Commands, and the Joint Staff.  Transferring funding for the execution of CE2T2 through the Joint Staff is intended to provide improvements to the Chairman of the Joint Chiefs of Staff focus areas consisting of the following: 1) restoring joint readiness; 2) improving our joint warfighting capability; and 3) developing leaders for Joint Forces Next.\n\nThe CE2T2 program continues to strengthen, expand, and develop Joint Force warfighting capabilities and competencies. Specifically, CE2T2 includes the following procurement activities: \n\n1 . USCYBERCOM requires procurement funding for hardware and software capabilities to preserve and expand current infrastructure. The current Cyber Range instrumentation provides a joint cyberspace training range to support United States Cyber Command (USCYBERCOM)-led CYBER FLAG, CYBER GUARD, and CYBER KNIGHT exercises. As part of the joint cyberspace training initiative, continuance and expansion of the cyber range infrastructure is needed to support the Combatant Commanders, Services and USCYBERCOM joint cyber training and exercise requirements. The current target environment includes a \"blue forces\" Department of Defense Information Network to include Network Operations Security Centers, a \"gray\" network of internet spaces to include .gov and .edu domains that will emulate Internet sites and user activities, a realistic representation of an adversary \"red\" network, and a management systems network. This emulated training environment is designed to utilize the existing Joint Information Operation Range (JIOR) transport layer to directly support USCYBERCOM's mission. Moreover, it helps establish the Joint Force Cyber Training Range capability and directly supports the training and certification of Cyber Mission Forces. Procurement funding is imperative to increase storage capacity and improve the survivability\/durability of the target environment. Additionally, ongoing hardware modernization efforts coupled with Opposing Forces (OPFOR) software requirements, necessitate CE2T2 procurement funding lines. \n\n2. Joint Interoperability Division (JID): JID is a critical enabler to the training transformation program as sole DoD provider of Tactical Data Link (TDL) and Joint Interface Control Officer (JICO) training and requires procurement funding for one Multifunctional Information Distribution System - Joint Tactical Radio System (MIDS-JTRS \/ MIDS-J). The MIDS-J is a software programmable four-channel Link-16, enhanced throughput, frequency remapping, wideband networking waveform, UHF\/VHF specialized radio. Procurement of this radio will enable the JID to train tactical data link students across the services on current equipment being used in the field to bring real-time situational awareness, location, targeting, and C2 data to smart bombs, dispersed joint forces on foot, or tactical vehicles in the air, land, or maritime environments. The MIDS-J radio system is required to support planning, implementation, and operations of mobile network connectivity to tactical war fighters and disadvantaged platforms such as ground vehicles, helicopters, unmanned aircraft, and small boats. Currently, MIDS-J is onboard the F\/A-18E\/F Super Hornet fighter family, the E-8C JSTARS battlefield surveillance & communication aircraft, and the RC-135 Rivet Joint airplane. Future weapon systems include the EC-130H Compass Call electronic warfare variant of the Hercules turboprop, E-2 Hawkeye and AWACS air\/maritime surveillance airplanes, as well the Navy's aircraft carriers, destroyers, and cruisers. The USAF will eventually field it on F-15E Strike Eagles, its B-1B and B-52H bombers, Special Operations aircraft, ground C2 and Intelligence, Surveillance, Reconnaissance (ISR) units."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}