{
    "id": "2019-DefenseInformationSystemsAgency-PB-0300D-JBOOK-908fafdf4286d3a3e1a87247fd8d2fe42970cc86a5db56400b3977f4ab1e8f62-8",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-DEFENSE_DISA-U_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "96"
        },
        "LineItemTitle": {
            "val": "Joint Regional Security Stacks"
        },
        "P1LineNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DISA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "149.623"
                },
                "CurrentYear": {
                    "val": "188.483"
                },
                "BudgetYearOneBase": {
                    "val": "140.338"
                },
                "BudgetYearOne": {
                    "val": "140.338"
                },
                "BudgetYearTwo": {
                    "val": "61.046"
                },
                "BudgetYearThree": {
                    "val": "62.127"
                },
                "BudgetYearFour": {
                    "val": "63.68"
                },
                "BudgetYearFive": {
                    "val": "65.271"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "149.623"
                },
                "CurrentYear": {
                    "val": "188.483"
                },
                "BudgetYearOneBase": {
                    "val": "140.338"
                },
                "BudgetYearOne": {
                    "val": "140.338"
                },
                "BudgetYearTwo": {
                    "val": "61.046"
                },
                "BudgetYearThree": {
                    "val": "62.127"
                },
                "BudgetYearFour": {
                    "val": "63.68"
                },
                "BudgetYearFive": {
                    "val": "65.271"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "149.623"
                },
                "CurrentYear": {
                    "val": "188.483"
                },
                "BudgetYearOneBase": {
                    "val": "140.338"
                },
                "BudgetYearOne": {
                    "val": "140.338"
                },
                "BudgetYearTwo": {
                    "val": "61.046"
                },
                "BudgetYearThree": {
                    "val": "62.127"
                },
                "BudgetYearFour": {
                    "val": "63.68"
                },
                "BudgetYearFive": {
                    "val": "65.271"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0303228K"
                }
            ]
        },
        "Description": {
            "val": "The Joint Regional Security Stacks (JRSS) are a joint DoD security architecture comprised of complementary defensive security solutions that remove redundant Information Assurance (IA) protections; leverages enterprise defensive capabilities with standardized security suites; protects the enclaves after the separation of server and user assets; and provides the tool sets necessary to monitor and control all security mechanisms throughout DoD's Joint Information Environment."
        },
        "Justification": {
            "val": "FY 2017: ($149.623)  Procured hardware\/software to enhance the DoD Cyber Situational Awareness Analytic Cloud (CSAAC) to incorporate Joint Regional Security Stacks\/Joint Management Systems (JRSS\/JMS) analytics data and correlation capabilities at JRSS locations; tech refresh enhancements to JRSS 1.5 capabilities; and began procurement of JRSS 2.0 capabilities required to meet functionality at the Department of Navy (DoN) Gateways.  Once completed, it enabled the ability to collect, aggregate and review syslog and security event data, and perform automated and manual correlation for both cyber defense and application performance monitoring and troubleshooting and enable DoN to begin migrating behind JRSS.  DISA procured the following capabilities:\n\n• JRSS and JMS 1.5 Tech Refresh - ($76.599) Procured hardware to support technology refresh enhancements to JRSS and JMS 1.5 active stack capabilities.  Tech refresh acceleration of Load Balancer, SSL decryption, and SIM will enable 2.0 capabilities.  DISA will pursue multi-year warranties of refreshed items, which will support 40 major HW\/SW end items & 400+ racks of equipment.\n\n• Web Security Gateway - ($35.846) Supported fine grain content filtering of assembled pages, proxy and native SSL and provides Web Content (Malware\/Policy Based) filtering; Integrated with SSL break and inspect capability; and Provided inline antivirus for web-based file scans.\n\n• Break and Inspect (B&I) (client to server, SSL\/TLS only) -  ($29.706) Ability to break encrypted traffic, open attachments and segment off threat traffic.  Complemented but did not replace DoD DMZ or other CDC\/IPN\/ISN B&I capabilities.  Primary JRSS break and inspect use-case is outbound SSL from DoD users to Internet.      \n\n• Cyber Situational Awareness Analytic Cloud (CSAAC) - ($7.472) Built-out the CSAAC requirements to enhance JRSS\/JMS 1.5 ArcSight and Splunk log analytics and correlation capabilities utilizing existing Data Orchestrator for event aggregation, enrichment and forwarding providing enhanced cyber SA for COCOMS, Services and Agencies.\n\nFY 2018: ($188.483)  Will procure hardware\/software to enhance the DoD Cyber Situational Awareness Analytic Cloud (CSAAC) to incorporate Joint Regional Security Stacks\/Joint Management Systems (JRSS\/JMS) analytics data and correlation capabilities at JRSS locations; upgrade Multiprotocol Label Switching (MPLS) connectivity to support integration with JRSS, and tech refresh\/enhance JRSS\/JMS to provide continued support for JRSS 1.5 capabilities and procure JRSS 2.0 capabilities.  Once complete, will enable ability to collect, aggregate and review syslog and security event data, and perform automated and manual correlation for both cyber defense and application performance monitoring and troubleshooting and enable DoN to migrate behind JRSS.  DISA will procure the following capabilities:\n\n• JRSS 2.0 Capabilities - ($104.703) Will purchase new hardware\/software to deploy JRSS 2.0 Capabilities for Web Content Filtering ($12.000), Endpoint Licenses ($19.300), Inline Intrusion Protections System ($34.863), Break and Inspect ($31.565) capabilities that will be deployed on NIPR and SIPR and the associated engineering support ($6.975).\n\n• JRSS and JMS 1.5 Tech Refresh - ($49.670) Will continue to procure hardware and software to support technology refresh enhancements of end of life enterprise JRSS hubs\/spokes ($11.820), tech refresh of end of life enterprise JRSS 1.5 and JMS 1.5 equipment ($14.500); engineering support ($4.650), license renewals ($5.600), and a new global condensed stack to support the enterprise solution ($13.100).\n\n• Cyber Situational Awareness Analytic Cloud (CSAAC) - ($11.210) Will acquire hardware\/software to support the installation and integration of three NIPR and SIPR Hub Sites to perform Big Data Platform and CSAAC capabilities to enhance JRSS\/JMS 1.5 ArcSight and Splunk log analytics and correlation capabilities, which include aggregation, enrichment, forwarding, and enhanced cyber situational awareness for the COCOMs Services and Agencies.\n\n• Multiprotocol Label Switching (MPLS, formerly part of JRSS and JMS 1.5 Tech Refresh ($9.400)) - ($22.900) Will upgrade existing connections to provide additional bandwidth and streamlined management in order to support integration with JRSS and handle the additional traffic associated with enhanced cyber SA.\n\nExplanation of Change from FY 2017 to FY 2018: The increase of +$38.860 between FY 2017 and FY 2018 is due to the upgrade of additional connections with MPLS routers at an estimated 23 locations (+$13.500) and the upgrade of additional connections with MPLS routers at an estimated 23 locations and acquisition of new hardware\/software to support fielding of new JRSS 2.0 Capabilities (i.e. Break and Inspect - SIPR and Inline IPS) (+$39.749).  This is partially offset by a decrease in the acquisition of analytic hubs (-$4.090) and JRSS\/JMS 1.5 tech refresh enhancements within CONUS (-$10.299).\n\nFY 2019: ($140.338)  Will procure hardware\/software to support JRSS 1.5 and DoD Cyber Situational Awareness Analytic Capabilities tech refresh and enhancements.  Will continue the upgrade of MPLS connectivity to support integration with JRSS.  Once complete, this will enable the ability to collect, aggregate, and review syslog and security event data, perform automated and manual correlation for both cyber defense and application performance monitoring, and troubleshooting to support migrations to JRSS.  DISA will procure the following capabilities:  \n\n• JRSS and JMS Tech Refresh - ($111.438) Will continue to procure hardware and software to support technology refresh enhancements of end-of-life\/end-of-support JRSS hubs\/spokes in order to keep current with evolving threats.   \n\n• Cyber Situational Awareness Analytic Cloud (CSAAC) - ($6.000) Funds procurement, engineering, test, integration, and implementation of analytics supporting JRSS.   Supports the hardware\/software tech refresh\/enhancement of CSAAC capabilities. \n \n• Multiprotocol Label Switching (MPLS) - ($22.900) Will continue to upgrade existing connections to provide additional bandwidth and streamlined management in order to support integration with JRSS and handle the additional traffic associated with enhanced cyber SA.\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nExplanation of Change from FY 2018 to FY 2019: The decrease of -$48.145 between FY 2018 and FY 2019 is due to the completion of the JRSS 2.0 capabilities in FY18 (Break and Inspect and Inline IPS), acquisition of CSAAC hub HW\/SW upgrades and reduced hardware\/software tech refresh requirements for JRSS\/JMS in FY19.       \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\nPerformance Metrics:\n \t\t\n1. Implement JMS CSAAC analytic capability at 6 JRSS locations in FY 2017, 6 additional JRSS locations in FY 2018, and 1 location in FY 2019. \nFY 2017  6 \/ Actual 0 \nFY 2018  6\nFY 2019  1 \n    \t\t\n2. Procure Web Security Gateway capabilities for 75% of the JRSS sites and Break and Inspect capabilities for 67% of the JRSS sites in FY 2017.  Procure 10% of the required Web Security Gateway capabilities for the remaining 25% of the JRSS sites in FY 2018.\nFY 2017  80% JRSS \/ 67% B&I \/ Actual 55% JRSS Web security Gateway \/ 0% B&I \nFY 2018  10% \nFY 2019  67% B&I planned\n\n3. MPLS enabled sites:\nFY17 Estimate:  9 Sites \/ Actual 9\nFY18 Estimate:  23 Sites\nFY19 Estimate:  23 Sites\n\n4. Procure 100% of JRSS 2.0 capabilities (Web Content Filtering, Break and Inspect, and Inline Intrusion Prevention System) by the end of FY18.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFY 2017  N\/A\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFY 2018  100%\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nFY 2019  N\/A"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Joint Regional Security Stacks"
                    },
                    "ItemNumber": [],
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "149.623"
                            },
                            "CurrentYear": {
                                "val": "188.483"
                            },
                            "BudgetYearOneBase": {
                                "val": "140.338"
                            },
                            "BudgetYearOne": {
                                "val": "140.338"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "149.623"
                            },
                            "CurrentYear": {
                                "val": "188.483"
                            },
                            "BudgetYearOneBase": {
                                "val": "140.338"
                            },
                            "BudgetYearOne": {
                                "val": "140.338"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "149.623"
                            },
                            "CurrentYear": {
                                "val": "188.483"
                            },
                            "BudgetYearOneBase": {
                                "val": "140.338"
                            },
                            "BudgetYearOne": {
                                "val": "140.338"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Joint Regional Security Stacks (JRSS)"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "PriorYear": {
                                                            "val": "1"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "149.623"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "188.483"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "140.338"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "140.338"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "PriorYear": {
                                                            "val": "149.623"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "188.483"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "140.338"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "140.338"
                                                        }
                                                    }
                                                },
                                                "ManufacturerList": {
                                                    "Manufacturer": [
                                                        {
                                                            "Name": {
                                                                "val": "TBD"
                                                            },
                                                            "Location": {
                                                                "val": "DITCO SCOTT AFB, IL"
                                                            },
                                                            "HistoryPlanningList": {
                                                                "HistoryPlanning": [
                                                                    {
                                                                        "FiscalYear": {
                                                                            "val": "2018"
                                                                        },
                                                                        "PCOLocation": {
                                                                            "val": "DISA"
                                                                        },
                                                                        "AwardDate": {
                                                                            "val": "2017-12"
                                                                        },
                                                                        "FirstDeliveryDate": {
                                                                            "val": "2018-02"
                                                                        },
                                                                        "Quantity": {
                                                                            "val": "1.000"
                                                                        },
                                                                        "UnitCost": {
                                                                            "val": "188.483"
                                                                        },
                                                                        "SpecsAvailableNow": {
                                                                            "val": "false"
                                                                        },
                                                                        "RFPIssueDate": {
                                                                            "val": "2017-09"
                                                                        },
                                                                        "FundingVehicle": {
                                                                            "val": "MIPR"
                                                                        }
                                                                    },
                                                                    {
                                                                        "FiscalYear": {
                                                                            "val": "2019"
                                                                        },
                                                                        "PCOLocation": {
                                                                            "val": "DISA"
                                                                        },
                                                                        "AwardDate": {
                                                                            "val": "2018-12"
                                                                        },
                                                                        "FirstDeliveryDate": {
                                                                            "val": "2019-02"
                                                                        },
                                                                        "Quantity": {
                                                                            "val": "1.000"
                                                                        },
                                                                        "UnitCost": {
                                                                            "val": "140.338"
                                                                        },
                                                                        "SpecsAvailableNow": {
                                                                            "val": "false"
                                                                        },
                                                                        "RFPIssueDate": {
                                                                            "val": "2018-09"
                                                                        },
                                                                        "FundingVehicle": {
                                                                            "val": "MIPR"
                                                                        }
                                                                    },
                                                                    {
                                                                        "FiscalYear": {
                                                                            "val": "2017"
                                                                        },
                                                                        "PCOLocation": {
                                                                            "val": "DISA"
                                                                        },
                                                                        "AwardDate": {
                                                                            "val": "2016-11"
                                                                        },
                                                                        "FirstDeliveryDate": {
                                                                            "val": "2016-12"
                                                                        },
                                                                        "Quantity": {
                                                                            "val": "1.000"
                                                                        },
                                                                        "UnitCost": {
                                                                            "val": "149.623"
                                                                        },
                                                                        "SpecsAvailableNow": {
                                                                            "val": "true"
                                                                        },
                                                                        "RFPIssueDate": {
                                                                            "val": "2016-08"
                                                                        },
                                                                        "FundingVehicle": {
                                                                            "val": "MIPR"
                                                                        }
                                                                    }
                                                                ]
                                                            }
                                                        }
                                                    ]
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "149.623"
                                            },
                                            "CurrentYear": {
                                                "val": "188.483"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "140.338"
                                            },
                                            "BudgetYearOne": {
                                                "val": "140.338"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "149.623"
                                        },
                                        "CurrentYear": {
                                            "val": "188.483"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "140.338"
                                        },
                                        "BudgetYearOne": {
                                            "val": "140.338"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}