{
    "id": "2019-Navy-PB-1810N-JBOOK-720e0b792f766599243518223dd74dea2e9105f3a59538aca7cb64a1c199f7a1-2",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-NAVY_OTHER_BA4-U_PROCUREMENT_JustificationBook_Navy_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "5253"
        },
        "LineItemTitle": {
            "val": "Tomahawk Support Equipment"
        },
        "P1LineNumber": {
            "val": "100"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Ordnance Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Ship Missile Systems Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "613.053"
                },
                "PriorYear": {
                    "val": "67.062"
                },
                "CurrentYear": {
                    "val": "73.184"
                },
                "BudgetYearOneBase": {
                    "val": "92.89"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "92.89"
                },
                "BudgetYearTwo": {
                    "val": "79.187"
                },
                "BudgetYearThree": {
                    "val": "81.059"
                },
                "BudgetYearFour": {
                    "val": "83.612"
                },
                "BudgetYearFive": {
                    "val": "84.201"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "613.053"
                },
                "PriorYear": {
                    "val": "67.062"
                },
                "CurrentYear": {
                    "val": "73.184"
                },
                "BudgetYearOneBase": {
                    "val": "92.89"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "92.89"
                },
                "BudgetYearTwo": {
                    "val": "79.187"
                },
                "BudgetYearThree": {
                    "val": "81.059"
                },
                "BudgetYearFour": {
                    "val": "83.612"
                },
                "BudgetYearFive": {
                    "val": "84.201"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "613.053"
                },
                "PriorYear": {
                    "val": "67.062"
                },
                "CurrentYear": {
                    "val": "73.184"
                },
                "BudgetYearOneBase": {
                    "val": "92.89"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "92.89"
                },
                "BudgetYearTwo": {
                    "val": "79.187"
                },
                "BudgetYearThree": {
                    "val": "81.059"
                },
                "BudgetYearFour": {
                    "val": "83.612"
                },
                "BudgetYearFive": {
                    "val": "84.201"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.181"
                },
                "CurrentYear": {
                    "val": "0.311"
                },
                "BudgetYearOneBase": {
                    "val": "0.365"
                },
                "BudgetYearOne": {
                    "val": "0.365"
                },
                "BudgetYearTwo": {
                    "val": "0.185"
                },
                "BudgetYearThree": {
                    "val": "0.18"
                },
                "BudgetYearFour": {
                    "val": "0.199"
                },
                "BudgetYearFive": {
                    "val": "0.219"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Theater Mission Planning Center (TMPC) consists of Commercial and Government Off-The-Shelf (COTS\/GOTS) software and COTS hardware. TMPC is the mission planning segment of the Tomahawk Weapon System (TWS) that provides subsystems for the precision targeting, route planning, mission distribution, and strike management of Tomahawk cruise missile missions from sites located ashore and afloat. TMPC optimizes all aspects of the Tomahawk missile mission to successfully engage a target.  TMPC has evolved into 4 scalable configurations deployed at 187 sites: Cruise Missile Support Activities (CMSAs) (3), Tomahawk Strike Mission Planning Cells (TSMPCs) (3), Carrier Strike Groups (CSGs) (19 - 10 CVN), and Firing Units (FRUs) (143 - 85 Surface \/ 58 Subsurface). Additionally, TMPC is installed in Labs (6) and Training Classrooms (13) that contain various combinations of the four configurations.\n\nContinuous TMPC software updates decreases mission planning time and increases the quality and accuracy of each mission while reducing complexity. TMPC provides mission planning at the theater and operational levels and is designed for high rate mission planning production responsive to national strategic, operational, and tactical requirements. TMPC produces and distributes missions; provides command information services; provides strike planning, execution, coordination, control and reporting, and provides Maritime Component Commanders (MCC) the capability to plan or modify conventional TWS missions.  TMPC supports major joint combat operations and Overseas Contingency Operations. TMPC was previously referred to as Tomahawk Command and Control System (TC2S).\n\nFunds provide for systems engineering, testing, Independent Verification & Validation (IV&V), security accreditation, installation, site acceptance testing, user familiarization of products, and hardware. Also, this funding line provides for COTS refreshment, engineering changes, software upgrades, cyber-security modernization, and associated Nuclear Powered General Purpose Attack Submarine\/Guided Missile Destroyer\/Guided Missile Cruiser\/Nuclear Aircraft Carrier (SSNs\/DDGs\/CGs\/CVN) logistics and infrastructure to maintain compatibility and interoperability with existing and future TMPC system configurations.\n\nSurface and Submarine Tactical Tomahawk Weapon Control System (TTWCS) is a post milestone III program executing its first major tech refresh since its 2004 IOC. This refresh resolves processor, display console, equipment rack and software obsolescence issues. The updated TTWCS version was released in FY 2017, but hardware and software must be procured and delivered throughout the next several years to promulgate it across the entire fleet (140 firing units). Advanced TTWCS functions include: tasking validation (missile mission matching), planning of over the water routes, initialization, preparation and launch of BLK III\/IV missiles, TTWCS reduced response time and increased operational flexibility through addition of Launch Platform Mission Planning (LPMP), C4I Web services interfaces, and in-flight monitoring and control of Blk IV missiles. In addition, funds provided to continue TTWCS viability in TTWCS v5.6 and ensure compliance with cyber security mandates, continue to address hardware obsolescence through periodic COTS hardware refresh and periodically refresh of GOTS software to address obsolescence, support migration from 32 bit to 64 bit architecture and migrate away from legacy Ada code. Finally, it will allow reduction of system complexity and incorporation of critical software fixes.  Program options are being identified that will enable TWS integration into future platforms.  Included in those options will be changes necessary for TTWCS to ensure required functionality as the missile is modernized beginning in FY 2019."
        },
        "Justification": {
            "val": "FY 2019 funding is required to continue fielding version TTWCS 5.4.0 and begin fielding of TTWCS hardware\/software obsolescence updates (v5.4.0.2).  Funds also provide for integration, modernization and interoperability efforts necessary to keep pace with changes, retain capability and exploit capabilities of internal (TWS All-Up-Round missile and TTWCS) and external (Modernized Integrated Data Base (MIDB)), National Geospatial Intelligence Agency (NGA) products, Distributed Common Ground Systems (DCGS) Integrated Backbone (DIB) compliance, Future Imagery Architecture (FIA) imagery formats and Intelligence Surveillance & Reconnaissance (ISR) interfaces, Network Centric Enterprise Services (NCES), Global Information Grid\/Internet Protocol (GIG\/IP) (V)6, FORCEnet compliance systems\/interfaces to the effectiveness of the TWS, into TMPC deployed configurations.  Funding supporting TTWCS is appropriately phased to complete the 1st major tech refresh since IOC in 2004.  TTWCS relies on COTS hardware that requires a constant and predictive upgrade path to meet cyber security mandates, ensure continued vendor supportability, avoid costly retrofits of fielded systems, and ensure interoperability between tightly coupled COTS software applications, operating systems, and hardware processing nodes.  Consequently, increased product improvement resources are required to comply with commercial hardware\/software supportability mandates, obsolescence, and information assurance requirements to maintain pace with modern computing architectures.\n\nFY 2019 funding is required to continue the upgrade of unsupportable and obsolete TMPC hardware and software, to ensure compliance with DoD cyber-security mandates, to continue fielding of TMPC 5.0.2 to 187 sites, and to continue navigation and communications improvements required to support the TWS Modernization program via TMPC 6.0.  FY 2019 increase supports TMPC 5.0.2 installation of both hardware and software required for upgrading the Microsoft Operating System from Windows 7 to Windows 10 to ensure continued uninterrupted Tomahawk Weapon System capability beyond Windows 7 end of life in 2020. Also, FY 2019 increase funds anti-tamper capability for the Tomahawk Planning System component of TMPC to protect Critical Program Information. Procurement of unique hardware will be executed in FY 2019 and FY 2020 using a qualified manufacturer. Integration is planned for the period FY 2019 - FY 2021. This anti-tamper capability will permit implementation of advanced capabilities of the Tomahawk Modernization program with needed anti-tamper safeguards.\n\nThe FY 2019 funding request was reduced by $0.725 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government."
        },
        "MDAPCode": {
            "val": "289"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "525300, TOMAHAWK Support Equipment"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "613.053"
                            },
                            "PriorYear": {
                                "val": "67.062"
                            },
                            "CurrentYear": {
                                "val": "73.184"
                            },
                            "BudgetYearOneBase": {
                                "val": "92.89"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "92.89"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "613.053"
                            },
                            "PriorYear": {
                                "val": "67.062"
                            },
                            "CurrentYear": {
                                "val": "73.184"
                            },
                            "BudgetYearOneBase": {
                                "val": "92.89"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "92.89"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "613.053"
                            },
                            "PriorYear": {
                                "val": "67.062"
                            },
                            "CurrentYear": {
                                "val": "73.184"
                            },
                            "BudgetYearOneBase": {
                                "val": "92.89"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "92.89"
                            }
                        },
                        "InitialSpares": {
                            "PriorYear": {
                                "val": "0.181"
                            },
                            "CurrentYear": {
                                "val": "0.311"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.365"
                            },
                            "BudgetYearOne": {
                                "val": "0.365"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "TTWCS"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "TTWCS Hardware funds are required to address hardware obsolescence through periodic COTS hardware refresh.",
                                                    "val": "1.1.1) Tactical Tomahawk Weapon Control System (TTWCS) Hardware"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "14.411"
                                                        },
                                                        "PriorYear": {
                                                            "val": "1.519"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.549"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.56"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.56"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "14.411"
                                            },
                                            "PriorYear": {
                                                "val": "1.519"
                                            },
                                            "CurrentYear": {
                                                "val": "1.549"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.56"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.56"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "14.411"
                                        },
                                        "PriorYear": {
                                            "val": "1.519"
                                        },
                                        "CurrentYear": {
                                            "val": "1.549"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.56"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.56"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "HARDWARE RECURRING SUPPORT - TTWCS"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "TTWCS relies on COTS hardware that require constant and predictive upgrade path to meet cyber security mandates, ensure continued vendor supportability, avoid costly retrofits of fielded systems, and ensure interoperability between tightly coupled COTS software applications, operating systems, and hardware processing nodes.  Consequently, increased product improvement resources are required commencing in FY 2017 and continuing through FY 2019 to comply with evolving security compliance requirements that necessitate a more frequent update cycle to combat obsolescence and adhere to commercial hardware\/software supportability mandates to maintain pace with modern computing architectures.",
                                                    "val": "2.1.1) TTWCS Product Improvement"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "134.42"
                                                        },
                                                        "PriorYear": {
                                                            "val": "14.352"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "18.469"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "19.891"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "19.891"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "134.42"
                                            },
                                            "PriorYear": {
                                                "val": "14.352"
                                            },
                                            "CurrentYear": {
                                                "val": "18.469"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "19.891"
                                            },
                                            "BudgetYearOne": {
                                                "val": "19.891"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "134.42"
                                        },
                                        "PriorYear": {
                                            "val": "14.352"
                                        },
                                        "CurrentYear": {
                                            "val": "18.469"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.891"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.891"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "TMPC"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "Procures hardware and software for installations of system upgrades at all U.S.TMPC sites. This also includes hardware and software for the system developers. FY 2019 procures the hardware and software for the installation of TMPC 5.0.2 onboard Firing Units Guided Missile Destroyers, Guided Missile Cruisers and Nuclear Powered General Purpose Attack Submarines (DDGs\/CGs\/SSNs), Command Staffs, laboratories, and training sites. Also, the FY 2019 increase funds anti-tamper capability for the Tomahawk Planning System (TPS) component of TMPC to protect Critical Program Information by procuring unique Anti-Tamper hardware using a qualified manufacturer. This anti-tamper capability will permit implementation of advanced capabilities of Tomahawk Modernization program with needed anti-tamper safeguards.",
                                                    "val": "3.1.1) Tomahawk Mission Planning Center (TMPC) Hardware"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "21.766"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.969"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "3.128"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "17.268"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "17.268"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "21.766"
                                            },
                                            "PriorYear": {
                                                "val": "2.969"
                                            },
                                            "CurrentYear": {
                                                "val": "3.128"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "17.268"
                                            },
                                            "BudgetYearOne": {
                                                "val": "17.268"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "21.766"
                                        },
                                        "PriorYear": {
                                            "val": "2.969"
                                        },
                                        "CurrentYear": {
                                            "val": "3.128"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.268"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.268"
                                        }
                                    }
                                }
                            }
                        ],
                        "Software": {
                            "Name": {
                                "val": "PRODUCT IMPROVEMENTS - TMPC"
                            },
                            "Recurring": {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "@footnote": "Provides for software engineering efforts associated with the delivery of system modernization and improvements by the prime developers to continue the upgrade of unsupportable and obsolete TMPC hardware and software and to ensure compliance with DoD cyber security mandates. In FY 2019, this line also continues the upgrades to the TMPC Enterprise Network (TEN 2.0) to improve the distribution of electronic software distribution \/ propagation, enable remote assistance\/troubleshooting, provide enhanced configuration management visibility, and provide cost effective means to deploy cyber-security patches and settings expeditiously. FY 2019 also funds software system upgrades for the submarine community to address system interfaces and upgrades to support the TMPC system usability improvements necessary for fleet operators to effectively execute large and complex TLAM operations as required by US Fleet Forces Command (USFFC). FY 2019 increase supports TMPC imagery format updates for TMPC 7.0 and 8.0.",
                                                "val": "4.1.1) TMPC Product Improvements"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "143.666"
                                                    },
                                                    "PriorYear": {
                                                        "val": "17.51"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "17.867"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "20.123"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "20.123"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "143.666"
                                        },
                                        "PriorYear": {
                                            "val": "17.51"
                                        },
                                        "CurrentYear": {
                                            "val": "17.867"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.123"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.123"
                                        }
                                    }
                                }
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "AllPriorYears": {
                                        "val": "143.666"
                                    },
                                    "PriorYear": {
                                        "val": "17.51"
                                    },
                                    "CurrentYear": {
                                        "val": "17.867"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "20.123"
                                    },
                                    "BudgetYearOne": {
                                        "val": "20.123"
                                    }
                                }
                            }
                        },
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "@footnote": "Decrease in production engineering from FY 2018 to FY 2019 is associated with the cost of fabrication of ship sets supporting TTWCS v5.4.0.2 upgrades.",
                                                "val": "5.1) TTWCS Production Engineering"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "23.141"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.038"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.059"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.976"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.976"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "TTWCS Integrated Logistics Support required for Surface\/Submarine installations onboard firing units.",
                                                "val": "5.2) TTWCS Integrated Logistic Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "98.791"
                                                    },
                                                    "PriorYear": {
                                                        "val": "10.86"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "11.081"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "10.96"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "10.96"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "121.932"
                                        },
                                        "PriorYear": {
                                            "val": "11.898"
                                        },
                                        "CurrentYear": {
                                            "val": "12.14"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.936"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.936"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Support - TTWCS"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "@footnote": "Provides systems engineering support for system design and definition of requirements necessary to evaluate all functional aspects of the TMPC subsystems and workflows that directly impact strike & execution and mission planning products. It includes reviewing TWS and external interfaces for impacts resulting from design upgrades\/changes within TWS and by external organizations, Independent Verification & Validation (IV&V), and security accreditation activities.",
                                                "val": "6.1) TMPC Production Engineering"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "36.645"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.392"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.353"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.44"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.44"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funds activities that directly support system upgrades requirements such as user events, requirements validation, systems engineering technical reviews, software formal qualification testing, and delta training documentation.",
                                                "val": "6.2) TMPC Production Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "34.374"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.164"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.126"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.218"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.218"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Funds installation support associated with the deployment of new TMPC system upgrades to all U.S. TMPC sites. FY 2019 funds the installation of TMPC 5.0.2 onboard Firing Units Guided Missile Destroyer, Guided Missile Cruiser and Nuclear Attack Submarine (DDGs\/CGs\/SSNs), Command Staffs, laboratories, and training classrooms.  The increase in FY 2019 funding supports TMPC 5.0.2 installation of both hardware and software required for upgrading the Microsoft Operating System from Windows 7 to Windows 10 to ensure continued uninterrupted Tomahawk Weapon System capability beyond Windows 7 end of life in 2020. Integration of the Anti-Tamper capability is planned for the period FY 2019 - FY 2021. This anti-tamper capability will permit implementation of advanced capabilities of Tomahawk Modernization program with needed anti-tamper safeguards.",
                                                "val": "6.3) TMPC Integrated Logistic Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "81.811"
                                                    },
                                                    "PriorYear": {
                                                        "val": "10.258"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "11.552"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "13.454"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "13.454"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "152.83"
                                        },
                                        "PriorYear": {
                                            "val": "18.814"
                                        },
                                        "CurrentYear": {
                                            "val": "20.031"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.112"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.112"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "TMPC"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "7.1) FMP Installations"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "15.139"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "15.139"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "ILS INSTALLATIONS"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "8.1) TTWCS Other Cost"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "8.889"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "8.889"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Miscellaneous"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}