{
    "id": "2019-AirForce-PB-3080F-MJBOOK-0-0-50c065cb676b2126b08f45ed29b7153ffac5ac42bfb6fc871eb3047d88091b60-36",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-AIRFORCE_OTHER-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "834530"
        },
        "LineItemTitle": {
            "val": "Air & Space Operations Center (AOC)"
        },
        "P1LineNumber": {
            "val": "38"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "15.325"
                },
                "CurrentYear": {
                    "val": "25.533"
                },
                "BudgetYearOneBase": {
                    "val": "40.066"
                },
                "BudgetYearOne": {
                    "val": "40.066"
                },
                "BudgetYearTwo": {
                    "val": "40.583"
                },
                "BudgetYearThree": {
                    "val": "5.19"
                },
                "BudgetYearFour": {
                    "val": "5.228"
                },
                "BudgetYearFive": {
                    "val": "5.247"
                },
                "Total": {
                    "val": "137.172"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "15.325"
                },
                "CurrentYear": {
                    "val": "25.533"
                },
                "BudgetYearOneBase": {
                    "val": "40.066"
                },
                "BudgetYearOne": {
                    "val": "40.066"
                },
                "BudgetYearTwo": {
                    "val": "40.583"
                },
                "BudgetYearThree": {
                    "val": "5.19"
                },
                "BudgetYearFour": {
                    "val": "5.228"
                },
                "BudgetYearFive": {
                    "val": "5.247"
                },
                "Total": {
                    "val": "137.172"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "15.325"
                },
                "CurrentYear": {
                    "val": "25.533"
                },
                "BudgetYearOneBase": {
                    "val": "40.066"
                },
                "BudgetYearOne": {
                    "val": "40.066"
                },
                "BudgetYearTwo": {
                    "val": "40.583"
                },
                "BudgetYearThree": {
                    "val": "5.19"
                },
                "BudgetYearFour": {
                    "val": "5.228"
                },
                "BudgetYearFive": {
                    "val": "5.247"
                },
                "Total": {
                    "val": "137.172"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Air Operations Center Weapon System (AOC WS), AN\/USQ-163 Falconer, the senior element of the Theater Air Control System, is the weapon system that the Commander, Air Force Forces (COMAFFOR) provides the Combined\/Joint Force Air Component Commander (C\/JFACC) for monitoring, planning, executing and assessing theater-wide air and space operations in support of the air battle campaign to meet the Combined\/Joint Force Commander's (C\/JFC) objectives.  \n\nThe AOC WS contains over 40 Command and Control (C2) systems\/applications (3rd Party Commercial Off the Shelf (COTS)\/Government Off the Shelf (GOTS)) that are continually being updated under semi-annual\/annual\/bi-annual efforts (i.e., Baseline Releases [BR]). The AOC WS 10.1 integrates these changes as well as provides periodic Capital Equipment Replacement (CER) to keep the AOC WS interoperable, supportable, and compliant (e.g., certification and accreditation). Fielding will provide Joint C2 interoperability, and respond to the highest priority Combatant Command (CCMD) interoperability problems including: (a) incorporating fixes to shortfalls in interactions with CCMD targeting support systems, (b) enhancing the effectiveness of the operational picture to respond to the proliferation of sensors, and (c) handling data interface changes being experienced with older 3rd Party program deliveries. Major subsystems have enhanced their security profile and this fielding will serve as a re-accreditation of the overall AOC WS baseline.  Primary efforts in fielding include CER and baseline updates via variously sized BRs. BRs are regularly scheduled 3rd Party COTS\/GOTS application updates. They are normally comprised of hardware\/software changes\/updates\/modernized improvements\/modifications and security patches. Each BR is based on warfighter-validated needs that require updates to the AOC WS 10.1. The AOC program's agile modification of the baseline 10.1 brought forward a hybrid cloud environment employment including on premise installation.  In FY 2019, the purchase of hardware supporting the hybrid cloud environment was realigned from FY 2018 OPAF to FY 2019 RDT&E. \n\nThe AOC WS funding provides system hardware, software, technical documents, CER (e.g., replacing end-of-life\/end of support Direct Mission Support (DMS) and 3rd Party components), core radio and initial training to standardize and sustain the AOC WS. This includes the integration, test and fielding of cyber security improvements and existing 3rd Party modernized improvements\/modifications (e.g., replace paper copy with electronic requests). The fielding and CER consist of AOCs and their associated support sites (e.g., Help Desk, Formal Training Unit (FTU), experimental sites, and Air Reserve Component sites). In FY 2019, funding increased to support moving the AOC baseline toward a cloud-based commercially managed Infrastructure and Platform as a Service (IaaS\/PaaS) hosting platform\/environment.\n\nThere are three distinct categories of AOCs: Geographic, Global (formally known as Functional), and assorted AOC Support Functions (Help Desk, Field Training Unit (FTU), Operational Support Facility (OSF) and Air Reserve Component sites). While all sites start with the standardized 10.1 baseline, each is specifically tailored to the needs of the associated Geographic CCMD or Global (formally known as Functional) Command. Thus, as no two AOCs are alike, when a CER or BR is accomplished, each site is unique and requires its own specifically designed site-engineered fielding plan and associated hardware, which drives differences in site specific (i.e., unit) costs.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\n\nFunding for this exhibit contained in PE 0207410F."
        },
        "Justification": {
            "val": "1. FIELDING: Primary efforts include integration and fielding of improvements\/upgrades of existing 3rd Party applications as well as newly developed replacement applications, CER (replacing end-of-life\/end of support components) and baseline updates via variously sized BRs.\n\n   a. CAPITAL EQUIPMENT REPLACEMENT (CER): FY19 funds will be used to support moving the AOC baseline toward a cloud-based commercially managed Infrastructure and Platform as a Service (IaaS\/PaaS) hosting platform\/environment and address numerous commercial end-of-life and DMS components including components associated with C2 applications (3rd Party COTS\/GOTS) that must be resolved. \n\n   b. BASELINE RELEASES (BR): FY19 will fund BRs, periodic maintenance upgrades, emergency fixes, cyber security improvements and other activities (e.g., testing activities). \n\n   c. FIELDING SYSTEM PROGRAM OFFICE (SPO) SUPPORT: FY19 funds will be used to provide government oversight, technical expertise, and program office support associated with the fielding of AOC. \n\n   d. TEST SUPPORT (46 Test Squadron [46TS]): FY19 funds will be used to provide government oversight and technical expertise associated with the testing of AOC."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Air & Space Operations Center (AOC)"
                    },
                    "IdCode": {
                        "val": "A"
                    },
                    "Remarks": {
                        "val": "1). Due to different levels of complexity, differences in equipment to be updated, and length of required time necessary for modification, the total cost will fluctuate between fiscal years.\n\n2). Differences in site specific setup (due to variations between mission specific needs and differences in site type i.e., Geographic vs. Global (formally known as Functional) vs. Associated Support Site vs. Air Reserve Component Sites) will drive differences in site specific requirements (e.g., time required, hardware required and software required). This makes quantification impossible, as there is no single baseline to produce a quantity against. Per DoD Financial Regulation 7000.14-R, Volume 2B, Chapter 4, Exhibit P-5 Instruction, the quantities in the P-5 are left blank as there is no way to report applicable quantities."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "15.325"
                            },
                            "CurrentYear": {
                                "val": "25.533"
                            },
                            "BudgetYearOneBase": {
                                "val": "40.066"
                            },
                            "BudgetYearOne": {
                                "val": "40.066"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "15.325"
                            },
                            "CurrentYear": {
                                "val": "25.533"
                            },
                            "BudgetYearOneBase": {
                                "val": "40.066"
                            },
                            "BudgetYearOne": {
                                "val": "40.066"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "15.325"
                            },
                            "CurrentYear": {
                                "val": "25.533"
                            },
                            "BudgetYearOneBase": {
                                "val": "40.066"
                            },
                            "BudgetYearOne": {
                                "val": "40.066"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "Hardware End Item"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "1.a.2. CAPITAL EQUIPMENT REPLACEMENT: AOC SUPPORT SITES - AD"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.591"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.a.3. CAPITAL EQUIPMENT REPLACEMENT: AOC EXPERIMENTAL SITES - AD"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "2.055"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2.112"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.136"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.136"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.b.1. BASELINE RELEASE: AOC SITES - AD"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "3.807"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "5.316"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "13.732"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "13.732"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.b.2. BASELINE RELEASE: SUPPORT SITES - AD"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.935"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "7.307"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.9"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.9"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.c. FIELDING SPO SUPPORT"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "3.428"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "5.505"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "15.268"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "15.268"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.d. TEST SUPPORT (46TS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.595"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2.4"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.565"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.565"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "11.411"
                                            },
                                            "CurrentYear": {
                                                "val": "22.64"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "36.601"
                                            },
                                            "BudgetYearOne": {
                                                "val": "36.601"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "11.411"
                                        },
                                        "CurrentYear": {
                                            "val": "22.64"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "36.601"
                                        },
                                        "BudgetYearOne": {
                                            "val": "36.601"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "2.a. PROGRAM MANAGEMENT ADMINISTRATION: PROGRAM SUPPORT"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "3.914"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.893"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.465"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.465"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "3.914"
                                        },
                                        "CurrentYear": {
                                            "val": "2.893"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.465"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.465"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Support End Item"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}