{
    "id": "2019-DefenseThreatReductionAgency-PB-0300D-JBOOK-d224f4ec8e4969f09511835d4b12aeeb02e97b78006d667479d83d216577aa38-0",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-DEFENSE_JIDF-U_PROCUREMENT_JustificationBook_Defense_Threat_Reduction_Agency_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Threat_Reduction_Agency_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "JIED01"
        },
        "LineItemTitle": {
            "val": "Rapid Acquisition and Threat Response"
        },
        "P1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationNumber": {
            "val": "2093D"
        },
        "AppropriationTitle": {
            "val": "Joint Improvised-Threat Defeat Fund"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Rapid Acquisition and Threat Response"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Rapid Acquisition and Threat Response - Defense Threat Reduction Agency"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "339.472"
                },
                "CurrentYear": {
                    "val": "497.5"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "339.472"
                },
                "CurrentYear": {
                    "val": "497.5"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "339.472"
                },
                "CurrentYear": {
                    "val": "497.5"
                }
            }
        },
        "Description": {
            "val": "The Joint Improvised-Threat Defeat Fund (JIDF) is available for obligation for three years. While these resources are documented in exhibit formats that are customary for Procurement appropriations, Congress approved these funds for development, procurement, and fielding of measures to defeat improvised threats to U.S. Joint Forces (such as, but not limited to, the development of defeat technologies for advanced wireless signals, compatible electronic countermeasures for improvised explosive devices (IED) defeat\/neutralization, miniaturized and integrated sensors, hand held detectors, and fielding of cutting edge Information Technology capabilities). These resources support the Department of Defense's (DoD) goal to close the gap between the enemy's innovation cycles and the operational capabilities of the U.S. Joint Forces.\n\nThe Joint Improvised-Threat Defeat mission under the authority, direction, and control of the Defense Threat Reduction Agency (DTRA) enables DoD actions to counter improvised threats, including improvised explosive devices. DTRA provides tactical responsiveness to near and mid-term threats (0-2 years) and supports the Combatant Commands' efforts to prepare for and adapt to battlefield surprise in support of counter-terrorism (CT), counter-insurgency (COIN), and other related mission areas, including counter-improvised explosive devices (C-IED)."
        },
        "Justification": {
            "val": "Historical Context:\n\nPrior to FY 2017, funds were enacted as the Joint Improvised Explosive Device Defeat Fund (JIEDDF) and were executed through the Army.\n\nJIEDDF \/ JIDF\n\nFY 2017     FY 2018     FY 2019\n$427.272   $497.500    $0.000\n\nThe FY 2017 actual shown above does not include $62.8M requested, but transferred to Operation & Maintenance, Defense-Wide (O&M, DW) under DTRA as per the Consolidated Appropriations Act, 2017 (P.L. 115-31). The FY 2017 actual shown above does include $87.8M in the Army's JIEDDF (2093A) per the Further Continuing and Security Assistance Appropriations Act, 2018 (P.L. 114-254).\n\nIn accordance with congressional intent to terminate the Joint Improvised-Threat Defeat Fund (JIDF) in section 9015 of the Chairman's recommendation to the Senate Appropriations Committee for the Department of Defense Appropriations Bill, 2018, all appropriations requested for the JIDO will be transitioned to Defense-wide appropriation accounts:  Operation and Maintenance (O&M), Research, Development, Test and Evaluation (RDT&E), and Procurement.\n\nO&M:  BA: 04 PE 0203011BR \/ Joint Improvised Explosive Device Defeat Organization and BA: 04 PE 0302199BR \/ Joint Improvised Explosive Device Defeat Organization.\nRDT&E: BA03 PE 0603134BR \/ Counter Improvised-Threat Simulation and BA04 PE 0604134BR \/ Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing.\nProcurement: Line Item 40 \/ Counter IED and Improvised Threat Technologies."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}