{
    "id": "2019-Army-PB-2035A-JBOOK-35554271f0a91fa230708ec88be83fdfc05656e3b3ff8a2ef16bf19acde9d154-58",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-ARMY_OTHER_3-4-U_PROCUREMENT_JustificationBook_Army_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "0312MB7000"
        },
        "LineItemTitle": {
            "val": "Base Level Common Equipment"
        },
        "P1LineNumber": {
            "val": "179"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "90"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "546.976"
                },
                "PriorYear": {
                    "val": "2.168"
                },
                "CurrentYear": {
                    "val": "13.239"
                },
                "BudgetYearOneBase": {
                    "val": "6.633"
                },
                "BudgetYearOneOCO": {
                    "val": "2.08"
                },
                "BudgetYearOne": {
                    "val": "8.713"
                },
                "BudgetYearTwo": {
                    "val": "14.34"
                },
                "BudgetYearThree": {
                    "val": "14.428"
                },
                "BudgetYearFour": {
                    "val": "14.522"
                },
                "BudgetYearFive": {
                    "val": "14.813"
                },
                "Total": {
                    "val": "629.199"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "546.976"
                },
                "PriorYear": {
                    "val": "2.168"
                },
                "CurrentYear": {
                    "val": "13.239"
                },
                "BudgetYearOneBase": {
                    "val": "6.633"
                },
                "BudgetYearOneOCO": {
                    "val": "2.08"
                },
                "BudgetYearOne": {
                    "val": "8.713"
                },
                "BudgetYearTwo": {
                    "val": "14.34"
                },
                "BudgetYearThree": {
                    "val": "14.428"
                },
                "BudgetYearFour": {
                    "val": "14.522"
                },
                "BudgetYearFive": {
                    "val": "14.813"
                },
                "Total": {
                    "val": "629.199"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "546.976"
                },
                "PriorYear": {
                    "val": "2.168"
                },
                "CurrentYear": {
                    "val": "13.239"
                },
                "BudgetYearOneBase": {
                    "val": "6.633"
                },
                "BudgetYearOneOCO": {
                    "val": "2.08"
                },
                "BudgetYearOne": {
                    "val": "8.713"
                },
                "BudgetYearTwo": {
                    "val": "14.34"
                },
                "BudgetYearThree": {
                    "val": "14.428"
                },
                "BudgetYearFour": {
                    "val": "14.522"
                },
                "BudgetYearFive": {
                    "val": "14.813"
                },
                "Total": {
                    "val": "629.199"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "2.168"
                                },
                                "CurrentYear": {
                                    "val": "13.239"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.633"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "2.08"
                                },
                                "BudgetYearOne": {
                                    "val": "8.713"
                                },
                                "BudgetYearTwo": {
                                    "val": "14.34"
                                },
                                "BudgetYearThree": {
                                    "val": "14.428"
                                },
                                "BudgetYearFour": {
                                    "val": "14.522"
                                },
                                "BudgetYearFive": {
                                    "val": "14.813"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "2.168"
                    },
                    "CurrentYear": {
                        "val": "13.239"
                    },
                    "BudgetYearOneBase": {
                        "val": "6.633"
                    },
                    "BudgetYearOneOCO": {
                        "val": "2.08"
                    },
                    "BudgetYearOne": {
                        "val": "8.713"
                    },
                    "BudgetYearTwo": {
                        "val": "14.34"
                    },
                    "BudgetYearThree": {
                        "val": "14.428"
                    },
                    "BudgetYearFour": {
                        "val": "14.522"
                    },
                    "BudgetYearFive": {
                        "val": "14.813"
                    }
                }
            }
        },
        "Description": {
            "val": "This program procures Base-level commercially available equipment from a list authorized by the Table of Distribution and Allowances (TDA) for Army activities but is not Army centrally managed or purchased. Equipment unit cost must meet the currently approved Expense-Investment threshold of $250,000.00. The equipment supports recurring and generic activities typically performed by garrisons, such as material and cargo handling, engineering and public works, port and terminal operations support. Procures new investment items or replacements for existing equipment that is over-aged, obsolete, or beyond economical repair.\n\nInstallation Management Commands existing BCE fleet is fifteen to forty years old and exceeds overall programmed life expectancy and Army set Maintenance Expenditure Limits (MEL). Equipment is becoming more difficult to repair after years of continual heavy use and repair parts are limited or not available due to discontinuation by the manufacture causing longer and more frequent down times. Continued maintenance is increasingly cost prohibitive and competes with other critical Base Operations Services for resources. When new procurement is not possible, garrisons turn to leasing equipment at an extremely high cost, over 45% more expensive over the life of the vehicle, to meet mission requirements.  If resources do not keep pace with IMCOM's aging fleet, safety risks rise, equipment readiness suffers, and mission support will be compromised as equipment continues to fail.  \n\nFunds are required for CID to purchase life cycle replacement for Scanning Electron Microscope -w\/Energy Dispersive X-ray Spectrometer w\/Wavelength Dispersive Spectrometer (SEM-EDS\/WDS).  The requirement is part of the US Army Criminal Investigation Laboratory continuing effort to modernize and advance its forensic capability.  This instrument allows for the investigation of elemental and crystalline structure compounds.  By using x-rays, the instrument is able to develop patterns of the x-ray bending properties of compounds, better known as \"diffraction patterns\". This instrument combines the areas of high magnification microscopy with the ability to conduct analysis of detectable energies in the form of x-rays."
        },
        "Justification": {
            "val": "FY 2019 funding in the amount of $6.633 million (Base) procures the following:\n\nIn FY 2019, Installation Management Command (IMCOM) will use $6.104 million to procure 23 essential equipment items.  This includes Bulldozers (2), Road Graders (3), Front End Loaders (8), Tractors (2), Cranes (2), Street Sweepers (3), Excavators (1), Water Tanker (1), and Fork Lift (1).  These items will be used to meet the immediate\/daily needs of 10 Installations. Funding for FY18 acknowledges need to reconstitute aging fleet.\n\nIn FY 2019, Criminal Investigative Command (CIDC) will use The FY19 (Base) procurement funding in the amount of $.529 million procures the following:\nScanning Electron Microscope -w\/Energy Dispersive X-ray Spectrometer\/ Wavelength Dispersive Spectrometer (SEM-EDS\/WDS) and the X-Ray Diffractometer (XRD):  Both instruments are the most advanced pieces of forensic equipment in the laboratory as well as being one of the most sensitive instruments for elemental analysis of materials.  The majority of examinations are geared to the analysis of crystalline materials.  It serves multiple functions in scientific investigations of materials associated with sexual assaults, assaults, homicides, suicides, arsons, burglaries, shooting investigations, IED investigations, etc.  In conjunction with the elemental analysis using SEM\/EDS\/WDS, the XRD is able to conclusively identify the manner in which elements in a compounds are associated (bonded).  An XRD analyzer obtains interference patterns reflecting lattice structures by varying the angle of incidence of the X-Ray beam. Thus, the precision, speed of rotation, and beam size of the x-rays become important parameters by which to judge materials.\nThe impact to the laboratory of not completing these life cycle replacement would be to significantly limit the laboratory's ability to conduct investigations requiring the analysis of explosive analysis, soil analysis, and most significantly the identification of molecular structure of crystalline materials.  The requirement must be obtained in order to meet electrical, mechanical and other installation requirements.  If not funded, the completion, occupation, relocation, and ability to complete mission functions will be adversely effected. If the current microscope is not replaced, the aging instrument could fail or result in evidence pertaining to homicides and sexual assault cases not being analyzed in a timely manner due to outdated software and incompatibility with Army networks.\n--------------------\nIn FY 2019, CIDC will use $2.080 million (OCO) procurement funding:\n\nOPA funding will allow the Defense Forensic Science Center (DFSC) to procure 8 2-sided expandable shelters to replace the first generation shelters that are not sanctioned by the Joint Committee on Tactical Shelters (JOCOTAS).  The  ESPs are part of modular, scalable, and customizable force packages for forward forensic exploitation that will be used to establish labs in support of global Geographic Combatant Commands (GCCs) with no organic exploitation capability."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}