{
    "id": "2019-Army-PB-2035A-JBOOK-1dc0c0b8d83e6cb110fcbdda44f3ea773b4315214f31d33eeee737793ec0f49c-0",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-ARMY_OTHER_2-U_PROCUREMENT_JustificationBook_Army_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "1975BW7100"
        },
        "LineItemTitle": {
            "val": "WIN-T - Ground Forces Tactical Network"
        },
        "P1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "12"
        },
        "BudgetSubActivityTitle": {
            "val": "Comm - Joint Communications"
        },
        "ResourceSummary": {
            "Quantity": {
                "AllPriorYears": {
                    "val": "2407"
                },
                "PriorYear": {
                    "val": "683"
                },
                "CurrentYear": {
                    "val": "877"
                },
                "Total": {
                    "val": "3967"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "4847.236"
                },
                "PriorYear": {
                    "val": "551.17"
                },
                "CurrentYear": {
                    "val": "420.492"
                },
                "Total": {
                    "val": "5818.898"
                }
            },
            "UnitCost": {
                "AllPriorYears": {
                    "val": "2013.808"
                },
                "PriorYear": {
                    "val": "806.984"
                },
                "CurrentYear": {
                    "val": "479.466"
                },
                "Total": {
                    "val": "1466.826"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "4847.236"
                },
                "PriorYear": {
                    "val": "551.17"
                },
                "CurrentYear": {
                    "val": "420.492"
                },
                "Total": {
                    "val": "5818.898"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "4847.236"
                },
                "PriorYear": {
                    "val": "551.17"
                },
                "CurrentYear": {
                    "val": "420.492"
                },
                "Total": {
                    "val": "5818.898"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0603782A"
                },
                {
                    "val": "0605350A"
                },
                {
                    "val": "0300349A"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "553"
                                },
                                "CurrentYear": {
                                    "val": "659"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "541.89"
                                },
                                "CurrentYear": {
                                    "val": "312.25"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army National Guard"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "119"
                                },
                                "CurrentYear": {
                                    "val": "218"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "5.8"
                                },
                                "CurrentYear": {
                                    "val": "108.242"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army Reserve"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "11"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "3.48"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "Quantity": {
                    "PriorYear": {
                        "val": "683"
                    },
                    "CurrentYear": {
                        "val": "877"
                    }
                },
                "TotalCost": {
                    "PriorYear": {
                        "val": "551.17"
                    },
                    "CurrentYear": {
                        "val": "420.492"
                    }
                }
            }
        },
        "Description": {
            "val": "Warfighter Information Network - Tactical (WIN-T) connects all users to each other from theater down to the maneuver battalion, to joint and multinational elements, and the Defense Information System Network (DISN). WIN-T employs a combination of terrestrial, airborne, and satellite-based transport options, to provide robust, redundant connectivity. Network modernization is one of the Army's top priorities, and WIN-T is its cornerstone program. It enables mission command on the move, keeping highly mobile and dispersed forces connected to one another and to the Army's global information network. With essential voice, video and data services, commanders can make decisions faster than ever before and from anywhere on the battlefield. WIN-T's infrastructure provides commanders and other users the ability to communicate via voice, data, and video simultaneously at all levels of security.  \n\nWarfighter Information Network- Tactical (WIN-T) Increment (Inc) 1: Networking At-the-Halt\nA state-of-the-art, Beyond Line of Sight, at-the-halt communications network that ensures operational relevancy and interoperability with future increments. It provides the current Warfighter with communications backbone that enables them to exchange information (voice, data, and video) at high speeds with high reliability throughout the tactical Division, Brigade Combat Team (BCT), and Battalion level elements using a wired and wireless backbones for the tactical Network Operations Centers (NOC) The wireless solution leverages the National Security Agency approved Commercial Solution for Classified (CSfC) architecture within the Operations Centers allowing simple and quick deployment of the NOC equipment and  C2 applications.   Two sub-increments are noted as follows: (Increment 1a): Extended Networking at-the-Halt - with Ka military satellite communications capability; and (Increment 1b): Enhanced Networking at-the-Halt, building on the Increment 1a capability by adding the Net Centric Waveform (NCW) and the Department of Defense Information Network (DoDIN) compliant Colorless Core Capability.  The NCW is essential to provide a meshed satellite network, minimizing latency through multiple hops at the below brigade HQs and the DoDIN compliant Colorless Core Capability  allows an efficient transport of multiple classified and unclassified data streams between WIN-T Inc 1 and Inc 2, as well as to reach back hub facilities. The  Increment 1 architecture is an integral part of the converged Network Operations (NETOPS) initiative allowing common NETOPS from any WIN-T assemblage.  Regional Hub Nodes are the uppermost level of the tactical architecture which provides a sanctuary, overlapping global presence that all WIN-T increments and product lines can leverage for transport services.  \n\n\nWIN-T Increment 2: Initial Networking On-the-Move\nWarfighter Information Network (WIN-T) Increment 2 (Inc 2) provides the Army with On-The-Move (OTM) networking capability.  The WIN-T Inc 2 network retains capabilities delivered by WIN-T Inc 1 and by leveraging proven government and commercial technologies, adds greater network throughput and automated Network Management to optimize planning (to include spectrum use), initialization, monitoring and troubleshooting. WIN-T Inc 2 employs Satellite Communications (SATCOM) OTM to extend the network in maneuver Brigade Combat Teams (BCTs) to Company level through FY18.  Using equipment mounted on combat platforms, WIN-T Inc 2 delivers a mobile capability that reduces reliance on fixed infrastructure and allows key leaders to move on the battlefield while retaining Situational Awareness and Mission Command capabilities. Using the Highband Networking Radio, with the Highband Networking Waveform and high performance antennas, the WIN-T Inc 2 Line-of-Sight network offers an adaptive 30 Megabit per second (Mbps) aggregate throughput to key leaders in their Command Post or in their vehicle. The WIN-T Inc 2 network is self-forming, which means that it automatically creates transmission paths based on terrain and environmental conditions; and self-healing, meaning that the paths will automatically re-route traffic to complete network transactions and calls even if one or more nodes break down or loses connectivity.  This offers greater network reliability and better end-to-end connectivity than traditional point-to-point networks.  WIN-T Inc 2 introduces the network management capability needed to keep the mobile and dispersed forces networked together through automated planning, initialization, monitoring, and troubleshooting.  Finally, WIN-T Inc 2 adopts \"Colorless Core\" technology that encrypts both classified and unclassified user information in the network and minimizes the number of users on the \"core\" of the network.  The Colorless Core allows commanders to utilize the tactical network without fear of the enemy intercepting information. Colorless Core is a technical insertion in the WIN-T Inc 1b network which enables information sharing between WIN-T Inc 1b and WIN-T Inc 2.\n\nThe WIN-T Inc 2 capabilities are identified for fielding to Armored, Infantry, and Stryker BCTs, Fires and CABs and Division Headquarters.  The Point of Presence and the Tactical Communications Node have both satellite and Line-of-Sight communication capability.  The Soldier Network Extension (SNE) provides satellite communication only.  The Point of Presence and the Tactical Communications Node are deployed at Division, Brigade and Battalion echelons. The SNE serves as the S3 vehicle at Battalion level and is also deployed down to Company level through FY18, when Network Capability Review (NCR) removes SNEs from the Company Commanders.  \n \nWIN-T Inc 3 developed NetOps and NetCentric Waveform (NCW) updates will be inserted into WIN-T Increment 2 equipped units.\n\nArea Common User System Modernization (ACUS MOD): \nSupports the Bridge to Future Networks (BFN) systems architecture by providing items to modernize the network or tech refresh existing legacy equipment.  ACUS Mod supports the Army's Transformation\/Modularity initiatives by developing, procuring, and fielding product improvements into the Army's Stryker Brigade Combat Teams (SBCTs) and 24 Expeditionary Signal Battalions (ESBs).  Also provides support to those systems that were fielded under the Area Common User System Modernization Plan (ACUS MP).  Overall, ACUS Mod supports the Army's mission by providing Ethernet local area network communications between Tactical Operational Centers (TOC); TOC & Tactical Internet network management capabilities; integrated voice, video and data services; Line of Sight (LOS) and Beyond Line of Sight (BLOS) transmission capability.\n\nThe ACUS Mod systems consist of: the High Capacity Line of Sight (HCLOS\/AN\/TRC-190) radio which provides a 16 Mbps line of site transmission capability required to transport the increased volume of data on the digital battlefield; the Battlefield Video-Teleconferencing Center (BVTC) provides Video Teleconference (VTC) and data collaboration to assist the commander in coordinating and interacting with different echelons and adjacent units; the AN\/TRC-170 tropospheric scatter radio which provides Beyond Line Of Sight (BLOS) communications with ranges in excess of 100 miles and bandwidth of up to 16 Mbps; and the Single Shelter Switch (SSS) which provides commanders with a \"First In\" capability and building block for network expansion.  The SSS is enhanced to provide Joint and Coalition interoperability using Commercial-Off-The-Shelf and Government-Off-The-Shelf (COTS\/GOTS) architecture for technology upgrade ease.  The aforementioned systems are an integral part of the Warfighter Information Network-Tactical (WIN-T) Increment 1 system architecture.  The Tactical NetOps Management System (TNMS) is a scalable modular NetOps capability that operates on multiple client or server platforms.  It is fielded to units not provided with WIN-T Inc 1 NetOps capabilities.  The TNMS will facilitate decision-making necessary to quickly identify network problems, shift resources, change configurations and coordinate the management of the critical network infrastructure supporting Mission Command (MC)\/Command and Control (C2) functions.  \n\nWIN-T Inc 2 is currently fielded to sixteen BCTs and nine Divisions. From FY19-23, WIN-T Inc 2 funding is realigned into two separate lines, Situational Information Transport (SIT) (B27201) and Tactical Network Technology Mod in Service (TNT MIS) (B07110) as part of the new Army Network Strategy.  The P-forms for B27201 and B07110 provide the description and justification associated with this new strategy."
        },
        "Justification": {
            "val": "Program has no FY 2019 request."
        },
        "MDAPCode": {
            "val": "349"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}