{
    "id": "2019-Navy-PB-1109N-MJBOOK-0-0-2e05e4be2fe4b3f8c414ceca88c19d59eae5836a8041cf57d09b3a87efa2453e-41",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-NAVY_MARINECORPS-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2019.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6520"
        },
        "LineItemTitle": {
            "val": "EOD Systems"
        },
        "P1LineNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "6465.246"
                },
                "PriorYear": {
                    "val": "110.224"
                },
                "CurrentYear": {
                    "val": "48.24"
                },
                "BudgetYearOneBase": {
                    "val": "47.854"
                },
                "BudgetYearOneOCO": {
                    "val": "8"
                },
                "BudgetYearOne": {
                    "val": "55.854"
                },
                "BudgetYearTwo": {
                    "val": "44.376"
                },
                "BudgetYearThree": {
                    "val": "26.624"
                },
                "BudgetYearFour": {
                    "val": "30.993"
                },
                "BudgetYearFive": {
                    "val": "28.613"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "6465.246"
                },
                "PriorYear": {
                    "val": "110.224"
                },
                "CurrentYear": {
                    "val": "48.24"
                },
                "BudgetYearOneBase": {
                    "val": "47.854"
                },
                "BudgetYearOneOCO": {
                    "val": "8"
                },
                "BudgetYearOne": {
                    "val": "55.854"
                },
                "BudgetYearTwo": {
                    "val": "44.376"
                },
                "BudgetYearThree": {
                    "val": "26.624"
                },
                "BudgetYearFour": {
                    "val": "30.993"
                },
                "BudgetYearFive": {
                    "val": "28.613"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "6465.246"
                },
                "PriorYear": {
                    "val": "110.224"
                },
                "CurrentYear": {
                    "val": "48.24"
                },
                "BudgetYearOneBase": {
                    "val": "47.854"
                },
                "BudgetYearOneOCO": {
                    "val": "8"
                },
                "BudgetYearOne": {
                    "val": "55.854"
                },
                "BudgetYearTwo": {
                    "val": "44.376"
                },
                "BudgetYearThree": {
                    "val": "26.624"
                },
                "BudgetYearFour": {
                    "val": "30.993"
                },
                "BudgetYearFive": {
                    "val": "28.613"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206211M"
                },
                {
                    "val": "0206313M"
                },
                {
                    "val": "0206623M"
                },
                {
                    "val": "0206315M"
                },
                {
                    "val": "0502511M"
                },
                {
                    "val": "0206624M"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "107.374"
                                },
                                "CurrentYear": {
                                    "val": "48.24"
                                },
                                "BudgetYearOneBase": {
                                    "val": "47.854"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "8"
                                },
                                "BudgetYearOne": {
                                    "val": "55.854"
                                },
                                "BudgetYearTwo": {
                                    "val": "44.376"
                                },
                                "BudgetYearThree": {
                                    "val": "26.624"
                                },
                                "BudgetYearFour": {
                                    "val": "30.993"
                                },
                                "BudgetYearFive": {
                                    "val": "28.613"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "2.85"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "110.224"
                    },
                    "CurrentYear": {
                        "val": "48.24"
                    },
                    "BudgetYearOneBase": {
                        "val": "47.854"
                    },
                    "BudgetYearOneOCO": {
                        "val": "8"
                    },
                    "BudgetYearOne": {
                        "val": "55.854"
                    },
                    "BudgetYearTwo": {
                        "val": "44.376"
                    },
                    "BudgetYearThree": {
                        "val": "26.624"
                    },
                    "BudgetYearFour": {
                        "val": "30.993"
                    },
                    "BudgetYearFive": {
                        "val": "28.613"
                    }
                }
            }
        },
        "Description": {
            "val": "ASSAULT BREACHER VEHICLE (ABV) is a tracked, armored combat engineer vehicle designed to breach minefields and complex obstacles and provide a deliberate and in-stride breaching capability. ABV consists of a rebuilt and upgraded M1A1 Tank chassis with the integration of Non-Developmental Items (NDI), which includes a Full-Width Mine Plow, a Dozer Blade, a Surface Mine Plow, a Rapid Ordnance Removal System, two M58 Linear Demolition Charges, a lane marking system and a self-defense weapon system. The ABV will provide crew protection and vehicle survivability while having the speed and mobility to keep pace with the maneuver force. The M1A1 Tank Chassis will provide economic supportability of the system through its commonality with the tank fleet and armor protection for survivability.\n\nMK 154 MODERNIZATION is a line charge launcher system installed in the Amphibious Assault Vehicle Personnel variant (AAVP7) used to breach mine fields in shallow water and inland areas, providing the USMC with an amphibious operations breaching capability.\n\nFAMILY OF EOD EQUIPMENT (FEOD)is comprised of over forty Table of Authorized Material Control Numbers (TAMCNs)  providing the required tools and capabilities to detect, locate, access, identify, triage, diagnose, stabilize, render safe, neutralize, recover, exploit, and dispose of unexploded explosive ordnance (UXO), improvised explosive devices (IED), and weapons of mass destruction (WMD).  The portfolio includes specialized diagnostic equipment, robotics and energetically actuated tools, which enable EOD to provide the Marine air-ground task force (MAGTF) and Marine Special Operations Forces with critical enabling capabilities that deliver responsive, scalable, strategic depth for special operations, crisis response, and littoral access.\n\nMINE RESISTANT AMBUSH PROTECTED (MRAP) Family of Vehicles (FoV) provides Warfighters multi-mission platforms capable of mitigating Improvised Explosive Devices (IEDs), underbody mines, and small arms fire threats, which are currently the greatest casualty producers in Overseas Contingency Operations (OCO). Multiple MRAP vehicle categories (CATs) have been procured, fielded, and sustained: MRAP-All Terrain Vehicle (M-ATV) - Combat operations (ops) in rural, mountainous, urban terrain.  Category I - Urban combat operations, ambulance. Category II - Multi-mission ops-convoy lead, troop transport, ambulance, utility vehicle. Category III - Mine\/IED clearance ops, explosive ordnance disposal. Funding includes required Government Furnished Equipment (GFE)\/subsystems and Engineering Change Proposal (ECP)\/Capability Insertion in response to an UUNS\/JUONS and Warfighter safety and survivability requirements.\n\nMRAP funding has been realigned to BLI 5050 beginning in FY19.\n\nCOUNTER RADIO-CONTROLLED IMPROVISED EXPLOSIVE DEVICE (RCIED) ELECTRONIC WARFARE (USMC CREW) SYSTEMS are vehicle mounted and dismounted modular programmable multi-band radio frequency jammers designed to deny enemy use of selected portions of the radio frequency spectrum in the vicinity of the jammer to counter the RCIED threat. The mounted and dismounted systems provide Marines in vehicle convoys and on foot with the necessary protection from the continued and evolving threat of deadly RCIEDs.  Legacy CREW systems are currently deployed to meet threats in the multiple theaters of operation and fielded to selected Marine Expeditionary Units (MEU)\/Marine Expeditionary Forces (MEF) in support of worldwide deployment.\n\nFAMILY OF COUNTER-IMPROVISED EXPLOSIVE DEVICE (C-IED) CAPABILITIES (F2C) provides capabilities not found in the current Joint land force structure to defeat explosive hazards and protect Marines and equipment while conducting route and area clearance operations. The Family of Counter-Improvised Explosive Device (C-IED) Capabilities (F2C) will enable Commanders to deliberately operate in explosive hazards environments by detecting and marking explosive hazards, enabling the Commanders to make timely and informed decisions to avoid the explosive hazards, or, if necessary, neutralize explosive hazards that impede their missions. Multiple detection and marking capabilities will detect a broader spectrum of explosive hazards and achieve higher overall effectiveness rates. Standoff and remote-controlled detection and marking capabilities will remove Joint forces from direct contact with explosive hazards and enhance force protection and the vehicles' system survivability. Operational speeds and rates will increase and better support the operational tempo (OPTEMPO) of the current and future force. ENFIRE is a digital surveying kit designed to collect and disseminate engineer-related information while minimizing exposure to enemy observation."
        },
        "Justification": {
            "val": "The FY 2019 funding request was reduced by ($.122) million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government.\n\nFY2018 Base Appropriation Request: $27.240M \n\nCREW Systems: The decrease in funding from FY2017 to FY2018 ($75.00M) completes procurement of Mounted CREW Systems and Vehicle Integration Kits using FY17 OCO funding. \n\nMINE RESISTANT AMBUSH PROTECTED (MRAP) VEHICLES: ($1.152M) Funds Engineering Change Proposal (ECP) upgrades for the enduring MRAP vehicle requirement.  Continues Engineering Change Proposal (ECP) Block III Upgrades and Egress Installations to maintain vehicle relevancy in meeting force protection threats, such as blast, rollover or water submersion events, and responding to operational needs.\n\nMRAP funding has been realigned to BLI 5050 beginning in FY19.\n\nFAMILY OF EOD EQUIPMENT: ($26.087M) Funds Supply Stock Lists (SL-3) Kits to include specialized tools.  The decrease of $9.087M from FY 2017 to FY 2018 is attributed to the $21.300M required in FY2017 to upgrade critical equipment required to mitigate significant risk to EOD Technicians executing tasks within an explosive hazardous serious injury zone.  Supports the procurement of AN\/PVS-31 Optic Sights (with helmet mounts) and AN\/PAS-29 Enhanced Clip-On Thermal Imagers (ECOTI) as well as various specialized EOD kits and EOD equipment.\n\nASSAULT BREACHER VEHICLE MODIFICATION:  ($0.001M)  Funds support M1A1 Upgrade.\n\nFY 2019 Base Appropriation Request: $47.854M\n\nFamily of EOD EQUIPMENT: ($45.962M) Funds Supply Stock Lists (SL-3) Kits to include specialized tools, and a Table of Equipment plus up to support the growth of two USMC platoons in FY19. The increase of $2.875M from FY18 to FY19 is attributed to the need to purchase Radiographic Imaging Systems, Remote Fuze Disassembly Kits, and Bomb Suits.\n\nFAMILY OF COUNTER-IMPROVISED EXPLOSIVE DEVICE (C-IED) CAPABILITIES (F2C): ($1.891M) Funds will support the procurement of Counter Improvised Explosive Device (C-IED) Capability (F2C) equipment. This procurement will provide the critical equipment such as Sickle Sticks and other F2C tools to detect and mark explosive hazards; provide standoff and remote-controlled detection and marking and remove operating forces from direct contact with explosive hazards.  \n\nASSAULT BREACHER VEHICLE MODIFICATION: ($0.001M) Funds support M1A1 Upgrade.\n\nOCO: \nFY 2018 Overseas Contingency Operations (OCO) Request: $21.000M ($4.0M MRAP, $17.0M EOD, $8.000M C-IED)\n\nMINE RESISTANT AMBUSH PROTECTED (MRAP) Family of Vehicles (FoV): $4.000M Funds the installation of Egress kits procured in response to UUUNS 08275UC and 10215UC; MARCENT Enduring requirements.  The Egress kit increases force protection on all Cougar CAT I and CAT II variants by ensuring that vehicle occupants can safely exit the vehicle after blast, rollover or water submersion events.\n\nFAMILY OF EOD EQUIPMENT: ($17.000M) - Procures Commercial Off the Shelf (COTS) equipment to include sensor detectors, video fiber optic scopes, Improvised Explosive Devices (IED)\/Weapons of Mass Destruction (WMD) diagnostic kits and fusion optics. These capabilities will give the EOD technician precision capabilities to counter IEDs\/WMDs during category \"A\" incidents where the EOD technician is required to assume a grave and immediate risk and physically operate within the very serious injury zone. Continue to provide support to EOD operations currently in support of U.S. Forces Central Command (CENT) and other \"new norm\" (ONN) Special Purpose Marine Air Ground Task Forces (SPMAGTFs) Crisis Response (CR) postured world-wide require a multitude of EOD specific equipment items to achieve full readiness, enabling supported units and nations engaged against the threat and use of IEDs, WMDs, and Unexploded Explosive Ordnance (UXO).\n\nFY 2019 Overseas Contingency Operations (OCO) Request: $8.000M\n\nFAMILY OF COUNTER-IMPROVISED EXPLOSIVE DEVICE (C-IED) CAPABILITIES (F2C): ($8.000M)Procures Husky Mounted Detection System Wire Detection (HMDS-WD) systems in support of the MROC DM 39-2011 R2C FoS Increment II Capabilities Production Document requirement. This capability will yield faster, more effective route clearance missions, significantly improve chances of avoiding an explosive hazard strike, and better awareness of the enemy's tactics, techniques, and procedures. The current HMDS lacks the ability to find command wires associated with deeply buried IEDs, relying on the ground penetrating radar to find the IED main charge or container."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "EOD Systems"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Assault Breacher Vehicle (ABV)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Assault Breacher Vehicle (ABV) Modification"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.698"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.394"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.001"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.001"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.001"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "6.698"
                                        },
                                        "PriorYear": {
                                            "val": "0.394"
                                        },
                                        "CurrentYear": {
                                            "val": "0.001"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.001"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.001"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Family of EOD Systems"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Various tool kits are procured.  EOD tool kits include CBNRE kits, Search kits, Tech kits, Tool kits, SL3 kits, GO kits, and IED kits. FY18 base and OCO will procure sensor detectors, video fiber optic scopes, Improvised Explosive Devices (IED)\/Weapons of Mass Destruction (WMD) diagnostic kits and fusion optics.",
                                                "val": "2.1) EOD Specialized Equipment and Tool Kits"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "123.263"
                                                    },
                                                    "PriorYear": {
                                                        "val": "31.634"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "43.087"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "45.962"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "45.962"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) EOD Reserves"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "2.85"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "123.263"
                                        },
                                        "PriorYear": {
                                            "val": "34.484"
                                        },
                                        "CurrentYear": {
                                            "val": "43.087"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.962"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.962"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) MK 154 Remanufacture"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) MK 154 Remanufacture"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "48"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "9.556"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "199083.33"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "9.556"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) Mine Resistant Ambush Protected (MRAP)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "FY18 - FY19 Base overall decrease of $0.442M (BLI 6520 MRAP FY18 $1.152 realigned to BLI 5050 FY19 $0.710M)",
                                                "val": "4.1) Upgrades"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.508"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.346"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "5.152"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "FY18 - FY19 OCO overall increase of $21.9200M (BLI 6520 MRAP FY18 $4.000M realigned to BLI 5050 FY19 $25.920M)",
                                                "val": "4.2) Prior Years Cumulative Funding"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6296.296"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "6296.804"
                                        },
                                        "PriorYear": {
                                            "val": "0.346"
                                        },
                                        "CurrentYear": {
                                            "val": "5.152"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) COUNTER RCIED ELECTRONIC WARFARE (USMC CREW)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Supports performance upgrade of mounted CREW Systems.",
                                                "val": "5.1) CREW Mounted Upgrade"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "65"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "5.2) Vehicle Integration Kits"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "10"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "75"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "6) Family of Counter-Improvised Explosive Device (C-IED) Capabilities"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "6.1) Counter-Improvised Explosive Devices (C-IED)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.891"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "8"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9.891"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.891"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "8"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.891"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "7) Prior Years Cumulative Funding"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "7.1) Other Prior Year"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "28.925"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "28.925"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "6465.246"
                            },
                            "PriorYear": {
                                "val": "110.224"
                            },
                            "CurrentYear": {
                                "val": "48.24"
                            },
                            "BudgetYearOneBase": {
                                "val": "47.854"
                            },
                            "BudgetYearOneOCO": {
                                "val": "8"
                            },
                            "BudgetYearOne": {
                                "val": "55.854"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}