{
    "id": "2019-AirForce-PB-3080F-JBOOK-4c925f887ad96de8d364386e9c32b045b235f207ccc8113ddaf5e293802dc9ad-41",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-AIRFORCE_OTHER-U_PROCUREMENT_JustificationBook_Air_Force_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "835110"
        },
        "LineItemTitle": {
            "val": "Joint Communications Support Element (JCSE)"
        },
        "P1LineNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Air Force Communications"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "5.182"
                },
                "CurrentYear": {
                    "val": "5.135"
                },
                "BudgetYearOneBase": {
                    "val": "3.145"
                },
                "BudgetYearOne": {
                    "val": "3.145"
                },
                "BudgetYearTwo": {
                    "val": "5.319"
                },
                "BudgetYearThree": {
                    "val": "5.415"
                },
                "BudgetYearFour": {
                    "val": "5.514"
                },
                "BudgetYearFive": {
                    "val": "5.613"
                },
                "Total": {
                    "val": "35.323"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "5.182"
                },
                "CurrentYear": {
                    "val": "5.135"
                },
                "BudgetYearOneBase": {
                    "val": "3.145"
                },
                "BudgetYearOne": {
                    "val": "3.145"
                },
                "BudgetYearTwo": {
                    "val": "5.319"
                },
                "BudgetYearThree": {
                    "val": "5.415"
                },
                "BudgetYearFour": {
                    "val": "5.514"
                },
                "BudgetYearFive": {
                    "val": "5.613"
                },
                "Total": {
                    "val": "35.323"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "5.182"
                },
                "CurrentYear": {
                    "val": "5.135"
                },
                "BudgetYearOneBase": {
                    "val": "3.145"
                },
                "BudgetYearOne": {
                    "val": "3.145"
                },
                "BudgetYearTwo": {
                    "val": "5.319"
                },
                "BudgetYearThree": {
                    "val": "5.415"
                },
                "BudgetYearFour": {
                    "val": "5.514"
                },
                "BudgetYearFive": {
                    "val": "5.613"
                },
                "Total": {
                    "val": "35.323"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "JOINT COMMUNICATIONS SUPPORT ELEMENT (JCSE): JCSE, assigned under Joint Enabling Capabilities Command, US Transportation Command, is the only joint Department of Defense (DoD) unit specifically formed to provide command, control, communications, and computers (C4) systems support for Joint Chiefs of Staff (JCS) contingency operations worldwide. The Joint Communications Support Element (JCSE) mission is to provide, on short notice, those critical communications required to support Joint Task Force support (JTF) and Joint Special Operations Task Force (JSOTF) headquarters. These assets support the warfighter's ability to deploy rapidly and immediately provide the positive command and control required. This support includes contingency and crisis communications for the Joint Chiefs of Staff, Combatant Commands, Services, Defense agencies, non-Defense agencies, and foreign governments. Program goals include meeting emerging real-world operational requirements with the maximum capabilities, smallest footprint, lowest operations and maintenance costs, and seamless integration with the global information grid. Per Defense Planning Guidance (DPG) and Director, Joint Staff Memorandum (DJSM)0291-14, the Air Force is mandated to fund 1\/3rd fair share of JCSE's validated Modernization Program.\n\nFunding for this exhibit is contained in PE 0207422F, Deployable Command, Control, and Communications (C3) Systems."
        },
        "Justification": {
            "val": "JCSE: FY19 base funding procures communications equipment based on Strategic Planning Guidance.  This includes the maximum capabilities for narrowband, wideband and  protected satellite communications (SATCOM) terminals and systems, tactical radios, terrestrial communications systems, satellite hubs, networking elements, virtual appliances, Video Teleconferencing (VTC) capabilities, alternative power solutions, Airborne \/En-Route, Forced Entry, Cyber Security, and Mobile Joint C2 equipment. Advancements in technology have provided opportunities to modernize current equipment sets with enhanced capabilities to meet the program goals which include meeting emerging real-world operational and cyber defense requirements with maximum capabilities, the smallest possible footprint, lowest operations and maintenance costs, and seamless integration with the global information grid. This equipment is a critical part of Command, Control and Communications packages that provide direct operational support to joint forces and HQ elements deployed to austere locations around the globe. Per the Planning Guidance, the Air Force is mandated to fund one-third of the fair share of JCSE's validated equipment modernization plan. JCSE's Program is built\/restructured based on Combatant Command (CCMD) and Service Components' requirements and emerging technologies. The Services influence JCSE's spending plan through recommendations in concert with Major Defense Acquisition Program (MDAP) schedules, ensuring that Service dollars meet Joint Service requirements."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}