{
    "id": "2019-AirForce-PB-3021F-MJBOOK-0-0-194bf0e784fbad25361faa9b2e969294b91d9c7ed6d7d509423526ba60f6b124-15",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-AIRFORCE_SPACE-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3021F",
        "appropriation_name": "Space Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "NUDETS"
        },
        "LineItemTitle": {
            "val": "NUDET Detection System"
        },
        "P1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3021F"
        },
        "AppropriationTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "4.395"
                },
                "CurrentYear": {
                    "val": "6.37"
                },
                "BudgetYearOneBase": {
                    "val": "7.705"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.705"
                },
                "BudgetYearTwo": {
                    "val": "6.532"
                },
                "BudgetYearThree": {
                    "val": "6.645"
                },
                "BudgetYearFour": {
                    "val": "6.78"
                },
                "BudgetYearFive": {
                    "val": "6.907"
                },
                "Total": {
                    "val": "45.334"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "4.395"
                },
                "CurrentYear": {
                    "val": "6.37"
                },
                "BudgetYearOneBase": {
                    "val": "7.705"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.705"
                },
                "BudgetYearTwo": {
                    "val": "6.532"
                },
                "BudgetYearThree": {
                    "val": "6.645"
                },
                "BudgetYearFour": {
                    "val": "6.78"
                },
                "BudgetYearFive": {
                    "val": "6.907"
                },
                "Total": {
                    "val": "45.334"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "4.395"
                },
                "CurrentYear": {
                    "val": "6.37"
                },
                "BudgetYearOneBase": {
                    "val": "7.705"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "7.705"
                },
                "BudgetYearTwo": {
                    "val": "6.532"
                },
                "BudgetYearThree": {
                    "val": "6.645"
                },
                "BudgetYearFour": {
                    "val": "6.78"
                },
                "BudgetYearFive": {
                    "val": "6.907"
                },
                "Total": {
                    "val": "45.334"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "1203913F"
                }
            ]
        },
        "Description": {
            "val": "The United States Nuclear Detonation (NUDET) Detection System (USNDS) provides a near real-time worldwide, highly survivable\/endurable capability to detect, locate, and report any nuclear detonations in the atmosphere of the earth or in near space. The USNDS Operational Requirements Document (ORD), dated 21 Jan 2004, documents the requirements for space-based NUDET detection. Space-based NUDET detection is also mandated by Public Law 110-181, dated 28 Jan 2008, which directs the Secretary of Defense (SECDEF) to maintain the capability for space-based nuclear detection at or above 2008 capability levels. USNDS supports NUDET detection requirements across five mission areas: Integrated Tactical Warning and Attack Assessment (ITW\/AA), Nuclear Force Management (NFM), Space Control (SC), Treaty Monitoring (TM) and a classified mission.\n\nThe USNDS 6 program is jointly sponsored and funded by the Department of Defense (DoD), through the U.S. Air Force (AF), and the Department of Energy (DOE), through the National Nuclear Security Administration (NNSA) and its Nuclear Detonation Detection (NA-22) office, respectively. NNSA\/NA-22 supplies USNDS space sensors as Government Furnished Equipment (GFE) to the AF USNDS Program Office, which is responsible for all acquisition and systems engineering, integration and test (SEIT) activities on space vehicles (SVs), to include Global Positioning System (GPS) and additional hosts, and their supporting ground control segments. The AF directly funds the procurement of the USNDS 6 ground segment (described below).\n\nDoD funds its contribution to the Nuclear Detonation (NUDET) Detection System (NDS) program in Program Element (PE) 1203913F with RDT&E, SPAF, and O&M dollars. NDS payload integration onto GPS satellites is funded in the GPS III Space Segment PE 1203265F for GPS III SVs. NDS payload integration onto Geosynchronous Earth Orbit (GEO) satellites is funded by NNSA\/NA-22.\n\nUSNDS consists of space sensors and complex ground segments. The space segment sensors, funded by DOE, consists of three nuclear detection sensor payloads: the Radiation Detection Capability (RADEC) payload for Defense Support Program (DSP) satellites, the Global Burst Detection (GBD) payload for Medium Earth Orbit (MEO) platforms (GPS satellites), and the Space Atmospheric Burst Reporting System (SABRS) payload for GEO platforms (classified GEO hosts).  Together, these sensors and associated communications capability provided by the host satellites comprise the global NUDET space segment detection capability for the USNDS.  Space sensors communicate NUDET indications to the fixed ground segment (the RADEC Data Processor (RDP), the Integrated Correlation and Display System (ICADS)) and the deployable mobile ground segment (survivable Ground NDS Terminals (GNTs), and the five survivable\/endurable Universal Ground NDS Terminals (UGNTs), when fielded.  The ground segment provides ground receiving analysis and reporting capabilities to national authorities, commands, and forward users as well as Department of State for the Treaty Monitoring and Verification mission. \n\nThe ground control segment is being modernized and continuously improved through an incremental evolutionary acquisition approach. \n\nThe current and future space domain demands that space systems be responsive to new and changing threats, and can rapidly integrate new capabilities to make our warfighting force more resilient in a contested battlespace. This agility, survivability, and rapid reconstitution must extend through the entire space warfighting enterprise, to include how we learn about the threat; develop solutions; acquire, test, deploy, train, operate and integrate new systems into the greater system of systems; and ensure our space mission force is ready to defeat a thinking adversary in a complex, multi-domain battlespace. The enterprise will use all of its elements to accelerate decision-making, prototype potential solutions, rapidly integrate decision-making tools and sustain a war-winning capability by delivering multi-domain effects in, from, and through space and cyberspace enabling battle management and resilience options to \"fight through.\" \n\nFunding for this exhibit contained in PE 1203913F, NUDET Detection System (SPACE)."
        },
        "Justification": {
            "val": "GROUND NUCLEAR DETONATION DETECTION TERMINALS UPGRADES\/SENSOR CHECKOUT ACTIVITIES : FY2019 funding includes but is not limited to; purchases USNDS6 equipment, integration and testing for the hardened shelters, on-orbit sensor testing and system engineering for USNDS GPS payload, Red Hat Linux upgrade, and simulator modification for ICADS Build 6 ground system. Rapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, prototyping, etc."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "NUDET Detection System"
                    },
                    "IdCode": {
                        "val": "A"
                    },
                    "Remarks": {
                        "val": "(1) Quantity\/unit cost data represents the average unit cost per system installation.  Due to cost variances between local configurations, unit cost data will fluctuate between fiscal years."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "4.395"
                            },
                            "CurrentYear": {
                                "val": "6.37"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.705"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.705"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "4.395"
                            },
                            "CurrentYear": {
                                "val": "6.37"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.705"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.705"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "4.395"
                            },
                            "CurrentYear": {
                                "val": "6.37"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.705"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "7.705"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "Hardware End Item"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "ADP + Spares"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "PriorYear": {
                                                            "val": "2"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "3"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "3"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "3"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "3.546"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "5.142"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "5.156"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "5.156"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "PriorYear": {
                                                            "val": "1.773"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.714"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.719"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.719"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sensor Checkout Activities"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "PriorYear": {
                                                            "val": "1"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.849"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.228"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.249"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.249"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "PriorYear": {
                                                            "val": "0.849"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.228"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.249"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.249"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Red Hat Linux Upgrades"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1.3"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.3"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1.3"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.3"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "4.395"
                                            },
                                            "CurrentYear": {
                                                "val": "6.37"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "7.705"
                                            },
                                            "BudgetYearOne": {
                                                "val": "7.705"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "4.395"
                                        },
                                        "CurrentYear": {
                                            "val": "6.37"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.705"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.705"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}