{
    "id": "2019-TheJointStaff-PB-0300D-MJBOOK-0-0-f789d1a1fce9a5d795e907a8210e445d4b36ba6e755a68be337b55e60e963a20-0",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-DEFENSE_TJS-U_PROCUREMENT_MasterJustificationBook_The_Joint_Staff_PB_2019.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_The_Joint_Staff_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "10"
        },
        "LineItemTitle": {
            "val": "Major Equipment, TJS"
        },
        "P1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "15"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, TJS"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "76.029"
                },
                "PriorYear": {
                    "val": "7.988"
                },
                "CurrentYear": {
                    "val": "9.341"
                },
                "BudgetYearOneBase": {
                    "val": "4.36"
                },
                "BudgetYearOne": {
                    "val": "4.36"
                },
                "BudgetYearTwo": {
                    "val": "7.363"
                },
                "BudgetYearThree": {
                    "val": "4.384"
                },
                "BudgetYearFour": {
                    "val": "4.378"
                },
                "BudgetYearFive": {
                    "val": "4.378"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "76.029"
                },
                "PriorYear": {
                    "val": "7.988"
                },
                "CurrentYear": {
                    "val": "9.341"
                },
                "BudgetYearOneBase": {
                    "val": "4.36"
                },
                "BudgetYearOne": {
                    "val": "4.36"
                },
                "BudgetYearTwo": {
                    "val": "7.363"
                },
                "BudgetYearThree": {
                    "val": "4.384"
                },
                "BudgetYearFour": {
                    "val": "4.378"
                },
                "BudgetYearFive": {
                    "val": "4.378"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "76.029"
                },
                "PriorYear": {
                    "val": "7.988"
                },
                "CurrentYear": {
                    "val": "9.341"
                },
                "BudgetYearOneBase": {
                    "val": "4.36"
                },
                "BudgetYearOne": {
                    "val": "4.36"
                },
                "BudgetYearTwo": {
                    "val": "7.363"
                },
                "BudgetYearThree": {
                    "val": "4.384"
                },
                "BudgetYearFour": {
                    "val": "4.378"
                },
                "BudgetYearFive": {
                    "val": "4.378"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "The Chairman of the Joint Chiefs of Staff (CJCS) is the principal military adviser to the President, National Security Council, and Secretary of Defense. The Chairman presides over and serves as a member of the Joint Chiefs of Staff. CJCS relies upon the Joint Staff to craft and distribute guidance for combatant forces' unified strategic direction, operations under unified commands, and integration into effective combat forces. On behalf of the Chairman, the Joint Staff provides Combatant Commands (CCMDs), the Services, and U.S. war fighters with joint policy, strategy, and doctrine necessary to employ effective joint combat forces in contingencies worldwide."
        },
        "Justification": {
            "val": "The Joint Staff requests $4.360M in FY 2019 procurement for mission critical information technology systems, and applications investment requirements.  The procurement request resources various efforts across the Joint Staff, including investments in joint force development data center and Information Technology (IT) \/ Information Security (IS) equipment.  \n\n1. Joint Lessons Learned Information System (JLLIS): \nNo new procurement funding is required for FY 2018 and beyond.  \n\n2. Planning and Decision Aid System (PDAS):\nPDAS realigned Procurement funding, $3,000K per year, to O&M to fund higher priority requirements for the following years:  FY 2019, FY 2021 – FY2023\n\nPDAS is a classified, protected program operated by the Joint Staff.  PDAS supports the planning and execution of Joint Staff and Unified Combatant Commanders (COCOM) operations.  PDAS is a world-wide network protecting sensitive information that meets the Intelligence Community Directive (ICD) 503 security requirements.  PDAS provides office automation packages, document and information management tools; collaboration, voice, and video tools in a secure, flexible architecture that promotes a distributed enterprise.  Within the enterprise, PDAS users have access to their data regardless of log-on location, secure data exchange, conferencing and planning sessions among physically distributed continental United States (CONUS) and outside continental United States (OCONUS) locations. Users are provided access to a Help Desk and remote troubleshooting within the PDAS enterprise. \n\nEquipment modernization will allow the Joint Staff to develop plans to implement materiel solutions to address hardware and software configuration items that are outdated, nearing end-of-life or end-of-support or which can no longer be commercially acquired.  Historically, this equipment has been purchased as required due to failures, end-of-life, or end-of-service which has led to many baselines and configurations of deployed hardware, software and communications equipment. Items reach end-of-life in different years providing a cascade of equipment replacement requirements.  This spacing lessens the financial impact but requires constant purchase, integration, testing and installation.  Integration and testing ensures that hardware or software is compatible with other installed hardware and software configuration items and does not introduce vulnerabilities into PDAS, or allow unauthorized personnel to gain access to information for which they are not authorized.  There are four specific focus uses as follows.\n\nPDAS funding will be used to procure additional program site installations, datacenter refresh, client refresh, and equipment modernizations. Due to the cyclic nature of the PDAS technical refresh requirement of datacenters, client computers and other IT equipment, this program presents a non-linear funding profile with noticeable spikes in funding requirements during technical refresh years.  When possible, equipment is purchased in increments across fiscal years which mitigates spikes in funding requirements.\n\nProcurement of additional PDAS program site installations will allow the Joint Staff operational sponsor and program manager to complete the installation of additional PDAS user sites. PDAS is comprised of hundreds of user sites with thousands of users worldwide. In recent years, the number of PDAS sites grew by 25 percent with planned expansion of both sites and users.  PDAS sites provide capabilities, services and the infrastructure necessary to meet operational mission needs. \n\nDatacenter refresh will allow the Joint Staff to provide refreshed datacenter hardware and software. The hardware and software to be replaced is reaching the end of its service life and approaching obsolescence.  New equipment for the datacenters will enable the PDAS program to consolidate equipment baselines and provide commonality at the datacenters. This periodic refresh provides PDAS with an updated hardware and software infrastructure, enabling improved performance, security, efficiency, and reduced logistical requirements.  From an operational perspective, it moves the program from event-driven, reactive situations of coping with the latest problem to a more proactive, forward-facing operational posture. The focus becomes one of preemptive quality assurance, standardization, and optimization. \n\nClient refresh will allow the Joint Staff to provide updated computer hardware to the PDAS users in order to be compliant with Security Control 28 (protection of information at rest to prevent insider threats). This periodic refresh provides the users with an up to date hardware and software infrastructure, enabling improved performance, security, efficiency, and reducing logistical requirements. Deferment of this purchase will require development of additional computer operating system baselines on deployed computer clients, significantly increasing life-cycle sustainment cost in future years.  \n\n3. Management Headquarters:\nManagement Headquarters provides the day-to-day financial resources necessary to conduct Joint Staff operations. Funding supports the Joint Integrated Air & Missile Defense Organization (JIAMDO), Joint Range Extender (JRE), mission-unique non-Joint Service Provider (JSP), Joint Staff IT requirements, and technology upgrades for the joint training facility. \n\nThere are two JIAMDO focus areas:\n\nJIAMDO uses funds to support a Near Real Time (NRT) Server in support of Combat Identification (CID) applications. The NRT Server provides an increased storage capacity for NRT data for real-time processing as well as testing and evaluation of new capabilities. It provides the ability to store non-standard data securely and also to enable future use of the data in development and testing. This item supports JIAMDO's national-to-tactical CID mission. Additional details are classified.\n\nJIAMDO also uses these funds to procure JRE, semi-rugged laptops (with JRE software license) and JRE help desk support. These JREs are required to support JIAMDO's advanced combat identification efforts. The JREs will be installed in the digital integration for combat employment joint mobile lab and will support hosting of Link 16 terminals for participation in exercises, testing, and operational events. The purpose of this funding is to develop and operationalize enhanced CID capability. This item supports JIAMDO's national-to-tactical CID mission. Additional details are classified.\n\nNote: All JIAMDO procurement funding (~$100K per year) was moved to RDT&E to fund higher priority requirements for FY 2019 and beyond.\n\nManagement Headquarters funds are also used to procure major hardware and software technology upgrades investments for the Suffolk, VA, joint training facility. These funds provide significant network distribution\/security, data processing, and capacity upgrades to the Suffolk Data Center to increase performance, security, reliability, and accessibility to the Combatant Commands and Services. Capability upgrades are required to host current joint training applications (Joint Knowledge Online, Joint Training Information Management System, Joint Lessons Learned Information Systems, and Joint Live, Virtual, and Constructive simulations). Additionally, the upgrades provide support to multi-site, multi-command, distributed live, virtual, and constructive joint force training events addressing transregional, multi-domain, and multi-functional threat environments.\n\nThe Deputy Secretary of Defense (DepSecDef) approved the alignment of common IT services in the Pentagon and the National Capital Region to the Joint Service Provider (JSP) operating as a field service activity in Defense Information Systems Agency (DISA). In 2018, the Joint Staff Information Network (JSIN) resources permanently transferred to the JSP (DISA PE 0305830K).  The overall effect to the Department was a net-zero profile change for FY 2018 and beyond.  Limited IT procurement funding was retained for mission-unique, non-JSP Joint Staff IT requirements. \n\n4.  Joint Information Operations Range (JIOR):\nThe JIOR provides DoD a closed-loop, persistent, geographically distributed network to conduct training, testing, and experimentation in support of Computer Network Attack (CNA)\/Computer Network Defense (CND) in a threat representative environment with realistic and relevant targets and command & control systems of interest. JIOR provides Services, Combatant Commanders (CCMDs), and other government agencies the ability to gain insights into advanced cyberspace, information operations (IO), and electronic warfare (EW) capabilities under current and future operational environment conditions. JIOR integrates other cyberspace ranges, replicates critical infrastructure, cyber targets, Internet traffic, and opposing forces.  The JIOR security construct allows users to develop, test, and secure their unique cyber capabilities and protect their identity during range activities. The JIOR hosts multiple, simultaneous, and disparate training\/certification, testing, and experimentation events on a secure, closed-loop enterprise network.  \n\nThe Department provided JIOR with resources (as a plus up FY 2018-FY 2022) to add 36 Guard and Reserve locations to the JIOR closed loop network.  Adding these Guard and Reserve sites to the JIOR supports training and readiness of Cyber Mission Force (CMF) drilling at those locations.  Specifically, the funding will be used to procure hardware and software to build and install 36 unique points required to connect these additional CMF teams to the JIOR network.  Additionally, the funding will be used to complete overarching technology upgrades\/modernization to the JIOR enterprise network.  Equipment and software modernization will enable the JIOR to extend service to the 36 new sites\/SDPs while continuing support to the existing 138+ JIOR access points.  Historically, JIOR had limited IT refresh funding and has purchased replacement hardware due to failures, end-of-life, or end-of-service constraints which has not allowed for a focused modernization effort.  Given the increased cyber mission focus, periodic technology upgrades are required to make the JIOR more efficient, agile, and sufficiently robust to accommodate this significant network expansion in support of additional CMF demand."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}