{
    "id": "2019-DefenseInformationSystemsAgency-PB-0300D-JBOOK-908fafdf4286d3a3e1a87247fd8d2fe42970cc86a5db56400b3977f4ab1e8f62-2",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-DEFENSE_DISA-U_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "16"
        },
        "LineItemTitle": {
            "val": "Items Less Than $5 Million"
        },
        "P1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DISA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "522.013"
                },
                "PriorYear": {
                    "val": "15.363"
                },
                "CurrentYear": {
                    "val": "15.541"
                },
                "BudgetYearOneBase": {
                    "val": "27.886"
                },
                "BudgetYearOne": {
                    "val": "27.886"
                },
                "BudgetYearTwo": {
                    "val": "26.416"
                },
                "BudgetYearThree": {
                    "val": "26.074"
                },
                "BudgetYearFour": {
                    "val": "27.599"
                },
                "BudgetYearFive": {
                    "val": "28.151"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "522.013"
                },
                "PriorYear": {
                    "val": "15.363"
                },
                "CurrentYear": {
                    "val": "15.541"
                },
                "BudgetYearOneBase": {
                    "val": "27.886"
                },
                "BudgetYearOne": {
                    "val": "27.886"
                },
                "BudgetYearTwo": {
                    "val": "26.416"
                },
                "BudgetYearThree": {
                    "val": "26.074"
                },
                "BudgetYearFour": {
                    "val": "27.599"
                },
                "BudgetYearFive": {
                    "val": "28.151"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "522.013"
                },
                "PriorYear": {
                    "val": "15.363"
                },
                "CurrentYear": {
                    "val": "15.541"
                },
                "BudgetYearOneBase": {
                    "val": "27.886"
                },
                "BudgetYearOne": {
                    "val": "27.886"
                },
                "BudgetYearTwo": {
                    "val": "26.416"
                },
                "BudgetYearThree": {
                    "val": "26.074"
                },
                "BudgetYearFour": {
                    "val": "27.599"
                },
                "BudgetYearFive": {
                    "val": "28.151"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0301144K"
                },
                {
                    "val": "0303122K"
                },
                {
                    "val": "0701113K"
                },
                {
                    "val": "0303149K"
                },
                {
                    "val": "0303134K"
                }
            ]
        },
        "Description": {
            "val": "Multinational Information Sharing (MNIS):\n\nMNIS is a portfolio of three coalition information sharing capabilities (Combined Enterprise Regional Information Exchange System (CENTRIXS), Pegasus, and the Combined Federated Battle Laboratory Network (CFBLNet) designed to enable and improve sharing of operational and intelligence among United States (US) forces and multinational partners.  This program directly supports five combatant commands and is critical because US forces no longer fight and win independently but rely on close coordination and collaboration with allies and other mission partners.  MNIS increases overall combat effectiveness by leveraging capabilities and information from all partners and reducing the possibility of fratricide. \n \n• CENTRIXS consists of multiple, isolated Communities of Interest (COI) that support multinational efforts including Overseas Contingency Operations and counter-narcotics operations.  Common Mission Network Transport (CMNT) provides the backbone that enables Network Operations (NETOPS) centers to manage individual networks more efficiently.  CMNT provides a common transport for encrypted traffic to meet mission partner communication requirements and facilitate the movement of Virtual Private Network traffic between segments.  This capability supports Department of Defense (DoD) Instruction 8110.1 guidance to integrate CENTRIXS and other operational networks into existing DoD general service communications infrastructure as a separate network servicing all DoD MNIS requirements.\n\n• Pegasus interconnects the National Command and Control (C2) systems of Australia, Canada, New Zealand, United Kingdom and the United States using Cross Domain Solutions to enable information sharing in facilitating situational awareness and strategic planning as well as operational execution. \n  \n• CFBLNet provides a controlled Research, Development, Trials and Assessment coalition information sharing sandbox is used to evaluate new technologies and to develop tactics, techniques, and procedures that facilitate the transition of promising technologies and capabilities into operational multinational information sharing capability enhancements.\n\nFY 2017: ($0.623) Procured NSA encryptor hardware to support classified networks on two Service Delivery Node (SDN) locations.  \n\nFY 2018: ($0.708)  Will perform technical refresh of NSA cryptographic equipment at two coalition node locations that support cryptographically isolated network data traffic for Coalition Allies and Mission Partners.\n\t\t\t\t\t\t\t\t\t\t\t\nExplanation of Change from FY 2017 to FY 2018: The increase  of +$0.085 between FY 2017 and FY 2018 is to support additional cryptographic COMSEC hardware devices from NSA that support coalition information sharing at infrastructure node locations \t\t\t\t\t\t\t\t\t\t\t\n\nFY 2019: ($0.000)  \t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nExplanation of Change from FY 2018 to FY 2019: The decrease of -$0.708 between FY 2018 and FY 2019 is due to the functional transfer of the MNIS program to the Air Force beginning in FY 2019.                                                                                                                                                                                                   \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nPerformance Metrics:  \n\n-  System provides 99.99% data integrity for authorized users sharing information cross COI.                 \nFY17 (Planned): N\/A\n\n-  Maintain 99.99% Confidentiality for users, by Nation between COIs.                                         \nFY17 (Estimated): N\/A\n\n-  Direct traffic with 99.99% accuracy for chat, email, VoIP, file transfer, data storage and web service.\nFY17 (Estimated): N\/A\n  \nPerformance Metric:   \n-  Deny 98.5% of unauthorized user attempts                                                                 \nFY17 (Estimated): N\/A\n\nPerformance Metric:   \n-  Audit log captured 99.99% of any unauthorized user activity                                                 \nFY17 (Estimated): N\/A\n   \nPerformance Metric: \n- 2 sites receiving cryptographic tech refresh and\/or hardware replaced prior to End of Life (EOL) per FY.\n                                            \nFY17: 2 Planned \/ 2 Actual\nFY18: 2 Planned\n   \nWhite House Situation Support Staff (WHSSS):  \n \nWHSSS provides classified communications, computer, and intelligence for the White House Situation Room, the National Security Staff, and other White House offices. WHSSS delivers the ability to meet and maintain a rate of 99.99% reliable telecommunications and information services through state-of-the-art equipment and technology, at the best possible price to the public.   \n \nFY 2017: ($8.329) Continued to upgrade and secure critical systems that support classified voice, data and video used in the White House Situation Room and throughout the NSC for the President, Vice President, White House Senior Staff, Executive Office of the President and the inter-agency as directed by the Assistant to the President for National Security Affairs.  These systems are also used at White House COOP and COG locations, Trip Sites and residences.  Funding also supported costs associated with increased NSC mission requirements related to the Presidential Information Technology Community (PITC) initiative requiring WHSSS to support additional EOP classified IT network infrastructure including ~1700 new classified accounts, 400 classified workstations, increase server capacities, COOP\/COG tech refresh, SIPR VTC refresh infrastructure and 10 geographically separated units.\n     \nFY 2018: ($8.750) Will continue to upgrade and secure critical systems that support classified voice, data and video used in the White House Situation Room and throughout the NSC for the President, Vice President, White House Senior Staff, Executive Office of the President and the inter-agency as directed by the Assistant to the President for National Security Affairs.  These systems are also used at White House COOP and COG locations, Trip Sites and residences.  Also, funding will continue to support costs associated with increased NSC mission requirements related to the Presidential Information Technology Community (PITC) initiative. \n\nExplanation of change from FY 2017 to FY 2018:  The increase of +$0.421 will procure additional equipment to support the EOP classified IT infrastructure and capabilities. \n\nFY 2019: ($8.900) Will continue to upgrade and secure critical systems that support classified voice, data and video used in the White House Situation Room and throughout the NSC for the President, Vice President, White House Senior Staff, Executive Office of the President and the inter-agency as directed by the Assistant to the President for National Security Affairs.  These systems are also used at White House COOP and COG locations, Trip Sites and residences.  Also, funding will continue to support costs associated with increased NSC mission requirements related to the Presidential Information Technology Community (PITC) initiative.  \t\n\t\t\t\t\t\t\t\t\t\t\nExplanation of change from FY 2018 to FY 2019:  The increase of +$0.150 from FY 2018 to FY 2019 is due to an increase in PITC IT network infrastructure requirements. \n\t\t\t\t\t\t\t\t\t\nPerformance Metrics: Conducts quarterly Independent Process Reviews to maximize performance.  Status is electronically monitored for outages to ensure 99.99% reliable classified telecommunications and information services.\n\nFY17 (Met): 99.99%\nFY18 (Target): 99.99%\nFY19 (Target): 99.99%\n\nCrisis Management System (CMS) and National Leadership Communications:  \n\nThe CMS is a high performance network that provides classified multi-media teleconferencing for the President, Cabinet Secretaries, designated agency directors, and their staff.  CMS provides near perfect reliability and communications survivability expected by national decision makers.  The expansion of the Executive Voice over Secure IP (VoSIP) telephone network will continue at Presidential locations and other key CMS sites.  \n \nFY 2017: ($6.377)  Continued replacement of router, switch, and codec replacement of equipment reaching EOL to enhance system reliability, availability, and security.  Replaced system call manager reaching EOL.  Continued phases of CMS installation at Western Watch Center as directed by National Security Council.  Upgraded CMS equipment and capabilities for systems security.  Deployed next generation TEMPEST executive travel kit for use by executive principals and staff.  Supported implementation of CMS aboard executive aircraft.  Complete change of administration tasks required by Executive Office of the President (EOP).  \n\nFY 2018: ($6.025)   Will continue replacement of router, switch, and codec replacement of equipment reaching EOL to enhance system reliability, availability, and security.  Will continue phases of CMS installation at Western Watch Center as directed by National Security Council.\n\nExplanation of Change from FY 2017 to FY 2018: The decrease of -$0.352 from FY 2017 to FY 2018 is due to the procurement of equipment required for system security upgrades to meet accreditations as well as perform necessary security upgrades and improvements requested by Program Stakeholders and Mission Partners.\n\nFY 2019: ($9.949)   Will continue replacement of router, switch, and codec replacement of equipment reaching EOL to enhance system reliability, availability, and security.  Will continue phases of CMS installation at Western Watch Center as directed by National Security Council. \t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nExplanation of Change from FY 2018 to FY 2019: The increase of +$3.924 from FY 2018 to FY 2019 will accelerate life cycle replacement of equipment for increased system security and to meet the system accreditor's requirements based on a previously conducted detailed evaluation.   \t\t\t\t\t\t\t\t\n\nPerformance Metrics: CMS primary performance metrics will include:\n\n1. System availability                                                                                 \nFY 2017   Target 98%  \/ 98% Achieved\nFY 2018   Target 98%\nFY 2019   Target 98%\n\n2. System emergency repair response time within guideline                    \nFY 2017   Target 95% \/ 97% Achieved\nFY 2018   Target 95%\nFY 2019   Target 95%\n\n3. System technology refreshment routers\/switches accomplished \nFY 2017   Target 100%  \/ 100% Achieved\nFY 2018   Target 100%  \nFY 2019   Target 100%\n\nDISA Europe (DISA-EUR) and DISA Pacific (DISA-PAC):\n\nThe DISA Europe and DISA Pacific Field Commands support the deployment, sustainment and agile operation of the DISA Enterprise to provide critical capabilities in the US European Command (USEUCOM) and US Pacific Command (USPACOM) theaters.  DISA EUR and DISA PAC funding procures cargo carrying vehicles to transport personnel and equipment to perform various tasks to include network outages, performance evaluations, site surveys, and equipment installations and upgrades.  Personnel are required to use the government vehicles for Temporary Duty (TDY) purposes, which decreases cost of commercial transportation while on TDY status.  The planned replacement cycle between DISA EUR and DISA PAC is to alternate years.  Odd years a vehicle in DISA EUR will be replaced and in the even years, two vehicles will be replaced in DISA PAC.\n  \nFY 2017:   ($0.034)  Replaced one cargo carrying vehicle for DISA-EUR.\n\nFY 2018 : ($0.058)  Two cargo carrying vehicles will be replaced for DISA-PAC; one in Japan and one in Korea.  \n\nExplanation of Change from FY 2017 to FY 2018:  The increase of +$0.024 from FY 2017 to FY 2018 is due to different configurations and specific vehicle types for two vehicle purchases in Japan and Korea.\n\nFY 2019: ($0.036)   One cargo carrying vehicle will be replaced for DISA-EUR.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\nExplanation of Change from FY 2018 to FY 2019:  The decrease of -$0.022 from FY 2018 to FY 2019 is due to the replacement of one cargo vehicle in DISA-EUR versus two in DISA-PAC.\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\nPerformance Metrics: \nFY17 (Planned) 1 vehicle; 1 vehicle purchased \nFY18 (Planned) 2 vehicles \nFY19 (Planned) 1 vehicle \n\nLSA COOP Program\n\nThis program supports National Leadership Command Capabilities and is classified. Additional detail provided upon request.\n\nFY2017: ($0.000)\nFY2018: ($0.000)\n\nExplanation of Change from FY 2017 to FY 2018: There is no change. \n\nFY2019: ($9.001) This program is classified. \n\nExplanation of Change from FY 2018 to FY 2019: This program supports National Leadership Command Capabilities and is classified. Additional detail provided upon request."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Items Less Than $5 Million"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Items Less Than $5 Million"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Crisis Management System (CMS)"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "3"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "36.286"
                                                    },
                                                    "PriorYear": {
                                                        "val": "6.377"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "6.025"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9.949"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9.949"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "12.095"
                                                    },
                                                    "PriorYear": {
                                                        "val": "6.377"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "6.025"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9.949"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9.949"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "White House Situation Support Staff (WHSSS)"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "3"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "31.357"
                                                    },
                                                    "PriorYear": {
                                                        "val": "8.329"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "8.75"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.9"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.9"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "10.452"
                                                    },
                                                    "PriorYear": {
                                                        "val": "8.329"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "8.75"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.9"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.9"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "DISA Pacific and Europe Field Commands"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "5"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.467"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.034"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.058"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.036"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.036"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.093"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.034"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.058"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.036"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.036"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Multinational Information Sharing (MNIS)"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "34"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "21.709"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.623"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.708"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.639"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.623"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.708"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "LSA COOP Program"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.996"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9.001"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9.001"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.498"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9.001"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9.001"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "White House Communications Agency (WHCA)"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "8"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "212.927"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "26.616"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Senior Leadership Enterprise (SLE)"
                                            },
                                            "ItemNumber": [],
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "218.271"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "218.271"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "522.013"
                                        },
                                        "PriorYear": {
                                            "val": "15.363"
                                        },
                                        "CurrentYear": {
                                            "val": "15.541"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.886"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.886"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "522.013"
                            },
                            "PriorYear": {
                                "val": "15.363"
                            },
                            "CurrentYear": {
                                "val": "15.541"
                            },
                            "BudgetYearOneBase": {
                                "val": "27.886"
                            },
                            "BudgetYearOne": {
                                "val": "27.886"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "category"
            }
        }
    }
}