{
    "id": "2019-DefenseContractManagementAgency-PB-0300D-JBOOK-b079771601b4a06c2a58513b512f03dfd258cd8e37727cd90da13dbffe82972a-0",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-DEFENSE_DCMA-U_PROCUREMENT_JustificationBook_Defense_Contract_Management_Agency_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Contract_Management_Agency_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Contract Management Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "500"
        },
        "LineItemTitle": {
            "val": "Major Equipment"
        },
        "P1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Contract Management Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "27"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DCMA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "13.148"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "4.347"
                },
                "BudgetYearOneBase": {
                    "val": "3.873"
                },
                "BudgetYearOne": {
                    "val": "3.873"
                },
                "BudgetYearTwo": {
                    "val": "2.916"
                },
                "BudgetYearThree": {
                    "val": "2.945"
                },
                "BudgetYearFour": {
                    "val": "2.974"
                },
                "BudgetYearFive": {
                    "val": "3.033"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "13.148"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "4.347"
                },
                "BudgetYearOneBase": {
                    "val": "3.873"
                },
                "BudgetYearOne": {
                    "val": "3.873"
                },
                "BudgetYearTwo": {
                    "val": "2.916"
                },
                "BudgetYearThree": {
                    "val": "2.945"
                },
                "BudgetYearFour": {
                    "val": "2.974"
                },
                "BudgetYearFive": {
                    "val": "3.033"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "13.148"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "4.347"
                },
                "BudgetYearOneBase": {
                    "val": "3.873"
                },
                "BudgetYearOne": {
                    "val": "3.873"
                },
                "BudgetYearTwo": {
                    "val": "2.916"
                },
                "BudgetYearThree": {
                    "val": "2.945"
                },
                "BudgetYearFour": {
                    "val": "2.974"
                },
                "BudgetYearFive": {
                    "val": "3.033"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "The Major Equipment program primarily supports two main DCMA efforts: \"Mechanization Of Contract Administration Services (MOCAS) Modernization\" and the \"IT and Service Management (ITSM) Platform\". Included in the Major Equipment program is the procurement and replacement of passenger carrying vehicles to support the DCMA overseas field offices.\n\nDCMA's requirement to procure replacement passenger carrying vehicles supports DCMA's overseas contract management mission.  Currently, DCMA maintains field offices in Germany, the Middle East, and the Pacific Rim requiring such vehicles.  DCMA is continuing to pursue efforts to convert our overseas fleet from owned passenger carrying vehicles to long term commercial leases or leases with the General Services Administration (GSA) where available. GSA vehicle lease services are currently not available outside of Germany; therefore, DCMA continues to require passenger carrying vehicle procurement authority for locations outside of Germany.\n\nMOCAS is a hardware & software computing platform used by DCMA & DFAS to administer and pay contracts issued to Defense contractors. As an integrated contract administration and payment system, MOCAS is designed to provide DCMA and DFAS with the electronic information necessary to accomplish their mission of contract and payment administration. In order to implement the MOCAS technical architecture modernization, DCMA will procure the necessary servers, storage, software, networking, and hardware. \n\nThe IT and Service Management (ITSM) Platform is used by both internal DCMA personnel and external DCMA customers to submit service center requests and receive feedback on provided Contingency Contract Administration Services. Survey and feedback data are used to initiate the appropriate corrective actions specifically where necessary upon receipt of negative surveys and\/or in the event negative trends become apparent.  The surveys within the module address areas such as: Pre-Award Acquisition Planning Support; Major Program Support; Engineering Support Services; Delivery and Schedule Management Support; Contract Management Support; Quality Assurance & Product Acceptance Support ; and, various miscellaneous support activities.  It allows training team members to formally request the development of IT training and create training plans to address apparent inefficiencies or negative trends. It is comprised of both Commercial Off-the-Shelf (COTS) and Government Off-The-Shelf (GOTS) modules implemented through an IT Service Center Platform called ChangeGear."
        },
        "Justification": {
            "val": "In FY 2019, the DCMA has a requirement to procure replacement passenger carrying vehicles ($.050) in support of the DCMA's overseas contract administration operations conducted throughout the world. The DCMA is replacing aging owned passenger carrying vehicles overseas and continuing to convert fleet to long-term commercial leases where available. With the General Services Administration's (GSA) limited support of leasing vehicles outside of Germany, the DCMA will continue to require passenger carrying vehicles procurement authority. In FY 2019, The Major Equipment program also enables the DCMA to continue procurement of servers, storage, software, networking, and hardware for implementing the modernized MOCAS Technical architecture ($1.924). In FY 2019, ($1.899) will be used for implementing the IT and Service Management (ITSM) Platform performance analytics, security operations, governance, and risk compliance capabilities within ServiceNow functionality."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}