{
    "id": "2019-Army-PB-2035A-JBOOK-35554271f0a91fa230708ec88be83fdfc05656e3b3ff8a2ef16bf19acde9d154-2",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-ARMY_OTHER_3-4-U_PROCUREMENT_JustificationBook_Army_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "2300M90101"
        },
        "LineItemTitle": {
            "val": "Base Defense Systems (BDS)"
        },
        "P1LineNumber": {
            "val": "123"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Chemical Defensive Equipment"
        },
        "ResourceSummary": {
            "Quantity": {
                "BudgetYearThree": {
                    "val": "1"
                },
                "BudgetYearFour": {
                    "val": "1"
                },
                "BudgetYearFive": {
                    "val": "2"
                },
                "Total": {
                    "val": "4"
                }
            },
            "TotalCost": {
                "PriorYear": {
                    "val": "26.572"
                },
                "CurrentYear": {
                    "val": "3.726"
                },
                "BudgetYearOneOCO": {
                    "val": "39.2"
                },
                "BudgetYearOne": {
                    "val": "39.2"
                },
                "BudgetYearThree": {
                    "val": "0.727"
                },
                "BudgetYearFour": {
                    "val": "0.705"
                },
                "BudgetYearFive": {
                    "val": "2.362"
                },
                "Total": {
                    "val": "73.292"
                }
            },
            "UnitCost": {
                "BudgetYearThree": {
                    "val": "727"
                },
                "BudgetYearFour": {
                    "val": "705"
                },
                "BudgetYearFive": {
                    "val": "1181"
                },
                "Total": {
                    "val": "18323"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "26.572"
                },
                "CurrentYear": {
                    "val": "3.726"
                },
                "BudgetYearOneOCO": {
                    "val": "39.2"
                },
                "BudgetYearOne": {
                    "val": "39.2"
                },
                "BudgetYearThree": {
                    "val": "0.727"
                },
                "BudgetYearFour": {
                    "val": "0.705"
                },
                "BudgetYearFive": {
                    "val": "2.362"
                },
                "Total": {
                    "val": "73.292"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "26.572"
                },
                "CurrentYear": {
                    "val": "3.726"
                },
                "BudgetYearOneOCO": {
                    "val": "39.2"
                },
                "BudgetYearOne": {
                    "val": "39.2"
                },
                "BudgetYearThree": {
                    "val": "0.727"
                },
                "BudgetYearFour": {
                    "val": "0.705"
                },
                "BudgetYearFive": {
                    "val": "2.362"
                },
                "Total": {
                    "val": "73.292"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "Quantity": {
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0"
                                },
                                "BudgetYearThree": {
                                    "val": "1"
                                },
                                "BudgetYearFour": {
                                    "val": "1"
                                },
                                "BudgetYearFive": {
                                    "val": "2"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "26.572"
                                },
                                "CurrentYear": {
                                    "val": "3.726"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "39.2"
                                },
                                "BudgetYearOne": {
                                    "val": "39.2"
                                },
                                "BudgetYearThree": {
                                    "val": "0.727"
                                },
                                "BudgetYearFour": {
                                    "val": "0.705"
                                },
                                "BudgetYearFive": {
                                    "val": "2.362"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "Quantity": {
                    "BudgetYearThree": {
                        "val": "1"
                    },
                    "BudgetYearFour": {
                        "val": "1"
                    },
                    "BudgetYearFive": {
                        "val": "2"
                    }
                },
                "TotalCost": {
                    "PriorYear": {
                        "val": "26.572"
                    },
                    "CurrentYear": {
                        "val": "3.726"
                    },
                    "BudgetYearOneOCO": {
                        "val": "39.2"
                    },
                    "BudgetYearOne": {
                        "val": "39.2"
                    },
                    "BudgetYearThree": {
                        "val": "0.727"
                    },
                    "BudgetYearFour": {
                        "val": "0.705"
                    },
                    "BudgetYearFive": {
                        "val": "2.362"
                    }
                }
            }
        },
        "Description": {
            "val": "Base Defense Systems (BDS) includes Non-Intrusive Inspection Systems (NIIS) (M90108), Battlefield Anti-Intrusion System (BAIS) (M90202), Lighting Kit Motion Detection (LKMD) (M90204), Integrated Ground Security, Surveillance and Response Capability (IGSSR-C)(M90106) Ground-Based Operational Surveillance System (Expeditionary) (GBOSS-E) (M90212), Tactical Security System (TSS) (M90220) and Integrated Base Defense (IBD) Kitting (M90115) \n\nNIIS is a family of systems that inspects for the presence of explosives, weapons and other contraband in vehicles, cargo containers and personnel from a distance providing stand-off ballistic and blast protection.  The current family of systems includes the Z-backscatter Van (ZBV), Military Mobile Vehicle and Cargo Inspection System (MMVACIS) and personnel scanners such as the Secure-1000. All systems are either mobile or fully re-locatable.  It is a force multiplier that maximizes protection of personnel, equipment and installations while minimizing manpower requirements.  NIIS provides the capability to non-intrusively inspect vehicles, cargo containers and personnel for the presence of explosives, weapons or other contraband which can kill or injure Soldiers and destroy critical warfighting materiel.  NIIS supports the urgent need for Counter-Improvised Explosive Device equipment to support military operations.   \n\nBAIS is a compact, modular, light-weight, unattended tactical ground seismic\/acoustic sensor that provides tactical units and Forward Operating Bases with an enhanced force protection capability.  BAIS enhances force protection and provides early detection and warning of personnel and wheeled or tracked vehicles, increasing situational awareness during defensive and ambush-type operations.  BAIS can be integrated into a layered system of systems force protection plan for small tactical units.  BAIS is also one of the sub-systems included in the Force Protection Suite that is part of the Base Expeditionary Targeting and Surveillance System, Combined, employed in Forward Operating Bases (FOB) and Combat Outpost (COP) defense and force protection.  BAIS provides combat Soldiers a force multiplier force protection system that significantly increases the combat potential and Soldier survivability, enhancing the probability of successful mission accomplishment.  BAIS replaces the Platoon Early Warning System (PEWS), which is no longer in production.  The Army Acquisition Objective (AAO) is 8,933 systems. \n\nLKMD is a lightweight, man-portable, easily emplaced and recoverable motion activated warning device.  LKMD provides an early detection and warning capability enhancing force protection and situational awareness during all types of combat operations.  LKMD is a motion activated (Infrared (IR) and Microwave) warning and illumination (visible light, IR and strobe) system.  LKMD can be employed in a stand-alone configuration or as part of an integrated protection plan.  LKMD provides small-unit Commanders with close-in warning of imminent intrusion and illuminates the intrusion where it occurs, permitting easier identification and facilitating appropriate responses. LKMD systems will be organic to appropriate tactical units.  LKMD provides support systems to Army units either operating in or deploying to combat theaters, thereby increasing force protection posture.  The Army fielding plan, based on the approved Basis of Issue Plan, requires systems be provided to the following types of units: Military Police, Infantry, Armor and Combat Engineers.  LKMD replaces the M49 Trip Flare, Electronic which is no longer in production.  The Army Acquisition Objective (AAO) is 23,545 systems.\n\nThe IGSSR-C is a Joint Requirement that provides a layered approach to integrate sensors, sensor systems and unmanned systems with automated fusion capabilities to create an in-depth security, surveillance and response Force Protection (FP) COP capability for CONUS fixed, OCONUS semi-fixed or expeditionary elements in all Operating Environments (OE).  This capability will enable rapid decision analysis, speed the response process as well as increase information dissemination horizontally and vertically along the chain of command and with outside supporting organizations.  IGSSR-C is a software centric fusion engine that connects legacy and emerging FP systems, legacy Chemical, Biological, Radiological, Nuclear, and Explosive (CBRNE), unmanned systems, biometric identification and forensic data systems. The desired end state is to achieve interoperability with current and emerging FP systems used by Joint Forces, Department of Defense (DoD) agencies and multi-national forces.\n\nGround-Based Operational Surveillance System (Expeditionary) (GBOSS-E) will replace the interim Persistent Surveillance System-Ground (PSS-G) Increment 1 towers with improved persistent surveillance capabilities and will provide network integration and better mobility utilizing modular configurations. GBOSS-E will replace obsolete, quick reaction capability (QRC) surveillance and force protections systems utilizing modular configurations: Light (man transportable\/detachable) for extra small base camps or small outpost\/company, Medium variant (mid sensor height) for small to medium size base, and Heavy variant (high level sensor height) for large contingency base camps. GBOSS-E will operate in a stand-alone mode or as part of an integrated network utilizing government owned software, be easily operated and maintained, and be rugged enough to support employment in expeditionary operations worldwide.\n\nThe Tactical Security System (TSS) provides a modular, scalable, lightweight, rapidly deployable, ground based security and surveillance Family of Systems designed for hasty emplacement to support short and long term security, surveillance and detection missions.  The system will be tailorable to support various missions including internment\/resettlement operations; perimeter security; internal security within base camps or installations; external security outside the perimeter and route clearance.  TSS will be employed at fixed, semi-fixed or expeditionary sites providing all weather imaging during daylight\/twilight and during periods of limited visibility regardless of environmental conditions to enhance the Commander's situational awareness and increase Soldier survivability.  TSS is designed to be employed as a stand-alone, in a layered effort or integrated with additional force protection systems including motion, acoustic, seismic, surface and subterranean detection technologies. TSS will address four of the five base camp core protection\/security capabilities identified in the IBD Concept of Operations including perimeter security, entry control, persistent surveillance and warning and alerting.  TSS can be employed in support of contingency, short-notice, early-entry operations in a variety of weather and terrain from open desert to complex urban environments.  TSS will assist in countering individuals and provide clandestine observation of detainees, individuals, either on foot or in vehicles from intruding into areas designated for security purposes.  TSS will allow the Commander to detect and observe enemy or adversarial forces from a distance prior to entering the base area of operations.  This advanced warning will allow the Commander to better deploy forces in a more effective manner to mitigate threat.\n\nThe purpose of IBD Kitting is to harvest and refurbish physical security and FP Non-Standard Equipment and package them into integrated and interoperable IBD capabilities.  IBD packages support expeditionary ground operations and provide a bridge to the enduring IBD capability.  IBD kits are integrated into a System of Systems (SoS) to provide an interim IBD capability to increase protective effectiveness, enhance situational awareness and reduce troop-to-task requirements. In support of JUONS 0540 to address the Vehicle Borne Explosive Device (VBIED) threat, additional sensor systems will be procured and integrated into the current Force Protection infrastructure.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "Justification": {
            "val": "FY19 Overseas Contingency Operation's (OCO) Procurement in the amount of $31.976 million provides hardware equipment for Integrated Base Defense (IBD) Kitting in support of Capability Retention Requirement and Implementation Plan (CRRIP). FY19 Overseas Contingency Operation's (OCO) Procurement in the amount of $7.224 million provides wide area motion imaging sensors in support of JUONS 540 capability gaps. \n\nIn accordance with Section 1815 of the FY2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities. All quantities and funding are for Active Components."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "INTEG BASE DEF NONSTAND EQUIP (IBD NS-E) KITTING"
                    },
                    "ItemNumber": {
                        "val": "M90115"
                    },
                    "SecondaryDistribution": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "CurrentYear": {
                                                "val": "3.726"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "39.2"
                                            },
                                            "BudgetYearOne": {
                                                "val": "39.2"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "CurrentYear": {
                                "val": "3.726"
                            },
                            "BudgetYearOneOCO": {
                                "val": "39.2"
                            },
                            "BudgetYearOne": {
                                "val": "39.2"
                            }
                        },
                        "NetProcurementP1": {
                            "CurrentYear": {
                                "val": "3.726"
                            },
                            "BudgetYearOneOCO": {
                                "val": "39.2"
                            },
                            "BudgetYearOne": {
                                "val": "39.2"
                            }
                        },
                        "TotalObligationAuthority": {
                            "CurrentYear": {
                                "val": "3.726"
                            },
                            "BudgetYearOneOCO": {
                                "val": "39.2"
                            },
                            "BudgetYearOne": {
                                "val": "39.2"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "IBD Govt Program Management Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "0.06"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "2.906"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.906"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IBD Equipment"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "CurrentYear": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "3.566"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "29.07"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "29.07"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "CurrentYear": {
                                                            "val": "3566"
                                                        }
                                                    }
                                                },
                                                "ManufacturerList": {
                                                    "Manufacturer": [
                                                        {
                                                            "Name": {
                                                                "val": "TBD"
                                                            },
                                                            "Location": {
                                                                "val": "TBD"
                                                            },
                                                            "HistoryPlanningList": {
                                                                "HistoryPlanning": [
                                                                    {
                                                                        "FiscalYear": {
                                                                            "val": "2018"
                                                                        },
                                                                        "PCOLocation": {
                                                                            "val": "TBD"
                                                                        },
                                                                        "AwardDate": {
                                                                            "val": "2018-01"
                                                                        },
                                                                        "FirstDeliveryDate": {
                                                                            "val": "2018-07"
                                                                        },
                                                                        "Quantity": {
                                                                            "val": "1"
                                                                        },
                                                                        "UnitCost": {
                                                                            "val": "3566"
                                                                        },
                                                                        "FundingVehicle": {
                                                                            "val": "TBD"
                                                                        }
                                                                    }
                                                                ]
                                                            }
                                                        }
                                                    ]
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IBD Kit Transportation"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "0.1"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JUONS 540 Equipment"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "3"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "3"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "6.3"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "6.3"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "2100"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2100"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JUONS 540 Intitial Spares"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "1"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.924"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.924"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneOCO": {
                                                            "val": "924"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "924"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "CurrentYear": {
                                                "val": "3.726"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "39.2"
                                            },
                                            "BudgetYearOne": {
                                                "val": "39.2"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "CurrentYear": {
                                            "val": "3.726"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "39.2"
                                        },
                                        "BudgetYearOne": {
                                            "val": "39.2"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "OverallHistoryPlanningRemarks": {
                        "val": "Repair parts are Commercial Off The Shelf (COTS) equipment and purchased from Defense Logistics Agency (DLA). Parts are procured from various vendors. Delivery dates are multiple and TBD."
                    }
                }
            ],
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Various"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "GRND-BASED OPNL SURV SYS (EXPED) (GBOSS-E)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "GRND-BASED OPNL SURV SYS (EXPED) (GBOSS-E)"
                                            },
                                            "ItemNumber": {
                                                "val": "M90212"
                                            },
                                            "SecondaryDistribution": {
                                                "ComponentList": {
                                                    "Component": [
                                                        {
                                                            "Name": {
                                                                "val": "Army Active"
                                                            },
                                                            "Cost": {
                                                                "TotalCost": {
                                                                    "PriorYear": {
                                                                        "val": "26.572"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    ]
                                                }
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "26.572"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "26.572"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "26.572"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}