{
    "id": "2019-Navy-PB-1810N-JBOOK-575cb62feb71824f7513145a69eaf3eafb3ad9a1d380c0d6f33e3f48b1681c25-28",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-NAVY_OTHER_BA2-U_PROCUREMENT_JustificationBook_Navy_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "2920"
        },
        "LineItemTitle": {
            "val": "RADIAC"
        },
        "P1LineNumber": {
            "val": "65"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shore Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "53.882"
                },
                "PriorYear": {
                    "val": "8.092"
                },
                "CurrentYear": {
                    "val": "10.718"
                },
                "BudgetYearOneBase": {
                    "val": "8.175"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "8.175"
                },
                "BudgetYearTwo": {
                    "val": "8.269"
                },
                "BudgetYearThree": {
                    "val": "8.344"
                },
                "BudgetYearFour": {
                    "val": "8.524"
                },
                "BudgetYearFive": {
                    "val": "8.693"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "53.882"
                },
                "PriorYear": {
                    "val": "8.092"
                },
                "CurrentYear": {
                    "val": "10.718"
                },
                "BudgetYearOneBase": {
                    "val": "8.175"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "8.175"
                },
                "BudgetYearTwo": {
                    "val": "8.269"
                },
                "BudgetYearThree": {
                    "val": "8.344"
                },
                "BudgetYearFour": {
                    "val": "8.524"
                },
                "BudgetYearFive": {
                    "val": "8.693"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "53.882"
                },
                "PriorYear": {
                    "val": "8.092"
                },
                "CurrentYear": {
                    "val": "10.718"
                },
                "BudgetYearOneBase": {
                    "val": "8.175"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "8.175"
                },
                "BudgetYearTwo": {
                    "val": "8.269"
                },
                "BudgetYearThree": {
                    "val": "8.344"
                },
                "BudgetYearFour": {
                    "val": "8.524"
                },
                "BudgetYearFive": {
                    "val": "8.693"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0708017N"
                }
            ]
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0603542N"
                },
                {
                    "val": "0702856N"
                }
            ]
        },
        "Description": {
            "val": "The FY 2019 funding request was reduced by $.015 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government.\n\nThe Radiation Detection, Indication and Computation (RADIAC) Program is responsible for providing radiation monitoring instruments that detect and measure ionizing radiation.  These instruments are used on all Navy, Coast Guard and Military Sealift Command vessels, and at every Navy shore installation, in order to ensure the safety of personnel, continuity of operations in radiological or nuclear contingencies, and protection of the environment.\n\n[P40A \/ M2100 - Survey Meters]: M2100.  Radiation survey meters, required by 10 CFR 20 and the Navy's mission, are used to detect, measure and monitor radiation levels in support of operations involving radioactive materials.  Navy operations associated with radioactive materials include operation of nuclear reactors, maintenance on radioactive systems or components, testing of components for structural integrity (X-ray), research, and medical diagnostics and treatment.  Additionally, radiation survey meters are used to search for, locate and intercept radioactive material, and in responding to casualties involving radioactive materials.  Where radiation survey meters are used to support operations involving radioactive material, they provide real-time information used to control personnel radiation exposure and to identify and control the spread of radioactivity.  When used to search for radioactive material, they provide an extremely reliable method of identifying radioactive material while minimizing the risk to personnel conducting these operations.\n\n[P40A \/ Radiological Detection System]: M2100, Radiological Detection System (RDS):  This is a basic RADIAC instrument used in Consequence Management and Occupational Safety and Health applications by all ships (U.S. Navy, U.S. Coast Guard and Military Sealift Command) and shore commands.  It is used to survey for radioactive surface contamination pursuant to nuclear plant operations or nuclear plant maintenance; following medical procedures involving radioactive isotopes; or casualties and events that release radioactivity into the environment such as after a nuclear reactor accident or the use of weapons involving nuclear devices or radioactivity.  It is also used to perform surveys for various types of radiation in order to monitor environmental conditions in areas and spaces immediately adjacent to where radioactive material is stored or used during routine operations; where nuclear plant operations occur; and where radioisotopes are used for maintenance, such as during industrial radiography operations.\n\nThe RDS consists of a control unit and a suite of probes that survey for different types of radioactivity (Alpha, Beta, Gamma, Neutron).  The control unit is necessary for all applications but the four probes are used for different situations.  That means the control unit will have the highest procurement objective and the four probes will be bought in varying quantities.  The probes will be configured as a separate unit of issue and provided to customers dependent upon the intended end use.\n\nThis instrument will replace the Navy's 30-year old IM-265\/PDQ Multi-Function RADIAC control unit and its ancillary probes, of which there are several thousand control units and probes in the inventory.  The procurement will be phased over multiple years.  The RDS is being developed by the Joint Project Manager, Radiological & Nuclear Defense in order that the Army, Navy, Marine Corps and Air Force will have a Joint instrument that will enable interoperability and surge support of assets from all the components to forward deployed units.\n\n[P40A \/ M2100 NWCF Contract Service Fee]: M2100 NWCF Contract Service Fee:  The PCO for hardware acquisitions is a Navy Working Capital Fund activity that charges a set fee for each contract award and modification.  The applicable fee for a given year is applied to the total value of the Cost Code hardware acquisitions.\n\n[P40A \/ M2200 - Dosimetry]: M2200.  Dosimetry consists of radiation sensitive materials that are used for detecting and measuring an individual's exposure to ionizing radiation and to aid in minimizing this exposure.  Dosimetry is required to be worn by personnel who work with sources of radioactivity or by personnel responding to casualties involving radioactivity.  Most dosimeters are small devices that are worn on the belt, on a lanyard around the neck or attached to a shirt.  Some dosimeters provide direct readout enabling the wearer to monitor and control radiation exposure.  Other types of dosimeters must be removed from the wearer to be evaluated in special dosimeter readers that extract the recorded radiation exposure value from the dosimeter.  Radiation exposure measured by dosimetry is recorded in individual medical records when formal tracking of the radiation exposure is required. \n\nIn accordance with 10 CFR 20, dosimetry is required to be worn by personnel who work with sources of radioactivity.  In the Navy this includes personnel in the Nuclear Propulsion, Nuclear Weapons, and Medical and Radiological Affairs Support programs.  In these programs radiation exposure is measured by dosimetry and recorded in individual medical records for tracking purposes.  Dosimetry is also worn by personnel responding to casualties involving radioactivity to control their exposure within acceptable levels.\n\n[P40A \/ DT-702 Card]: M2200, DT-702 Card:  The DT-702 Thermoluminescent Dosimeter (TLD) is a small metal card, a little smaller and thinner than a domino, that contains four circular slots containing different elements that are sensitive to various types of radioactivity.  The card is placed in a plastic holder so it is protected and able to be worn by personnel on a lanyard or on their clothing.  It is issued to sailors and civilians who are occupationally exposed to radiation.  This includes Navy programs such as Nuclear Propulsion, Explosive Ordnance Disposal, Nuclear Weapons, Industrial Radiography and Medical.  The DT-702 provides primary dosimetry, whereby dosage accumulated on this card can be entered into the respective person's permanent medical files.  The processes associated with the DT-702 also are compliant with        10 CFR 20 by being approved by the National Voluntary Laboratory Accreditation Program (NVLAP), which is administered by the National Institute of Standards & Technology (NIST).  The cards are issued to individuals and tracked by serial numbers.  The cards are periodically turned in (and another card is issued so there is no coverage gap) to have the dose extracted by an 8800 Reader.  The process by which the cards are read include several heating cycles that eventually make the receptor elements unusable, so the life of a TLD is finite -- about 100 reads -- and then they have to be replaced.  Cards are procured approximately every two to three years in order to achieve economic order quantity.  Under the current contract the most cost effective price is achieved at no fewer than 20,000 units.\n\n[P40A \/ DT-702 Card Holder]: M2200, DT-702 Card Holder:  A plastic case into which the DT-702 card is placed for the card's protection and so it can be worn on a lanyard or on a belt.  It has four circular windows made of specific materials of various thickness to allow the proper filtration of radiation to the dosimeter elements under each of the windows.\n\n[P40A \/ Extremity Dosimeter]: M2200, Extremity Dosimeter:  An extremity dosimeter is used to measure concentrated exposure to the hands when a radiation worker is reaching into a glove box or medical personnel are performing fluoroscopy tasks.  This item is composed of three inexpensive pieces:  1) a plastic ring ($2) to wear on a finger; 2) a dosimeter ($36) that measures exposure; and 3) a cap that secures the dosimeter to the ring.  The cap is made to a specific thickness depending on the type of radiation the dosimeter is intended to measure ($3).  These items will be procured in quantities of 3,000 each.  An average unit cost for the three items is used and all 9,000 components are shown on this one Cost Element.\n\n[P40A \/ Battlefield Dosimeter]: M2200, Battlefield Dosimeter:  A dosimeter designed for use during nuclear or radiological events involving high energy gamma and neutron irradiation.  An \"event\" can be a nuclear reactor accident, such as the Fukushima disaster in 2011, or an attack on, e.g., a Carrier Strike Group using a nuclear or radiological (dirty bomb) weapon.  The concept of operations for such a dosimeter is that it is issued at MOP (Military Operational Posture) III to allow the commander to manage the exposure received by members of recovery teams who would be deployed in order to maintain continuity of operations.  It is also used to perform triage on casualties, allowing medical personnel to most effectively allocate their resources.\n\n[P40A \/ Battlefield Dosimeter Cases]: M2200, Battlefield Dosimeter Cases:  The Battlefield Dosimeter will spend much of its time aboard ships stored in Damage Control Lockers.  The instrument will also have to be shipped to and from a RADIAC Calibration Laboratory to undergo periodic calibrations.  Because allowances for the instruments on the various ship classes range from 12 on an LCS to 700 each on a CVN, cases configured to hold different quantities (25, 50, 100) will be procured to afford the necessary protection for storage and shipping while maximizing shipboard storage space efficiency. \n\nWith the final delivery order executed on 29 September 2017, 118 cases in two size configurations were ordered using budgeted FY17 funds.\n\n[P40A \/ Battlefield Dosimeter Data & Training]: M2200, Battlefield Dosimeter Data & Training:  The Technical Data Package includes the Technical Manual, Technical Repair Standard,  Standard Calibration Procedure, Product Drawings, Electronic Magnetic Interference & Prompt Nuclear Test Report. These documents are needed to maintain, repair and calibrate the IM-276A\/PD. The test report will provide the needed objective quality evidence showing compliance)prior to delivery of the dosimeters.\n\nThe Data Acquisition System\/Calibration Software includes the hardware and calibration software used to calibrate, configure, assign, reset and re-zero the IM-276A\/PD. This software will then be submitted for NMCI certification and DADMS approval and pushed to the calibration laboratories.\n\nTraining will be conducted at a Navy RADIAC Calibration Laboratory for technicians who are responsible for the maintenance and repair of equipment.  Training will include a review of the repairable parts and step-by-step instruction on how to perform the standard calibration procedure the technicians will employ to keep the equipment adjusted to specified tolerances.\n\n[P40A \/ Electronic Personal Dosimeter]: M2200, Electronic Personal Dosimeter (EPD):  An electronic dosimeter that includes a real-time digital display of radiation dose being received.  These so-called secondary dosimeters are normally used in conjunction with the DT-702 primary dosimeter in order to provide the wearer with real-time radiation dose information and alarm features that aid workers in controlling their radiation exposure.  The DT-702 (Cost Element 2.1) is the Navy's approved dosimeter to record dose of record in each individual's medical record, but it is a \"passive\" device; i.e., it does not immediately display the dose being received.  Instead, the dose is stored on the card on four different elements. It must be turned in and read by a machine (the 8800 Reader), a process that takes weeks, and therefore does not indicate if the wearer is in imminent danger.\n\n[P40A \/ M2200 NWCF Contract Service Fee]: M2200 NWCF Contract Service Fee:  The PCO for hardware acquisitions is a Navy Working Capital Fund activity that charges a set fee for each contract award and modification.  The applicable fee for a given year is applied to the total value of the Cost Code hardware acquisitions.\n\n[P40A \/ M2400 - Other RADIAC]: M2400.  Other RADIAC.  The RADIAC Program fields 70 different families of instruments, consisting of a total of almost 43,000 instruments and 400,000 dosimeters.  Those families that fall into similar functionality have been grouped here into the M2100, M2200, M2500 and M2600 Cost Codes.  The M2400 Cost Code consists of instruments that have specialized functions that only they perform, and therefore would require an unmanageable and meaningless number of additional Cost Codes if each were addressed individually.  In the context of the family metaphor used here, these instruments are no less important but are orphans in the sense there are not many of similar functionality with which they could be grouped.\n\nThis Cost Code also supports replenishment of Ready for Issue (RFI) stocks when instruments in any Cost Code fall below stock levels sufficient to meet quarterly demand.  This Cost Element (Spares) is a Continuing element that varies year-to-year based on emergent requirements and the quantity and unit cost of the item(s) being replenished.\n\n[P40A \/ Spares]: M2400, Spares:  Purchase of additional quantities of existing models of RADIACs to replenish or supplement stocks of spare items due to minor increases in program allowances, inventory losses, or due to items being beyond economical repair.\n\n[P40A \/ M2400 NWCF Contract Service Fee]: M2400 NWCF Contract Service Fee:  The PCO for hardware acquisitions is a Navy Working Capital Fund activity that charges a set fee for each contract award and modification.  The applicable fee for a given year is applied to the total value of the Cost Code hardware acquisitions.\n\n[P40A \/ M2500 - Air Sampling Systems]: M2500.  Monitoring for airborne radioactivity is done to detect leaks from nuclear reactors or associated systems to ensure that radioactivity is not inadvertently released to the environment from these operations.  Additionally, monitoring for airborne radioactivity is performed during maintenance on radioactive components or during events that might cause radioactivity to be released to the air.  Monitoring for airborne radioactivity is normally done by drawing air across filter paper to collect airborne radioactive particles.  This filter paper is then evaluated by radiation detectors and the concentration of airborne radioactivity is calculated.  The types of airborne radioactivity monitoring systems include fixed systems and portable systems.\nFixed systems sample air from pre-determined locations and normally include built-in radiation detectors for determining the airborne radioactivity concentration.  Portable systems can be used to sample air at any desired location, but normally require the use of separate radiation detection instruments to measure the radioactive particles deposited on the filter paper to determine the airborne radioactivity concentration.\n\n[P40A \/ Air Particle Detector (APD) Ship Frames]: M2500, Air Particle Detector (APD), Ship, Frames:  Government Furnished Material (GFM) to be provided to the manufacturer of the APD Ship (IM-272\/WDQ).  This material consists of the housing and specific internal components from the IM-239\/WDQ.  The housings and identified internal components from the IM-239\/WDQ will be prepared in the depot level maintenance facility for the APD and provided to the manufacturer of the IM-272\/WDQ. Use of these housings and components reduces the overall cost of the IM-272\/WDQ and avoids the cost of a ship alteration by ensuring the IM-272\/WDQ will have the same shipboard footprint as the IM-239\/WDQ.\n\n[P40A \/ APD Ship]: M2500, Air Particle Detector, Ship:  Airborne radioactivity monitoring system that is required for use on CVNs and all submarines.   This system (IM-272\/WDQ) is a replacement for the existing IM-239\/WDQ used on all Navy nuclear ships.   The IM-272\/WDQ incorporates significant technology enhancements that will reduce spurious false alarms and reduce operator maintenance.\n\n[P40A \/ APD Ship Engineering Change Proposal]: M2500, APD Ship Engineering Change Proposal (ECP):  Naval Reactors has directed an ECP be designed and incorporated that will reduce noise and vibration for the IM-272\/WDQ in order to meet (classified) specifications for the COLUMBIA class submarines.\n\n[P40A \/ APD Ship Provisioning]: M2500, APD Ship Provisioning:  The contractor shall host a provisioning conference at which the equipment will be broken down to Source, Maintenance and Recoverability (SM&R) codes and where maintenance philosophies will be established for each part for the acoustic upgrade model.\n\n[P40A \/ APD Ship Data]: M2500, Air Particle Detector, Ship Data:  This data includes a one-time cost for Technical Manuals in FY18 for the acoustic model.  Subsequent years include the Technical Repair Standard, drawings, and production reports with every delivery order.\n\n[P40A \/ APD Ship Initial Spare Parts]: M2500, Air Particle Detector, Ship, Initial Spare Parts:  In FY17 procure initial spare parts to support fielding.  In FY19, procure two Flow Meter Test Sets.  In FY21, procure parts kits to upgrade 10 of the initial 40 units procured in FY14 to the new acoustic standard directed by Naval Reactors.\n\n[P40A \/ APD Ship Upgrade Kit]: M2500, APD Ship Upgrade Kit:  The Navy procured the first lot of IM-272 APDs in FY14.  Subsequent to that delivery order an Engineering Change Proposal was directed by Naval Reactors in order to accommodate more stringent acoustic specifications for the COLOMBIA class submarines.  Ten of the IM-272 will be retrofitted with new parts to upgrade them to the IM-272A model.\n\n[P40A \/ APD Ship Training]: M2500, APD Ship Training:  The vendor will provide maintenance and repair training for Navy technicians at two Government sites.  One site will be at the IM-272's depot level maintenance facility at PSNSY&IMF, and the other at the RADIAC Calibration Laboratory that provides fleet support for the equipment.  The sessions will be professionally filmed for distribution to the fleet to assist ships' force sailors to learn how to perform trouble shooting and basic maintenance.\n\n[P40A \/ APD Shore]: M2500, Air Particle Detector (APD) Shore:  This system is a replacement for the existing IM-239\/WDQ designed for ships that is also currently used in radiological maintenance facilities ashore.   The APD Shore incorporates significant technology enhancements that will reduce spurious false alarms and reduce operator maintenance, and since it does not need to be hardened for shipboard use, it will be cheaper to procure and maintain than the new IM-272\/WDQ units (Cost Element 4.2) being procured for ships.\n\n[P40A \/ Air Particle Sampler]: M2500, Air Particle Sampler:  Portable airborne radioactivity sampling system.  Used during radiological work or during radiological casualties to draw air across a filter paper to collect radioactive particles.  The filter paper is then evaluated using separately provided radiation detectors to determine the concentration of airborne radioactivity.\n\n[P40A \/ Tritium Monitor]: M2500, Tritium Monitor:  The AN\/PDR-73 Tritium Monitor is used at nuclear weapons storage facilities and research laboratories to sample the air for the presence of tritium, which is a toxic radiation hazard if inhaled. The current instrument is 30 years old and cannot be repaired due to obsolete components. At the current loss rate due to normal wear and tear there will be insufficient assets to meet operational requirements, so a replacement must be procured.\n\n[P40A \/ Tritium Monitor Testing, Data, Parts & Training]: M2500, Tritium Monitor Initial Spare Parts Testing, Data & Training:  In FY17 procure Electro Magnetic Interference testing, Technical Manuals, and Technical Repair Standard.  In FY19 procure initial spare parts to support fielding and factory training of RADIAC Calibration Laboratory Electronic Technicians and program engineers.\n\n[P40A \/ M2500 NWCF Contract Service Fee]: M2500 NWCF Contract Service Fee:  The PCO for hardware acquisitions is a Navy Working Capital Fund activity that charges a set fee for each contract award and modification.  The applicable fee for a given year is applied to the total value of the Cost Code hardware acquisitions.\n\n[P40A \/ M2600 - Laboratory Test Equipment]: M2600.  This Cost Code supports specialized equipment usually found in laboratories, hospitals and test facilities.  This kind of equipment is distinct enough to warrant separating it for management purposes from the M2400 Cost Code.\n\n[P40A \/ Calibrators]: M2600, Calibrators:  Calibrators are the basic tool used to calibrate all Navy radiological detection equipment.  They consist of a high energy radiological source (Cs-137) in a shielded container that is located in a specially constructed room, or \"range.\" A technician places the instrument to be calibrated at a specific calibration point in the range and remotely operates the calibrator by raising the source out of its container so that the radiological source becomes exposed and it irradiates the instrument. The instrument's response to the radiation is measured so that it can be calibrated to specific tolerances. The current suite of AN\/UDM-1B calibrators is over 30 years old, and the natural decay of the strength of the radioactive source over time restricts calibration effectiveness by limiting the scale of calibration points below American National Standards Institute (ANSI) requirements that are followed in accordance with Navy policy. Also, due to the age of the calibrators, there are several parts no longer supported by the manufacturer, and a malfunctioning calibrator (e.g., where the source gets stuck in the exposed position) poses a very high safety risk.\n\n[P40A \/ Calibrator Initial Spare Parts & Training]: M2600, Calibrator Initial Spare Parts & Training:  Initial spare parts and vendor training at each of the seven RADIAC Calibration Laboratories where the equipment will be installed.\n\n[P40A \/ M2600 NWCF Contract Service Fee]: M2600 NWCF Contract Service Fee:  The PCO for hardware acquisitions is a Navy Working Capital Fund activity that charges a set fee for each contract award and modification.  The applicable fee for a given year is applied to the total value of the Cost Code hardware acquisitions.\n\n[P40A \/ M2830 - Support - Production Engineering]: M2830, Production Engineering:  Labor cost of the government and contractor personnel who prepare the acquisitions.\n\n[P40A \/ Production Engineering Carderock]: M2830, Production Engineering:  Labor cost of the government Engineers, Health Physicists, Scientists and others who prepare the acquisitions.\n\n[P40A \/ Production Engineering ISEA]: M2830, Production Engineering In Service Engineering Agent (ISEA):  Labor cost of the contractor Engineers, Logisticians, Technical Writer, Program Analyst, and Systems Analysts who help prepare the acquisitions.\n\nA new contract was awarded in FY17 with a new alignment of engineering and logistical support that resulted in a spike in FY17 to address work backlog and a slightly higher annual outlay thereafter than previously budgeted in order to sustain requirements at an acceptable level.\n\n[P40A \/ M2830 NWCF Contract Service Fee]: M2830 NWCF Contract Service Fee:  The PCO for acquisitions is a Navy Working Capital Fund activity that charges a set fee for each contract award and modification.  The applicable fee for a given year is applied to the total value of the Cost Code services acquisition."
        },
        "Justification": {
            "val": "Title 10 of the Code of Federal Regulations, Part 20 (10 CFR 20) requires RADIAC instruments be used to ensure the safety of personnel who work with or who are exposed to radioactive materials in their work.  Additionally, the Navy's mission requires personnel and ships to have the ability to operate in radiological environments and the ability to identify and interdict radiological Weapons of Mass Destruction (WMD).  Navy programs that require RADIAC instruments for Occupational Safety & Health (OSH) reasons under the provisions of 10 CFR 20 include Naval Nuclear Propulsion, Nuclear Weapons, Medical, and Radiological Affairs Support.  Non-OSH programs include Radiological Defense, Consequence Management, Training, Technical (RADIAC calibration, shielding evaluation, research) and Radiological Search (maritime interdiction to locate or intercept WMD)."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "RADIAC"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "2) M2200 - Dosimetry"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) DT-702 Card"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "145000"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.857"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "26.6"
                                                    }
                                                }
                                            },
                                            "AllPriorYearsDeliveries": {
                                                "val": "115000"
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Thermo Fisher Scientific"
                                                        },
                                                        "Location": {
                                                            "val": "Franklin, MA"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2016"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2016-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2016-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "30000"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "46.71"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2014-05"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "IDIQ"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.2) DT-702 Card Holder"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "35000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "25000"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.642"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.5"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "18.34"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "20"
                                                    }
                                                }
                                            },
                                            "AllPriorYearsDeliveries": {
                                                "val": "35000"
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Thermo Fisher Scientific"
                                                        },
                                                        "Location": {
                                                            "val": "Oakwood Village, OH"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2018"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2018-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "25000"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "20.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2018-02"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "IDIQ"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.3) Extremity Dosimeter"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "12000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "9000"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.141"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.123"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "11.75"
                                                    },
                                                    "PriorYear": {
                                                        "val": "13.66"
                                                    }
                                                }
                                            },
                                            "AllPriorYearsDeliveries": {
                                                "val": "12000"
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Thermo Fisher Scientific"
                                                        },
                                                        "Location": {
                                                            "val": "Oakwood Village, OH"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2017"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "9000"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "13.66"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-02"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "IDDQ"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "M2200, Battlefield Dosimeter (BD): Subsequent to the Fukushima Daiichi nuclear plant incident in 2011, a capability gap was identified wherein ships in the deployed Battle Group were exposed to the lower levels of radiation normally associated with occupational radiological workers.  This hampered the continuity of operations because the existing BD is designed to record and display exposure beginning only at 10 rem (roentgen equivalent in man), a level associated with the detonation of a nuclear weapon.  This is a specification vestige of the Cold War.  The millirem, which is one thousandth of a rem, is used to measure dosages encountered in daily life, such as the amount of radiation received from medical X-rays, long airplane flights, background sources, and the lower levels of radiation normally associated with occupational radiological work, during which workers are exposed on a continuous basis and why their exposures are closely monitored and recorded.  To fill the gap, specifications were added to the new BD for a device that could provide real-time feedback of dose received at occupational levels.   This procurement has been beset by technical delays due to manufacturing defects.  In June 2016, the manufacturer self-identified that their manufacturing process of Direct Ion Storage chambers was defective and producing only 30% yield of functionally acceptable detectors.   At that rate, they could not be profitable nor meet the contractual delivery schedule.  In July 2016, a Navy team of engineers and health physicists visited manufacturing sites to ascertain if the production and quality assurance processes could be improved sufficiently enough to meet technical specifications and the delivery schedule.  Based on the team's observations, a contract modification with a revised delivery schedule and considerations was granted, but the delay prevented award of the delivery order and obligation of FY15 and FY16 funding as had been scheduled.  Subsequent Navy acceptance testing and exposure testing at White Sands Missile Range of low rate initial production units delivered from September 2016 through November 2016 identified non-compliance with several technical specifications.  After extensive consultations between the manufacturer and the Navy team, Navy findings were incorporated into the design.  Deliveries received thereafter through March 2017 have demonstrated the dosimeter now meets all specifications and the manufacturer will be able to ramp up production and meet the delivery schedule for the procurement objective.  A follow-on sole source contract is scheduled for award in September 2017.    On 5 July 2017 updated pricing for the new award was provided by the manufacturer and has been applied in the P40A effective with FY15 through FY17 available funding.   On 29 September 2017 the final delivery order on the initial contract was executed, using budgeted funds from FY15, FY16 and FY17.",
                                                "val": "2.4) Battlefield Dosimeter"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "29434"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2266"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "10275"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9175"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9175"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "5.122"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.514"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.384"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.165"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.165"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "174.02"
                                                    },
                                                    "PriorYear": {
                                                        "val": "227"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "232"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "236"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "236"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Radiation Safety & Control Services"
                                                        },
                                                        "Location": {
                                                            "val": "Stratham, NH"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2014"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2015-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2016-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "20000"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "149.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2012-12"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "IDDQ"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2015"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-03"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "4044"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "227.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2016-10"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "IDDQ"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2016"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-03"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "5390"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "227.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2017"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-03"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "2266"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "227.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2018"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2018-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-03"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "10275"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "232.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2019"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2019-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "9175"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "236.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "TBD"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "M2200, Battlefield Dosimeter Cases.  The unit price of the cases will vary with their size.  Since all three configurations are consolidated into one Cost Element and will be purchased in varying quantities in each year, the Total Cost year-to-year will not necessarily conform to inflation indices.",
                                                "val": "2.5) Battlefield Dosimeter Cases"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "200"
                                                    },
                                                    "PriorYear": {
                                                        "val": "118"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "165"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "150"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "150"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.083"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.048"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.068"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.063"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.063"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "415"
                                                    },
                                                    "PriorYear": {
                                                        "val": "405.17"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "413"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "421"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "421"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Radiation Safety & Control Services"
                                                        },
                                                        "Location": {
                                                            "val": "Stratham, NH"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2015"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-03"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "200"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "417.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2016-10"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2017"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-03"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "118"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "405.17"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2018"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2018-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-03"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "165"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "413.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2019"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2019-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "150"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "421.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.6) Battlefield Dosimeter Data & Training"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.19"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "M2200, Electronic Personal Dosimeter (EPD):  The vendor of the Navy's current EPD has extended its production from the previously announced FY17 to FY22.  The manufacturer will set aside 5,000 units for the Navy to procure if they are required, which at the present time is not deemed necessary.  But due to the high failure rate of fielded units it may become necessary to procure some of these additional units in future years in order to sustain an inventory that meets operational requirements.  In FY23 a new EPD will begin to be procured (in open competition; not necessarily from the same vendor) and an initial 100 units will be procured to provide enough instruments to validate software and logistical requirements.  There are currently approximately 30,000 EPDs in the Navy inventory, so procurement of the new model will continue as the older model becomes unsupportable and is gradually phased out.  The unit pricing in FY23 uses the pricing of the current model in FY17 as the baseline.",
                                                "val": "2.7) Electronic Personal Dosimeter"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "16338"
                                                    },
                                                    "PriorYear": {
                                                        "val": "2000"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "4.227"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.926"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "258.72"
                                                    },
                                                    "PriorYear": {
                                                        "val": "463"
                                                    }
                                                }
                                            },
                                            "AllPriorYearsDeliveries": {
                                                "val": "16188"
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Thermo Fisher Scientific"
                                                        },
                                                        "Location": {
                                                            "val": "Franklin, MA"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2016"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2016-06"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2016-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "150"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "441.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2013-07"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "IDDQ"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2017"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "2000"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "463.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2013-07"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "SS"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "IDIQ"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.8) M2200 NWCF Contract Service Fee"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.285"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.08"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.344"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.133"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.133"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "14.357"
                                        },
                                        "PriorYear": {
                                            "val": "1.691"
                                        },
                                        "CurrentYear": {
                                            "val": "3.486"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.361"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.361"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) M2400 - Other RADIAC"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) Spares"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.891"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.244"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.096"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.1"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "M2400 NWCF Contract Service Fee:  In years when serial numbered equipment is purchased through Naval Supply Systems Command, there is no associated contract service fee.",
                                                "val": "3.2) M2400 NWCF Contract Service Fee"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.173"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.003"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "7.064"
                                        },
                                        "PriorYear": {
                                            "val": "0.244"
                                        },
                                        "CurrentYear": {
                                            "val": "0.099"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.1"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.1"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) M2500 - Air Sampling Systems"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "M2500, Air Particle Detector, Ship, Frames: No GFM will be prepared in FY 2017 because no production units were ordered in 2016.  However, there was an emergent requirement in FY17 to fund changes to GFM already refurbished.  The new design to accommodate COLOMBIA class requirements dictated the need to remove and replace several parts in the already completed GFM.  The FY17 refurbishment gap will keep the existing supply of Ready for Issue IM-239\/WDQ at levels sufficient to meet demand (IM-239\/WDQ supply the cabinets and components that become the GFM).  When work resumes in FY 2018 the cost will increase by $250 per unit above inflation because of the units the contractor has already received, they have reported a failure rate of one internal component of 40%.  This is significant enough to warrant its replacement in every piece of GFM they have received or will receive in the future.  Also in FY18, 90 of the frames that were previously converted need to have additional work done to remove some components.  These 90 units were refurbished prior to completion of the final design of the IM-272\/WDQ and some components are no longer required.  The unit cost for the refurbishment of the 50 scheduled units does not change; the FY18 unit cost now reflects the additional $230K needed for the work on the previously refurbished 90 units.",
                                                "val": "4.1) Air Particle Detector (APD) Ship Frames"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "200"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "50"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "60"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "60"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.349"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.042"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.592"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.442"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.442"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "6745"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "11840"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7362"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7362"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Puget Sound NSY"
                                                        },
                                                        "Location": {
                                                            "val": "Bremerton, WA"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2013"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "** NO PCO **"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2012-11"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2013-02"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "50"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "5580.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "FundingVehicle": {
                                                                        "val": "WR"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2014"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "** NO PCO **"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2013-11"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2014-02"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "50"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "6280.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "FundingVehicle": {
                                                                        "val": "WR"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2015"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "** NO PCO **"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2014-10"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2015-01"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "50"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "6580.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "FundingVehicle": {
                                                                        "val": "WR"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2016"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "** NO PCO **"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2015-10"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2016-01"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "50"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "6700.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "FundingVehicle": {
                                                                        "val": "WR"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2018"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "** NO PCO **"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-10"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-01"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "50"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "11840.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "FundingVehicle": {
                                                                        "val": "WR"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2019"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "** NO PCO **"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2018-10"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-01"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "60"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "7362.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "FundingVehicle": {
                                                                        "val": "WR"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "M2500, Air Particle Detector, Ship: The final delivery order on the current contract was placed in June 2017 with increased, updated pricing.  The price was increased due to the acoustic modifications ordered by Naval Reactors for the COLUMBIA class submarines.  The modifications driving the unit cost increase included making the pressure vessel out of a different material, installing acoustic tiles in the upper pressure vessel, installing a new muffler, and providing factory testing of the units to meet the new acoustic standard.  A new contract for the remaining units will be competed on a build to print basis and is scheduled for award in late FY18.  Pricing for FY18 units and beyond is notional and based on the pricing of the June 2017 delivery order.  On 11 July 2017 in a meeting with Naval Reactors, they disclosed that the original plan to not place the IM-272\/WDQ on any of the NIMITZ class carriers has to be modified and the three oldest CVNs will now require these units.  This is due to the legal proscription from performing ship alterations on ships within a specified period from their decommissioning.  This has increased the procurement objective from 310 units to 338 (30 of the units procured in FY14 have been diverted from U.S. use to a Foreign Military Sales case for the United Kingdom).",
                                                "val": "4.2) APD Ship"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "40"
                                                    },
                                                    "PriorYear": {
                                                        "val": "30"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "40"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "35"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "35"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.719"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.755"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.387"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.13"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.13"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "42975"
                                                    },
                                                    "PriorYear": {
                                                        "val": "58499"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "59669"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "60862"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "60862"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Leidos"
                                                        },
                                                        "Location": {
                                                            "val": "San Diego, CA"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2014"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2014-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2015-07"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "40"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "42975.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2011-02"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2017"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-04"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "30"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "58499.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2011-02"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "TBD"
                                                        },
                                                        "Location": {
                                                            "val": "UNKNOWN"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2018"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2018-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-07"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "40"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "59669.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-11"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2019"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2019-04"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-04"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "35"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "60862.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-11"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.3) APD Ship Engineering Change Proposal"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.198"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.584"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.4) APD Ship Provisioning"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.334"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.04"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "M2500, Air Particle Detector, Ship Data:  In FY18 due to the new contract for the modified version of the unit with the acoustic upgrade, there will be a one-time extra cost for new Technical Manuals.",
                                                "val": "4.5) APD Ship Data"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.396"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.164"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.6"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.135"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.135"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.6) APD Ship Initial Spare Parts"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.097"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.783"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.25"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.25"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "125000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "125000"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "TBD"
                                                        },
                                                        "Location": {
                                                            "val": "New MFG - Loc"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2019"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2019-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "2"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "125000.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2018-09"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "TBD"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.7) APD Ship Upgrade Kit"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "10"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.2"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "20000"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "TBD"
                                                        },
                                                        "Location": {
                                                            "val": "UNKNOWN"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2018"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2018-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-04"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "10"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "20000.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2017-11"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "CPFF"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.8) APD Ship Training"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.1"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.9) APD Shore"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "110"
                                                    },
                                                    "PriorYear": {
                                                        "val": "20"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.914"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.352"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "17400"
                                                    },
                                                    "PriorYear": {
                                                        "val": "17610"
                                                    }
                                                }
                                            },
                                            "AllPriorYearsDeliveries": {
                                                "val": "50"
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Canberra Industries"
                                                        },
                                                        "Location": {
                                                            "val": "Meriden, CT"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2014"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2015-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2015-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "60"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "17400.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2012-10"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2017"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-05"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2017-11"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "20"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "17610.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2012-10"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.10) Air Particle Sampler"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "280"
                                                    },
                                                    "PriorYear": {
                                                        "val": "200"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "367"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "367"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "367"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.345"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.261"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.485"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.484"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.484"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "1232.14"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1307"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1320.48"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1319.59"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1319.59"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "Spectral Labs, Inc."
                                                        },
                                                        "Location": {
                                                            "val": "San Diego, CA"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2015"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2015-07"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2016-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "200"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "1227.43"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2014-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2016"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2016-07"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2017-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "80"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "1248.34"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2014-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2017"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-07"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "200"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "1307.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2014-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2018"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2018-07"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "367"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "1320.48"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2014-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2019"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2019-07"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2020-06"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "367"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "1319.59"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2014-06"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Initial unit cost in FY17 included testing of First Articles.  The unit cost in FY19 for procuring the same number of units (50) does not include a testing requirement.  Unit cost in FY18 is based on step ladder pricing for buying 100 units instead of 50.",
                                                "val": "4.11) Tritium Monitor"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "50"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "100"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "50"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "50"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.975"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.345"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.895"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.895"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "19500"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "13447"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "17894"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "17894"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": [
                                                    {
                                                        "Name": {
                                                            "val": "TBD"
                                                        },
                                                        "Location": {
                                                            "val": "TBD"
                                                        },
                                                        "HistoryPlanningList": {
                                                            "HistoryPlanning": [
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2017"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2017-09"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-03"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "50"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "19500.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2016-08"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2018"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2018-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2018-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "100"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "13447.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2016-08"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "FFP"
                                                                    }
                                                                },
                                                                {
                                                                    "FiscalYear": {
                                                                        "val": "2019"
                                                                    },
                                                                    "PCOLocation": {
                                                                        "val": "NSWC Carderock"
                                                                    },
                                                                    "AwardDate": {
                                                                        "val": "2019-03"
                                                                    },
                                                                    "FirstDeliveryDate": {
                                                                        "val": "2019-09"
                                                                    },
                                                                    "Quantity": {
                                                                        "val": "50"
                                                                    },
                                                                    "UnitCost": {
                                                                        "val": "17894.00"
                                                                    },
                                                                    "SpecsAvailableNow": {
                                                                        "val": "true"
                                                                    },
                                                                    "RFPIssueDate": {
                                                                        "val": "2016-08"
                                                                    },
                                                                    "ContractMethod": {
                                                                        "val": "C"
                                                                    },
                                                                    "ContractType": {
                                                                        "val": "TBD"
                                                                    }
                                                                }
                                                            ]
                                                        }
                                                    }
                                                ]
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.12) Tritium Monitor Testing, Data, Parts & Training"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.038"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.18"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.18"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "4.13) M2500 NWCF Contract Service Fee"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.312"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.252"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.613"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.215"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.215"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "7.664"
                                        },
                                        "PriorYear": {
                                            "val": "5.206"
                                        },
                                        "CurrentYear": {
                                            "val": "6.262"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.831"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.831"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) M2600 - Laboratory Test Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.3) M2600 NWCF Contract Service Fee"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.005"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "0.005"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "6) M2830 - Support - Production Engineering"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "6.1) Production Engineering Carderock"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "14.3"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.531"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.541"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.551"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.551"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "6.2) Production Engineering ISEA"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "10.462"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.42"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.325"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.332"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.332"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "With the transfer of services contract management from NAVSEA headquarters to the Warfare Centers effective in FY17, the Service Cost Center (SCC) fee is now being assessed by the Warfare Center in a lump sum, payable in OMN, as opposed to the previous practice of paying per the value of each contract modification in the same appropriation as the funding being added to the contract.  Therefore the costs previously associated with OPN funding modifications for the SCC fee have been zeroed out in the FYDP.",
                                                "val": "6.3) M2830 NWCF Contract Service Fee"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.035"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "24.797"
                                        },
                                        "PriorYear": {
                                            "val": "0.951"
                                        },
                                        "CurrentYear": {
                                            "val": "0.866"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.883"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.883"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "53.882"
                            },
                            "PriorYear": {
                                "val": "8.092"
                            },
                            "CurrentYear": {
                                "val": "10.718"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.175"
                            },
                            "BudgetYearOne": {
                                "val": "8.175"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}