{
    "id": "2019-Navy-PB-1810N-JBOOK-f8088fe6f0e9c9e604ec08541a64cf45e79f8fbeada8df29c1b3bb90ed49d7ab-7",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-NAVY_OTHER_BA3-U_PROCUREMENT_JustificationBook_Navy_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "4250"
        },
        "LineItemTitle": {
            "val": "Common Control System"
        },
        "P1LineNumber": {
            "val": "95"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Aviation Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Aircraft Support Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0.594"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.594"
                },
                "BudgetYearTwo": {
                    "val": "0.792"
                },
                "BudgetYearThree": {
                    "val": "1.188"
                },
                "BudgetYearFour": {
                    "val": "1.484"
                },
                "BudgetYearFive": {
                    "val": "11.788"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0.594"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.594"
                },
                "BudgetYearTwo": {
                    "val": "0.792"
                },
                "BudgetYearThree": {
                    "val": "1.188"
                },
                "BudgetYearFour": {
                    "val": "1.484"
                },
                "BudgetYearFive": {
                    "val": "11.788"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0.594"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.594"
                },
                "BudgetYearTwo": {
                    "val": "0.792"
                },
                "BudgetYearThree": {
                    "val": "1.188"
                },
                "BudgetYearFour": {
                    "val": "1.484"
                },
                "BudgetYearFive": {
                    "val": "11.788"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "OPN funding is required to procure and modify Common Control System (CCS) software.  \n\nThis line item provides funding to CCS Software Production, Software\/Production Engineering Support and Integrated Logistics Support. The primary mission of CCS is to provide common control across the Navy's Unmanned Systems (UxSs) portfolio to add scalable and adaptable warfighting capability, implement robust cyber security attributes, leverage existing government owned products, eliminate redundant software development efforts, consolidate product support, encourage innovation, improve cost control and enable rapid integration of unmanned system (UxS) capabilities across Aviation, Surface, Sub-Surface, and Ground domains.\n\nCCS will be a ship\/shore\/airborne\/expeditionary based common control system that provides Vehicle Management (VM) and Mission Management\/Mission Planning (MM\/MP) capabilities for Naval Group 1 through 5 Unmanned Air Vehicles (UAVs) as well as other domain UxSs. VM is the software that allows the operator to control the UxS. MM\/MP is the software that allows the operator to create mission plans and control the UxS's sensors. CCS software is based on the OSD Unmanned Control Segment (UCS) architecture which is a service oriented open architecture that is modular and scalable to meet evolving Service requirements and is also supportive of safety\/airworthiness certification and cybersecurity certification and accreditation. \n\nThis program delivers CCS capability that enables the flexibility for Ground Control Systems (GCS) that could be ship, shore, airborne, or expeditionary based to operate multiple and dissimilar Naval UxSs. CCS includes a common framework, user interface, and common components that are integrated and tested with legacy platform components. CCS is constructed with an open and modular business model with robust cybersecurity implementation and provided as Government Furnished Equipment (GFE) to UxS contractors as required.\n\nBudget Line Item (BLI) 4250 Common Control System is a New Start in FY19."
        },
        "Justification": {
            "val": "CCS deliveries to MQ-8 commence in 2019 to support planned MQ-8 control station updates.  CCS deliveries to MQ-25 in 2020 to support planned MQ-25 control station installations.\n\nSoftware Production - Funding is required to initiate the production, procurement and delivery of CCS software to MQ-8 Fire Scout in FY19. CCS is comprised of government off-the shelf (GOTS) and commercial off-the-shelf (COTS) software which will initially be hosted on legacy platform hardware. CCS funding will procure all necessary items for software production and installation (discs, hard drives, network drawings, installation manuals, and software licenses required at installation).\n\nSoftware\/Production Engineering Support - The CCS program produces software releases via an incremental development process. These releases contain changes required to retain commonality and compatibility with supported platforms, correct deficiencies, and incrementally-field new capabilities. CCS software releases are independent of platform hardware buys. Software\/Production and Engineering Support includes production support services, engineering support services, acceptance tests, certifications, site activation, cybersecurity compliance and quality assurance efforts.\n\nIntegrated Logistics Support - The CCS program will conduct on-site logistics evaluations to verify installation configurations and installation media compliant with the specified configuration. This includes the production, update and delivery of technical documentation (Technical Directives and associated compliance)."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Common Control System"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Common Control System"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1) Software Production"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.146"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.146"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Software\/Production and Engineering Support includes production support services, engineering support services, acceptance tests, certifications, site activation, cybersecurity compliance and quality assurance efforts. Software\/Production and Engineering Support increases in proportion to delivered CCS units in the Fleet.",
                                                "val": "2) Software\/Production Engineering Support"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.351"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.351"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3) Integrated Logistics Support"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.097"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.097"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.146"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.146"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.594"
                            },
                            "BudgetYearOne": {
                                "val": "0.594"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}