{
    "id": "2019-AirForce-PB-3021F-JBOOK-dcbef60cc3dbd2bc8549ff5f18605de9cf2f367dfb6232a596556a0afea0253e-11",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-AIRFORCE_SPACE-U_PROCUREMENT_JustificationBook_Air_Force_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3021F",
        "appropriation_name": "Space Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "MILSAT"
        },
        "LineItemTitle": {
            "val": "MILSATCOM"
        },
        "P1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3021F"
        },
        "AppropriationTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "41.773"
                },
                "CurrentYear": {
                    "val": "35.289"
                },
                "BudgetYearOneBase": {
                    "val": "11.265"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "11.265"
                },
                "BudgetYearTwo": {
                    "val": "11.096"
                },
                "BudgetYearThree": {
                    "val": "11.29"
                },
                "BudgetYearFour": {
                    "val": "11.52"
                },
                "BudgetYearFive": {
                    "val": "11.736"
                },
                "ToComplete": {
                    "val": "172.204"
                },
                "Total": {
                    "val": "306.173"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "41.773"
                },
                "CurrentYear": {
                    "val": "35.289"
                },
                "BudgetYearOneBase": {
                    "val": "11.265"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "11.265"
                },
                "BudgetYearTwo": {
                    "val": "11.096"
                },
                "BudgetYearThree": {
                    "val": "11.29"
                },
                "BudgetYearFour": {
                    "val": "11.52"
                },
                "BudgetYearFive": {
                    "val": "11.736"
                },
                "ToComplete": {
                    "val": "172.204"
                },
                "Total": {
                    "val": "306.173"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "41.773"
                },
                "CurrentYear": {
                    "val": "35.289"
                },
                "BudgetYearOneBase": {
                    "val": "11.265"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "11.265"
                },
                "BudgetYearTwo": {
                    "val": "11.096"
                },
                "BudgetYearThree": {
                    "val": "11.29"
                },
                "BudgetYearFour": {
                    "val": "11.52"
                },
                "BudgetYearFive": {
                    "val": "11.736"
                },
                "ToComplete": {
                    "val": "172.204"
                },
                "Total": {
                    "val": "306.173"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "PE 1203601F MILSATCOM TERMINALS\n\nMILITARY SATELLITE COMMUNICATIONS (MILSATCOM) joint-service systems collectively provide a broad range of satellite communication capabilities, including secure, jam-resistant, 24-hour worldwide communications to meet essential strategic, tactical and general-purpose operational requirements. MILSATCOM terminals support communications requirements for the President and Secretary of Defense, unified and specified commanders, uniformed services and defense agencies. Procurement funding is in program element (PE) 1203601F, MILSATCOM Terminals, except where otherwise noted.\n\nThe current and future space domain demands that space systems be responsive to new and changing threats, and can rapidly integrate new capabilities to make our warfighting force more resilient in a contested battlespace. This agility, survivability, and rapid reconstitution must extend through the entire space warfighting enterprise, to include how we learn about the threat; develop solutions; acquire, test, deploy, train, operate and integrate new systems into the greater system of systems; and ensure our space mission force is ready to defeat a thinking adversary in a complex, multi-domain battlespace. The enterprise will use all of its elements to accelerate decision-making, prototype potential solutions, rapidly integrate decision-making tools and sustain a war-winning capability by delivering multi-domain effects in, from, and through space and cyberspace enabling battle management and resilience options to \"fight through.\" \n\nThe FY 2019 funding request was reduced by $2.383 million to account for the availability of prior year execution balances."
        },
        "Justification": {
            "val": "AIR FORCE WIDEBAND ENTERPRISE TERMINALS (AFWET) TERMINAL MODERNIZATION: AFWET terminals form the Satellite Communications (SATCOM) backbone of the DoD Information Network (DoDIN), operating over Wideband Global SATCOM (WGS), Defense Satellite Communications System, commercial and Allied satellites. These Enterprise terminals support the command and control requirements of Combatant Commanders worldwide and the communication requirements of the President, Secretary of Defense, Department of State (DoS), US strategic and tactical forces, and the North Atlantic Treaty Organization. The Air Force is responsible for terminal equipment at Air Force operated and maintained Enterprise ground terminal locations.  In FY2019, the Air Force funds will extend the life of the system, sustain operational suitability, safety and effectiveness, and maintain high interoperability with other DoD, Army, Navy, and Air Force strategic and tactical terminals. Procurement includes terminal modernization, installation, engineering, integration and site preparation, including radomes, facility monitoring systems, power and communication infrastructure, acceptance testing, Interconnect Facility (ICF), initial spares, Product Support Services (PSS), Advisory and Assistance Services (A&AS), system engineering, training and other related activities.  Installation, integration and site preparation costs change substantially based on location.  Life extension and modernization efforts also provide incidental increases in capability, allowing for full utilization of WGS capabilities, compliance with directives on the usage of Internet Protocol, adherence to Unified Capabilities Requirements, compliance with DISA and National Security Agency directives and more efficient and effective usage of satellite resources for jam-resistant and anti-scintillation wideband links. \n  \nGLOBAL BROADCAST SERVICE (GBS): This AF-led joint program implements a worldwide high-capacity satellite broadcast information system to provide a continuous, one-way, high-speed, high-volume flow of classified and unclassified data and imagery to garrisoned, deployed or moving forces. GBS provides DoD some relief from reliance on leased commercial satellite communications. GBS Receive Suites provide lower-echelon AF users with efficient high-data-rate in-theater to many distributed information sources via satellite-hosted GBS packages. In addition to Prime Mission Equipment, FY2019 funds will fund studies (e.g., part obsolescence, encapsulation of modem, antenna trades, Pre-Planned Product Improvement (P3I) ORD requirements), integration and installation, technical manual updates, Diminishing Manufacturing Supply (DMS), spares, systems engineering, test, training, A&AS, upgrades, incorporation of Transmission Security (TRANSEC), and other related activities.  \n \na.  GBS RECEIVE SUITES: The receive suites link users to information sources via GBS, offering worldwide service.  \n \nb.  GBS PORTABLE RECEIVE SUITES: These are Rucksack and Suitcase variants of the GBS terminals required by Special Operations Forces in forward operating areas.  \n \nc.  INTERIM NON-TRANSEC MODEM:  Interim non-TRANSEC solution was operationally accepted Nov 16.  This solution will be used until a TRANSEC solution is Operationally Accepted (OA).\n\nd.  JOINT INTERNET PROTOCOL MODEM (JIPM): On November 13, 2014, DoD Chief Information Officer (CIO) re-directed the JIPM acquisition strategy to a commercial-off-the-shelf (COTS) solution.\n\ne.  TRANSEC MODEM: GBS was funded in FY2017 thru FY2019 to continue a TRANSEC solution. \n    \nf.  GBS BROADCAST MANAGER: The Satellite Broadcast Manager (SBM) systems at two of DISA's Defense Enterprise Computing Centers (DECC) that provide the GBS broadcast to the GBS Receive Suites worldwide.   \n\nMILSATCOM SUSTAINMENT MODIFICATIONS: Provides minor modifications for MILSATCOM systems currently in sustainment and those currently fielded. No FY2019 funding is requested for PE 1203605F SATELLITE COMMUNICATIONS (SATCOMS).\n\nContinue program office and other related support activities that may include, but are not limited to studies, technical analysis, etc.\n\nRapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain.  Activities may include, but are not limited to program office support, studies, technical analysis, prototyping, etc.\n\nFY 2019:  -$2.383M Rephased GBS for underexecution."
        },
        "MDAPCode": {
            "val": "199"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "AFWET"
                    },
                    "IdCode": {
                        "val": "A"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "33.458"
                            },
                            "CurrentYear": {
                                "val": "28.833"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.986"
                            },
                            "BudgetYearOne": {
                                "val": "10.986"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "33.458"
                            },
                            "CurrentYear": {
                                "val": "28.833"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.986"
                            },
                            "BudgetYearOne": {
                                "val": "10.986"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "33.458"
                            },
                            "CurrentYear": {
                                "val": "28.833"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.986"
                            },
                            "BudgetYearOne": {
                                "val": "10.986"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "1203601F"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "AFWET - Terminal Modernization"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "PriorYear": {
                                                            "val": "3"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "26.529"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "24.267"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "7.113"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "7.113"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "PriorYear": {
                                                            "val": "8.843"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "12.134"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AFWET - Sustainment"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "3.424"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.104"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.075"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.075"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AFWET - Product Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "1.36"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.612"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.644"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.644"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "31.313"
                                            },
                                            "CurrentYear": {
                                                "val": "26.983"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "9.832"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9.832"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "31.313"
                                        },
                                        "CurrentYear": {
                                            "val": "26.983"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.832"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.832"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "AFWET - Advisory and Assistance Services (A&AS)"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.749"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.509"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.519"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.519"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "AFWET - OTHER SUPPORT"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.396"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.341"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.635"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.635"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "2.145"
                                        },
                                        "CurrentYear": {
                                            "val": "1.85"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.154"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.154"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "1203601F"
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "GBS"
                    },
                    "IdCode": {
                        "val": "A"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "8.043"
                            },
                            "CurrentYear": {
                                "val": "6.179"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.279"
                            },
                            "BudgetYearOne": {
                                "val": "0.279"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "8.043"
                            },
                            "CurrentYear": {
                                "val": "6.179"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.279"
                            },
                            "BudgetYearOne": {
                                "val": "0.279"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "8.043"
                            },
                            "CurrentYear": {
                                "val": "6.179"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.279"
                            },
                            "BudgetYearOne": {
                                "val": "0.279"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "1203601F"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "GBS - Enterprise Systems Engineering & Integration"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "6.707"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "3.923"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.279"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.279"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GBS - Technical Mission Analysis"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GBS - Receive Suites, Integration and Installation"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "1.262"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2.256"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "7.969"
                                            },
                                            "CurrentYear": {
                                                "val": "6.179"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.279"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.279"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "7.969"
                                        },
                                        "CurrentYear": {
                                            "val": "6.179"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.279"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.279"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "GBS - OTHER SUPPORT"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.074"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0.074"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "1203601F"
                                }
                            }
                        ]
                    }
                }
            ],
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Satellite Communications (SATCOM) O&M"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "CCS-C"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.272"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.277"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0.272"
                                        },
                                        "CurrentYear": {
                                            "val": "0.277"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0.272"
                            },
                            "CurrentYear": {
                                "val": "0.277"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}