{
    "id": "2019-Navy-PB-1109N-MJBOOK-0-0-2e05e4be2fe4b3f8c414ceca88c19d59eae5836a8041cf57d09b3a87efa2453e-42",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-NAVY_MARINECORPS-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2019.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6438"
        },
        "LineItemTitle": {
            "val": "Physical Security Equipment"
        },
        "P1LineNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Materials Handling Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "262.257"
                },
                "PriorYear": {
                    "val": "23.495"
                },
                "CurrentYear": {
                    "val": "53.477"
                },
                "BudgetYearOneBase": {
                    "val": "28.306"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "28.306"
                },
                "BudgetYearTwo": {
                    "val": "17.977"
                },
                "BudgetYearThree": {
                    "val": "18.362"
                },
                "BudgetYearFour": {
                    "val": "90.477"
                },
                "BudgetYearFive": {
                    "val": "39.553"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "262.257"
                },
                "PriorYear": {
                    "val": "23.495"
                },
                "CurrentYear": {
                    "val": "53.477"
                },
                "BudgetYearOneBase": {
                    "val": "28.306"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "28.306"
                },
                "BudgetYearTwo": {
                    "val": "17.977"
                },
                "BudgetYearThree": {
                    "val": "18.362"
                },
                "BudgetYearFour": {
                    "val": "90.477"
                },
                "BudgetYearFive": {
                    "val": "39.553"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "262.257"
                },
                "PriorYear": {
                    "val": "23.495"
                },
                "CurrentYear": {
                    "val": "53.477"
                },
                "BudgetYearOneBase": {
                    "val": "28.306"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "28.306"
                },
                "BudgetYearTwo": {
                    "val": "17.977"
                },
                "BudgetYearThree": {
                    "val": "18.362"
                },
                "BudgetYearFour": {
                    "val": "90.477"
                },
                "BudgetYearFive": {
                    "val": "39.553"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206313M"
                }
            ]
        },
        "Description": {
            "val": "Physical Security Systems provide systematic, uniform technological solutions to manpower intensive security requirements. Systems are used at bases and stations protecting our most important assets vital to operations - people, flight lines, classified information, Arms, Ammunition, and Explosives (AA&E), shore lines, open dessert areas, critical assets and infrastructure and providing constant, vigilant capabilities that control and restrict access and provide notification of actual and attempted unauthorized intrusion. Mass Notification System (MNS) provides immediate notice and warning to personnel living and working aboard our bases and stations in the event of security breaches via interior and exterior speaker systems, telephones and computers in the event of natural disasters, terrorist activities, weather emergencies or other events requiring immediate guidance to ensure the safety and security of personnel. These systems upgrade and replace antiquated individually purchased systems that are costly to maintain and may not meet prescribed requirements for securing U.S. assets.  The Marine Corps Electronic Security System (MCESS) Program provides a comprehensive electronic security system suite that supports collateral equipment including intrusion detection, surveillance, installation, and facility automated access control and tracking capabilities.  These systems increase efficiency\/effectiveness of available security manpower and improve security and safety at installation perimeter, flight line, restricted area, facility entry points and is now expanding to meet installation access control requirements.  Ground based radars support wide areas aboard Marine Corps installations such as expansive waterways, open airfields and dessert areas (improved assessment at long distances) allowing for greater defensive posture and response capabilities.  \n\nCollateral Equipment (CE) funds the one time initial outfitting of equipment not defined as built-in for new facilities (MILCONs), newly renovated\/refurbished facilities, and Host Nation funded construction projects.  The one time procurement includes equipment such as Mass Notification Systems, Intrusion Detection Systems, Closed Circuit TVs, Information Technology switches and routers, Passive Optical Networks, Internal Grounding Systems, Voice over Internet Protocol (VOIP), Audio Visual\/Video Teleconferencing Systems and other industrial equipment such as recycling and pulping systems, warehouse conveyor systems, and heavy maintenance equipment. \n\nIdentity Dominance System-MC (IDS-MC) is a multi-modal (fingerprint, iris and face) biometric collection system that provides the USMC a reliable and effective capability to collect, share, match, access, verify and store identity information. IDS-MC will enable the Marine to collect appropriate biometric, biographical and reference information on an individual and match this locally developed information with pre-existing information available to the expeditionary force. The system will display match results with linkage to the respective individual's biographical and reference information as well as help analyze the response, update records as appropriate, create reports and disseminate updated information in accordance with current MAGTF policy. The primary mission of IDS-MC is to provide the MAGTF with the means to identify persons encountered in the battlespace. While IDS-MC is not an intelligence analysis system, it does provide identification information in support of military intelligence and law enforcement operations by providing positive identification of persons of interest. IDS-MC is an enabler in the areas of detainee management and questioning, base access, counterintelligence screening, border control, law enforcement, displaced persons' management and aiding in humanitarian assistance missions. IDS-MC supports the tactical application of identity dominance and fully supports a forward presence, crisis response and contingency response capability. IDS will subsume the Biometrics Automated Toolset (BAT). The total AAO of 804 is required for training facilities and eleven battalion-sized elements. \n\nUtilities provide essential support to facilities for performing installation missions.  Utilities PMC funding provides the initial hardware and equipment to establish an enterprise-wide cybersecure network operating environment for the control systems that operate our utilities and the facilities systems that deliver utilities to facilities. Without this cybersecure environment, our utilities and facilities will remain vulnerable to attack that could damage or deny the use of our installations or facilities to provide mission support.  This effort answers the DoD mandate (OASD Memorandum 31 Mar 2016 to implement cybersecurity controls on the most critical facility-related control systems by the end of FY19, referencing DoDI 8500.01, Cybersecurity, Mar 2014).  To provide the cybersecure network, the hardware and equipment will be used to support the buildout of the Building and Utilities Control Systems (BUCS) Enclaves.  The enclaves will be established within Marine Corps facilities already designated for housing IT assets.  The enclaves will provide capabilities such as a resilient isolated network for the various BUCS to include increased security controls for high risk activities such as vendor or contractor maintenance, repair, or expansion of systems; consistent implementation of security controls across BUCS; comprehensive passive and active monitoring, including inheritance of security and monitoring services from the servicing Network Operations and Security Center (NOSC); increased breach isolation capabilities; patching and tech refreshes; secure sharing of control system and metering data with business systems for analysis; and to reduce total hardware count and software count, resulting in lower life cycle cost and reduced threat surface."
        },
        "Justification": {
            "val": "Beginning in FY19, Identity Dominance System has been realigned from BLI 6438 PHYSICAL SECURITY EQUIPMENT, to BLI 4652, MODIFICATIONS KIT C4FIRE SUPPORT SYSTEMS C41.\n\nFY18 Base Appropriation Request: $53.477M\n\nIDS-MC $0.498M: Supports the required remanufacture of the SEEK II handheld hardware repurposed for IDS-MC, which provides identification information in support of military intelligence and law enforcement operations by providing positive identification of persons of interest. IDS-MC is an enabler in the areas of detainee management and questioning, base access, counterintelligence screening, border control, law enforcement, displaced persons' management and aiding in humanitarian assistance missions. IDS-MC supports the tactical application of identity dominance and fully supports a forward presence, crisis response and contingency response capability.  \n\nCollateral Equipment $41.532M: Funds initial outfitting (one time procurement) of items like mass notification systems, intrusion detection systems, closed circuit TVs, passive optical networks, internal grounding systems, voice over internet telephones, switches, routers, uninterrupted power supplies, audio visual, and video teleconferencing suites.    \n\nThe increase of $29.472M from FY17 to FY18 is due to the type and number of construction projects that are currently under construction and are coming to completion in FY18, therefore requiring collateral equipment .  Without equipment, facilities such as Townsend Bombing Range, Camp Pendleton Communication Complex, Joint Strike Force Hangar at MCAS Miramar, Unmanned Aircraft System Facility at MCAS Cherry Point, Radar Air Traffic Control Facility at MCAS New River, Aircraft Hangar Facility at MCB Hawaii, and Simulator Control Facility at Camp Lejeune may not be usable for their intended purpose after construction.\n\nInstallation Security Systems $7.447M:  Funds the procurement of physical security systems and program initiatives supporting flight line security, waterside\/shoreline security, protection of classified material storage areas, Arms, Ammunition & Explosives (AA&E) and other critical assets. Funds will support the enhancement of command and control systems for the Marine Corps Expeditionary Security System (MCESS). As well as required upgrades to the family of systems to maintain compliance with DoD requirements to deploy an enterprise access control system capable of interfacing with DoD databases such as Defense Enrollment Eligibly Reporting System (DEERS) and other federal government authoritative databases.  This funding also supports Defense Policy Review Initiatives (DPRI) for Guam, Okinawa and Iwakuni.  Funding, executed by Space and Naval Warfare Center (SPAWAR), will procure, install and accredit, access control and intrusion detection for five MILCON projects. The five projects, funded by the Government of Japan (GoJ), are in direct support of the Futenma Replacement Facility (FRF) program.  The GoJ projects are (1) MC0508-T Base Communications Building, (2) MC0510-T Exchange Complex, (3) MC0514-T Bachelor Enlisted Quarters C & D, (4) MC0590-T Magazines A-D, and (5) MC2579-T Electrical Substation.  The FRF program is a bilateral agreement with the GoJ to relocate operations at MCAS Futenma to Camp Schwab. Implementation of the installation physical access control systems approval occurred in FY17.  \n\nThe decrease in funding of $3.492M from FY17 to FY18 is due to reduced requirements for CCTV\/data recording devices at installations.\n\nUtilities $4.000M:  Funds the procurement of hardware and equipment to support the buildout of the Building and Utilities Control Systems (BUCS) Enclaves at 4 Regional Commands and 15 installations.  The increase in funding of $4.000M in FY17 to FY18 is due to program implementation beginning in FY18. FY18 will be the only year of PMC funding for these efforts under the Utilities program, as all BUCS requirements will transition to the newly-created Facilities Related Control Systems (FRCS) program beginning in FY19.\n\nFY19 Base Appropriation Request: $28.306M\n\nInstallation Security Systems $4.262M: Funds the procurement of physical security systems and program initiatives supporting flight line security, waterside\/shoreline security, protection of classified material storage areas (SCIFS), Arms, Ammunition & Explosives (AA&E) and other critical assets. Funds will support the enhancement of command and control systems for the Marine Corps Electronic Security System (MCESS). Funding will also support upgrades to the family of systems to maintain compliance with Federal and DoD requirements to deploy an enterprise access control system capable of interfacing with DoD databases such as Defense Enrollment Eligibly Reporting System (DEERS) and other federal government authoritative databases. This funding also supports Defense Policy Review Initiatives (DPRI) for Guam, Okinawa and Iwakuni. \n\nThe decrease in funding of $3.185M from FY18 to FY19 is due the implementation funding for physical access control systems in the previous years.\n\nCollateral Equipment $24.044M: Funds will be used for the initial outfitting (one time procurement) of items like mass notification systems, intrusion detection systems, closed circuit TVs, passive optical networks, internal grounding systems, voice over internet telephones, switches, routers, uninterrupted power supplies, audio visual, and video teleconferencing suites. The FY19 projects include four aircraft hangars, two communications facilities, and one bachelor housing facility.  Without equipment, the buildings may not be usable for their intended purpose after construction.\n\nThe decrease of $17.488M from FY18 to FY19 is due to the fewer number and type of projects requiring collateral equipment in FY19 (FY17 MILCON projects create FY19 collateral equipment requirements).\n\nOCO: \nFY 2019 Overseas Contingency Operations (OCO) Request: N\/A"
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Physical Security Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Collateral Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Collateral Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "127.511"
                                                    },
                                                    "PriorYear": {
                                                        "val": "12.06"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "41.532"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "24.044"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "24.044"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "127.511"
                                        },
                                        "PriorYear": {
                                            "val": "12.06"
                                        },
                                        "CurrentYear": {
                                            "val": "41.532"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "24.044"
                                        },
                                        "BudgetYearOne": {
                                            "val": "24.044"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Installations Security Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Installation Security Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "112.037"
                                                    },
                                                    "PriorYear": {
                                                        "val": "10.939"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "7.447"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.262"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.262"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "112.037"
                                        },
                                        "PriorYear": {
                                            "val": "10.939"
                                        },
                                        "CurrentYear": {
                                            "val": "7.447"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.262"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.262"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "@footnote": "IDSMC software licenses have been fully procured for our AAO, and we will use the funding to fix and remanufacture the hardware for Increment 1.",
                                    "val": "3) Identity Dominance System - Marine Corps (IDS-MC)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "FY18 updated to actual plan.",
                                                "val": "3.1) IDS Marine Corps Increment II Hardware"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.498"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "FY18 updated to actual plan.",
                                                "val": "3.2) Software Support"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.693"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.496"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "2.693"
                                        },
                                        "PriorYear": {
                                            "val": "0.496"
                                        },
                                        "CurrentYear": {
                                            "val": "0.498"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) Utilities"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) Utilities"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "4"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "4"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "5) Prior Year Cumulative Funding"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "5.1) Prior Year Cumulative Funding"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "78"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "20.016"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "256615.38"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "20.016"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "262.257"
                            },
                            "PriorYear": {
                                "val": "23.495"
                            },
                            "CurrentYear": {
                                "val": "53.477"
                            },
                            "BudgetYearOneBase": {
                                "val": "28.306"
                            },
                            "BudgetYearOne": {
                                "val": "28.306"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}