{
    "id": "2019-Navy-PB-1507N-JBOOK-7220bdd2727fedae09aa6c1a28334f37b13a0aa6a59fd6862f0a09a7cd134062-22",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-NAVY_WEAPONS-U_PROCUREMENT_JustificationBook_Navy_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1507N",
        "appropriation_name": "Weapons Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "2433"
        },
        "LineItemTitle": {
            "val": "Fleet Satellite Comm Follow-On"
        },
        "P1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1507N"
        },
        "AppropriationTitle": {
            "val": "Weapons Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Other Missiles"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Support Equipment & Facilities"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "2067.026"
                },
                "PriorYear": {
                    "val": "33.723"
                },
                "CurrentYear": {
                    "val": "46.357"
                },
                "BudgetYearOneBase": {
                    "val": "66.779"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "66.779"
                },
                "BudgetYearTwo": {
                    "val": "67.38"
                },
                "BudgetYearThree": {
                    "val": "53.46"
                },
                "BudgetYearFour": {
                    "val": "45.985"
                },
                "BudgetYearFive": {
                    "val": "46.907"
                },
                "ToComplete": {
                    "val": "617.197"
                },
                "Total": {
                    "val": "3044.814"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "2067.026"
                },
                "PriorYear": {
                    "val": "33.723"
                },
                "CurrentYear": {
                    "val": "46.357"
                },
                "BudgetYearOneBase": {
                    "val": "66.779"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "66.779"
                },
                "BudgetYearTwo": {
                    "val": "67.38"
                },
                "BudgetYearThree": {
                    "val": "53.46"
                },
                "BudgetYearFour": {
                    "val": "45.985"
                },
                "BudgetYearFive": {
                    "val": "46.907"
                },
                "ToComplete": {
                    "val": "617.197"
                },
                "Total": {
                    "val": "3044.814"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "2067.026"
                },
                "PriorYear": {
                    "val": "33.723"
                },
                "CurrentYear": {
                    "val": "46.357"
                },
                "BudgetYearOneBase": {
                    "val": "66.779"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "66.779"
                },
                "BudgetYearTwo": {
                    "val": "67.38"
                },
                "BudgetYearThree": {
                    "val": "53.46"
                },
                "BudgetYearFour": {
                    "val": "45.985"
                },
                "BudgetYearFive": {
                    "val": "46.907"
                },
                "ToComplete": {
                    "val": "617.197"
                },
                "Total": {
                    "val": "3044.814"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0303109N"
                },
                {
                    "val": "1203109N"
                }
            ]
        },
        "Description": {
            "val": "The Mobile User Objective System (MUOS) provides a worldwide, multi-service population of mobile and fixed-site terminal users with ultra-high frequency (UHF), narrowband, beyond line of sight satellite communications (SATCOM).  \nMUOS significantly increases performance and capacity in support of critical Combatant Command SATCOM priorities.  MUOS is the replacement system for the UHF Follow-on (UFO) system, which is currently beyond its design life.  MUOS consists of Space, Ground, and User Entry Segments.  The Space Segment consists of 5 geosynchronous satellites, one which is an on-orbit spare, and provides both a legacy UHF payload, which is backward compatible with UFO, and a Wideband Code Division Multiple Access (WCDMA) payload, which provides 3G cellular-like capability.  The Ground Segment or System consists of four world-wide radio access facilities (RAFs) and two satellite control facilities.  Each RAF includes three 60 ft. antennas, and over 50 equipment racks which house a total of 5,000 major hardware components and 250 software applications across the MUOS Program.  The RAF in Hawaii includes a Network Management Facility (NMF).  The RAFs in Hawaii and Virginia each include a Switching Facility (SF).  The User Entry Segment consists of the MUOS waveform that is ultimately integrated into MUOS-capable terminals.  The MUOS legacy capability has been in operational use since 2012, and the WCDMA capability transitioned to Early Combatant Command Use in July 2016.\n\nIn addition to providing UHF SATCOM for the Department of Defense (DoD), the Navy has the overall responsibility to deliver the end-to-end (E2E) MUOS capability to the warfighter.  This responsibility involves systems engineering, integration, and test management of all MUOS system of system activities, to include the integration of the MUOS waveform into MUOS-capable terminals and the subsequent terminal certification testing.\n\nIn June 2016 based on the results of the Multi-Service Operational Test and Evaluation-2 (MOT&E-2), Director, Operational Test & Evaluation (DOT&E) assessed MUOS not operationally effective or suitable.  As a result the program is addressing the findings and preparing for MOT&E-2B in FY19 and Full Operational Capability (FOC) has been moved to FY20. Beginning in FY17, the program's focus has been updating all four radio access facilities and two satellite control facilities to address cybersecurity requirements, tech refresh of obsolescent hardware and software, and operational deficiencies."
        },
        "Justification": {
            "val": "The FY19 budget is based on the scope of work required to update the MUOS Ground System in preparation for Operational Test in FY19 and Full Operational Capability in FY20.  Program funding increased from FY18 to FY19 as a result of MUOS Ground System obsolescence and associated cybersecurity vulnerabilities which impact the ability to obtain accreditation, transition to operations, and reliability and availability of the MUOS system.  The Ground System completed fielding in 2012, and currently 46% of the hardware (HW) and 96% of the software (SW) is obsolete. Emerging cybersecurity threats and increasing cybersecurity requirements have resulted in over 700 category I\/II cybersecurity vulnerabilities, of which 12% are directly attributable to obsolescence.  Resolution of the category I cybersecurity vulnerabilities is required by USSTRATCOM to fully transition the system to operations.  \n  \nGround System updates in FY19, which are critical to transitioning to operations, include hardware and software procurements and correction of HW\/SW issues resulting from MOT&E findings, trouble tickets, and\/or problem change requests.  FY19 funds 5 Enterprise Agile Ground System releases and 3 minor releases deployed to each of the Ground sites, and includes associated engineering, integration, test and delivery efforts to address obsolescence, cybersecurity vulnerabilities, and ensure readiness levels support the warfighter narrowband SATCOM requirements.  \n\nFY19 continues procurement of  the following equipment items in order to address obsolescence:\n\nEarth Terminal Interface Signal Processor (ETISP) - The three ETISPs per RAF are beyond the end of support, have high failure rates and long down times due to difficulty in troubleshooting, and are high risk to Wideband Code Division Multiple Access (WCDMA) availability.  This effort also provides technology refresh that increases capability to address electromagnetic interference issues with MUOS communications.   \n\nMUOS TRANSEC Controller (MTC) - The two MTCs per RAF are beyond end of support, have a failure rate that is expected to consume all spares by end of FY 19, and are high risk to satellite command and control operational availability.  \nAnti-Jam Modem (AJM) - The two AJMs per RAF are beyond end of life, approaching end of support, and have a failure rate expected to consume all spares by end of FY 19.  These are high risk to satellite command and control operational availability.   \n\nDefense Switch Network Gateway (DSNG) - The DSN Gateway in each Switch Facility is beyond end of support, and does not support the Internet Protocol Defense Switch Network (DSN) interface that DISA has transitioned to.  This results in DISA continuing to support legacy protocol for MUOS and four other programs.  This increases risk to providing DSN MUOS voice capability via DISA Teleport and DSN services.  \n\nInformation Assurance Components - Network Intrusion Devices,  and Ground System back-up\/restoral devices are beyond end of support.  This obsolescence effort addresses cybersecurity requirements.\n\nFY19 funds initial procurement efforts for the following equipment items in order to address obsolescence:\n\nHigh Assurance Internet Protocol Encryptor (HAIPE) - The KG-175A's at each ground site are beyond end of support, and require a waiver from DISA for use.  The KG 175D's at each ground site are beyond end of life, are approaching end of support and have a high failure rate.  These are high risk to satellite command and control operational availability as well as MUOS communications operational availability.\n\nWindows Obsolescence - The MUOS Ground system has approximately 300 instances of Windows versions pre-Windows 10.  This effort also includes updating the hardware platforms and associated applications when necessary to work with the Windows OS replacement.  These are high risk to cybersecurity.\n\nThe FY 2019 funding request was reduced by $0.633 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government."
        },
        "MDAPCode": {
            "val": "345"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Fleet Satellite Comm Follow-On"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "2067.026"
                            },
                            "PriorYear": {
                                "val": "33.723"
                            },
                            "CurrentYear": {
                                "val": "46.357"
                            },
                            "BudgetYearOneBase": {
                                "val": "66.779"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "66.779"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "2067.026"
                            },
                            "PriorYear": {
                                "val": "33.723"
                            },
                            "CurrentYear": {
                                "val": "46.357"
                            },
                            "BudgetYearOneBase": {
                                "val": "66.779"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "66.779"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "2067.026"
                            },
                            "PriorYear": {
                                "val": "33.723"
                            },
                            "CurrentYear": {
                                "val": "46.357"
                            },
                            "BudgetYearOneBase": {
                                "val": "66.779"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "66.779"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "The Ground System Updates line includes equipment for the entire MUOS Ground system, which includes 4 Remote Access Facilities (or Ground Stations) and 2 Satellite Control Facilities.",
                                                    "val": "1.1.1) Ground System Updates"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "130.837"
                                                        },
                                                        "PriorYear": {
                                                            "val": "33.723"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "46.357"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "66.779"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "66.779"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "130.837"
                                            },
                                            "PriorYear": {
                                                "val": "33.723"
                                            },
                                            "CurrentYear": {
                                                "val": "46.357"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "66.779"
                                            },
                                            "BudgetYearOne": {
                                                "val": "66.779"
                                            }
                                        }
                                    }
                                },
                                "NonRecurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "1.2.1) Advance Procurement Prior Years (FY2001-2010)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "118.858"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.2.2) Satellite Procurement (MUOS)"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "AllPriorYears": {
                                                            "val": "3"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "902.39"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "AllPriorYears": {
                                                            "val": "300796.667"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "1021.248"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "1152.085"
                                        },
                                        "PriorYear": {
                                            "val": "33.723"
                                        },
                                        "CurrentYear": {
                                            "val": "46.357"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "66.779"
                                        },
                                        "BudgetYearOne": {
                                            "val": "66.779"
                                        }
                                    }
                                }
                            }
                        ],
                        "Hardware": [
                            {
                                "NonRecurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "2.1.1) EELV Launch Vehicles (MUOS)"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "AllPriorYears": {
                                                            "val": "5"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "735.464"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "AllPriorYears": {
                                                            "val": "147092.8"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "735.464"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "735.464"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "3.1) EELV Launch Vehicle Production"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "37.345"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.2) Satellite Production"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "142.132"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "179.477"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}