{
    "id": "2019-DefenseContractAuditAgency-PB-0300D-JBOOK-6ce5c67081f251da43a6974ab20678b8aa6d1348fdbfde3c72731e78ea3d3009-0",
    "meta": {
        "filename": "2019-BASE_PROCUREMENT-2019-DEFENSE_DCAA-U_PROCUREMENT_JustificationBook_Defense_Contract_Audit_Agency_PB_2019.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Contract_Audit_Agency_PB_2019.xml",
        "doctype": "2019-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Contract Audit Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "20"
        },
        "LineItemTitle": {
            "val": "DCAA Major Equipment, items less than $5 million"
        },
        "P1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Contract Audit Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "11"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DCAA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "1.488"
                },
                "PriorYear": {
                    "val": "7.809"
                },
                "CurrentYear": {
                    "val": "1.475"
                },
                "BudgetYearOneBase": {
                    "val": "2.542"
                },
                "BudgetYearOne": {
                    "val": "2.542"
                },
                "BudgetYearTwo": {
                    "val": "2.541"
                },
                "BudgetYearThree": {
                    "val": "3.228"
                },
                "BudgetYearFour": {
                    "val": "3.228"
                },
                "BudgetYearFive": {
                    "val": "3.228"
                },
                "Total": {
                    "val": "25.539"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "1.488"
                },
                "PriorYear": {
                    "val": "7.809"
                },
                "CurrentYear": {
                    "val": "1.475"
                },
                "BudgetYearOneBase": {
                    "val": "2.542"
                },
                "BudgetYearOne": {
                    "val": "2.542"
                },
                "BudgetYearTwo": {
                    "val": "2.541"
                },
                "BudgetYearThree": {
                    "val": "3.228"
                },
                "BudgetYearFour": {
                    "val": "3.228"
                },
                "BudgetYearFive": {
                    "val": "3.228"
                },
                "Total": {
                    "val": "25.539"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "1.488"
                },
                "PriorYear": {
                    "val": "7.809"
                },
                "CurrentYear": {
                    "val": "1.475"
                },
                "BudgetYearOneBase": {
                    "val": "2.542"
                },
                "BudgetYearOne": {
                    "val": "2.542"
                },
                "BudgetYearTwo": {
                    "val": "2.541"
                },
                "BudgetYearThree": {
                    "val": "3.228"
                },
                "BudgetYearFour": {
                    "val": "3.228"
                },
                "BudgetYearFive": {
                    "val": "3.228"
                },
                "Total": {
                    "val": "25.539"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "Description": {
            "val": "These funds provide for the purchase of the latest technologically advanced electronic information technology equipment to support DCAA's contract audit mission.  In order to efficiently perform our audit reviews, it is essential that DCAA auditors be provided with equipment and software that are compatible with defense contractors' information technology systems, that provide access to the Agency's Management Information System and to the Internet for researching audit issues, and that provide the capability to securely electronically transmit and receive audit documents.  In addition, up-to-date equipment is needed to satisfy the hardware\/software\/communication requirements for Information Assurance compliance as well as to interface with a variety of DoD standard systems such as:  Defense Business Management System (DBMS), Defense Civilian Personnel Data System (DCPDS), Defense Civilian Pay System (DCPS), Defense Property Accountability System (DPAS), Defense Travel System (DTS), Program Budget and Accounting System (PBAS), and the Standard Procurement System (SPS).  Procurement funds will be applied to the continued upgrading of DCAA's Integrated Information Network automation efforts.\n\nFY 2017\n\nDCAA Integrated Information Network. ($7.809 million) In FY 2017, funding in the amount of $700,000 is required to support the Agency's communication projects involving access to DoD standard systems and to the Internet and World Wide Web. Funding in the amount of $816,000 is required for the replacement of local area network servers that have reached the end of their useful systems life and storage to meet DoD requirements. The components will replace those that are technologically obsolete and no longer capable of running current applications software or that are non-operational and the cost to repair exceeds the cost to replace. Funding in the amount of $1,448,000 is required for the replacement of the software used by DCAA to aid in the creation and building of the audits DCAA produces. Funding in the amount of $4,845,000 is required to address emergency warfighter readiness. Funds are required to address the needed infrastructure improvements for compute and data storage capability to improve DCAA network bandwidth and accommodate increased data traffic associated with consolidated servers and new audit software. The updated infrastructure replaces and consolidates over 250 remote servers into two locations. With the upgrades, multiple auditors and audit managers will have the capability to and directly access prior audit packages, work audits, perform real-time reviews, maintain audit oversight, and permit progress transparency, all simultaneously on the same audit. The collective result will provide the DCAA audit workforce with dependable, accessible and functional infrastructure required to perform their audit mission. Without this infrastructure audit software, DCAA will lose the opportunity gain impactful audit efficiencies that will keep our audit resources viable and better serve the Department.\n\nFY 2018\nDCAA Integrated Information Network. ($1.475 million) In FY 2017, funding in the amount of $700,000 is required to support the Agency's communication projects involving access to DoD standard systems and to the Internet and World Wide Web. Funding in the amount of $775,000 is required for the replacement of local area network servers that have reached the end of their useful systems life and storage to meet DoD requirements. The components will replace those that are technologically obsolete and no longer capable of running current applications software or that are non-operational and the cost to repair exceeds the cost to replace.\n\nFY 2019\nDCAA Integrated Information Network. ($2.542 million) In FY 2019, funding in the amount of $1,089,000 is required to continue the scheduled procurement of caseware licensing for the software used by DCAA to aid in the creation and building of the audits DCAA produces. Funding in the amount of $1,453,000 is required to support the life-cycle replacement of technologically obsolete infrastructure."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}