{
    "id": "2020-AirForce-PB-3080F-MJBOOK-0-0-32f43a028405e13288a3cdd30654b31c0257b2b6cc94e347effadb70a892396d-22",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_OTHER-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "833170"
        },
        "LineItemTitle": {
            "val": "Mission Planning Systems"
        },
        "P1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Electronics Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "15.486"
                },
                "CurrentYear": {
                    "val": "12.092"
                },
                "BudgetYearOneBase": {
                    "val": "14.508"
                },
                "BudgetYearOne": {
                    "val": "14.508"
                },
                "BudgetYearTwo": {
                    "val": "15.154"
                },
                "BudgetYearThree": {
                    "val": "14.892"
                },
                "BudgetYearFour": {
                    "val": "15.715"
                },
                "BudgetYearFive": {
                    "val": "17.984"
                },
                "Total": {
                    "val": "105.831"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "15.486"
                },
                "CurrentYear": {
                    "val": "12.092"
                },
                "BudgetYearOneBase": {
                    "val": "14.508"
                },
                "BudgetYearOne": {
                    "val": "14.508"
                },
                "BudgetYearTwo": {
                    "val": "15.154"
                },
                "BudgetYearThree": {
                    "val": "14.892"
                },
                "BudgetYearFour": {
                    "val": "15.715"
                },
                "BudgetYearFive": {
                    "val": "17.984"
                },
                "Total": {
                    "val": "105.831"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "15.486"
                },
                "CurrentYear": {
                    "val": "12.092"
                },
                "BudgetYearOneBase": {
                    "val": "14.508"
                },
                "BudgetYearOne": {
                    "val": "14.508"
                },
                "BudgetYearTwo": {
                    "val": "15.154"
                },
                "BudgetYearThree": {
                    "val": "14.892"
                },
                "BudgetYearFour": {
                    "val": "15.715"
                },
                "BudgetYearFive": {
                    "val": "17.984"
                },
                "Total": {
                    "val": "105.831"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0208006F"
                }
            ]
        },
        "Description": {
            "val": "The Mission Planning Systems (MPS) Hardware program procures commercial-off-the-shelf (COTS) computing systems hardware and hardware-related requirements for Air Force active duty, Guard, and Reserve units worldwide.  These computing systems provide a flexible, configurable and cost-effective range of increasing capability to meet the continuum of peacetime, contingency and wartime planning requirements.  These electronic systems provide a mission data management system that efficiently interfaces with other planning systems as well as aircraft avionics.  These computing systems are procured on a four-year life cycle replacement to effectively address and\/or alleviate Diminishing Manufacturing Sources (DMS) issues.  Once procured the systems are centrally managed for all applicable AF platforms and their operational users, including Guard and Reserve Forces.\n\nThe program continues the procurement of COTS computing hardware and other devices associated with the Mission Planning Systems program.  It also continues the procurement of all capital replacement hardware used in conjunction with MPS and other pre-, post-, and in-flight mission planning software.  Together this hardware and associated software enables aircrews and other planners to plan the safest, most effective operational missions in a timely manner.  \n\nThe program procures COTS based Personal Computing (PC) Systems to include (but are not limited to) desktop computers, laptops, personal digital assistants (PDA), tablet PCs, color printers, storage devices, servers, displays, other peripherals, software and software licenses, and other support services, that together, allow the user to produce the necessary charts and other mission-specific products required to effectively perform a variety of military missions. \n\nA variety of information technology, navigation and communications hardware and software packages will also be procured each year to meet the varied needs of mission planning platforms and training units.  This PC-based capability, when integrated with corresponding mission planning software releases, provides a portable, tailorable, net-centric system for aircrews to complete the mission planning function.  The procured items also enable aircrews to effectively utilize software that has been modified to stay in sync with new capabilities incorporated into select platforms via their Operational Flight Program (OFP) update process.  They also provide a mission planning capability for precision\/autonomous guided munitions and can also be networked with other Theater Battle Management (TBM) systems to further tailor a platform's mission planning environment. \n\nThe MPS procurement strategy leverages the rapid increase in PC-based technology to enable high-end computing on increasingly smaller and more mission-oriented devices.  The programs procure PC-based systems that provide flexible, configurable, and cost effective solutions that increase tactical and strategic capabilities to meet the continuum of operations ranging from peacetime contingencies to conventional and nuclear wartime mission planning requirements.  Each segment of the program has shifted its hardware emphasis from a limited number of large, complex planning systems to more compact and personal planning devices that can be tailored to satisfy user needs.  This adjustment is a practical and efficient way to meet technology-driven challenges such as the evolutionary nature of mission planning (that necessitates recurrent hardware changes to meet overall system requirements) and advances in COTS technology that makes available new capabilities (which may lower component costs or address component\/interface obsolescence).  It is also a more effective way to address changes in the number, type, and deployment of aircraft\/weapons that force changes in the number of PC-based mission planning computers and their concept of operations.  \n\n1. MISSION PLANNING SYSTEMS (MPS) HARDWARE:  This acquisition is a continuation of procurement efforts to provide MPS-related hardware for Air Force platforms.  The program will provide a suite of COTS-based mission planning hardware and software systems that can be integrated with USAF Command, Control, Communications, Computers, and Intelligence (C4I) systems for the operation of USAF aircraft (e.g. F-22, B-1, F-16, F-15, RC\/OC-135, E-3, E-4, E-8, C-130, HC-130, EC-130, HH-60, KC-135, KC-46, C-5, KC-10, C-17, A-10, F-35, Global Hawk, U-2, B-52, B-2, UH-1, T-38) and the support of USAF training requirements.  MPS allows aircrews to electronically receive tasking orders, intelligence information, target coordinates, imagery and other information.  This information is then used to organize and prepare flight (including equipment and personnel airdrop) and weapons delivery planning data (e.g., maps, charts, imagery, flight logs, radar predications, and navigation databases) that is electronically transferred to aircraft and\/or precision-guided weapons.  MPS increases the combat effectiveness of Air Force aerial assets (including unmanned air vehicles, conventional and low-observable aircraft, and weapons) and Army guided delivery systems by supporting the use of sophisticated avionics and precision\/autonomous guided munitions.  It helps to increase wartime sortie rates while improving aircrew and aircraft survivability and aircrew readiness.\n\n2. PRECISION AERIAL DELIVERY SYSTEM (PADS): PADS provides the capability for direct delivery of cargo and equipment through high altitude, precision airdrops (principally with C-17 and C-130 aircraft).  Currently it consists of the Joint Precision Airdrop System (JPADS) acquisition effort.  JPADS is a collaborative effort with the Army, USMC, and other agencies to provide aviators the ability to accurately airdrop payloads (including supplies\/equipment and personnel) to units in the field from altitudes beyond the reach of some surface-to-air weaponry.  This portion of the program procures COTS-based computing hardware, support services and aerial delivery systems to enable completion of pre and in-flight mission planning functions as well as aerial delivery proficiency training in and with operational units. \n \nMarket surveys and analysis of COTS products will be used to support procurement decisions. This funding request will support potential DMS and obsolescence solutions, to include if optimal, life of type buys or bridge buys limited to the program of record quantity.\n\nFunding for this exhibit contained in PE 0208006F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "FY20 funding will continue procurement of a variety of computers, software, and electronic equipment to support pre-, post-, and in-flight mission planning tasks for a number of Air Force platforms. Procured hardware and other items will support and enable completion of mission planning efforts using legacy planning tools (e.g. Portable Flight Planning Software (PFPS)) as well as the Joint Mission Planning Systems (JMPS). The hardware will also accommodate planning system updates based upon new capability  incorporation via individual platform Operational Flight Programs (OFPs). All items where appropriate are centrally managed and distributed by the MPS System Support Facility. The following kinds of equipment and mission areas will be supported: \n\n1. MPS HARDWARE: FY20 funding will continue procurement of COTS-based hardware, software, and support services to include (but is not limited to) desktop computers, laptops, tablet PCs, data storage devices, servers, PDAs, monitors, software applications, warranties, and other electronic computing components.  These assets provide a portable, tailorable, network-capable system that can be integrated with MPS software to provide basic mission planning capability and full interoperability with TBM systems.  Components can also be networked with further tailor a platform's mission planning environment.  The program will procure hardware and software items, warranties, other services, and up to a 15% contingency inventory (based on the overall number of items being procured) for the following mission planning operational users: \n\nAir Combat Command (ACC): F-15, F-15 C, F-16 Block 15\/25\/30\/40\/50, F-22,F-35, E-3, E-4, E-8,RC-135, HH-60, HC-130, EC-130, U-2, Global Hawk \n\nAir Mobility Command (AMC): C-5, C-17, C-130, KC-10, KC-135, KC-46 \n\nAir Force Global Strike Command (AFGSC): B-2, B-52, B-1, UH-1 \n\nAir Education and Training Command (AETC): T-38\n\nFunding for this effort is in program element 0208006F. \n\n\n2. PRECISION AERIAL DELIVERY SYSTEMS (PADS): FY20 funding will continue the procurement of Joint Precision Airdrop Systems (JPADS) hardware, software, LRU support equipment for functional checkout (i.e. Automatic Test Equipment or ATE) and other related items.  Components include, but are not limited to:  guided delivery vehicles (e.g. ultralight, 2K, 10K); Pressure Tolerant Disk Drives (PTDD) [including solid state and pressure sealed disk drives]; precision-guided airdrop training systems; portable data storage units, engineering\/technical support, equipment storage and associated hardware warranties.  Funding for this effort is in program element 0208006F.  \n\n3. PROGRAM MANAGEMENT ADMINISTRATION: FY20 funding provides program office, engineering, and other contractor support for the Mission Planning Systems (MPS) and Joint Precision Airdrop Systems (JPADS) procurement program. Items 1b and 2i,2j in aggregated items table."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Mission Planning Systems"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1. Mission Planning Systems (MPS)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "a. MPS Hardware"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "8.72"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "7.759"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.56"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.56"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "b. MPS Program Management Administration (Contractor Services)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.683"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.703"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.724"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.724"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2. Precision Aerial Delivery Systems (PADS)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "a. PADS Dropsondes"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "b. PADS Shipping"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "c. PADS Support Services & Spares"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "d. PADS System Engineering & Logistical Support"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.427"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.499"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.501"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.501"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "e. PADS Testing"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "f. PADS Delivery Systems"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "112"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "120"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "120"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "2.44"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.984"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.984"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "21785.71"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "33200"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "33200"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "g. PADS PARANAVSYS Delivery Systems"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "129"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "5.137"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "39821.95"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "h. PADS Delivery System Riggings & Services"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "i. Program Management Administration (Government Cost)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.103"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.104"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.114"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.114"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "j. Program Management Administration (Contractor Services)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.416"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.587"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.625"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.625"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "k. PADS Ultralight"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "l. PADS Drives & Storage Devices"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "m. Depot Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "15.486"
                                        },
                                        "CurrentYear": {
                                            "val": "12.092"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.508"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.508"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Unit costs vary because different types\/configurations of equipment are being procured.\n\nMission Planning Systems (MPS) and Precision Aerial Delivery Systems (PADS) components are procured as commercial-of-the-shelf (COTS) equipment using various contracting methods, vehicles and agencies. Items are procured annually via Delivery Orders (DOs) on a variety of contract vehicles (e.g. Blanket Purchase Agreements (BPAs), Indefinite Delivery Indefinite Quantity (IDIQ) contracts, and GSA and NASA SEWP IV Contract schedules) and through agencies such as AFWAY\/NETCENTS II (Gunter AFB).\n\nMission Planning Systems (MPS)hardware assets are centrally managed by the MPS System Support Facility (SSF) at Hill AFB."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "15.486"
                            },
                            "CurrentYear": {
                                "val": "12.092"
                            },
                            "BudgetYearOneBase": {
                                "val": "14.508"
                            },
                            "BudgetYearOne": {
                                "val": "14.508"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}