{
    "id": "2020-AirForce-PB-3080F-JBOOK-436af14163fe2e9306ff706b86ab44f2d525ceb9c7dd74301eaba5aa16959d87-25",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_OTHER-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "834040"
        },
        "LineItemTitle": {
            "val": "Af Global Command & Control Sys"
        },
        "P1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "3.634"
                },
                "CurrentYear": {
                    "val": "6.152"
                },
                "BudgetYearOneBase": {
                    "val": "2.756"
                },
                "BudgetYearOne": {
                    "val": "2.756"
                },
                "BudgetYearTwo": {
                    "val": "4.813"
                },
                "BudgetYearThree": {
                    "val": "4.884"
                },
                "BudgetYearFour": {
                    "val": "6.827"
                },
                "BudgetYearFive": {
                    "val": "5.061"
                },
                "Total": {
                    "val": "34.127"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "3.634"
                },
                "CurrentYear": {
                    "val": "6.152"
                },
                "BudgetYearOneBase": {
                    "val": "2.756"
                },
                "BudgetYearOne": {
                    "val": "2.756"
                },
                "BudgetYearTwo": {
                    "val": "4.813"
                },
                "BudgetYearThree": {
                    "val": "4.884"
                },
                "BudgetYearFour": {
                    "val": "6.827"
                },
                "BudgetYearFive": {
                    "val": "5.061"
                },
                "Total": {
                    "val": "34.127"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "3.634"
                },
                "CurrentYear": {
                    "val": "6.152"
                },
                "BudgetYearOneBase": {
                    "val": "2.756"
                },
                "BudgetYearOne": {
                    "val": "2.756"
                },
                "BudgetYearTwo": {
                    "val": "4.813"
                },
                "BudgetYearThree": {
                    "val": "4.884"
                },
                "BudgetYearFour": {
                    "val": "6.827"
                },
                "BudgetYearFive": {
                    "val": "5.061"
                },
                "Total": {
                    "val": "34.127"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0303150F"
                }
            ]
        },
        "Description": {
            "val": "GLOBAL COMMAND AND CONTROL SYSTEM AIR FORCE (GCCS-AF): The GCCS-AF program provides the common AF infrastructure hardware and software necessary to pass AF command and control (C2) data among commands, their components, and the joint GCCS. This program procures GCCS components which include, but are not limited to, items such as servers, commercial-off-the-shelf (COTS) software, and associated peripherals to provide users with the full suite of joint baseline capability (including the common operating picture and Integrated Imagery & Intelligence). GCCS-AF is integrated at the following locations to establish initial and full joint connectivity and operational capability across the spectrum of intelligence, operations, war planning, manpower, and logistics: AF-supported war-fighting commands, AF critical sites, Headquarters United States Air Force, Major Command headquarters (MAJCOM), numbered air forces, wings, Air National Guard (ANG) bases, Air Force Reserve (AFR) bases, and remote sites. Each site will comply with current Air Force and Department of Defense (DoD) network initiatives by employing a standardized interface among AF base-level classified C2 networks, AF base-level network control centers, and the joint Defense Information Systems Agency (DISA) Secret Internet Protocol Router Network (SIPRNET). This program provides a flexible open system and distributed C2 architecture necessary to support the joint GCCS. GCCS supports AF operations by installing and upgrading a site's classified C2 system through extensive use of COTS technology that adheres to AF command and control, communications, and computer architectures and standards. \n\nFunding for the exhibit contained in PE 0303150F: GLOBAL COMMAND AND CONTROL SYSTEM\n\nThe FY2020 funding request was reduced by $1.855 million to account for availability of prior year execution balances.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "GLOBAL COMMAND AND CONTROL SYSTEM AIR FORCE (GCCS-AF): FY20 procurement funding procures various types and quantities of hardware and software in support of installation and unit mission\nrequirements for Air Force personnel. GCCS-AF will procure and install GCCS-Joint (GCCS-J) version 6.0 hardware and software (government-off-the-shelf and commercial-off-the-shelf) at warfighter Combatant Command (CCMD) and MAJCOM locations, providing a full spectrum of command, control, war planning, logistics, and intelligence capability from strategic to unit level operations with total joint service connectivity. The GCCS architecture supports functional users on each base and specifically incorporates war planning functions into GCCS. These fielding activities are consistent with the AF's Air Expeditionary Force (AEF) C2 structure and integration with DoD's emerging next generation joint C2 enabler."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}