{
    "id": "2020-Army-PB-2031A-JBOOK-637e408165016711b0ce5d837ca179b7366db442ade32a54318bb21964051f79-13",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_AIRCRAFT-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2031A",
        "appropriation_name": "Aircraft Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "0023A01001"
        },
        "LineItemTitle": {
            "val": "MQ-1 Payload (MIP)"
        },
        "P1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2031A"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Modification of Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Modification of Aircraft"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "278.801"
                },
                "PriorYear": {
                    "val": "70.51"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "Total": {
                    "val": "349.311"
                }
            },
            "UnitCost": {
                "AllPriorYears": {
                    "val": "3359.048"
                },
                "PriorYear": {
                    "val": "4147.647"
                },
                "Total": {
                    "val": "3493.11"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "278.801"
                },
                "PriorYear": {
                    "val": "70.51"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "Total": {
                    "val": "349.311"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "278.801"
                },
                "PriorYear": {
                    "val": "70.51"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "Total": {
                    "val": "349.311"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "70.51"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "70.51"
                    }
                }
            }
        },
        "Description": {
            "val": "Funds in this program were realigned beginning in FY2015 from the shared MQ-1 Payload-UAS funding line (SSN A00020) for more efficient, effective program management. The funds were realigned into a new shared parent SSN, MQ-1 Payloads (MIP) (SSN A01001), which includes the MQ-1 sensor payloads: Synthetic Aperture Radar\/Moving Target Indicator (SAR\/MTI) (SSN A01003), Signal Intelligence (SIGINT) (SSN A01004), and Common Sensor Payload Full Motion Video (CSP FMV) (SSN A01005).\n\nMQ-1 Payload (MIP) (A01001) budget line is shared between multiple Payload programs and two Program Managers. These Payload programs support the Army's transformation by procuring Reconnaissance, Surveillance and Target Acquisition (RSTA) and Intelligence, Surveillance and Reconnaissance (ISR) payload systems for Brigade Combat Teams, Divisions, and Corps Unmanned Aircraft Systems (UAS).  This is in accordance with Headquarters Department of the Army (HQDA) and Training and Doctrine Command (TRADOC) UAS priorities.  Common Sensor Payload (CSP), Small TActical Radar - Lightweight (STARLite), and Tactical Signals Intelligence (SIGINT) Payload (TSP) are principal payloads for the Gray Eagle UAS.  The Army Acquisition Objective (AAO) for STARLite and CSP is equivalent to aircraft\/platform quantities, one system per Gray Eagle UAS - AAO is commensurate with aircraft quantity (one STARLite and one CSP payload per aircraft).  The AAO for TSP is 112 systems.\n\nCommon Sensor Payload (CSP) Electro Optical \/ Infra Red \/ Laser Designator (EO\/IR\/LD) provides High Definition (HD) Full Motion Video (FMV) in both the Electro Optical and Mid Wave IR spectrums with day\/night capability to collect and display continuous imagery and the ability to designate targets of interest for attack by laser guided precision weapons.  It is the EO\/IR\/LD sensor for the Gray Eagle UAS which supports force applications, battlespace awareness, force protection, and net-centric operations across the battlefield to provide wide area, near real time RSTA capabilities.  Current product improvements continue to focus on the development and implementation of technologies that directly supporting emerging requirements of the Army's Current and Future Force.\n\nSmall TActical Radar - Lightweight (STARLite) SAR\/MTI is a lightweight, high performance, all weather, multi-functional radar system for the Gray Eagle Unmanned Aircraft System (UAS). The STARLite system provides wide area, near real time RSTA capabilities. It operates throughout the UAS flight mission profile in adverse weather and through battlefield obscurants. The SAR mode generates quality images for the battlefield commander for detection, classification and location of stationary commercial wheeled vehicle-size targets. The MTI mode detects moving ground targets, to include man-sized detection, and provides location information and performs cross-cue with the Electro-Optic\/Infrared (EO\/IR) sensors.\n\nThe Tactical Signals Intelligence (SIGINT) Payload (TSP) is a SIGINT sensor system for the Gray Eagle Unmanned Aircraft System (UAS) that detects radio frequency (RF) emitters. The TSP system provides a SIGINT capability to the tactical commander.  The TSP system is  a modular, scalable payload using an architecture that is software reconfigurable to allow for growth and flexibility as technology, and as the adversaries use of technology changes.  This flexible architecture allows for third party software applications to be integrated into the TSP system. The TSP system processing, control and data dissemination is integrated into the Distributed Common Ground System - Army (DCGS-A) via the Operational Ground Station. It supports Manned\/Unmanned (MUM) teaming with Brigade Combat Team ground SIGINT Terminal Guidance (STG) teams and manned airborne assets.  The TSP system improves situational awareness and shortens the targeting cycle by detecting and identifying emitters associated with high value targets (HVTs).  The TSP system is capable of processing conventional signals, standard military signals, and modern signals of interest.  This includes detection, recognition, identification, direction finding, and high confidence geo-location.\n\nMQ-1C Gray Eagle Extended Range (GE-ER) - Program Manager Unmanned Aircraft Systems(PM UAS) received a Congressional plus up of $49M President's Budget15 (PB15) to procure Extended Range UAS which increases the CPD objective endurance requirements for the current GE configuration. To meet the PM UAS GE-ER test schedule 1st QTR FY18 and first unit equipped date, TSP must be integrated and tested on the IGE and the A-Kit must be modified."
        },
        "Justification": {
            "val": "CSP: FY2020 No Base or OCO Procurement dollars.\n\nSTARLite: FY 2020 No Base or OCO Procurement dollars.\n\nTSP: FY 2020 No Base or OCO Procurement dollars.\n\nAll Quantities are for the Active component.\n\nComments:\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for the homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}