{
    "id": "2020-AirForce-PB-3080F-JBOOK-436af14163fe2e9306ff706b86ab44f2d525ceb9c7dd74301eaba5aa16959d87-5",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_OTHER-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "823230"
        },
        "LineItemTitle": {
            "val": "Security And Tactical Vehicles"
        },
        "P1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Vehicular Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Special Purpose Vehicles"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "51.28"
                },
                "CurrentYear": {
                    "val": "1.113"
                },
                "BudgetYearOneBase": {
                    "val": "1.315"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.315"
                },
                "BudgetYearTwo": {
                    "val": "1.423"
                },
                "BudgetYearThree": {
                    "val": "1.533"
                },
                "BudgetYearFour": {
                    "val": "1.575"
                },
                "BudgetYearFive": {
                    "val": "8.329"
                },
                "Total": {
                    "val": "66.568"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "51.28"
                },
                "CurrentYear": {
                    "val": "1.113"
                },
                "BudgetYearOneBase": {
                    "val": "1.315"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.315"
                },
                "BudgetYearTwo": {
                    "val": "1.423"
                },
                "BudgetYearThree": {
                    "val": "1.533"
                },
                "BudgetYearFour": {
                    "val": "1.575"
                },
                "BudgetYearFive": {
                    "val": "8.329"
                },
                "Total": {
                    "val": "66.568"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "51.28"
                },
                "CurrentYear": {
                    "val": "1.113"
                },
                "BudgetYearOneBase": {
                    "val": "1.315"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.315"
                },
                "BudgetYearTwo": {
                    "val": "1.423"
                },
                "BudgetYearThree": {
                    "val": "1.533"
                },
                "BudgetYearFour": {
                    "val": "1.575"
                },
                "BudgetYearFive": {
                    "val": "8.329"
                },
                "Total": {
                    "val": "66.568"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Air Force Active"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "120"
                                },
                                "CurrentYear": {
                                    "val": "12"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "51.28"
                                },
                                "CurrentYear": {
                                    "val": "0.965"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.171"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "1.171"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Air National Guard"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "8"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "11"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0.099"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.105"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.105"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Air Force Reserve"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "4"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "4"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0.049"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.039"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.039"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "Quantity": {
                    "PriorYear": {
                        "val": "120"
                    },
                    "CurrentYear": {
                        "val": "24"
                    },
                    "BudgetYearOneBase": {
                        "val": "15"
                    },
                    "BudgetYearOneOCO": {
                        "val": "0"
                    },
                    "BudgetYearOne": {
                        "val": "15"
                    }
                },
                "TotalCost": {
                    "PriorYear": {
                        "val": "51.28"
                    },
                    "CurrentYear": {
                        "val": "1.113"
                    },
                    "BudgetYearOneBase": {
                        "val": "1.315"
                    },
                    "BudgetYearOneOCO": {
                        "val": "0"
                    },
                    "BudgetYearOne": {
                        "val": "1.315"
                    }
                }
            }
        },
        "Description": {
            "val": "FY18 funding totals include $1.100M  appropriated for Overseas Contingency Operations.\n\nFY19 funding totals include $0.130M appropriated for Overseas Contingency Operations.\n\nJLTV PROCUREMENT FY17 & FY18 IN THIS BPAC.  FY19 AND OUT WILL BE BPAC 823210.\n\nFunding provides for a variety of security and tactical vehicles essential to strategic military operations.  This program previously procured the standard diesel powered High Mobility Multi-purpose Wheeled Vehicle (HMMWV) and all configurations used by the Air Force, Guardian Angel Air-Deployable Rescue Vehicle (GAARV), and cargo trailers.  Funding will be used to procure next generation security and tactical vehicles to include the fielding of the Joint Light Tactical Vehicle (JLTV).\n\nThe M1101 and M1102 are light tactical trailers (designated by load weight) in a single axle, two wheel trailer designed to be towed by a HMMWV towing vehicle.  The trailers have the same tires, wheels, and track width as the HMMWV.  The only difference between the M1101 and the M1102 trailer is the model information and payload capacity.  The trailers have various applications and provide the forces with a light, nimble, rugged trailer built primarily for hauling cargo.\n\nJoint Light Tactical Vehicles (JLTV) is the HMMWV replacement for the DOD.  The USAF investment in JLTVs began in FY17 and will continue through the FYDP. The USAF JLTV program will need multiple STS Work Directives generated and worked through the Joint Program Office (JPO) for USAF specific requirements and kit operability on three JLTV variants and a JLTV trailer.  The three variants include the General Purpose (GP) JLTV, the Utility (UT) JLTV, and the Heavy Guns Carrier (HGC) JLTV.  FY17 funding defined by the user configurations on each platform prior to Full Rate Production began in FY18.  Purchase of CFE and GFE kits, as well as at least one JLTV in each variant: GP, UTL, and HGC was executed in FY17. Technical Data Packages, as well as USAF specific Tech Data and support will also be provisioned and worked during this time to support the incoming inventory once testing is complete.\n\nGuardian Angel Air-Deployable Rescue Vehicle: The Guardian Angel Air-Deployable Rescue Vehicle (GAARV) is an air-deployable surface recovery platform capable of maneuvering over adverse terrain in order to search for and recover isolated personnel and\/or equipment.  It will provide increased survivability during \"outside the wire\" personnel recovery operations, more secure transportation capability to the recovery team and injured\/isolated personnel from an area of high threat, and necessary training platforms for operators to familiarize themselves with vehicles they utilize in the area of operations.  It also provides operators with increased protection from enemy fire and improvised explosive devices. Funding includes, but is not limited to procurement of end items, training, upgrades, spares, Interim Contractor Support (ICS), repairs, deployment packages and returns.  This funding request will support potential DMS and obsolescence solutions, to include if optimal, life of type buys or bridge buys limited to the program of record quantity. Due to rapidly changing threat environment, the acquisition program manager has the authority to redirect funding as necessary to meet current slated and emerging requirements. On 7 July 2017, ACC\/A5\/8R terminated the HDT Storm solution to the GAARV requirement. A new solution to the requirement will be developed if\/when the GAARV requirement is revalidated. Subsequent funding will fund contract termination and Program Management Administration until a follow-on requirement is identified. Funding for GAARV is in Program Element 0207227F.\n\n  \nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\n\nFunding for this exhibit contained in PEs 0202834F,  0207227F, 0507831F, 0502831F, 0702831F, 0804731F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "FY20 procurement dollars in the amount of $1.315M will procure, but not be limited to, 15 vehicles in support of installation and unit mission requirements for Air Force personnel.           \n\nQuantities are based on current requirements provided by the 441 Vehicle Support Chain Operations Squadron (VSCOS) IAW the process outlined in AFI 24-302, Vehicle Management.  The requirements are generated from the priority buy model that is used to support the Planning, Programming, Budgeting and Execution (PPBE) process.  The model calculates vehicle requirements by fund year by BPAC using end of life projections based on depreciation and service life of the vehicle, cumulative sustainment cost and mission priority.    \n\nQuantities reflected on the PDOCs show current requirements for each year supporting Active Duty, Air Force Reserve Center (AFRC), Air National Guard (ANG), Rapid Airfield Damage Repair (RADR), European Deterrence Initiative (EDI), Set the Theater Initiatives for PACOM, and other initiatives as they arise.\n\nAs the model applies the life expectancy\/sustainment cost\/mission priority logic in generating requirements, there can be gaps in individual vehicle type (NSN) requirements from year-to-year.  \n\nUnit Cost is subject to change from year-to-year based on buy quantities, CONUS\/OCONUS locations, inflation and additional requirements (options required by users).  Examples of options include, but are not limited to, specialized trailer towing packages, export (non-Ultra Low Sulfur Diesel) engines, and mission specific specialized attachments for construction vehicles.  Unit cost is also subject to change based on fluctuations in contract pricing."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}