{
    "id": "2020-Army-PB-2031A-JBOOK-637e408165016711b0ce5d837ca179b7366db442ade32a54318bb21964051f79-14",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_AIRCRAFT-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2031A",
        "appropriation_name": "Aircraft Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "0028A02706"
        },
        "LineItemTitle": {
            "val": "Universal Ground Control Equipment (UAS)"
        },
        "P1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2031A"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Modification of Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Modification of Aircraft"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "15"
                },
                "CurrentYear": {
                    "val": "27.114"
                },
                "BudgetYearOneBase": {
                    "val": "2.09"
                },
                "BudgetYearOne": {
                    "val": "2.09"
                },
                "BudgetYearTwo": {
                    "val": "7.872"
                },
                "BudgetYearThree": {
                    "val": "7.987"
                },
                "Total": {
                    "val": "60.063"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "15"
                },
                "CurrentYear": {
                    "val": "27.114"
                },
                "BudgetYearOneBase": {
                    "val": "2.09"
                },
                "BudgetYearOne": {
                    "val": "2.09"
                },
                "BudgetYearTwo": {
                    "val": "7.872"
                },
                "BudgetYearThree": {
                    "val": "7.987"
                },
                "Total": {
                    "val": "60.063"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "15"
                },
                "CurrentYear": {
                    "val": "27.114"
                },
                "BudgetYearOneBase": {
                    "val": "2.09"
                },
                "BudgetYearOne": {
                    "val": "2.09"
                },
                "BudgetYearTwo": {
                    "val": "7.872"
                },
                "BudgetYearThree": {
                    "val": "7.987"
                },
                "Total": {
                    "val": "60.063"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "15"
                                },
                                "CurrentYear": {
                                    "val": "27.114"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.09"
                                },
                                "BudgetYearOne": {
                                    "val": "2.09"
                                },
                                "BudgetYearTwo": {
                                    "val": "7.872"
                                },
                                "BudgetYearThree": {
                                    "val": "7.987"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "15"
                    },
                    "CurrentYear": {
                        "val": "27.114"
                    },
                    "BudgetYearOneBase": {
                        "val": "2.09"
                    },
                    "BudgetYearOne": {
                        "val": "2.09"
                    },
                    "BudgetYearTwo": {
                        "val": "7.872"
                    },
                    "BudgetYearThree": {
                        "val": "7.987"
                    }
                }
            }
        },
        "Description": {
            "val": "Universal Ground Control Station (UGCS) software and hardware modernization efforts mitigate costly maintenance and testing burden by utilizing an open software architecture that supports the separation of flight and mission critical functionality. Builds software infrastructure that will support current and emerging Unmanned Aircraft Systems (UAS) Universal Ground Control Station (UGCS) as well as Scalable Control Interface (SCI) requirements.\n\nCurrent Universal Products consist of the UGCS, the Universal Ground Data Terminal (UGDT) and the Universal Mission Simulator (UMS). The Universal Products will be capable of flight and payload control of multiple unmanned aircraft systems. UGCS is protected in a climate-controlled, standard S-280 or S-788 U.S. Army shelter and mounted on either a standard Army FMTV or HMMWV, the UGCS receives and disseminates battlefield video and situational awareness data through state-of-the-art operator consoles. Consoles can be used to provide aircraft command and control, payload control and weapons launch.  Future GCS modifications will allowed scaled down sizes of GCS to support expeditionary operations.\n\nThe UGDT provides a Line of Sight (LOS) capability for transmit and receipt of UAS command and control and UAS payload products. The UGDT is the common datalink system for U. S. Army UAS.\n\nThe Universal Mission Simulator (UMS) consists of the hardware and software required to fully train UAS operators to full Readiness Level (RL) 1. The UMS will be capable of training and simulating flight and payload control of [Directorate of Simulation (DOS)] Shadow and Gray Eagle unmanned aircraft systems.\n\nThe OSRVT Increment II consists of a Remote Operations Video Enhanced Receiver (ROVER), Miltope tablet, Antennas, UHF Modem, Type I encryption, Ku-Directional Antennas (KuDA) with an On-The-Move (OTM) capable variant, and an extended range Mobile Directional Antennas System (MDAS). Software supports decoding Telemetry Data from multiple Manned\/Unmanned Aircraft Systems, provides Electro-Optical (EO)\/Infrared (IR) payload control, and supports off-target calculations. OSRVT supports current operations and emerging requirements."
        },
        "Justification": {
            "val": "FY20 Base Procurement funds in the amount of $2.090 Million will be utilized to procure UGCS Hardware components modernization for Unmanned Aerial Systems (UAS) fleet to include but not limited to Gray Eagle (MQ-1C), and Shadow (RQ-7) Programs of Record.\n\nTitle: Universal Products (UGCS and UGDT)\nThe APA funding continues the procurement and implementation of hardware to address modernization while enforcing commonality across the U-Product fleet.  Current planning allocates $2.090 Million for procurement of common UGCS computing\/communications hardware and associated integration\/qualification, and associated systems engineering, program management, and logistics support.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}