{
    "id": "2020-AirForce-PB-3010F-JBOOK-7d350153b6be1eccae748c4d22ac154e90df0a164dbdb11a1943b05640e0cbad-2",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_AIRCRAFT_VOL1-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3010F",
        "appropriation_name": "Aircraft Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "C135B0"
        },
        "LineItemTitle": {
            "val": "C-135B"
        },
        "P1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3010F"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Combat Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Combat Aircraft"
        },
        "ResourceSummary": {
            "Quantity": {
                "CurrentYear": {
                    "val": "1"
                },
                "Total": {
                    "val": "1"
                }
            },
            "TotalCost": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "125"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "125"
                }
            },
            "UnitCost": {
                "CurrentYear": {
                    "val": "125"
                },
                "Total": {
                    "val": "125"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "125"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "125"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "125"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "125"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0305145F"
                }
            ]
        },
        "Description": {
            "val": "The Open Skies Treaty permits unarmed overflight of the sovereign territory of 34 signatory nations. The Treaty enhances mutual understanding and confidence by giving all participants, regardless of size, a direct role in gathering information through aerial imaging on military forces and activities of concern. Open Skies is one of the most wide-ranging international arms control efforts to date to promote openness and transparency in military forces and activities.\n\nThe Department of Defense is responsible for oversight, implementation of, and compliance with, arms control agreements, including the Open Skies Treaty. The United States Air Force has a requirement to execute missions under the Open Skies Treaty and utilizes two OC-135B aircraft as the observation aircraft. All roles and responsibilities are called out in Presidential Policy Directive 15, \"Implementation of the Treaty on Open Skies, Mar 1, 2012. The OC-135B fleet has experienced decreasing mission reliability due to age, difficulties with out-of-production parts, and increased operating costs. Open Skies missions averaged a 65% mission completion rate over the ten-year period from 2007 to 2017 with leading non-mission capable drivers being the engines, fuel system, landing gear, generators, and airframe. Additionally, the OC-135B aircraft's 6,500km range is insufficient to fully execute mission options within the 96-hour in-country Treaty observation time constraint permitted under Treaty.  \n\nIn February 2018 the Joint Capabilities Board reviewed and endorsed the Joint Doctrine, Organization, Training, materiel, Leadership and Education, Personnel, Facilities, and Policy Change Recommendation which updated platform requirements for Open Skies Treaty aircraft and recommended moving the capability onto a small-airliner class aircraft and existing materiel solutions.  The Joint Capabilities Board revised thirteen requirements to represent the full range of capability necessary for optimized support to Treaty missions and endorsed the Air Force's efforts to determine and pursue the best method for procuring an existing aircraft for platform recapitalization to include commercial-off-the-shelf solutions.\n\nAn Open Skies System consist of the missionized aircraft (Digital Visual Imaging System sensor suite, flight deck avionics, and crew workstations) and Digital Ground Processing Station.\n\nThe budget supports modification and Treaty Certification of two commercial-off-the-shelf, small airliner class OC-135B replacement aircraft. The total program includes procurement of two commercial-derivative aircraft and Digital Visual Imaging System kits, design and development for mission system integration (structural design, interphone communications systems, flight deck avionics, and Digital Visual Imaging System hardware), test, and Federal Aviation Administration and Open Skies Treaty certification activities over a planned 24-month period. Additionally, the complete effort establishes pre-operational support for aircraft, mission systems and Digital Ground Processing Station. In FY19, the Air Force finalized the acquisition strategy, stood up the program office, conducted market research, began Request for Proposal development and pre-solicitation activates. In FY20, the program will complete competitive source selection, award a contract, and begin preliminary design activities. \n\nThe Air Force Milestone Decision Authority approved the Open Skies Treaty Aircraft Recapitalization Materiel Development Decision and Acquisition Strategy on 11 September 2018. This acquisition leverages the rapid fielding pathway authorized by section 804 of the National Defense Authorization Act for Fiscal Year 2016 (Public Law 114-92). The program will award a single supply contract with embedded services for Contractor Logistics Support and Engineering Services. The program will utilize Full and Open Competition under Part 15 and Part 12 of the Federal Acquisition Regulation.  The program will procure two new aircraft capable of achieving Open Skies Treaty Missions, integrate two new treaty certified commercial-off-the-shelf Digital Visual Imaging Systems, and perform required Developmental Test, Operational Test, and Treaty Certification Data Gathering. The program will establish Pre-operational Support for aircraft, mission systems and the Digital Ground Processing Station necessary to deliver an aircraft, ready for Treaty Certification, by 2022. The program provides for Engineering Services necessary to support the Treaty Certification process. Contractor Logistics Support elements include worldwide supply chain management, establishment of a Contractor Managed Base Supply, program management, depot maintenance, training services, field support, and engineering services for the aircraft, engines, and mission systems. The program will issue the Request for Proposals in April 2019 and award the Development contract by February 2020.\n\nThe OC-135B fleet has experienced decreasing mission reliability due to age, difficulties with out-of-production parts, and increased operating costs.  Open Skies missions averaged a 65% mission completion rate over the ten-year period from 2007 to 2017 with leading non-mission capable drivers being the engines, fuel system, landing gear, generators, and airframe. Additionally, the OC-135B aircraft's 6,500 km range is insufficient to fully execute mission options within the time constraints of the 96-hour in-country Treaty observation time constraint permitted under Treaty.  The Department of Defense, motivated by operational limitations of the OC-135B experienced during Open Skies missions combined with declining mission capability, prompted program officials to request a Capabilities-Based Assessment in July 2015 to study aircraft issues. The effort which completed in June 2016 indicated that key requirements within the 1992 Open Skies Operational Requirements Document were no longer current, and that the OC-135B had known capability performance gaps in range and mission completion.\n\nIn October 2016, the Air Force secured permission to develop a Doctrine, Organization, Training, materiel, Leadership and Education, Personnel, Facilities and Policy Change Recommendation for the Open Skies Treaty Aircraft. The process used a multi-disciplinary High Performance Team to create and validate a series of required capabilities for an Open Skies aircraft, evaluate aircraft that could satisfy the required capabilities, and then consider each of the Doctrine, Organization, Training, materiel, Leadership and Education, Personnel, Facilities and Policy elements as part of a recommended solution. The effort accomplished two main purposes. First, it updated operational requirements and replaced the 1992 Operational Requirements Document to reflect both operational experience and expected Open Skies program needs for the foreseeable future. Second, it recommend an Air Force solution that best satisfied required capabilities within existing materiel solutions. The Joint Capabilities Board adopted the Air Force recommendation directed acquisition of two small airliner class aircraft for the Open Skies Treaty mission to be acquired in a method consistent with the Federal Acquisition Regulation and other applicable guidance, training using existing contractor training facilities, equipment, and curriculum, and a maintenance concept with military personnel performing unit-level maintenance actions with contractor support for parts supply, and supply chain management, performed under a Low Utilization Maintenance Program.\n\nIn 2019 Open Skies Treaty Aircraft Recapitalization was a New Start.\n\nFunding for this exhibit contained in PE 0305145F\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "No Budget Year FY 2020 funding requested."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}