{
    "id": "2020-Navy-PB-1109N-JBOOK-b326adbe914504e2b61de725ef983e7223e072a57601b3e4ae0ec2b7f58a6709-44",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6545"
        },
        "LineItemTitle": {
            "val": "Ultra-Light Tactical Vehicle (ULTV)"
        },
        "P1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "General Property"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "110.32"
                },
                "PriorYear": {
                    "val": "1.266"
                },
                "CurrentYear": {
                    "val": "0.606"
                },
                "BudgetYearOneBase": {
                    "val": "0.647"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.647"
                },
                "BudgetYearTwo": {
                    "val": "4.019"
                },
                "BudgetYearThree": {
                    "val": "5.955"
                },
                "BudgetYearFour": {
                    "val": "8.827"
                },
                "BudgetYearFive": {
                    "val": "9.004"
                },
                "Total": {
                    "val": "140.644"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "110.32"
                },
                "PriorYear": {
                    "val": "1.266"
                },
                "CurrentYear": {
                    "val": "0.606"
                },
                "BudgetYearOneBase": {
                    "val": "0.647"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.647"
                },
                "BudgetYearTwo": {
                    "val": "4.019"
                },
                "BudgetYearThree": {
                    "val": "5.955"
                },
                "BudgetYearFour": {
                    "val": "8.827"
                },
                "BudgetYearFive": {
                    "val": "9.004"
                },
                "Total": {
                    "val": "140.644"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "110.32"
                },
                "PriorYear": {
                    "val": "1.266"
                },
                "CurrentYear": {
                    "val": "0.606"
                },
                "BudgetYearOneBase": {
                    "val": "0.647"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.647"
                },
                "BudgetYearTwo": {
                    "val": "4.019"
                },
                "BudgetYearThree": {
                    "val": "5.955"
                },
                "BudgetYearFour": {
                    "val": "8.827"
                },
                "BudgetYearFive": {
                    "val": "9.004"
                },
                "Total": {
                    "val": "140.644"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206623M"
                }
            ]
        },
        "Description": {
            "val": "The Family of Internally Transportable Vehicles (FITV) are light weight and internally transportable in the V-22, CH-53D & CH53E tilt and rotary wing aircraft consisting of the Utility Task Vehicle (UTV), the future Ultra-Light Tactical Vehicle (ULTV), and the obsolete Internally Transportable Vehicle (ITV). The FITV provides deployed Marine Air-Ground Task Force (MAGTF) and Marine Expeditionary Unit (Special Operations Capable) (MEU SOC) with vehicles, which are internally transportable in selected rotary and fixed wing aircraft. The FITV expeditionary vehicles support over-the-horizon amphibious operations, irregular warfare and enhanced company operations. The vehicles are fielded to infantry and reconnaissance communities. Speed, maneuverability, and the use of cover and concealment are the crew's primary means of survival.\n\nThe UTV is a part of the family of vehicles that supports the Marine Corps Operating Concept (MOC) by providing infantry and reconnaissance battalions with a reliable, easily maintained, inexpensive vehicle to support dispersed and disaggregated logistics operations while increasing unit mobility. The UTV fills a capability gap in motorized logistics sustainment, including casualty evacuation (CASEVAC) and Javelin\/ammo transport for Marine Corps infantry units. UTV's are employed by the helo companies of the MEUs and Special Purpose (SP) MAGTFs as they execute heliborne and tiltrotor operations. This commercial off the shelf (COTS) solution mitigates the infantry battalion support gap, with the ability to operate in remote, rural regions where currently fielded ground mobility platforms are unsuitable due to size, weight, and safety concerns.\n\nBased on USMC Expeditionary Fire Support System (EFSS) divestiture, the Marine Corps will divest of ITV prime mover and light strike variants and move toward modernization as Internally Transportable Vehicle (ITV) replacement alternatives are explored.\n\nEfforts will begin to replace the Utility Task Vehicles (UTV) with the Ultra-Light Tactical Vehicle (ULTV). The replacement vehicle will be multirole, supporting Reconnaissance and Infantry communities by providing a deployed SP MAGTF and Marine Expeditionary Unit (Special Operations Capable) (MEU (SOC)) with an internally transportable vehicle to support over-the-horizon amphibious operations, irregular warfare and enhanced company operations as they execute heliborne and tiltrotor operations.  The ULTV will replace the UTV fleet of vehicles with greater capability and will absorb and increase its mission.  Increased capabilities planned include integration of communications and GPS equipment and serve as a crew-served weapons carrier.\n\nThe FITV line item will provide for the implementation of engineering change proposals, safety initiatives, and quality design resolutions to fielded UTVs. This hands-on method ensures proper in-service management and vehicle sustainment while allowing the program office to develop and implement improvements as needed to respond to evolving requirements of the Marine Corps that affect vehicle reliability, safety, availability and readiness. The last UTVs have a planned item exit date of 2022. Safety and reliability modifications are planned throughout its life to ensure maximum readiness as vehicles age."
        },
        "Justification": {
            "val": "FY18 Base Appropriation Request: $1.266M\n\nFunding provided product improvements to the existing UTV Fleet to address safety and reliability issues, engineering change proposals, as required, based upon feedback from the users of this COTS item in the operational environment.\n\nFY19 Base Appropriation Request: $0.606M\n\nFunding provides product improvement to the centrally managed UTV fleet for safety and reliability issues and engineering change proposals. The funds will also support the associated update of the technical documentation upon modification of the vehicles. \n\nFY20 Base Appropriation Request:  $0.648M\n\nFunding provides for reliability engineering in support of product improvement to the UTV Fleet to address emergent fact of life reliability issues based on feedback from the operational users, such as the previously executed  wheel well protection analysis and engineering change proposal that resulted in increased vehicle safety, reliability, and enhanced performance.\n\nThe increase of $0.042M is due to additional engineering change proposals required to ensure vehicle safety, reliability and enhanced performance associated with the aging UTV fleet."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Family of Internally Trans Veh (ITV)"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "Remarks": {
                        "val": "[Support Cost] Funding is provided for reliability engineering in support of product improvement to the UTV Fleet to address emergent fact of life reliability issues based on feedback from the operational users, including efforts similar to previously executed road march kits, all-terrain tires and floorboard reinforcement engineering change proposals that resulted in increased vehicle safety and reliability."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "110.32"
                            },
                            "PriorYear": {
                                "val": "1.266"
                            },
                            "CurrentYear": {
                                "val": "0.606"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.647"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.647"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "110.32"
                            },
                            "PriorYear": {
                                "val": "1.266"
                            },
                            "CurrentYear": {
                                "val": "0.606"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.647"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.647"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "110.32"
                            },
                            "PriorYear": {
                                "val": "1.266"
                            },
                            "CurrentYear": {
                                "val": "0.606"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.647"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0.647"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "Prior year includes the procurement of 195 ITV Modification kits at a unit cost of $26,210.26 each, initial Contractor Logistics Support (CLS); 248 Utility Task Vehicles (UTVs) at a unit cost of $50,512.10 each and miscellaneous cost associated with the execution of the program requirements.",
                                                    "val": "1.1.1) Prior years Cumulative Funding"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "106.133"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "106.133"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "106.133"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "2.1) Prior Year Cummulative"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.2"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "UTV's are deployed to the infantry battalions and the Reconnaissance units.  Continuous feedback provided on these vehicles results in necessary safety modifications",
                                                "val": "2.2) UTV ECPs\/Modifications"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.144"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.34"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.647"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.647"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "FY19 will support the update of technical documentation associated with UTV vehicle improvements based on the modifications and engineering change proposals.",
                                                "val": "2.3) UTV Technical Documentation"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.987"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.266"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.4) UTV Reliability Engineering"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.557"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.5) UTV Program Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.565"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "4.187"
                                        },
                                        "PriorYear": {
                                            "val": "1.266"
                                        },
                                        "CurrentYear": {
                                            "val": "0.606"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.647"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.647"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}