{
    "id": "2020-DefenseThreatReductionAgency-PB-0300D-JBOOK-9ba84e89bc41d2a322815f43d079a7325829de00ae8525c173a423afac2145a2-1",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-DEFENSE_DTRA-U_PROCUREMENT_JustificationBook_Defense_Threat_Reduction_Agency_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Threat_Reduction_Agency_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "30"
        },
        "LineItemTitle": {
            "val": "Other Major Equipment"
        },
        "P1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "23"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, Defense Threat Reduction Agency"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "70.057"
                },
                "PriorYear": {
                    "val": "12.356"
                },
                "CurrentYear": {
                    "val": "5.592"
                },
                "BudgetYearOneBase": {
                    "val": "11.521"
                },
                "BudgetYearOne": {
                    "val": "11.521"
                },
                "BudgetYearTwo": {
                    "val": "9.507"
                },
                "BudgetYearThree": {
                    "val": "8.776"
                },
                "BudgetYearFour": {
                    "val": "8.984"
                },
                "BudgetYearFive": {
                    "val": "3.79"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "70.057"
                },
                "PriorYear": {
                    "val": "12.356"
                },
                "CurrentYear": {
                    "val": "5.592"
                },
                "BudgetYearOneBase": {
                    "val": "11.521"
                },
                "BudgetYearOne": {
                    "val": "11.521"
                },
                "BudgetYearTwo": {
                    "val": "9.507"
                },
                "BudgetYearThree": {
                    "val": "8.776"
                },
                "BudgetYearFour": {
                    "val": "8.984"
                },
                "BudgetYearFive": {
                    "val": "3.79"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "70.057"
                },
                "PriorYear": {
                    "val": "12.356"
                },
                "CurrentYear": {
                    "val": "5.592"
                },
                "BudgetYearOneBase": {
                    "val": "11.521"
                },
                "BudgetYearOne": {
                    "val": "11.521"
                },
                "BudgetYearTwo": {
                    "val": "9.507"
                },
                "BudgetYearThree": {
                    "val": "8.776"
                },
                "BudgetYearFour": {
                    "val": "8.984"
                },
                "BudgetYearFive": {
                    "val": "3.79"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Other Major Equipment Procurement Program allows for focused enhancement of Agency-wide Cybersecurity, Computer Network Defense, Network Operations, and Security Center capabilities in compliance with Department of Defense (DoD) Instruction 8500.01, \"Cybersecurity,\" dated March 14, 2014, and the continuous monitoring capabilities mandated by DoD Instruction 8510.01, Change 2, \"Risk Management Framework for DoD Information Technology (IT),\" dated July, 28, 2017.  These investments provide a comprehensive Cyber Assessment Lightweight toolkit that can be deployed to any location world-wide, and non-intrusively tap customer's network to perform on the spot network data analytics on inbound and outbound network traffic to assess for indicators of compromise, a stand-alone low visibility gamma\/neutron wide-area detection system, designed to improve the concealability of the existing Multi-Platform System (MPS) via miniaturization and modularization, a Comprehensive Nuclear Test Ban Treaty's IMS to support the operations of the NACT program and the U.S. Government's nonproliferation objectives related to implementation, compliance, monitoring, and inspections for nuclear arms control activities. It also provides materials handling equipment (MHE) support to missions in the U.S. and overseas. MHE are mechanical devices for handling of supplies with greater ease and economy. MHE refers to various equipment, to include but not limited to forklifts, tractors, and other specialized industrial trucks powered by electric motors or internal combustion engines. The MHE is heavily operated in rocky, unpaved terrain and warehouse environments resulting in shortened life-cycles and increased volume for maintenance."
        },
        "Justification": {
            "val": "The FY 2018 funding of $12.356 million resourced the following new and continuing efforts:\n-  Began one-time replacement of DTRA's obsolete classified network cable plant infrastructure. The cable connectors, which were installed in DTRA facilities a decade ago, are no longer manufactured, supported, or available on the market, causing compatibility issues with new end-user devices as well as network switching and routing equipment.\n-  IT infrastructure core routing and switching, DTRA Experimentation Lab\/Reachback systems, analytical equipment for Chemical Biological Weapons of Mass Destruction (CBWMD) search missions, and the life- cycle replacement of Defense Stockpile Management System (DSMS) including the Defense Integration and Management of Nuclear Data Services (DIAMONDS) enterprise server equipment located at Kirtland Air Force Base, New Mexico.\n-  Continued support to the Nuclear Arms Control Technology (NACT) program for the International Monitoring System (IMS) component replenishment and monitoring system acquisition necessary to meet on- going operational responsibilities.\n-  Initial purchase of (5) Orca systems, providing Weapons of Mass Destruction (WMD) search teams a low visibility gamma\/neutron wide-area detection system, designed to improve the concealability of the existing Multi-Platform System (MPS) via miniaturization and modularization.  The Orca system was developed and is produced by the Space and Naval Warfare Systems Center, Pacific (SPAWAR SSC Pacific) in collaboration with the Department of Energy's Special Technologies Laboratory (DOE-STL). One Orca system consists of eight (8) \"pods\" – four (4) gamma sensors and four (4) neutron sensors, and their associated electronics components.  The projected procurement of Orcas totals seventy-seven (77) across the FYDP.  The seventy-seven 77 Orcas will be apportioned in increments of thirteen (13) Orca's (currently MPS's) to each Technical Support Group, one for each three (3) person search team. Each Orca is a stand-alone wide-area radiation detection system providing data to the search team. This data can also be shared externally via communication systems to command elements overseeing multiple search teams.\n\nThe FY 2019 budget of $5.592 million will fund the following new and continuing efforts:\n-  Purchase of Information Operations Computer Network Defense system equipment, giving DTRA a greater capability to execute cyber vulnerability scanning tools on Balanced Survivability Assessments (BSAs).\n-  Completing the second and final phase to support the one-time replacement of DTRA's cable plant infrastructure started in FY 2018.\n-  Information technology enhancements to the DTRA Experimentation Laboratory supporting Technical Reachback.\n-  Continued Defense Stockpile Management System (DSMS) lifecycle replacement of the primary Defense Integration and Management of Nuclear Data Services (DIAMONDS) enterprise server equipment.\n-  Continued support to the NACT program to meet on-going operational responsibilities in support of the Comprehensive Nuclear Test Ban Treaty's IMS and the U.S. Government's nonproliferation objectives related to implementation, compliance, monitoring, and inspection for nuclear arms control activities.\n\nThe FY 2020 budget of $11.521 million will fund the following efforts:\n-  Purchase an additional eighteen (18) Orca systems to provide Weapons of Mass Destruction (WMD) search teams a low visibility gamma\/neutron wide-area detection system, designed to improve the concealability of the existing Multi-Platform System (MPS) via miniaturization and modularization. This is a life-cycle replacement of the existing MPS. \n-  One-time purchase of two (2) BLACK RHINO Next Generation (BR-NG) deployable toolkit designed to provide a lightweight flyaway\/portable kit configured with high-end systems pre-loaded with next generation Cybersecurity technologies and software designed to conduct Balanced Survivability Assessments of Military and Federal installations.\n-  Continued Defense Stockpile Management System (DSMS) lifecycle replacement of the primary Defense Integration and Management of Nuclear Data Services (DIAMONDS) enterprise server equipment.\n-  Continued support to the NACT program to meet on-going operational responsibilities to operate, maintain, and recapitalize U.S. International Monitoring System (IMS) stations in support of the United States and Department of Defense objectives and the Comprehensive Nuclear Test Ban Treaty objectives related to implementation, monitoring, and verification for nuclear arms control activities.\n-  Materials handling equipment (MHE) in support of missions in the U.S. and overseas. MHE consists of mechanical devices for handling of supplies with greater ease and economy. MHE could be various equipment, including forklifts, tractors, and other specialized industrial trucks powered by electric motors or internal combustion engines. MHE could be operated in rocky, unpaved terrain and warehouse environments resulting in shortened life-cycles and increased volume for maintenance.\n\nThe net increase of $5.929 million from FY 2019 to FY 2020 is based on the following increases and decreases:  \n\nAn increase of $7.629 million supports:  \n-  Mission Management to procure an additional (5) 'Orca' systems that provide Weapons of Mass Destruction (WMD) search teams a low visibility gamma\/neutron wide-area detection system.\n-  Infrastructure to procure the BLACK RHINO Cyber Assessment Tool Kit to provide a comprehensive cyber security assessment of networks and systems.\n\nA decrease of $1.700 million reflects:\n-  A realignment of $1.500 million to the Operation and Maintenance (O&M) appropriation to purchase commodity IT services from the Defense Information Systems Agency (DISA) in support of  the Fourth Estate IT Network Optimization Reform initiative.\n-  A small programmatic adjustment to Information technology enhancements for the DTRA Experimentation Laboratory."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Mission Management"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Mission Management"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Mission Management"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "14.507"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.35"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.208"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.272"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.272"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "14.507"
                                        },
                                        "PriorYear": {
                                            "val": "4.35"
                                        },
                                        "CurrentYear": {
                                            "val": "3.208"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.272"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.272"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Resources support the following mission critical programs:\n-  Nuclear Arms Control Technology (NACT): Provides for recapitalization of components of the International Monitoring System stations managed by the NACT program in support of the Comprehensive Nuclear Test Ban Treaty.\n-  Stockpile Logistics: Provides lifecycle replacement of the primary Defense Integration and Management of Nuclear Data Services (DIAMONDS) enterprise server equipment.\n-  Nimble Elder: Increase supports the purchase of (5) Orca system to provide the Weapons of Mass Destruction search teams a low visibility gamma\/neutron wide-area detection system to improve their concealability and to replace the existing Multi-Platform System."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "14.507"
                            },
                            "PriorYear": {
                                "val": "4.35"
                            },
                            "CurrentYear": {
                                "val": "3.208"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.272"
                            },
                            "BudgetYearOne": {
                                "val": "8.272"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Infrastructure"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Infrastructure"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Infrastructure"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "55.55"
                                                    },
                                                    "PriorYear": {
                                                        "val": "8.006"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.384"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.249"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.249"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "55.55"
                                        },
                                        "PriorYear": {
                                            "val": "8.006"
                                        },
                                        "CurrentYear": {
                                            "val": "2.384"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.249"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.249"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "The FY 2020 budget resources the procurement of the BLACK RHINO Cyber Assessment Tool Kit for the networks and systems."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "55.55"
                            },
                            "PriorYear": {
                                "val": "8.006"
                            },
                            "CurrentYear": {
                                "val": "2.384"
                            },
                            "BudgetYearOneBase": {
                                "val": "3.249"
                            },
                            "BudgetYearOne": {
                                "val": "3.249"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}