{
    "id": "2020-Army-PB-2035A-JBOOK-9a506ef771645f1f497a55d2f9689cb43329bd66a6d473f4742f08dfe8518cf2-14",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_OTHER_1-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "8992DA0924"
        },
        "LineItemTitle": {
            "val": "Modification Of In Svc Equip"
        },
        "P1LineNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Tactical and Support Vehicles"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Tactical Vehicles"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "6939.851"
                },
                "PriorYear": {
                    "val": "146.587"
                },
                "CurrentYear": {
                    "val": "256.642"
                },
                "BudgetYearOneBase": {
                    "val": "58.946"
                },
                "BudgetYearOneOCO": {
                    "val": "28"
                },
                "BudgetYearOne": {
                    "val": "86.946"
                },
                "BudgetYearTwo": {
                    "val": "49.25"
                },
                "BudgetYearThree": {
                    "val": "46.05"
                },
                "Total": {
                    "val": "7525.326"
                }
            },
            "UnitCost": {
                "AllPriorYears": {
                    "val": "8588.925"
                },
                "PriorYear": {
                    "val": "242.293"
                },
                "CurrentYear": {
                    "val": "812.158"
                },
                "BudgetYearOneBase": {
                    "val": "1786.242"
                },
                "BudgetYearOne": {
                    "val": "2634.727"
                },
                "BudgetYearTwo": {
                    "val": "1119.318"
                },
                "BudgetYearThree": {
                    "val": "495.161"
                },
                "Total": {
                    "val": "3962.784"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "6939.851"
                },
                "PriorYear": {
                    "val": "146.587"
                },
                "CurrentYear": {
                    "val": "256.642"
                },
                "BudgetYearOneBase": {
                    "val": "58.946"
                },
                "BudgetYearOneOCO": {
                    "val": "28"
                },
                "BudgetYearOne": {
                    "val": "86.946"
                },
                "BudgetYearTwo": {
                    "val": "49.25"
                },
                "BudgetYearThree": {
                    "val": "46.05"
                },
                "Total": {
                    "val": "7525.326"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "6939.851"
                },
                "PriorYear": {
                    "val": "146.587"
                },
                "CurrentYear": {
                    "val": "256.642"
                },
                "BudgetYearOneBase": {
                    "val": "58.946"
                },
                "BudgetYearOneOCO": {
                    "val": "28"
                },
                "BudgetYearOne": {
                    "val": "86.946"
                },
                "BudgetYearTwo": {
                    "val": "49.25"
                },
                "BudgetYearThree": {
                    "val": "46.05"
                },
                "Total": {
                    "val": "7525.326"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0604622A"
                }
            ]
        },
        "Description": {
            "val": "This budget line funds Modifications of In-Service Equipment to the Tactical Wheeled Vehicle fleet to include trailers and enablers. It is used to develop material solutions and also to procure hardware, materials, and the hardware installation cost required to complete the modification. Modifications are performed to correct safety deficiencies; increase mission capabilities and interoperability; extend the useful life; improve supportability; upgrade existing technology; increase efficiency; improve readiness; address obsolescence issues; and to meet new and\/or changing statutory and regulatory requirements. By modifying existing equipment, the Army maintains a ready, supportable inventory of equipment that meets current requirements and regulations at a cost considerably below that of buying new equipment.\n\nThis line funds the Army's plan to recapitalize Mine Resistant Ambush Protected (MRAP) RG33L+ variant vehicles originally bought to fill Operational Needs Statement (ONS) or Joint Operational Needs Statement (JUONS) into Program of Record (PoR) Panther Medium Mine Protected Vehicle (MMPV) Type I (a 6 wheeled vehicle).  In addition, this line implements the Army's plan to upgrade a mix of ONS\/JUONS vehicles: Husky, Panther-MMPV Type I, Buffalo, and RG31-MMPV Type II (a 4 wheeled  vehicle) in conjunction with a reset program to field PoR vehicles to Engineer Companies; Chemical, Biological, Radiological, Nuclear, Explosive (CBRNE) Units; Explosive Ordnance Disposal (EOD) Units; and Area Clearance Platoons.\n\nThe Family of Heavy Tactical Vehicles (FHTV) line funds the United States Army Europe (USAREUR) Operational Needs Statement (ONS #17-22207) for Heavy Equipment Transporter System (HETS) tractor modifications. Existing M1070A1 HETS tractors will be modified to meet the payload requirements directed in the 1 DEC 17 Army Requirements Oversight Council (AROC) memo of achieving a payload capacity of 78.5 tons without consideration of operational road permits, and 75 ton capacity while obtaining operational road permits in the European area of operations. The AROC memo additionally directed the further modification of M1070A1 tractors to meet the capacity targets of 85 tons without consideration of operational road permits and maintaining a capacity of 75 tons with operational road permits in the European theater of operations. Both configurations allow for the use of the HETS Urban Survivability Kit (HUSK) armored cab. This line also funds modifications for active safety; autonomy; modernization and Modification Work Orders (MWOs)."
        },
        "Justification": {
            "val": "FY 2020 Base procurement dollars of $42.946 million funding completes the entire Route Clearance Vehicle Fleet effort. Funds Logistics operator and maintenance manual for Husky Engineering Change Proposal (ECP) to provide the ability to Lift and Tie down the Husky vehicle for transport. This ECP is a  Sustainment Cost Savings initiative since currently the Husky requires a crane for assembly, disassembly and containerization for transport. Funds Interim Contractor Logistic Support (ICLS) for previously fielded vehicles until validated maintenance manuals are available and Field Level Maintenance \/ New Equipment Training (FLMNET) is provided to 193 units. Funds Program Management and Engineering Support for the Product Office. The DA0924 Base funding split between DA0925 (85%) and DA0926 (15%).\n\nFY 2020 Base procurement dollars in the amount of $16.000 million provides for 33 United States Army Europe (USAREUR) Heavy Equipment Transporter Systems (HETS) Operational Needs Statement (ONS) tractor modifications to pair with commercial new production trailers. Per the 1 DEC 17 Army Requirements Oversight Council (AROC), this additional modification to the M1070A1 tractor will allow it to achieve an ultimate carrying capacity of 85 tons while achieving operational road permits at a weight of 75 tons in the European theater of operations. This funding will provide for the purchase of the modification to the tractors, documentation and data to support technical manual and training material development, transportation to and from the facility conducting the modification, and finish automotive and performance testing of the system to ensure that the 85 ton payload objective is met.  This program supports the Army's modernization priorities in support of the National Defense Strategy.\n\nFY 2020 OCO procurement dollars of $28 million completes the Army's plan for fielding of the final 281 Medium Mine Protected Vehicle Type II (MMPV )Type II (AAO 823). Funds an increase in fielding teams to maximize delivery for fielding completion by 30 Sep 2020, Operator New Equipment Training and Field Level Maintenance New Equipment Training (OPNET\/FLMNET), Program and Engineering support and transportation of the MMPV II.   In accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities In accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "ItemExhibitList": {
            "P3AModificationItemGroup": [
                {
                    "ModificationTitle": {
                        "val": "Various"
                    },
                    "ModificationNumber": {
                        "val": "DA0925"
                    },
                    "ModificationType": {
                        "val": "Various"
                    },
                    "Model": {
                        "val": "Various"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "2265.67"
                            },
                            "PriorYear": {
                                "val": "124.978"
                            },
                            "CurrentYear": {
                                "val": "214.738"
                            },
                            "BudgetYearOneBase": {
                                "val": "36.671"
                            },
                            "BudgetYearOneOCO": {
                                "val": "28"
                            },
                            "BudgetYearOne": {
                                "val": "64.671"
                            },
                            "BudgetYearTwo": {
                                "val": "28"
                            },
                            "Total": {
                                "val": "2698.057"
                            }
                        },
                        "UnitCost": {
                            "AllPriorYears": {
                                "val": "2804.047"
                            },
                            "PriorYear": {
                                "val": "206.575"
                            },
                            "CurrentYear": {
                                "val": "679.551"
                            },
                            "Total": {
                                "val": "1560.473"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "2265.67"
                            },
                            "PriorYear": {
                                "val": "124.978"
                            },
                            "CurrentYear": {
                                "val": "214.738"
                            },
                            "BudgetYearOneBase": {
                                "val": "36.671"
                            },
                            "BudgetYearOneOCO": {
                                "val": "28"
                            },
                            "BudgetYearOne": {
                                "val": "64.671"
                            },
                            "BudgetYearTwo": {
                                "val": "28"
                            },
                            "Total": {
                                "val": "2698.057"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "2265.67"
                            },
                            "PriorYear": {
                                "val": "124.978"
                            },
                            "CurrentYear": {
                                "val": "214.738"
                            },
                            "BudgetYearOneBase": {
                                "val": "36.671"
                            },
                            "BudgetYearOneOCO": {
                                "val": "28"
                            },
                            "BudgetYearOne": {
                                "val": "64.671"
                            },
                            "BudgetYearTwo": {
                                "val": "28"
                            },
                            "Total": {
                                "val": "2698.057"
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "Recapitalization (MPRCV)"
                                },
                                "Procurement": {
                                    "AKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "val": "Engineering Support (STS)"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "11.078"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "6"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "4"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "3.125"
                                                                },
                                                                "BudgetYearOneOCO": {
                                                                    "val": "3.95"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "7.075"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "28.153"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "Kit Quantity"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "472"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "142"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "181"
                                                                },
                                                                "Total": {
                                                                    "val": "795"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "1988.638"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "25.056"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "71.187"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "2084.881"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "Fielding - OPNET\/FLMNET"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "8.682"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "9.845"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "19.21"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "7.166"
                                                                },
                                                                "BudgetYearOneOCO": {
                                                                    "val": "20.65"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "27.816"
                                                                },
                                                                "BudgetYearTwo": {
                                                                    "val": "28"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "93.553"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "Equipment"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "23.351"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "20.64"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "51.448"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "95.439"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "Parts"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "0.658"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "6.715"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "5.576"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "12.949"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "Program Support"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "17.058"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "13"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "15.298"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "1.834"
                                                                },
                                                                "BudgetYearOneOCO": {
                                                                    "val": "1.485"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "3.319"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "48.675"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "Transportation"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "2"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "2"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "4.45"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "3.125"
                                                                },
                                                                "BudgetYearOneOCO": {
                                                                    "val": "1.915"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "5.04"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "13.49"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "Testing"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "26.22"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "26.22"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "ICLS"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "18.841"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "17.001"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "16.551"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "17.093"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "17.093"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "69.486"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "GFE"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "8.007"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "4.837"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "8.894"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "21.738"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "Log Support"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "3.362"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "4.026"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "9.069"
                                                                },
                                                                "BudgetYearOneBase": {
                                                                    "val": "4.328"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "4.328"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "20.785"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "472"
                                                    },
                                                    "PriorYear": {
                                                        "val": "142"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "181"
                                                    },
                                                    "Total": {
                                                        "val": "795"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2107.895"
                                                    },
                                                    "PriorYear": {
                                                        "val": "109.12"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "205.683"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "36.671"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "28"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "64.671"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "28"
                                                    },
                                                    "Total": {
                                                        "val": "2515.369"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "Quantity": {
                                                "AllPriorYears": {
                                                    "val": "472"
                                                },
                                                "PriorYear": {
                                                    "val": "142"
                                                },
                                                "CurrentYear": {
                                                    "val": "181"
                                                },
                                                "Total": {
                                                    "val": "795"
                                                }
                                            },
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "2107.895"
                                                },
                                                "PriorYear": {
                                                    "val": "109.12"
                                                },
                                                "CurrentYear": {
                                                    "val": "205.683"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "36.671"
                                                },
                                                "BudgetYearOneOCO": {
                                                    "val": "28"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "64.671"
                                                },
                                                "BudgetYearTwo": {
                                                    "val": "28"
                                                },
                                                "Total": {
                                                    "val": "2515.369"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "Letterkenny Army Depot (LEAD"
                                                },
                                                "Location": {
                                                    "val": "Chambersburg, PA."
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2018-02"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2019-02"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2018-07"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2019-07"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "5"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "4"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "AllPriorYears": {
                                                "val": "472"
                                            },
                                            "PriorYear": {
                                                "val": "142"
                                            },
                                            "CurrentYear": {
                                                "val": "181"
                                            },
                                            "Total": {
                                                "val": "795"
                                            }
                                        },
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "2107.895"
                                            },
                                            "PriorYear": {
                                                "val": "109.12"
                                            },
                                            "CurrentYear": {
                                                "val": "205.683"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "36.671"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "28"
                                            },
                                            "BudgetYearOne": {
                                                "val": "64.671"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "28"
                                            },
                                            "Total": {
                                                "val": "2515.369"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "OrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Depot Recap"
                                                    },
                                                    "InstallationQuantity": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            },
                            {
                                "Title": {
                                    "val": "Family of Heavy Tactical Vehicles MOD Efforts"
                                },
                                "Procurement": {
                                    "AKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "val": "HEMTTA4 GMT Crane Effort"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "PriorYear": {
                                                                    "val": "26"
                                                                },
                                                                "Total": {
                                                                    "val": "26"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "PriorYear": {
                                                                    "val": "6.2"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "6.2"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "CTE KIT Procurement\/Install"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "AllPriorYears": {
                                                                    "val": "277"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "210"
                                                                },
                                                                "Total": {
                                                                    "val": "487"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "148.075"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "4.707"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "152.782"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "CTE Kit Procurement\/Install (OCO Only)"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "PriorYear": {
                                                                    "val": "193"
                                                                },
                                                                "Total": {
                                                                    "val": "193"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "0.708"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "2.599"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "3.307"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "CTE - Matrix Functionl Support"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "3.45"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "0.27"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "3.72"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "CTE - Fielding"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "1.615"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "0.28"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "1.895"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "CTE FDT"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "1.127"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "1.137"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "2.264"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "PLS Hook Arm Pin Effort"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "2.8"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "0.665"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "3.465"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "HETS Tractor Mods - Hardware"
                                                        },
                                                        "Cost": {
                                                            "Quantity": {
                                                                "CurrentYear": {
                                                                    "val": "170"
                                                                },
                                                                "Total": {
                                                                    "val": "170"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "CurrentYear": {
                                                                    "val": "9.055"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "9.055"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "277"
                                                    },
                                                    "PriorYear": {
                                                        "val": "429"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "170"
                                                    },
                                                    "Total": {
                                                        "val": "876"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "157.775"
                                                    },
                                                    "PriorYear": {
                                                        "val": "15.858"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "9.055"
                                                    },
                                                    "Total": {
                                                        "val": "182.688"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "Quantity": {
                                                "AllPriorYears": {
                                                    "val": "277"
                                                },
                                                "PriorYear": {
                                                    "val": "429"
                                                },
                                                "CurrentYear": {
                                                    "val": "170"
                                                },
                                                "Total": {
                                                    "val": "876"
                                                }
                                            },
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "157.775"
                                                },
                                                "PriorYear": {
                                                    "val": "15.858"
                                                },
                                                "CurrentYear": {
                                                    "val": "9.055"
                                                },
                                                "Total": {
                                                    "val": "182.688"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "OSHKOSH"
                                                },
                                                "Location": {
                                                    "val": "Oshkosh, WI"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2018-06"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2019-06"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2020-06"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2021-06"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2022-06"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2023-06"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2018-09"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2019-09"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2020-09"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2021-09"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2022-09"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2023-09"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "9"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "3"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "AllPriorYears": {
                                                "val": "277"
                                            },
                                            "PriorYear": {
                                                "val": "429"
                                            },
                                            "CurrentYear": {
                                                "val": "170"
                                            },
                                            "Total": {
                                                "val": "876"
                                            }
                                        },
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "157.775"
                                            },
                                            "PriorYear": {
                                                "val": "15.858"
                                            },
                                            "CurrentYear": {
                                                "val": "9.055"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "182.688"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "OrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "TBD"
                                                    },
                                                    "InstallationQuantity": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "Quantity": {
                            "AllPriorYears": {
                                "val": "749"
                            },
                            "PriorYear": {
                                "val": "571"
                            },
                            "CurrentYear": {
                                "val": "351"
                            },
                            "Total": {
                                "val": "1671"
                            }
                        },
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "2265.67"
                            },
                            "PriorYear": {
                                "val": "124.978"
                            },
                            "CurrentYear": {
                                "val": "214.738"
                            },
                            "BudgetYearOneBase": {
                                "val": "36.671"
                            },
                            "BudgetYearOneOCO": {
                                "val": "28"
                            },
                            "BudgetYearOne": {
                                "val": "64.671"
                            },
                            "BudgetYearTwo": {
                                "val": "28"
                            },
                            "Total": {
                                "val": "2698.057"
                            }
                        }
                    },
                    "Description": {
                        "val": "This line funds the Army's plan to recapitalize Mine Resistant Ambush Protected (MRAP) RG33L+ variant vehicles originally bought to fill Operational Needs Statement (ONS) or Joint Urgent Operational Needs Statement (JUONS) into Program of Record (PoR) Panther Medium Mine Protected Vehicle (MMPV) Type I (a 6 wheeled vehicle).  In addition, this line implements the Army's plan to upgrade a mix of ONS\/JUONS vehicles: Husky, Panther-MMPV Type I, Buffalo, and RG31-MMPV Type II (a 4 wheeled vehicle) in conjunction with a reset program to field PoR vehicles to Engineer Companies; Chemical, Biological, Radiological, Nuclear, Explosive (CBRNE) Units; EOD Units; and Area Clearance Platoons. \n\nThe Family of Heavy Tactical Vehicles (FHTV) modification effort includes, but is not limited to, upgrades to the Palletized Load System Trailer (PLST) with Container Transfer Enhancement (CTE). The CTE enables the PLS truck to directly transload a standard 20-foot International Organization for Standardization (ISO) container to the M1076 PLS trailer without the need for a M1077 flatrack. In addition, this line funds the United States Army Europe (USAREUR) Operational Needs Statement (ONS #17-22207) for Heavy Equipment Transporter System (HETS) tractor modifications. It utilizes the existing M1070A1 HETS tractor to meet the payload screen and road transportability benchmark and provides the best cost, delivery schedule and risk rating. Per the 1 DEC 17 Army Requirement Oversight Committee (AROC), the USAREUR HETS ONS solution shall ultimately be capable of carrying 85 tons of payload and receive road permits at 75 tons within the European Union. Modifications to the tractor will allow the use of the HETS Urban Survivability Kit (HUSK) armored cab if operational conditions change. This line can also fund modifications for active safety; autonomy; modernization and Modification Work Orders (MWOs).\n\nFY 2020 Base procurement dollars of $36.671 million funding completes the entire Route Clearance Vehicle Fleet effort.   Funds Logistics operator and maintenance manual for Husky Engineering Change Proposal (ECP) to provide the ability to Lift and Tie down the Husky vehicle for transport. This ECP is a  Sustainment Cost Savings initiative since currently the Husky requires a crane for assembly, disassembly and containerization for transport. Funds Interim Contractor Logistic Support (ICLS) for previously fielded vehicles until validated maintenance manuals are available and Field Level Maintenance \/ New Equipment Training  is provided to 193 units. Funds Program Management and Engineering Support for the Product Office. The DA0925 supports 85% of the parent DA0924 for Base.\n \nThe 2020 OCO procurement dollars of $28 million completes the Army's plan for fielding of the final 281  MMPV Type II (AAO 823). Funds an increase in fielding teams to maximize delivery for fielding completion by 30 Sep 2020, Operator New Equipment Training and Field Level Maintenance New Equipment Training, Program and Engineering support and transportation   of the MMPV II.      In accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
                    }
                },
                {
                    "ModificationTitle": {
                        "val": "Various"
                    },
                    "ModificationNumber": {
                        "val": "DA0926"
                    },
                    "ModificationType": {
                        "val": "Various"
                    },
                    "Model": {
                        "val": "Various"
                    },
                    "ResourceSummary": {
                        "Quantity": {
                            "BudgetYearOneBase": {
                                "val": "33"
                            },
                            "BudgetYearOne": {
                                "val": "33"
                            },
                            "BudgetYearTwo": {
                                "val": "44"
                            },
                            "BudgetYearThree": {
                                "val": "93"
                            },
                            "Total": {
                                "val": "170"
                            }
                        },
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "4674.181"
                            },
                            "PriorYear": {
                                "val": "21.609"
                            },
                            "CurrentYear": {
                                "val": "41.904"
                            },
                            "BudgetYearOneBase": {
                                "val": "22.275"
                            },
                            "BudgetYearOne": {
                                "val": "22.275"
                            },
                            "BudgetYearTwo": {
                                "val": "21.25"
                            },
                            "BudgetYearThree": {
                                "val": "46.05"
                            },
                            "Total": {
                                "val": "4827.269"
                            }
                        },
                        "UnitCost": {
                            "BudgetYearOneBase": {
                                "val": "675"
                            },
                            "BudgetYearOne": {
                                "val": "675"
                            },
                            "BudgetYearTwo": {
                                "val": "482.955"
                            },
                            "BudgetYearThree": {
                                "val": "495.161"
                            },
                            "Total": {
                                "val": "28395.7"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "4674.181"
                            },
                            "PriorYear": {
                                "val": "21.609"
                            },
                            "CurrentYear": {
                                "val": "41.904"
                            },
                            "BudgetYearOneBase": {
                                "val": "22.275"
                            },
                            "BudgetYearOne": {
                                "val": "22.275"
                            },
                            "BudgetYearTwo": {
                                "val": "21.25"
                            },
                            "BudgetYearThree": {
                                "val": "46.05"
                            },
                            "Total": {
                                "val": "4827.269"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "4674.181"
                            },
                            "PriorYear": {
                                "val": "21.609"
                            },
                            "CurrentYear": {
                                "val": "41.904"
                            },
                            "BudgetYearOneBase": {
                                "val": "22.275"
                            },
                            "BudgetYearOne": {
                                "val": "22.275"
                            },
                            "BudgetYearTwo": {
                                "val": "21.25"
                            },
                            "BudgetYearThree": {
                                "val": "46.05"
                            },
                            "Total": {
                                "val": "4827.269"
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "Recapitalization (MPRCV)\/ Fielding\/FLMNET"
                                },
                                "Procurement": {
                                    "AKits": {
                                        "Recurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": {
                                                            "val": "Kit Quanity"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "AllPriorYears": {
                                                                    "val": "4665.888"
                                                                },
                                                                "PriorYear": {
                                                                    "val": "19.083"
                                                                },
                                                                "CurrentYear": {
                                                                    "val": "40.51"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "4725.481"
                                                                }
                                                            }
                                                        }
                                                    },
                                                    {
                                                        "Name": {
                                                            "val": "Fielding\/FLMNET"
                                                        },
                                                        "Cost": {
                                                            "TotalCost": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "6.275"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "6.275"
                                                                },
                                                                "ToComplete": {
                                                                    "val": "0"
                                                                },
                                                                "Total": {
                                                                    "val": "6.275"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "4665.888"
                                                    },
                                                    "PriorYear": {
                                                        "val": "19.083"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "40.51"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "6.275"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6.275"
                                                    },
                                                    "Total": {
                                                        "val": "4731.756"
                                                    }
                                                }
                                            }
                                        },
                                        "CategorySubtotal": {
                                            "TotalCost": {
                                                "AllPriorYears": {
                                                    "val": "4665.888"
                                                },
                                                "PriorYear": {
                                                    "val": "19.083"
                                                },
                                                "CurrentYear": {
                                                    "val": "40.51"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "6.275"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "6.275"
                                                },
                                                "Total": {
                                                    "val": "4731.756"
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "Letterkenny Army Depot (LEAD)"
                                                },
                                                "Location": {
                                                    "val": "Chambersburg, PA."
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2018-02"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2019-02"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2018-07"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2019-07"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "5"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "4"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "4665.888"
                                            },
                                            "PriorYear": {
                                                "val": "19.083"
                                            },
                                            "CurrentYear": {
                                                "val": "40.51"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "6.275"
                                            },
                                            "BudgetYearOne": {
                                                "val": "6.275"
                                            },
                                            "Total": {
                                                "val": "4731.756"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "OrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Depot Recap"
                                                    },
                                                    "InstallationQuantity": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            },
                            {
                                "Title": {
                                    "val": "Family of Heavy Tactical Vehicles MOD Efforts"
                                },
                                "Procurement": {
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "OSHKOSH"
                                                },
                                                "Location": {
                                                    "val": "Oshkosh, WI"
                                                },
                                                "ContractDates": {
                                                    "PriorYear": {
                                                        "val": "2018-06"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2019-06"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2020-07"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2021-07"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2022-07"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2023-07"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "PriorYear": {
                                                        "val": "2018-09"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2019-09"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2021-01"
                                                    },
                                                    "BudgetYearTwo": {
                                                        "val": "2022-01"
                                                    },
                                                    "BudgetYearThree": {
                                                        "val": "2023-01"
                                                    },
                                                    "BudgetYearFour": {
                                                        "val": "2024-01"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "10"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "6"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "0"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "TBD"
                                                    },
                                                    "InstallationCost": {
                                                        "AllPriorYears": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "1189"
                                                                    },
                                                                    "Total": {
                                                                        "val": "1189"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "1.987"
                                                                    },
                                                                    "Total": {
                                                                        "val": "1.987"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "PriorYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "1913"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "389"
                                                                    },
                                                                    "Total": {
                                                                        "val": "2302"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "6.306"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "2.526"
                                                                    },
                                                                    "Total": {
                                                                        "val": "8.832"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "CurrentYear": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "CurrentYear": {
                                                                        "val": "262"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "33"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "33"
                                                                    },
                                                                    "Total": {
                                                                        "val": "295"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "CurrentYear": {
                                                                        "val": "1.394"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "16"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "16"
                                                                    },
                                                                    "Total": {
                                                                        "val": "17.394"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "BudgetYearTwo": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearTwo": {
                                                                        "val": "44"
                                                                    },
                                                                    "Total": {
                                                                        "val": "44"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearTwo": {
                                                                        "val": "21.25"
                                                                    },
                                                                    "Total": {
                                                                        "val": "21.25"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "BudgetYearThree": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearThree": {
                                                                        "val": "93"
                                                                    },
                                                                    "Total": {
                                                                        "val": "93"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearThree": {
                                                                        "val": "46.05"
                                                                    },
                                                                    "Total": {
                                                                        "val": "46.05"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "BudgetYearFour": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "BudgetYearFive": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "ToComplete": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "AllPriorYears": {
                                                                        "val": "3102"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "389"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "262"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "33"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "33"
                                                                    },
                                                                    "BudgetYearTwo": {
                                                                        "val": "44"
                                                                    },
                                                                    "BudgetYearThree": {
                                                                        "val": "93"
                                                                    },
                                                                    "Total": {
                                                                        "val": "3923"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "AllPriorYears": {
                                                                        "val": "8.293"
                                                                    },
                                                                    "PriorYear": {
                                                                        "val": "2.526"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "1.394"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "16"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "16"
                                                                    },
                                                                    "BudgetYearTwo": {
                                                                        "val": "21.25"
                                                                    },
                                                                    "BudgetYearThree": {
                                                                        "val": "46.05"
                                                                    },
                                                                    "Total": {
                                                                        "val": "95.513"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "AllPriorYears": {
                                                                "val": "1901"
                                                            },
                                                            "PriorYear": {
                                                                "FirstQuarter": {
                                                                    "val": "182"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "182"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "140"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "140"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "140"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "140"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "66"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "66"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "66"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "66"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "8"
                                                                }
                                                            },
                                                            "BudgetYearTwo": {
                                                                "FirstQuarter": {
                                                                    "val": "8"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "8"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "9"
                                                                }
                                                            },
                                                            "Total": {
                                                                "val": "3122"
                                                            }
                                                        },
                                                        "Out": {
                                                            "AllPriorYears": {
                                                                "val": "1719"
                                                            },
                                                            "PriorYear": {
                                                                "FirstQuarter": {
                                                                    "val": "182"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "182"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "182"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "140"
                                                                }
                                                            },
                                                            "CurrentYear": {
                                                                "FirstQuarter": {
                                                                    "val": "140"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "140"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "140"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "66"
                                                                }
                                                            },
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "66"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "66"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "66"
                                                                }
                                                            },
                                                            "BudgetYearTwo": {
                                                                "FirstQuarter": {
                                                                    "val": "8"
                                                                },
                                                                "SecondQuarter": {
                                                                    "val": "8"
                                                                },
                                                                "ThirdQuarter": {
                                                                    "val": "8"
                                                                },
                                                                "FourthQuarter": {
                                                                    "val": "9"
                                                                }
                                                            },
                                                            "Total": {
                                                                "val": "3122"
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "AllPriorYears": {
                                                "val": "3102"
                                            },
                                            "PriorYear": {
                                                "val": "389"
                                            },
                                            "CurrentYear": {
                                                "val": "262"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "33"
                                            },
                                            "BudgetYearOne": {
                                                "val": "33"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "44"
                                            },
                                            "BudgetYearThree": {
                                                "val": "93"
                                            },
                                            "Total": {
                                                "val": "3923"
                                            }
                                        },
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "8.293"
                                            },
                                            "PriorYear": {
                                                "val": "2.526"
                                            },
                                            "CurrentYear": {
                                                "val": "1.394"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "16"
                                            },
                                            "BudgetYearOne": {
                                                "val": "16"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "21.25"
                                            },
                                            "BudgetYearThree": {
                                                "val": "46.05"
                                            },
                                            "Total": {
                                                "val": "95.513"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "4665.888"
                            },
                            "PriorYear": {
                                "val": "19.083"
                            },
                            "CurrentYear": {
                                "val": "40.51"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.275"
                            },
                            "BudgetYearOne": {
                                "val": "6.275"
                            },
                            "Total": {
                                "val": "4731.756"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "Quantity": {
                            "AllPriorYears": {
                                "val": "3102"
                            },
                            "PriorYear": {
                                "val": "389"
                            },
                            "CurrentYear": {
                                "val": "262"
                            },
                            "BudgetYearOneBase": {
                                "val": "33"
                            },
                            "BudgetYearOne": {
                                "val": "33"
                            },
                            "BudgetYearTwo": {
                                "val": "44"
                            },
                            "BudgetYearThree": {
                                "val": "93"
                            },
                            "Total": {
                                "val": "3923"
                            }
                        },
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "8.293"
                            },
                            "PriorYear": {
                                "val": "2.526"
                            },
                            "CurrentYear": {
                                "val": "1.394"
                            },
                            "BudgetYearOneBase": {
                                "val": "16"
                            },
                            "BudgetYearOne": {
                                "val": "16"
                            },
                            "BudgetYearTwo": {
                                "val": "21.25"
                            },
                            "BudgetYearThree": {
                                "val": "46.05"
                            },
                            "Total": {
                                "val": "95.513"
                            }
                        }
                    },
                    "Description": {
                        "val": "This line funds the Army's plan to recapitalize Mine Resistant Ambush Protected (MRAP) RG33L+ variant vehicles originally bought to fill Operational Needs Statement (ONS) or Joint Operational Needs Statement (JUONS) into Program of Record (PoR) Panther Medium Mine Protected Vehicle (MMPV) Type I (a 6 wheeled  vehicle).  In addition, this line implements the Army's plan to upgrade a mix of ONS\/JUONS vehicles: Husky, Panther-MMPV Type I, Buffalo, and RG31-MMPV Type II (a 4 wheeled vehicle) in conjunction with a reset program to field PoR vehicles to Engineer Companies; Chemical, Biological, Radiological, Nuclear, Explosive (CBRNE) Units; EOD Units; and Area Clearance Platoons.\n\nThe Family of Heavy Tactical Vehicles (FHTV) line funds the United States Army Europe (USAREUR) Operational Needs Statement (ONS #17-22207) for Heavy Equipment Transporter System (HETS) tractor modifications. Existing M1070A1 HETS tractors will be modified to meet the payload requirements directed in the 1 DEC 17 Army Requirements Oversight Council (AROC) memo of achieving a payload capacity of 78.5 tons without consideration of operational road permits, and 75 ton capacity while obtaining operational road permits in the European area of operations. The AROC memo additionally directed the further modification of M1070A1 tractors to meet the capacity targets of 85 tons without consideration of operational road permits and maintaining a capacity of 75 tons with operational road permits in the European theater of operations. Both configurations allow for the use of the HETS Urban Survivability Kit (HUSK) armored cab. This line also funds modifications for active safety; autonomy; and Modification Work Orders (MWOs). \n\nFY 2020 Base procurement dollars of $6.275 million Funding completes the entire Route Clearance Vehicle Fleet effort.   Logistics operator and maintenance manual for Husky Engineering Change Proposal (ECP) to provide the ability to Lift and Tie down the Husky vehicle. This ECP is a  Sustainment Cost Savings initiative since currently the Husky requires a crane for assembly, disassembly and containerization. Funds ICLS for previously fielded vehicles until validated maintenance manuals are available and Field Level Maintenance \/ New Equipment Training (FLMNET) is provided to units.  Program Management and Engineering Support for the Product Office. The DA0926 supports 15% of the parent, DA0924 for Base. In accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\n\nFY 2020 Base procurement dollars in the amount of $16.000 million provides for 33 United States Army Europe (USAREUR) Heavy Equipment Transporter Systems (HETS) Operational Needs Statement (ONS) tractor modifications to pair with commercial new production trailers. Per the 1 DEC 17 Army Requirements Oversight Council (AROC), this additional modification to the M1070A1 tractor will allow it to achieve an ultimate carrying capacity of 85 tons while achieving operational road permits at a weight of 75 tons in the European theater of operations. This funding will provide for the purchase of the modification to the tractors, documentation and data to support technical manual and training material development, transportation to and from the facility conducting the modification, and finish automotive and performance testing of the system to ensure that the 85 ton payload objective is met.   This program supports the Army's modernization priorities in support of the National Defense Strategy."
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}