{
    "id": "2020-Army-PB-2033A-JBOOK-36f9e8210537ea7aa53fea5e324974b9ef85f39529f985c49fddc0eb80a8c4f4-38",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_WTCV-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2033A",
        "appropriation_name": "Procurement of W&TCV, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "3270GC0050"
        },
        "LineItemTitle": {
            "val": "Production Base Support (WOCV-WTCV)"
        },
        "P1LineNumber": {
            "val": "39"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2033A"
        },
        "AppropriationTitle": {
            "val": "Procurement of W&TCV, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Weapons and Other Combat Vehicles"
        },
        "BudgetSubActivityNumber": {
            "val": "30"
        },
        "BudgetSubActivityTitle": {
            "val": "Support Equipment & Facilities"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "326.984"
                },
                "PriorYear": {
                    "val": "0.992"
                },
                "CurrentYear": {
                    "val": "3.284"
                },
                "BudgetYearOneBase": {
                    "val": "2.651"
                },
                "BudgetYearOne": {
                    "val": "2.651"
                },
                "BudgetYearTwo": {
                    "val": "3.048"
                },
                "BudgetYearThree": {
                    "val": "3.534"
                },
                "BudgetYearFour": {
                    "val": "3.6"
                },
                "BudgetYearFive": {
                    "val": "3.701"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "326.984"
                },
                "PriorYear": {
                    "val": "0.992"
                },
                "CurrentYear": {
                    "val": "3.284"
                },
                "BudgetYearOneBase": {
                    "val": "2.651"
                },
                "BudgetYearOne": {
                    "val": "2.651"
                },
                "BudgetYearTwo": {
                    "val": "3.048"
                },
                "BudgetYearThree": {
                    "val": "3.534"
                },
                "BudgetYearFour": {
                    "val": "3.6"
                },
                "BudgetYearFive": {
                    "val": "3.701"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "326.984"
                },
                "PriorYear": {
                    "val": "0.992"
                },
                "CurrentYear": {
                    "val": "3.284"
                },
                "BudgetYearOneBase": {
                    "val": "2.651"
                },
                "BudgetYearOne": {
                    "val": "2.651"
                },
                "BudgetYearTwo": {
                    "val": "3.048"
                },
                "BudgetYearThree": {
                    "val": "3.534"
                },
                "BudgetYearFour": {
                    "val": "3.6"
                },
                "BudgetYearFive": {
                    "val": "3.701"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "0.992"
                                },
                                "CurrentYear": {
                                    "val": "3.284"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.651"
                                },
                                "BudgetYearOne": {
                                    "val": "2.651"
                                },
                                "BudgetYearTwo": {
                                    "val": "3.048"
                                },
                                "BudgetYearThree": {
                                    "val": "3.534"
                                },
                                "BudgetYearFour": {
                                    "val": "3.6"
                                },
                                "BudgetYearFive": {
                                    "val": "3.701"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "0.992"
                    },
                    "CurrentYear": {
                        "val": "3.284"
                    },
                    "BudgetYearOneBase": {
                        "val": "2.651"
                    },
                    "BudgetYearOne": {
                        "val": "2.651"
                    },
                    "BudgetYearTwo": {
                        "val": "3.048"
                    },
                    "BudgetYearThree": {
                        "val": "3.534"
                    },
                    "BudgetYearFour": {
                        "val": "3.6"
                    },
                    "BudgetYearFive": {
                        "val": "3.701"
                    }
                }
            }
        },
        "Description": {
            "val": "This program provides funding to the Army Test and Evaluation Command (ATEC) to establish, modernize, expand or replace test facilities used in production testing of Weapons and Tracked Combat Vehicles and their components.  It sustains Army production test capabilities through upgrade and replacement of instrumentation and equipment that is technologically and\/or economically obsolete.  Modernization of test instrumentation and equipment provides increased automation and efficiencies, improved data quality and quantity and cost avoidance to Army Program Managers.  Programmed funding will be used to upgrade or replace production test instrumentation and equipment at Aberdeen Test Center (ATC), Aberdeen Proving Ground, MD; White Sands Test Center (WSTC), White Sands Missile Range, NM and Yuma Test Center (YTC), Yuma Proving Ground, AZ. \n\nThis program provides funding to establish, modernize, expand or replace Army-owned industrial facilities and equipment used in production and production testing of Weapons and Tracked Combat Vehicles and their components. The program also provides for the preserving, storing and disposing for facilities and equipment that are either not required for current active production or are not needed by the Army. Provisioning of Industrial Facilities (PIF) occurs at Rock Island Arsenal, IL; Watervliet Arsenal, NY; and General Dynamics-Armaments and Technical Products, Saco, ME. The Layaway of Industrial Facilities (LIF) and Maintenance of Laid-away Industrial Facilities (MLIF) funding supports unique and necessary equipment at Watervliet Arsenal, NY. This program also provides funding for the Arsenal Support Program Initiative."
        },
        "Justification": {
            "val": "FY 2020 Base procurement dollars in the amount of $2.651million support the following:\n\nAt Aberdeen Test Center (ATC), upgrades Fire Control Instrumentation, which in many cases is over 10 years old and has exceeded its economic useful life. The effort will replace or upgrade instrumentation required to assess weapon fire control system performance on a wide range of test items. New weapon and sight HD video cameras, recorders, and digital processing video systems and telemetry systems will provide equal or greater capability at less annual operations and sustainment.\n\nAt ATC and Yuma Test Center (YTC): replace and upgrade the current 35-year-old configurations of the mobile dynamometer control systems. The upgrades will include programmable dynamometer control, using any combination of vehicle speed, drawbar force and\/or absorbed power. This effort will result in more reliable dynamometer operations, reduced downtimes, and reduced Operations and Maintenance (O&M) costs, providing increased capabilities at ATC and YTC for automotive powertrain, winch, and fuel consumption testing.\n\nAt White Sand Test Center (WSTC): maintains and upgrades White Sands Missile Range's directed energy, and High Power Electromagnetic (HPEM) effects test simulators. WSTC will repair, upgrade, and replace existing equipment and instrumentation that no longer meets regulatory, customer, and mission requirements due to excessive use, age, deterioration of components, new mission requirements and outdated technologies. This effort will result in environmental regulatory compliance, safety improvements, reduced down-times and turn-around times, and reduced O&M costs at WSTC.\n\nThis instrumentation is required to ensure complete and accurate test data are collected and safety and environmental hazards are minimized. Benefits of this project include increased test efficiencies and decreased costs and risk to Army Program Managers.\n\nIn accordance with section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}