{
    "id": "2020-Army-PB-2035A-JBOOK-ffd9e522016155822ff405752ab066bad8691a671e35376b94f41dbe6a64b3a9-38",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_OTHER_3-4-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "4428X01500"
        },
        "LineItemTitle": {
            "val": "Hydraulic Excavator"
        },
        "P1LineNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "50"
        },
        "BudgetSubActivityTitle": {
            "val": "Construction Equipment"
        },
        "ResourceSummary": {
            "Quantity": {
                "PriorYear": {
                    "val": "5"
                },
                "CurrentYear": {
                    "val": "2"
                },
                "BudgetYearThree": {
                    "val": "5"
                },
                "Total": {
                    "val": "12"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "119.31"
                },
                "PriorYear": {
                    "val": "3.85"
                },
                "CurrentYear": {
                    "val": "1.355"
                },
                "BudgetYearOneBase": {
                    "val": "0.5"
                },
                "BudgetYearOne": {
                    "val": "0.5"
                },
                "BudgetYearTwo": {
                    "val": "5.192"
                },
                "BudgetYearThree": {
                    "val": "3.4"
                },
                "Total": {
                    "val": "133.607"
                }
            },
            "UnitCost": {
                "PriorYear": {
                    "val": "770"
                },
                "CurrentYear": {
                    "val": "677.5"
                },
                "BudgetYearThree": {
                    "val": "680"
                },
                "Total": {
                    "val": "11133.917"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "119.31"
                },
                "PriorYear": {
                    "val": "3.85"
                },
                "CurrentYear": {
                    "val": "1.355"
                },
                "BudgetYearOneBase": {
                    "val": "0.5"
                },
                "BudgetYearOne": {
                    "val": "0.5"
                },
                "BudgetYearTwo": {
                    "val": "5.192"
                },
                "BudgetYearThree": {
                    "val": "3.4"
                },
                "Total": {
                    "val": "133.607"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "119.31"
                },
                "PriorYear": {
                    "val": "3.85"
                },
                "CurrentYear": {
                    "val": "1.355"
                },
                "BudgetYearOneBase": {
                    "val": "0.5"
                },
                "BudgetYearOne": {
                    "val": "0.5"
                },
                "BudgetYearTwo": {
                    "val": "5.192"
                },
                "BudgetYearThree": {
                    "val": "3.4"
                },
                "Total": {
                    "val": "133.607"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "Quantity": {
                                "PriorYear": {
                                    "val": "5"
                                },
                                "CurrentYear": {
                                    "val": "2"
                                },
                                "BudgetYearThree": {
                                    "val": "5"
                                }
                            },
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "3.85"
                                },
                                "CurrentYear": {
                                    "val": "1.355"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.5"
                                },
                                "BudgetYearOne": {
                                    "val": "0.5"
                                },
                                "BudgetYearTwo": {
                                    "val": "5.192"
                                },
                                "BudgetYearThree": {
                                    "val": "3.4"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "Quantity": {
                    "PriorYear": {
                        "val": "5"
                    },
                    "CurrentYear": {
                        "val": "2"
                    },
                    "BudgetYearThree": {
                        "val": "5"
                    }
                },
                "TotalCost": {
                    "PriorYear": {
                        "val": "3.85"
                    },
                    "CurrentYear": {
                        "val": "1.355"
                    },
                    "BudgetYearOneBase": {
                        "val": "0.5"
                    },
                    "BudgetYearOne": {
                        "val": "0.5"
                    },
                    "BudgetYearTwo": {
                        "val": "5.192"
                    },
                    "BudgetYearThree": {
                        "val": "3.4"
                    }
                }
            }
        },
        "Description": {
            "val": "The HYEX Type I enables Combat Engineer units with the capabilities necessary to efficiently fulfill Joint Engineer Mission requirements across all phases of Joint Military Operations and conduct Joint Functions of (1) Movement and Maneuver: Combat Roads and Trails, Gap Crossing, Lines of Communications and\/or Supply Routes, Vegetation Removal in Support of IEDD Intermediate Staging Bases, Barriers and Obstacles, Breaching and Clearing Operations; (2) Protection:  Hardening; Field Fortification Support; (3) Sustainment: Base Camp Development, Construction and Repair of Infrastructure and Facilities.  The HYEX Type I enables U.S. Army Engineers with the capabilities to perform precision excavation, land clearing, and lifting and loading various materials and aggregates into dump trucks, concrete mobile mixers, hoppers, and aggregate bins in an expeditious manner. These capabilities also include supporting and operating GP Bucket, Rock Bucket, Hydraulic Hammer, Hydraulic Plate Compactor, Barrier Grapple, Crush-all, and Vegetation Removal Tool.  A Commercial-Off-The-Shelf (COTS), the HYEX Type I has a Crew Protection Kit, Rifle Mount, NATO Receptacle, JP-8 Fuel Compatibility, and CARC paint. The HYEX is fielded to Horizontal Construction Companies, VERT Companies, Multi-Role Bridge Companies, and the TRADOC training base. The CEVT are commercial off the shelf virtual training devices with software modifications for military unique tasks.  These simulators enable the United States Army Engineer School with the capability to more effectively train Engineer Military Occupational Skill (MOS), while reducing maintenance of actual equipment and fuel costs during traditional training.  These simulators provide the Engineer Warfighter with a multitude of training scenarios and continuous hands on training on a variety of construction equipment and in various simulated conditions.  Use of CEVT increases skills and competency in the operation of equipment. The HYEX Type I Army Acquisition Objective (AAO) is 465; with 35 Construction Equipment Virtual Trainers (CEVT).The minimum monthly sustaining rate is 1, economic rate is 5, and maximum rate is 8 per month.\n\nCapabilities of HYEX are as follows for each platform:\n\nHorizontal Construction Company, TOE 05417R000: Provides personnel and equipment to perform Engineering tasks such as clearing and grubbing operations; haul, grade, shape, compact, cut and fill material; emplace culverts; remove snow\/ice; construct drainage structures; conduct burrow pit operations; provide dust control operations; construct basecamps, air landing platforms, Forward Area Rearming and refueling Points (FARPS), supply routes, roads, control points, fire bases, tank ditches, Ammunition Supply Points (ASPCs), and field hospital platforms; prepare river crossing sites; and support port repair due to Hydraulic Excavator (HYEX). \nVertical Construction Company, TOE 05418R000: Provides personnel and equipment to perform Engineering tasks such as constructing basecamps, internment facilities; and constructs, repairs, maintains vertical infrastructures. \nEngineer Support Company, TOEs 05419R000\/100: Provides personnel and equipment to conduct engineering missions including Rapid Runway Repair (RRR), initial basecamp construction, non-explosive obstacle breaching, non-explosive area clearing, constructing tactical Unmanned Aerial Vehicle (UAV) airfields, helicopter Landing Zones (HLZs), and Assault Landing Zones (ALZs) to Division\/Corps and Maneuver BCT. \nMultirole Bridge Company, TOE 05473R000: Provides personnel and equipment to transport, assemble, disassemble, retrieve, and maintain all standard U.S. Army bridging systems, (HYEX conducts dredge operations to emplace bridging assets), and to provide transportation of Palletized Loading System (PLS) configured cargo."
        },
        "Justification": {
            "val": "FY20  Base procurement dollars in the amount of $0.500 million procures support of the Hydraulic Excavator Type I (HYEX-I) vehicle.\n\nNote: This program is considered a Critical Dual Use (CDU) system.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}