{
    "id": "2020-AirForce-PB-3010F-MJBOOK-0-0-1e0f952d1345c880c8ec0a5af7b60dd62ff8d78e20c2ef53a26e5060c0bfd863-13",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_AIRCRAFT_VOL2-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3010F",
        "appropriation_name": "Aircraft Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "OAX000"
        },
        "LineItemTitle": {
            "val": "Observation Attack Replacement (OA-X)"
        },
        "P1LineNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3010F"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Other Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Aircraft"
        },
        "ResourceSummary": {
            "Quantity": {
                "BudgetYearThree": {
                    "val": "4"
                },
                "BudgetYearFour": {
                    "val": "10"
                },
                "BudgetYearFive": {
                    "val": "10"
                },
                "Total": {
                    "val": "24"
                }
            },
            "TotalCost": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "100"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "160"
                },
                "BudgetYearFour": {
                    "val": "400.005"
                },
                "BudgetYearFive": {
                    "val": "400.005"
                },
                "Total": {
                    "val": "1060.01"
                }
            },
            "UnitCost": {
                "BudgetYearThree": {
                    "val": "40"
                },
                "BudgetYearFour": {
                    "val": "40.001"
                },
                "BudgetYearFive": {
                    "val": "40.001"
                },
                "Total": {
                    "val": "44.167"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "100"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "160"
                },
                "BudgetYearFour": {
                    "val": "400.005"
                },
                "BudgetYearFive": {
                    "val": "400.005"
                },
                "Total": {
                    "val": "1060.01"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "100"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "160"
                },
                "BudgetYearFour": {
                    "val": "400.005"
                },
                "BudgetYearFive": {
                    "val": "400.005"
                },
                "Total": {
                    "val": "1060.01"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Light Attack Aircraft (LAA) platform increases combat capability and readiness at reduced operating costs for missions in permissive environments. LAA executes under a middle tier rapid fielding acquisition strategy pursuant to Section 804 of the FY16 National Defense Authorization Act. The LAA option offers flexibility and accelerates modernization of current and potential partner forces who do not require advanced fighter aircraft. The LAA effort supports the National Defense Strategy to counter violent extremism on a global scale, alongside allies and partners.\n\nLAA in light of the National Defense Strategy coupled with the potential for U.S. and partner nations combined airborne operations requires the efficient and timely information exchange of tactical data. LAA and partner nations interoperability will achieved by the utilization of a secure and fully-exportable tactical data network.\n\nLAA squadrons will provide a deployable and sustainable multirole attack capability, capable of performing a diverse array of attack missions, including but not limited to, Close Air Support (CAS), Armed Reconnaissance, Strike Coordination and Reconnaissance (SCAR), Airborne Forward Air control (FAC-A), and Interdiction. Other tasks for which Light Attack aircraft is expected to be suitable include Combat Search and Rescue (CSAR), Rescue Escort (RESCORT), and Maritime Air Support (MAS). LAA squadrons executing these tasks allows our 4th and 5th Generation fighter fleets to implement a tailored training regimen to address declining core mission readiness and focus on preparing to deter or prevail in conflicts with peer adversaries. LAA will provide a deployable, persistent attack capability that can be employed with low footprint and light logistical support requirements.\n\nOn 31 July 2018, LAA was formally designated a Section 804 rapid fielding program by the Assistant Secretary of the Air Force (AT&L). Initial aircraft sustainment efforts, known as Contractor Logistics Support (CLS) will be provided by the contractor. LAA funding also supports procurement of long lead materials ,as directed by the Congressional add, Life of Type Buys as required, Training Systems, Support Equipment, Operation Site Activation, Depot Stand-Up, Direct Mission Support, Program Management Administration (PMA) activities, Other Government Costs (OGC), various studies and analysis, future LAA planning activities, and potential Diminishing Manufacturing Sources (DMS) and obsolescence planning activities.\n\nThe LAA program is acquiring a complete training system to include motion and non-motion simulators, and other aircrew and maintenance part task training devices. It also includes Type I training, aircrew and maintenance courseware, Interim Contractor Support (ICS), and support equipment.\n\nFunding for this exhibit is contained in PE 0207100F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "There are currently no FY20 procurement funds being requested for Light Attack aircraft."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}