{
    "id": "2020-AirForce-PB-3080F-JBOOK-436af14163fe2e9306ff706b86ab44f2d525ceb9c7dd74301eaba5aa16959d87-17",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_OTHER-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "833030"
        },
        "LineItemTitle": {
            "val": "Battle Control System - Fixed"
        },
        "P1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "Electronics Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "6.415"
                },
                "CurrentYear": {
                    "val": "2.849"
                },
                "BudgetYearOneBase": {
                    "val": "3.063"
                },
                "BudgetYearOne": {
                    "val": "3.063"
                },
                "BudgetYearTwo": {
                    "val": "3.119"
                },
                "BudgetYearThree": {
                    "val": "3.175"
                },
                "BudgetYearFour": {
                    "val": "3.232"
                },
                "BudgetYearFive": {
                    "val": "3.291"
                },
                "Total": {
                    "val": "25.144"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "6.415"
                },
                "CurrentYear": {
                    "val": "2.849"
                },
                "BudgetYearOneBase": {
                    "val": "3.063"
                },
                "BudgetYearOne": {
                    "val": "3.063"
                },
                "BudgetYearTwo": {
                    "val": "3.119"
                },
                "BudgetYearThree": {
                    "val": "3.175"
                },
                "BudgetYearFour": {
                    "val": "3.232"
                },
                "BudgetYearFive": {
                    "val": "3.291"
                },
                "Total": {
                    "val": "25.144"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "6.415"
                },
                "CurrentYear": {
                    "val": "2.849"
                },
                "BudgetYearOneBase": {
                    "val": "3.063"
                },
                "BudgetYearOne": {
                    "val": "3.063"
                },
                "BudgetYearTwo": {
                    "val": "3.119"
                },
                "BudgetYearThree": {
                    "val": "3.175"
                },
                "BudgetYearFour": {
                    "val": "3.232"
                },
                "BudgetYearFive": {
                    "val": "3.291"
                },
                "Total": {
                    "val": "25.144"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "1"
                },
                "CurrentYear": {
                    "val": "1"
                },
                "BudgetYearOneBase": {
                    "val": "1"
                },
                "BudgetYearOne": {
                    "val": "1"
                },
                "Total": {
                    "val": "3"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "BCS-F supports the North American Aerospace Defense Command\/ Northern Command (NORAD\/NORTHCOM) homeland defense and air sovereignty mission for fixed Air Defense Sectors.\n\nBATTLE CONTROL SYSTEM-FIXED (BCS-F): BCS-F is a Bi-national program with Canada. The BCS-F Program is an AF Homeland Defense battle management command and control system with the capability to integrate data from existing and future civil and military defense surveillance systems into a comprehensive air picture. BCS-F provides tactical communications and data link capabilities with other military and civil systems responsible for planning, directing, coordinating and controlling forces for air surveillance, air defense, and control of sovereign US air space. This integrated air picture enhances the capability to conduct peacetime air sovereignty operations and transition to active air defense operations in the event of aggression. Life cycle replacement will be required to prevent system obsolescence, account for new cyber-security requirements and posture the program to seamlessly integrate future capabilities.\n\nNATIONAL CAPITOL REGION - INTEGRATED AIR DEFENSE SYSTEM (NCR-IADS): NCR-IADS is a post-September 11, 2001 rapidly fielded capability that improves low altitude detection capability in order to prosecute airborne threats to the NCR. NCR-IADS provides ground-based air defense of the National Capitol Region airspace, and provides an integrated air picture, ground air defense weapons, enhanced regional situational awareness and forensic data collection capabilities for the warfighter mission to protect the NCR. FY2020 life cycle replacement will be required, to prevent system obsolescence, account for new cyber-security requirements and posture the program to seamlessly integrate future capabilities.\n\nBATTLE CONTROL SYSTEM MODIFICATION: Provides for capital equipment replacement activities at the fixed Air Defense Sectors under the modification efforts for Release 3.2.5 and beyond, which include, but are not limited to: infrastructure upgrades, future Diminishing Manufacturing Sources (DMS), and replacement of other equipment that does not qualify for Centralized Asset Management (CAM) funding.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "- NATIONAL CAPITAL REGION - INTEGRATED AIR DEFENSE SYSTEM (NCR-IADS): FY2020 funds will support hardware upgrades to seamlessly integrate new and emerging sensors, data, and technologies. Funds will be utilized for hardware upgrades and spares that do not qualify for Centralized Asset Management (CAM) funding, to include, but not limited to: updated configurations of existing sites to match the modified baseline, and hardware to maintain the mandated cyber security posture and Authority to Operate (ATO) requirements.\n\n- BATTLE CONTROL SYSTEM MODIFICATION: FY2020 funds will support hardware upgrades to seamlessly integrate new and emerging sensors, data, and technologies. Funds will be utilized for hardware upgrades and spares that do not qualify for Centralized Asset Management (CAM) funding, to include, but not limited to: updated configurations of existing sites to match the modified baseline, and hardware to maintain the mandated cyber security posture and Authority to Operate (ATO) requirements.\n\n- PROGRAM MANAGEMENT ADMINISTRATION (PMA): FY2020 funds for PMA costs provide the management, engineering and technical support for the program office.\n\n- This funding request supports potential Diminishing Manufacturing Sources (DMS) and obsolescence solutions, to include if optimal, life of type buys or bridge buys limited to the program of record quantity."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}