{
    "id": "2020-AirForce-PB-3080F-MJBOOK-0-0-32f43a028405e13288a3cdd30654b31c0257b2b6cc94e347effadb70a892396d-35",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_OTHER-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "834470"
        },
        "LineItemTitle": {
            "val": "Defense Enterprise Accounting & Mgt Sys"
        },
        "P1LineNumber": {
            "val": "38"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "13.04"
                },
                "PriorYear": {
                    "val": "1"
                },
                "CurrentYear": {
                    "val": "0.802"
                },
                "BudgetYearOneBase": {
                    "val": "1.905"
                },
                "BudgetYearOne": {
                    "val": "1.905"
                },
                "BudgetYearTwo": {
                    "val": "0.9"
                },
                "BudgetYearThree": {
                    "val": "3.107"
                },
                "BudgetYearFour": {
                    "val": "3.162"
                },
                "BudgetYearFive": {
                    "val": "3.219"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "27.135"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "13.04"
                },
                "PriorYear": {
                    "val": "1"
                },
                "CurrentYear": {
                    "val": "0.802"
                },
                "BudgetYearOneBase": {
                    "val": "1.905"
                },
                "BudgetYearOne": {
                    "val": "1.905"
                },
                "BudgetYearTwo": {
                    "val": "0.9"
                },
                "BudgetYearThree": {
                    "val": "3.107"
                },
                "BudgetYearFour": {
                    "val": "3.162"
                },
                "BudgetYearFive": {
                    "val": "3.219"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "27.135"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "13.04"
                },
                "PriorYear": {
                    "val": "1"
                },
                "CurrentYear": {
                    "val": "0.802"
                },
                "BudgetYearOneBase": {
                    "val": "1.905"
                },
                "BudgetYearOne": {
                    "val": "1.905"
                },
                "BudgetYearTwo": {
                    "val": "0.9"
                },
                "BudgetYearThree": {
                    "val": "3.107"
                },
                "BudgetYearFour": {
                    "val": "3.162"
                },
                "BudgetYearFive": {
                    "val": "3.219"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "27.135"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0901554F"
                }
            ]
        },
        "Description": {
            "val": "Defense Enterprise Accounting and Management System (DEAMS) is a commercial-off-the-shelf (COTS), Oracle-based software implementation effort that will provide an auditable, modern accounting and finance system. DEAMS is a Joint United States Air Force (USAF) and United States Transportation Command (USTRANSCOM) Enterprise Resource Planning (ERP) Program that will provide core funds execution management functions consistent with financial management laws, regulations and policy, general ledger, funds management, payments, receivables, cost and revenues, and fiduciary reporting. DEAMS is compliant with the Clinger-Cohen Act, Business Enterprise Architecture (BEA), and integrates into Global Combat Support System-Air Force (GCSS-AF). When fully deployed, DEAMS will be key to Air Force compliance with the Financial Improvement and Audit Readiness (FIAR) requirement in the 2010 National Defense Authorization Act (NDAA).\n\nDEAMS user deployments include:\n- Air Mobility Command (AMC) without Transportation Working Capital Funds (TWCF)\n- AMC with TWCF, in conjunction with Defense Finance and Accounting Service (DFAS) Rome\n- Air Combat Command (ACC) and Air Force Global Strike Command (AFGSC)\n- Air Force Reserve Command (AFRC), Air National Guard (ANG), and other Geographically Separated Units (GSUs) to include DFAS Limestone, Air Force District of Washington (AFDW), Air Force Special Operations Command (AFSOC), U.S. Air Force Academy (USAFA), Pacific Air Forces (PACAF), and DFAS Japan\n- U.S. Air Forces in Europe (USAFE), DFAS Europe, Air Education and Training Command (AETC), and Joint Base San Antonio\n- Air Force Material Command (AFMC), and Air Force Space Command (AFSPC) \n- Remaining DFAS locations and all other GSUs\n\nOn 23 January 2017, the senior official provided the Critical Change Report (CCR) with certifications to Congress. The report recommended a restructure of DEAMS from one increment to multiple increments. The Milestone Decision Authority (MDA) approved the restructured program for DEAMS Increment (Inc) 1, to include deferring certain requirements to future increments, a limited deployment to an additional 700 users for Inc 1 to United States Air Forces in Europe (USAFE), and the updated Full Deployment Authority to Proceed (FD ATP) criteria via an Acquisition Decision Memorandum (ADM) dated 2 June 2017. FD ATP date is August 2020 and Capability Support Authority to Proceed (CS ATP) date is February 2021.  \n\nThe remaining DEAMS Inc 1 schedule includes Oracle e-Business Suite R12 upgrade and reporting, auditing, and disbursing initiatives. DEAMS was designated as an Agile Pilot program in the FY19 NDAA.  Reporting, auditing, and disbursing will be completed using Agile Software Development.\n\nDEAMS Inc 1 funding through FY 2020 is to support Inc 1 deployments. DEAMS Continuous Capabilities Development (CCD) funding begins in FY2022 and will support CCD Agile deployments. \nDEAMS Inc 1 and CCD will require software user licenses to support system deployments as well as potential software and hardware requirements needed to manage, execute, and deliver DEAMS system capability including necessary system upgrades. \n\nFunds are used to procure software user licenses and other potential hardware and software using multiple contracts and various vendors. Software license counts are estimates and may vary at actual execution based on system needs. \n\nThis funding request will support potential DMS and obsolescence solutions, to include if optimal, life of type buys or bridge buys limited to the program of record quantity. This program element may include necessary civilian pay expenses required to manage, execute, and deliver DEAMS system capability. \n\n\nBeginning in FY20 DEAMS procurement funding moves to PE 0901554F, Defense Enterprise Accounting and Management System (DEAMS). Procurement funding prior to FY19 for DEAMS was in PE 0901538F, Financial Management Information Systems Development (FMISD).\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "Funds are used to procure software licenses and other potential hardware using multiple contracts and various vendors.  Software license counts are estimates and may vary at actual execution based on system needs.\n\nThis funding request will support potential Diminishing Manufacturing Statement (DMS) and obsolescence solutions, to include, if optimal, life of type buys or bridge buys limited to the program of record quantity. This program element may include necessary civilian pay expenses required to manage, execute, and deliver DEAMS system capability."
        },
        "MDAPCode": {
            "val": "N87"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}