{
    "id": "2020-Navy-PB-1109N-JBOOK-b326adbe914504e2b61de725ef983e7223e072a57601b3e4ae0ec2b7f58a6709-23",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "4767"
        },
        "LineItemTitle": {
            "val": "Distributed Common Ground System (DCGS-MC)"
        },
        "P1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "16"
        },
        "BudgetSubActivityTitle": {
            "val": "Intell\/Comm Equipment (Non-Tel)"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "59.99"
                },
                "PriorYear": {
                    "val": "12.883"
                },
                "CurrentYear": {
                    "val": "16.081"
                },
                "BudgetYearOneBase": {
                    "val": "32.562"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "32.562"
                },
                "BudgetYearTwo": {
                    "val": "34.427"
                },
                "BudgetYearThree": {
                    "val": "27.623"
                },
                "BudgetYearFour": {
                    "val": "29.173"
                },
                "BudgetYearFive": {
                    "val": "32.165"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "59.99"
                },
                "PriorYear": {
                    "val": "12.883"
                },
                "CurrentYear": {
                    "val": "16.081"
                },
                "BudgetYearOneBase": {
                    "val": "32.562"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "32.562"
                },
                "BudgetYearTwo": {
                    "val": "34.427"
                },
                "BudgetYearThree": {
                    "val": "27.623"
                },
                "BudgetYearFour": {
                    "val": "29.173"
                },
                "BudgetYearFive": {
                    "val": "32.165"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "59.99"
                },
                "PriorYear": {
                    "val": "12.883"
                },
                "CurrentYear": {
                    "val": "16.081"
                },
                "BudgetYearOneBase": {
                    "val": "32.562"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "32.562"
                },
                "BudgetYearTwo": {
                    "val": "34.427"
                },
                "BudgetYearThree": {
                    "val": "27.623"
                },
                "BudgetYearFour": {
                    "val": "29.173"
                },
                "BudgetYearFive": {
                    "val": "32.165"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "InitialSpares": {
                "BudgetYearOneBase": {
                    "val": "0.166"
                },
                "BudgetYearOne": {
                    "val": "0.166"
                },
                "BudgetYearTwo": {
                    "val": "0.169"
                },
                "BudgetYearThree": {
                    "val": "0.172"
                },
                "BudgetYearFour": {
                    "val": "0.176"
                },
                "BudgetYearFive": {
                    "val": "0.18"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0505208M"
                },
                {
                    "val": "0206625M"
                }
            ]
        },
        "Description": {
            "val": "This is a Military Intelligence Program (MIP) budget line item.\n\nDistributed Common Ground\/Surface System Marine Corps (DCGS-MC) is integral to delivering decision advantage at the speed of operational relevance outlined in the 2018 National Defense Strategy.  In order to concentrate investments in an integrated architecture to improve enterprise alignment while delivering substantially better collective intelligence outcomes for the warfighter, our All-Source and SIGINT programs have been consolidated under the DCGS-MC portfolio. DCGS-MC provides an analysis and production capability within garrison and deployed Marine Corps organizations. DCGS-MC complies with the Department of Defense (DoD) DCGS Enterprise interoperability and information sharing requirements by migrating select processing, exploitation, analysis, and production capabilities into a single, integrated, net-centric baseline within the Marine Corps Intelligence, Surveillance, and Reconnaissance Enterprise (MCISRE). This baseline will enable MCISRE analysts to deliver tactically focused, operational, and strategic intelligence at the tactical edge throughout all phases of operations and will provide relevant, precise decision support for Joint Task Force (JTF), Marine Air Ground Task Force (MAGTF), and subordinate Marine units. The DCGS-MC portfolio currently consists of enterprise services and functional analytic and production tools that provide analysts with the ability to process, disseminate, exploit, analyze, and produce intelligence for discovery via the DCGS Integration Backbone (DIB). The functional capabilities are grouped by DCGS-MC GEOINT, DCGS-MC All Source, and DCGS-MC SIGINT.  Future capabilities will be delivered via clearly defined Capability Drops determined by an integrated assessment of user needs, technology readiness, risk mitigation, and affordability.\n\nDCGS-MC Geospatial Intelligence (DCGS-MC GEOINT)\n\nDCGS-MC GEOINT provides geo-referenced data and products that establish the GEOINT foundation for battlespace visualization and a common frame of reference to support the commander's decision making process.  It enables the ability to rapidly respond to, or predict, threats around the world by providing near real time geospatially referenced data and products that serve as the Authoritative Data Source for the full spectrum of Marine Air-Ground Task Force (MAGTF), joint, and multinational partner's operations. DCGS-MC GEOINT enables mission accomplishment across the range of military operations and with all mission partners. The DCGS-MC GEOINT provides the tasking, collection, processing, exploitation, analysis, production, storage, and dissemination of imagery and geospatial information to describe, assess, produce, and visually depict physical features and geographically referenced activities on the Earth. DCGS-MC GEOINT will incorporate those capabilities formally provided by the Tactical Exploitation Group, Topographic Production Capability, Virtual Imagery Processing - Marine Corps, and Target Materials Production legacy systems.\n\nDCGS-MC All Source\n\nDCGS-MC All Source incorporates those capabilities formally provided by the Intelligence Analysis System (IAS) project. This acquisition program is the Marine Corps' primary intelligence analytical toolset at all levels of the Marine Air Ground Task Force (MAGTF).  DCGS-MC All Source enables global collaboration with Marine and joint analytical systems. It provides Marines the capability to conduct all-source fusion, analysis, and production of intelligence by automating multiple intelligence functions and processes. This includes the display of current enemy situation, collection requirements, asset management, message parsing, and database updates. DCGS-MC All Source automatically logs intelligence activities into a journal and provides access to intelligence produced by tactical, theater, and national systems and agencies. It facilitates the dissemination and exchange of intelligence and information with other echelons through tactical local area networks and wide area networks from the Marine Expeditionary Force (MEF) garrison facility down to the infantry company level. DCGS-MC All Source consists of intelligence servers and workstations with their associated peripherals and software.\n\nDCGS-MC Signals Intelligence (DCGS-MC SIGINT)\n\nThe Technical Control Analysis Center (TCAC) FoS is the DCGS-MC SIGINT capability and consists of the TCAC Remote Analysis Workstation (RAWS), the Transportable Workstation (TWS) and the Cross Domain Solution (CDS), and is the focal point of Radio Battalions (RADBN), Marine Corps Forces Special Operations Command (MARFORSOC), and Joint Strike Fighter (JSF) Signal Intelligence (SIGINT) operations. TCAC automatically collects, stores, retrieves and plays back digital audio signals.  It fuses and analyzes SIGINT data from tactical, theater, and national collectors and databases for dissemination to tactical commanders. TCAC provides SIGINT analysis applications to deployable MAGTF units capable of directing and managing the technical and operational functions of other RADBN SIGINT\/EW assets. Additionally, TCAC provides a focal point for national, theater, and tactical data networks for data exchange with tactical SIGINT\/EW assets, the IAS and national databases. TCAC will enable the transfer of USMC tactical SIGINT collection and analytical data into the Real-Time Regional Gateway (RT-RG) and by producing DIB enabled products that will be discoverable by any DCGS enabled Marine. The system provides ground processing of Electronic Warfare (EW) information including EW Support and Electronic Attack (EA) data collected by the RADBN and JSF aircraft. The Cross Domain Solution also enables the TCAC to transfer approved and sanitized file types from Top Secret\/Sensitive Compartmented Information (TS\/SCI) networks (e.g. JWICS\/NSAnet) to Marine Corps Enterprise Network-SIPR (MCEN-S) networks for delivery to Tactical Commanders."
        },
        "Justification": {
            "val": "FY 2018 Base Appropriation Request: $12.883M (active)\nFunding procured a subset of Geospacial (TPC) and Imagery (TEG) hardware assets as part of an incremental equipment refresh. Funding also supported efforts such as Geodetic Survey Sets (GSS) fielding, Commercial Joint Mapping Tool Kit (CJMTK) software integration into DCGS-MC Servers, Advanced Imagery Exploitation Software capability enhancements, as well as ECP's across the DCGS-MC portfolio of systems. \n\nFY 2019 Base Appropriation Request: $16.081M (active)\n\nFunding is necessary to support GSS fielding and its geospatial intelligence peripheral components, software integration into DCGS-MC Servers, and Common Geospatial Intelligence (GEOINT) hardware and software consolidation efforts as well as ECP's across the DCGS-MC portfolio of systems. \n\nFY 2020 Base Appropriation Request: $32.562M (active)\n\n$12.046M of the FY20 increase is the realignment of DCGS-MC All Source and DCGS-MC SIGINT resources from LI 4747 Intelligence Support Equipment to the DCGS-MC portfolio. Transition into DCGS-MC is necessary to concentrate investments in an integrated architecture to improve DCGS Enterprise alignment and more effectively leverage the rapid integration of new technology. An additional increase of $4.435M in FY20 is for GEOINT hardware and software modernization efforts to include intelligence cloud services and hardware upgrades at USMC PED sites in support of project MAVEN Artificial Intelligence\/Machine learning (AI\/ML) capabilities.  \n\nDCGS-MC GEOINT: $20.516M will support the modernization efforts such as geospatial intelligence peripheral components, software integration into DCGS-MC Servers, and Common Geospatial Intelligence (GEOINT) hardware and software consolidation efforts as well as ECP's across the DCGS-MC portfolio of systems. Additionally, funding will support the collapsing of GEOINT\/Target Intelligence, hardware\/software baselines and sustaining and advancing critical technology investments in AI\/ML and intelligence cloud services.  The increase of $4.435M from FY19 to FY20 supports collapsing GEOINT\/Target Intelligence, hardware\/software baselines; sustaining and advancing investments in Artificial Intelligence\/Machine learning and intelligence cloud services. \n\nDCGS-MC ALL SOURCE (IAS): $7.770M will support the procurement of hardware associated with the Tier II common components and Tier III technical fielding support. The IAS program was previously funded in LI 4747 in FY19 and prior. Decrease of $1.800M from FY19 (LI 4747 $9.570M) to FY20 supports the completion of the Tier I server procurement. \n\nDCGS-MC SIGINT (TCAC): $4.276M will support the Transportable Work Station (TWS) hardware procurement, the Fielding and Initial Engineering, Tech and Management support for the Cross Domain Solution (CDS), and Initial software procurement for TCAC Family of Systems (FoS). The TCAC program was previously funded in LI 4747 in FY19 and prior. Decrease of $2.473M from FY19 (LI 4747 $6.749M) to FY20 supports the completion of the Remote Analyst Work Station (RAWS) server procurement."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Distributed Common Ground Surface System (DCGS) (120306)"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "59.99"
                            },
                            "PriorYear": {
                                "val": "12.883"
                            },
                            "CurrentYear": {
                                "val": "16.081"
                            },
                            "BudgetYearOneBase": {
                                "val": "32.562"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "32.562"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "59.99"
                            },
                            "PriorYear": {
                                "val": "12.883"
                            },
                            "CurrentYear": {
                                "val": "16.081"
                            },
                            "BudgetYearOneBase": {
                                "val": "32.562"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "32.562"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "59.99"
                            },
                            "PriorYear": {
                                "val": "12.883"
                            },
                            "CurrentYear": {
                                "val": "16.081"
                            },
                            "BudgetYearOneBase": {
                                "val": "32.562"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "32.562"
                            }
                        },
                        "InitialSpares": {
                            "BudgetYearOneBase": {
                                "val": "0.166"
                            },
                            "BudgetYearOne": {
                                "val": "0.166"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "1.1.1) DCGS-MC GEOINT:  Enterprise DIB Service (EDS) Solution"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "8.492"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.306"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.306"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "DCGS-MC GEOINT Hardware:  Increase is in support of modernization efforts to include intelligence cloud services and hardware upgrades at USMC PED sites in support of project MAVEN Artificial Intelligence\/Machine learning (AI\/ML) capabilities.",
                                                    "val": "1.1.2) DCGS-MC GEOINT:  H\/W"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "9.299"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "9.935"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "12.174"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "12.174"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "Prior to FY20, DCGS-MC All Source (IAS) funding can be found in PMC LI 4747.",
                                                    "val": "1.1.5) DCGS-MC All Source:  Common Intel Server Tier II"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "5.642"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "5.642"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "Prior to FY20, DCGS-MC SIGINT (TCAC) funding can be found in PMC LI 4747.",
                                                    "val": "1.1.7) DCGS-MC SIGINT:  Transportable Work Station (TWS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "2.3"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.3"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.10) Prior Year Funding Total"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "14.605"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "23.097"
                                            },
                                            "PriorYear": {
                                                "val": "9.299"
                                            },
                                            "CurrentYear": {
                                                "val": "9.935"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "22.422"
                                            },
                                            "BudgetYearOne": {
                                                "val": "22.422"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "23.097"
                                        },
                                        "PriorYear": {
                                            "val": "9.299"
                                        },
                                        "CurrentYear": {
                                            "val": "9.935"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.422"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.422"
                                        }
                                    }
                                }
                            }
                        ],
                        "Software": {
                            "Recurring": {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "2.1.1) DCGS-MC GEOINT:  Software"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.978"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.532"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.783"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.783"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.1.2) DCGS-MC SIGINT:  Software"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.75"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.75"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "2.1.3) Prior Years Funding Total"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.351"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "7.351"
                                        },
                                        "PriorYear": {
                                            "val": "1.978"
                                        },
                                        "CurrentYear": {
                                            "val": "2.532"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.533"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.533"
                                        }
                                    }
                                }
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "AllPriorYears": {
                                        "val": "7.351"
                                    },
                                    "PriorYear": {
                                        "val": "1.978"
                                    },
                                    "CurrentYear": {
                                        "val": "2.532"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "4.533"
                                    },
                                    "BudgetYearOne": {
                                        "val": "4.533"
                                    }
                                }
                            }
                        },
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "3.1) EDS Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6.312"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.75"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.2) DCGS-MC GEOINT:  Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.573"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.253"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.253"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.3) TPC:  Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "4.415"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.606"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.864"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.4) DCGS-MC All Source:  Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2.128"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.128"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.5) DCGS-MC SIGINT:  Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.226"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.226"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "3.6) Prior Years Funding Total"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "15.242"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "29.542"
                                        },
                                        "PriorYear": {
                                            "val": "1.606"
                                        },
                                        "CurrentYear": {
                                            "val": "3.614"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.607"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.607"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}