{
    "id": "2020-DefenseInformationSystemsAgency-PB-0300D-JBOOK-e79e62ae6107341b2195e3b430d446f2a3631582b260b94513e68611f810375d-0",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-DEFENSE_DISA-U_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Information_Systems_Agency_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "09"
        },
        "LineItemTitle": {
            "val": "Information Systems Security Program"
        },
        "P1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DISA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "118.765"
                },
                "PriorYear": {
                    "val": "26.805"
                },
                "CurrentYear": {
                    "val": "31.59"
                },
                "BudgetYearOneBase": {
                    "val": "3.318"
                },
                "BudgetYearOne": {
                    "val": "3.318"
                },
                "BudgetYearTwo": {
                    "val": "22.249"
                },
                "BudgetYearThree": {
                    "val": "38.319"
                },
                "BudgetYearFour": {
                    "val": "40.91"
                },
                "BudgetYearFive": {
                    "val": "43.35"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "118.765"
                },
                "PriorYear": {
                    "val": "26.805"
                },
                "CurrentYear": {
                    "val": "31.59"
                },
                "BudgetYearOneBase": {
                    "val": "3.318"
                },
                "BudgetYearOne": {
                    "val": "3.318"
                },
                "BudgetYearTwo": {
                    "val": "22.249"
                },
                "BudgetYearThree": {
                    "val": "38.319"
                },
                "BudgetYearFour": {
                    "val": "40.91"
                },
                "BudgetYearFive": {
                    "val": "43.35"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "118.765"
                },
                "PriorYear": {
                    "val": "26.805"
                },
                "CurrentYear": {
                    "val": "31.59"
                },
                "BudgetYearOneBase": {
                    "val": "3.318"
                },
                "BudgetYearOne": {
                    "val": "3.318"
                },
                "BudgetYearTwo": {
                    "val": "22.249"
                },
                "BudgetYearThree": {
                    "val": "38.319"
                },
                "BudgetYearFour": {
                    "val": "40.91"
                },
                "BudgetYearFive": {
                    "val": "43.35"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0303140K"
                }
            ]
        },
        "Description": {
            "val": "The Information Systems Security Program (ISSP) mission focuses on delivering Department of Defense (DoD) enterprise solutions to Combatant Commands, Services, and Defense-wide agencies to ensure critical mission execution in the face of cyber attacks. The ISSP ensures that, \"the network, the computing centers, and core enterprise services will evolve to better support a joint information assurance model that has common enterprise-scale perimeter defenses and will support a broad range of sharing policies from completely unclassified to tightly-held within a classified community.\"  The ISSP provides solutions to harden the network by: (1) reducing the exposed attack surface and gaps that potential adversaries can exploit to disrupt communications; (2) providing vital situational awareness to senior decision-makers and network defenders to enable attack detection and diagnosis; (3) supporting safe sharing of information with allies and mission partners; (4) publishing security guidelines and assessing compliance; (5) providing training to the DoD community; and (6) Implementing Software Defined Networking to enable network agility for faster response times to mission need and improved deterrence against cyber attacks.  The Sharkseer Program enables the Department of Defense the capability for (1) boundary defense and protection, (2) remote accessible malware analysis, automated cyber threat intelligence sharing, and cyber readiness services."
        },
        "Justification": {
            "val": "FY 2018: ($26.805) Procured the necessary hardware\/software (HW\/SW) for reducing the attack surface of the DoD network, prevented exploitation by hackers and adversaries to disrupt missions, and improved the warfighter's ability to safely share information across DoD's classified and unclassified networks. DISA procured the following capabilities:\n\n• Defense Information Systems Network (DISN) Cyber Technology Refresh - ($16.679) Procured HW\/SW to support the cyber tech refresh of modernized web content filter equipment suites at specific Internet Access Points and security information event manager equipment enabling network defenders at the DISN perimeter and endpoints. \n\n• Database Security Gateway Tool (Demilitarized Zone (DMZ)) - ($3.560) Procured HW\/SW to support the NIPRNet Federated Gateway capability at specific Internet Access Point (IAP) network locations, expanding boundary locations, and database firewall acquisitions. \n\n• Enterprise Collaborative Operational Sensors (ECOS) - ($1.199) Procured hardware to support tech refresh of the ECOS full packet capture capabilities at ten Internet Access Points (IAPs).\n\n• Cross Domain Enterprise Services (CDES) - ($1.734) Purchased and implemented a multi-mission enterprise solution for file sharing and enterprise email between users and devices residing on different networks.  Procured hardware to support tech refresh of High Speed Guards for enterprise file transfer and enterprise email.\n\n• Public Key Infrastructure (PKI) - ($1.930) Procured Non-Person Entity (NPE) hardware and software detection capabilities for encrypting and decrypting the associated user's identity within authorized DoD Networks.\n\n• Endpoint Security Modernization - ($1.212) Purchased and implemented secure host baseline containment\/visibility licenses to modernize high-end security on DoD Networks.  This provided the ability to restrict high-risk applications and investigate security incidents on DoD Networks.\n\n• Cyber Security Range - ($.491) Cyber Security Range is required to emulate Non-classified Internet Protocol (IP) Router Network (NIPR) and Secret Internet Protocol Router Network (SIPR) capabilities.  Procured HW\/SW upgrades for the Cyber Security Range to emulate the new network infrastructure to aid in the training of our network operators to successfully train and prevent the exploitation by hackers and adversaries to disrupt missions, and improved the warfighter's ability to safely share information across DoD's classified and unclassified networks.   \n\nFY 2019: ($31.590) Continue to procure the necessary hardware for reducing the attack surface of the DoD Network, preventing the exploitation by hackers and adversaries to disrupt missions, and improve the warfighter's ability to safely share information across DoD's classified and unclassified networks.  DISA will acquire the following capabilities: \n                                                                                                                               \n• Perimeter Defense - ($13.028)  Will procure HW\/SW to tech refresh the suite of systems that serve as the defense layer between the commercial internet and NIPRNet.  Specifically acquire outbound Uniform Resource Locator (URL) filtering and inbound spyware, malware, anti-virus and vulnerability filtering equipment; Splunk logging system; Procure equipment to support the NIPRNet Federated Gateway capability in \nOutside Continental United States (OCONUS) and firewall capability at specific IAP nework locations; and tech refresh of the sensing appliance capabilities at IAPs.\n                                                                                                                     \n• Cyber Information Sharing Systems - ($1.781) Will procure tech refresh servers for security information manager coop environments that enable network defenders at the DISN perimeter and endpoints. \n                                                                                                                         \n• Cross Domain Enterprise Services (CDES) - ($2.780) Will procure tech refresh, guard solutions, enterprise file sharing, and email solution between users and devices residing on different networks. \n                                                                                                                            \n• Public Key Infrastructure (PKI) - ($1.930) Will procure NPE hardware and software detection capabilities for encrypting and decrypting the associated user's identity within authorized DoD Networks. \n                                                                                                                        \n• Cyber Security Range - ($2.071) Will procure HW\/SW upgrades for the Cyber Security Range to emulate the new network infrastructure.  \n\n• Sharkseer - ($10.000)  Will support procurement and accelerate the Sharkseer National Defense Authorization Act (NDAA) requirements.  Specifically,  the Joint DISA\/National Security Agency (NSA) Program Management Office (PMO) will identify efficiencies and integrate perimeter-endpoint defenses.  Additionally, the Joint PMO will develop DoD enterprise Sand-box-as-a-Service for a internet facing forensic environment and Enhanced Endpoint Analytics to track mitigations across multiple cyber defense platforms.                                                                                                         \n                                                                                                                                  \nExplanation of Change from FY 2018 to FY 2019: The increase of +$4.785 between FY 2018 and FY 2019 is primarily due to the completion of the tech refresh of the rate limiting capability that enables throttle traffic load going into the DOD Information Network (DODIN) and Firewalls at the IAPs, offset by the purchase of equipment to upgrade the web application firewall to identify non-compliant application and servers and additional HW for enterprise high speed cross domain guards.   \n\nFY 2020: ($3.318) Continue to procure software licenses and hardware\/software upgrades necessary hardware for reducing the attack surface of the DoD Network, preventing the exploitation by hackers and adversaries to disrupt missions, and improve the warfighter's ability to safely share information across DoD's classified and unclassified networks.  DISA will acquire the following capabilities:   \n\n• Network Management and Cyber Information Sharing Systems (formerly Cyber Information Sharing Systems) - ($1.201) Will procure software licenses as a component of a security orchestration automation and response capability in support of the Security Information and Event Management (SIEM) system. \n\n• Cyber Security Range - ($2.117) Will procure HW\/SW upgrades for the Cyber Security Range to emulate the new network infrastructure.               \n                                                                                                                                \nExplanation of Change from FY 2019 to FY 2020: The decrease of -$28.272 is due to completing the installation of FEDERAL Demilitarized Zone (DMZ) web proxies (-$0.425), FED DMZ server and router upgrades (-$1.200), and Web Content Filtering load balancers (-$5.500), integration completion of Security Information Event Manager (SIEM) next gen hardware (-$0.580), and transition of Perimeter Defense capabilities to Capacity as a Service (-$4.358).  Completion of Sharkseer accelerated transition, integration of sand-box-as-a-service, and migration of Enhanced Endpoint Analytics (-$10.000). Fund transfer to DISA Defense Working Capital Fund (DWCF) to establish a DISN Capital Investment Program (CIP) for Cybersecurity (-$6.209).  Web Content Filtering, NIPRNET Federated Gateway, Zero Day Network Defense Email, Cross Doman and Test Lab equipment Refresh programs were eliminated.\n                                                                                                                                   \nPerformance Metrics: \n\n1. Tech refresh 2 Cloud Access Points (CAP) through FY 2018\n\nFY 2018 Planned 1 Suite Install \/ Actual - 0 (CAP transferred)\n\n2. Maintain ECOS MAC III sensor availability to 98.6%; sensor recovery should be within 5 days of failure\n\nFY 2018 Planned 30% \/ Actual - 100%\nFY 2019 Planned 98.6%\nFY 2020 Planned 98.6%\n\n3. Tech refresh 33% of CDES systems supporting NIPR-SIPR email and file sharing in CONUS and OCONUS (unit of measure is percent).  \n\nFY 2018 Planned 30% \/ Actual - 13.3%\nFY 2019 Planned 33%\n\n4. Perform tech refresh on certificate authorities and issue stronger cyber identities (e.g. SHA-256) to 33% of all DoD NIPR\/SIPRNet users and devices.\n\nFY 2018 Planned 33% \/ Actual - 33%\nFY 2019 Planned 34%\n\n5.  Implement break and inspect at all 17 active IAPs.\n\nFY 2018 Planned N\/A \/ Actual - N\/A\n\n6. Procure, install, and implement Cyber Security Range.\n\nFY 2018 Planned 1 \/ Actual - 3\nFY 2019 N\/A\nFY 2020 Planned 3\n\n7.  Procure, install, and implement Web Content Filters at active IAPs.\n\nFY 2018 Planned 10 \/ Actual - 0 (Installation of all IAPs to begin in FY19)\nFY 2019 N\/A\nFY 2020 Planned N\/A\n\n8.  Procure, install, and implement equipment to support the NIPRNet Federated Gateway capability in OCONUS and firewall capability at specific IAP network locations.\n\nFY 2020 Planned 10\n\n9.    Internet Facing Forensic Sandbox\/Sharkdive and Expanded Orchestration Capability\/SharkStorm. Includes the migration of Sharkdive to Amazon Web Services (AWS), accreditation and enhanced Field security Operations (FSO) capability to integrate with DISA's Defense Connect Online (DCO) active, passive sensing and analytic platforms.\n\nFY 2019 Planned 70%\nFY 2020 Planned 100%"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}