{
    "id": "2020-AirForce-PB-3021F-JBOOK-1fc4d60f6d50c7854be477a33f99be9ac491b911e12c05444bcf79d58507bec1-6",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_SPACE-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3021F",
        "appropriation_name": "Space Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "GPS03C"
        },
        "LineItemTitle": {
            "val": "GPS IIIF SPAF"
        },
        "P1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3021F"
        },
        "AppropriationTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "Quantity": {
                "BudgetYearOneBase": {
                    "val": "1"
                },
                "BudgetYearOne": {
                    "val": "1"
                },
                "BudgetYearTwo": {
                    "val": "2"
                },
                "BudgetYearThree": {
                    "val": "3"
                },
                "BudgetYearFour": {
                    "val": "3"
                },
                "BudgetYearFive": {
                    "val": "3"
                },
                "Total": {
                    "val": "12"
                }
            },
            "TotalCost": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "414.625"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "414.625"
                },
                "BudgetYearTwo": {
                    "val": "628.445"
                },
                "BudgetYearThree": {
                    "val": "890.355"
                },
                "BudgetYearFour": {
                    "val": "897.544"
                },
                "BudgetYearFive": {
                    "val": "962.3"
                },
                "Total": {
                    "val": "3793.269"
                }
            },
            "UnitCost": {
                "BudgetYearOneBase": {
                    "val": "414.625"
                },
                "BudgetYearOne": {
                    "val": "414.625"
                },
                "BudgetYearTwo": {
                    "val": "314.223"
                },
                "BudgetYearThree": {
                    "val": "296.785"
                },
                "BudgetYearFour": {
                    "val": "299.181"
                },
                "BudgetYearFive": {
                    "val": "320.767"
                },
                "Total": {
                    "val": "316.106"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "414.625"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "414.625"
                },
                "BudgetYearTwo": {
                    "val": "628.445"
                },
                "BudgetYearThree": {
                    "val": "890.355"
                },
                "BudgetYearFour": {
                    "val": "897.544"
                },
                "BudgetYearFive": {
                    "val": "962.3"
                },
                "Total": {
                    "val": "3793.269"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "414.625"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "414.625"
                },
                "BudgetYearTwo": {
                    "val": "628.445"
                },
                "BudgetYearThree": {
                    "val": "890.355"
                },
                "BudgetYearFour": {
                    "val": "897.544"
                },
                "BudgetYearFive": {
                    "val": "962.3"
                },
                "Total": {
                    "val": "3793.269"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "1203269F"
                }
            ]
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "1203265F"
                }
            ]
        },
        "Description": {
            "val": "The Global Positioning System (GPS) is a space-based navigation system that fills validated Joint Service requirements for worldwide, accurate, common grid three-dimensional positioning\/navigation for military aircraft, ships, and ground personnel. The consistent accuracy, unaffected by location or weather and available in real time, significantly improves effectiveness of reconnaissance, weapons delivery, mine countermeasures and rapid deployment for all services. GPS must comply with Title 10 United States Code (USC) Sec. 2281, which requires that the Secretary of Defense ensures the continued sustainment and operation of GPS for military and civilian purposes, and 51 USC Sec. 50112, which requires that GPS complies with certain standards and facilitates international cooperation.\n\nThe system is composed of three segments: User Equipment (funded under Program Element (PE) 1203164F), Space (funded under PE 1203265F, 1203165F, and 1203269F), and a Control Network (funded under PE 1206423F and 1203165F). Research, Development, Test and Evaluation (RDT&E) Air Force (AF) funding for GPS III Follow-On (GPS IIIF), including development and acquisition of Space Vehicles (SVs) 11-12, is in PE 1203269F, Project 653170, GPS IIIF. The satellites broadcast high-accuracy data using precisely synchronized signals that are received and processed by user equipment installed in military platforms. This equipment computes the platform position and velocity and provides steering vectors to target locations or navigation waypoints. The control segment provides daily updates to the navigation messages broadcast from the satellites to maintain system precision in three dimensions to 16 meters (spherical error probable) worldwide. Additionally, GPS supports the United States Nuclear Detonation (NUDET) Detection System (USNDS) mission and provides strategic and tactical support to the following Department of Defense (DoD) missions: Joint Operations by providing capabilities for Positioning, Navigation, and Timing (PNT); Command, Control, Communications, and Intelligence (C3I); Special Operations; Military Operations in Urban Terrain (MOUT); Defense-Wide Mission Support (DWMS); Air Mobility; and Space Launch Orbital Support.\n\nGPS IIIF delivers GPS III satellites beyond the first ten SVs being delivered by the GPS III program (funded in PE 1203265F GPS III Space Segment). The GPS IIIF satellites maintain the same capabilities as the GPS III satellites, but also delivers significant enhancements to include: backward compatibility, unified S-Band (USB) interface compliance, integration of hosted payloads (redesigned USNDS), Laser Retro-reflector Arrays (LRAs), Search and Rescue\/GPS (SAR\/GPS), Energetic Charged Particles (ECP) sensor, and Regional Military Protection (RMP) capabilities that provide the ability to deliver high-power regional Military Code (M-Code) signals in specific areas of intended effect. Implementation of RMP into the GPS Enterprise requires integration with the ground and user segments, executed by the GPS Next Generation Operational Control System (OCX) and Military GPS User Equipment (MGUE) programs, respectively. The SAR\/GPS payload provided by Canada fills a validated National Search and Rescue Committee requirement to provide enduring, space-based distress alerting capability to detect, locate, and relay distress alerts to fulfill its responsibilities under international agreements for Search and Rescue. LRA, built by the Naval Research Lab (NRL), is a passive reflector that improves accuracy and provides better ephemeris data. National Geospatial-Intelligence Agency (NGA) funds the integration costs of the LRA.\n\nIn December 2017, The Principal Deputy Assistant Secretary of the Air Force (Acquisition & Logistics) declared the GPS IIIF program a new start beginning in FY 2019 and consistent with the 2016 National Defense Authorization Act (NDAA), the program was categorized as an ACAT 1B Major Defense Acquisition Program (MDAP) with the Service Acquisition Executive (SAE) as the Milestone Decision Authority (MDA). During this time, the MDA approved the second phase of the two-phased GPS IIIF acquisition strategy. Executed using funds in PE 1203265F, GPS III Space Segment, the Phase 1 Production Readiness Feasibility Assessments conducted during FY 2016 - FY 2017 provided data and insight into contractors' GPS satellite production designs with emphasis on a mature navigation payload and production-ready designs. Phase 1 results affirmed the viability of a competitive approach for Phase 2. The Phase 2 strategy directs the AF to conduct a full-and-open competition for GPS IIIF SVs and specified the use of RDT&E funds to deliver SVs 11-12 and conduct associated Non-Recurring Engineering (NRE). Upon Milestone C approval, procurement of SV 13+ is planned via annual contract options exercise using Space Procurement, Air Force (SPAF) funds consistent with full-funding policy under an annual-buy approach.\n\nSpace acquisition must respond with speed and agility to emerging adversary threats.  Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture.  Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n\nFunding for this exhibit is contained in PE 1203269F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "This program is a new start.\n\nThis program was previously funded in PE 1203265F, GPS III Space Segment (GPSIII).  In FY 2020 GPS III funding for the GPS IIIF production satellites was transferred to PE 1203269F.\n\nFY 2020 funding procures the first GPS IIIF production satellite (SV-13) in addition to any recurring, SV specific support equipment and tooling.  FY 2020 funding also procures independent technical, systems engineering, and integration support critical to managing SV13 production milestones and mission assurance activities.  Rapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain.  Activities may include, but are not limited to, program office support, studies, technical analysis, experimentation, prototyping, etc."
        },
        "MDAPCode": {
            "val": "590"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "GPS IIIF SPAF"
                    },
                    "IdCode": {
                        "val": "B"
                    },
                    "ResourceSummary": {
                        "Quantity": {
                            "BudgetYearOneBase": {
                                "val": "1"
                            },
                            "BudgetYearOne": {
                                "val": "1"
                            }
                        },
                        "TotalCost": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "414.625"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "414.625"
                            }
                        },
                        "UnitCost": {
                            "BudgetYearOneBase": {
                                "val": "414.625"
                            },
                            "BudgetYearOne": {
                                "val": "414.625"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "414.625"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "414.625"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "414.625"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "414.625"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "SpaceVehicle": {
                            "Name": {
                                "val": "GPS IIIF SPAF"
                            },
                            "Recurring": {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "GPS IIIF"
                                            },
                                            "Cost": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "382.005"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "382.005"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "382.005"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "382.005"
                                                    }
                                                }
                                            },
                                            "ManufacturerList": {
                                                "Manufacturer": {
                                                    "Name": {
                                                        "val": "Lockheed Martin"
                                                    },
                                                    "Location": {
                                                        "val": "Littleton, CO"
                                                    },
                                                    "MinimumSustainingRate": {
                                                        "val": "72.00"
                                                    },
                                                    "MaximumProductionRate": {
                                                        "val": "72.00"
                                                    },
                                                    "Rate185": {
                                                        "val": "72.00"
                                                    },
                                                    "InitialQuantity": {
                                                        "AdminLeadTimeBeforeOct1InMonths": {
                                                            "val": "0"
                                                        },
                                                        "AdminLeadTimeAfterOct1InMonths": {
                                                            "val": "10"
                                                        },
                                                        "ProductionLeadTimeAfterOct1InMonths": {
                                                            "val": "74"
                                                        },
                                                        "TotalLeadTimeAfterOct1InMonths": {
                                                            "val": "84"
                                                        }
                                                    },
                                                    "ReorderQuantity": {
                                                        "AdminLeadTimeBeforeOct1InMonths": {
                                                            "val": "0"
                                                        },
                                                        "AdminLeadTimeAfterOct1InMonths": {
                                                            "val": "0"
                                                        },
                                                        "ProductionLeadTimeAfterOct1InMonths": {
                                                            "val": "0"
                                                        },
                                                        "TotalLeadTimeAfterOct1InMonths": {
                                                            "val": "0"
                                                        }
                                                    },
                                                    "HistoryPlanningList": {
                                                        "HistoryPlanning": [
                                                            {
                                                                "FiscalYear": {
                                                                    "val": "2020"
                                                                },
                                                                "PCOLocation": {
                                                                    "val": "SMC, LA AFB, CA"
                                                                },
                                                                "AwardDate": {
                                                                    "val": "2020-07"
                                                                },
                                                                "FirstDeliveryDate": {
                                                                    "val": "2026-09"
                                                                },
                                                                "Quantity": {
                                                                    "val": "1"
                                                                },
                                                                "UnitCost": {
                                                                    "val": "382.005"
                                                                },
                                                                "SpecsAvailableNow": {
                                                                    "val": "false"
                                                                },
                                                                "ContractMethod": {
                                                                    "val": "C"
                                                                },
                                                                "ContractType": {
                                                                    "val": "FPIF"
                                                                },
                                                                "MonthlyDeliveryScheduleList": {
                                                                    "MonthlyDeliverySchedule": {
                                                                        "ServiceAgencyName": {
                                                                            "val": "Air Force"
                                                                        },
                                                                        "ProcQuantity": {
                                                                            "val": "1"
                                                                        },
                                                                        "MonthlyDeliveryList": {
                                                                            "MonthlyDelivery": [
                                                                                {
                                                                                    "Month": {
                                                                                        "val": "2026-09"
                                                                                    },
                                                                                    "Amount": {
                                                                                        "val": "1"
                                                                                    }
                                                                                }
                                                                            ]
                                                                        }
                                                                    }
                                                                },
                                                                "MonthlyDeliveryScheduleTotal": {
                                                                    "ProcQuantity": {
                                                                        "val": "1"
                                                                    },
                                                                    "MonthlyDeliveryList": {
                                                                        "MonthlyDelivery": [
                                                                            {
                                                                                "Month": {
                                                                                    "val": "2026-09"
                                                                                },
                                                                                "Amount": {
                                                                                    "val": "1"
                                                                                }
                                                                            }
                                                                        ]
                                                                    }
                                                                }
                                                            }
                                                        ]
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "GPS IIIF Enterprise SE&I"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.425"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.425"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "GPS IIIF Technical Mission Analysis"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "10.571"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "10.571"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "393.001"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "393.001"
                                        }
                                    }
                                }
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "PriorYear": {
                                        "val": "0"
                                    },
                                    "CurrentYear": {
                                        "val": "0"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "393.001"
                                    },
                                    "BudgetYearOneOCO": {
                                        "val": "0"
                                    },
                                    "BudgetYearOne": {
                                        "val": "393.001"
                                    }
                                }
                            }
                        },
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "GPS IIIF FFRDC"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "5.767"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.767"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "GPS IIIF A&AS"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "15.857"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "15.857"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "GPS IIIF Other Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "21.624"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.624"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "GPS IIIF SPAF"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}