{
    "id": "2020-Army-PB-2035A-JBOOK-ae1ed46873d9bdf25873e5689835ba301fffafb48f21f5afd9fbcf4edb5f072b-83",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_OTHER_2-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "9705BA9301"
        },
        "LineItemTitle": {
            "val": "Network Management Initialization and Services"
        },
        "P1LineNumber": {
            "val": "106"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "89"
        },
        "BudgetSubActivityTitle": {
            "val": "Elect Equip - Tactical C2 Systems"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "318.572"
                },
                "PriorYear": {
                    "val": "15.179"
                },
                "CurrentYear": {
                    "val": "15.087"
                },
                "BudgetYearOneBase": {
                    "val": "24.448"
                },
                "BudgetYearOne": {
                    "val": "24.448"
                },
                "BudgetYearTwo": {
                    "val": "20.67"
                },
                "BudgetYearThree": {
                    "val": "16.727"
                },
                "BudgetYearFour": {
                    "val": "17.183"
                },
                "BudgetYearFive": {
                    "val": "14.439"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "UnitCost": {
                "PriorYear": {
                    "val": "1897.375"
                },
                "CurrentYear": {
                    "val": "1508.7"
                },
                "BudgetYearOneBase": {
                    "val": "1438.118"
                },
                "BudgetYearOne": {
                    "val": "1438.118"
                },
                "BudgetYearTwo": {
                    "val": "1291.875"
                },
                "BudgetYearThree": {
                    "val": "983.941"
                },
                "BudgetYearFour": {
                    "val": "687.32"
                },
                "BudgetYearFive": {
                    "val": "2887.8"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "318.572"
                },
                "PriorYear": {
                    "val": "15.179"
                },
                "CurrentYear": {
                    "val": "15.087"
                },
                "BudgetYearOneBase": {
                    "val": "24.448"
                },
                "BudgetYearOne": {
                    "val": "24.448"
                },
                "BudgetYearTwo": {
                    "val": "20.67"
                },
                "BudgetYearThree": {
                    "val": "16.727"
                },
                "BudgetYearFour": {
                    "val": "17.183"
                },
                "BudgetYearFive": {
                    "val": "14.439"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "318.572"
                },
                "PriorYear": {
                    "val": "15.179"
                },
                "CurrentYear": {
                    "val": "15.087"
                },
                "BudgetYearOneBase": {
                    "val": "24.448"
                },
                "BudgetYearOne": {
                    "val": "24.448"
                },
                "BudgetYearTwo": {
                    "val": "20.67"
                },
                "BudgetYearThree": {
                    "val": "16.727"
                },
                "BudgetYearFour": {
                    "val": "17.183"
                },
                "BudgetYearFive": {
                    "val": "14.439"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "10.195"
                                },
                                "CurrentYear": {
                                    "val": "11.074"
                                },
                                "BudgetYearOneBase": {
                                    "val": "19.101"
                                },
                                "BudgetYearOne": {
                                    "val": "19.101"
                                },
                                "BudgetYearTwo": {
                                    "val": "16.001"
                                },
                                "BudgetYearThree": {
                                    "val": "12.008"
                                },
                                "BudgetYearFour": {
                                    "val": "12.419"
                                },
                                "BudgetYearFive": {
                                    "val": "10.075"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army National Guard"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "3.255"
                                },
                                "CurrentYear": {
                                    "val": "2.621"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.492"
                                },
                                "BudgetYearOne": {
                                    "val": "3.492"
                                },
                                "BudgetYearTwo": {
                                    "val": "3.049"
                                },
                                "BudgetYearThree": {
                                    "val": "3.082"
                                },
                                "BudgetYearFour": {
                                    "val": "3.111"
                                },
                                "BudgetYearFive": {
                                    "val": "2.85"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "1.729"
                                },
                                "CurrentYear": {
                                    "val": "1.392"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.855"
                                },
                                "BudgetYearOne": {
                                    "val": "1.855"
                                },
                                "BudgetYearTwo": {
                                    "val": "1.62"
                                },
                                "BudgetYearThree": {
                                    "val": "1.637"
                                },
                                "BudgetYearFour": {
                                    "val": "1.653"
                                },
                                "BudgetYearFive": {
                                    "val": "1.514"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "15.179"
                    },
                    "CurrentYear": {
                        "val": "15.087"
                    },
                    "BudgetYearOneBase": {
                        "val": "24.448"
                    },
                    "BudgetYearOne": {
                        "val": "24.448"
                    },
                    "BudgetYearTwo": {
                        "val": "20.67"
                    },
                    "BudgetYearThree": {
                        "val": "16.727"
                    },
                    "BudgetYearFour": {
                        "val": "17.183"
                    },
                    "BudgetYearFive": {
                        "val": "14.439"
                    }
                }
            }
        },
        "Description": {
            "val": "The Network Management Initialization and Services (NMIS) program supports the Army's objectives of an integrated Network Operations capability.  There are two components to the program:  \n\nLine of Effort 1: Unified Network (I-NetOps Trailboss (I-NetOps TB))\nProject BA9312: Network Management System (NMS) funds the I-NetOps TB systems engineering to support converged NetOps and Cyber capabilities in order to enable improved network security and delivery of network operations services to the Materiel, Training, Test, Engineering, and Home Station organizations as well as Combat Units of the Army. Integrated Cyber and NetOps capabilities support distributed operational NetOps responsibilities across the tactical and strategic components of the US Army enterprise network (LANDWARNET), simplify the network management environment for the tactical commander and the G6\/S6 staff, and eliminate both functional and material redundancies in order to achieve efficiencies in fielding. AAO is N\/A.\n\nLine of Effort 1: Network Enabling Functions (Data Products) \nProject BA9315: The Data Products funding line supports the Army's Network Modernization Strategy Line of Effort 1, Unified Network.  Data Products are a critical component in enabling a converged Mission Command Network that operates seamlessly worldwide in any environment. Data Products enable end-to-end network centric connectivity and interoperability across The Mission Command Network by enforcing and implementing standards-based technologies and providing the machine level instruction required by digital systems to communicate with each other.  Data Products allow the integration of disparate networks\/systems capabilities across multiple domains and environments.  Data Products enable the network to provide resiliency through path diversity and dynamic routing to ensure tactical units can communicate in hostile environments.  Data Products are a collection of information\/data required to plan and initialize the current set of Mission Command Network capabilities such as Joint Battle Command - Platform (JBC-P), Command Post of the Future (CPOF), Nett Warrior (Ground Soldier System), Distributed Common Ground System (DCGS), Air and Missile Defense Workstation (AMDWS), Tactical Unmanned Aircraft System (TUAS), PEO Aviation, and other Army Mission Command Systems.  Information\/Data includes: JBC-P database, COCOM databases, and Active Directory initialization files (e.g., Lightweight Directory Interchange Format (LDIFs)), etc.  AAO is N\/A."
        },
        "Justification": {
            "val": "In FY 2020, the NetOps Trail Boss will continue to work integration of NetOps and Cyber program functionality with the Command Post Computing Environment to support version 3 deployment through the FY19-20 timeframe. \n\nFY 2020 Base procurement dollars, in the amount of $13.534 million, provides systems engineering support to execute the duties as an integration\/interoperability\/convergence manager for the Army's NetOps portfolio to provide more effective network capability to the Soldier. Integrated NetOps Trailboss duties include: conducting technical assessments of Cyber and NetOps capabilities and documenting gaps and overlaps, developing and coordinating NetOps capability development roadmaps with materiel developers, specifying interoperability and integration standards, informing development of Cyber and NetOps requirement documents, recommending realignment of resources to execute Army Integrated NetOps priorities and capability gap remediation, and updating and maintaining the NetOps capability configuration management baseline. FY 2020 also includes increased requirements for procuring prototype integrated software framework, data exchange, and application for modernization systems. FY 2020 also includes fielding of Joint Enterprise Network Manager (JENM) and Joint Tactical Networking Toolkit (J-TNT) via contractor fielding support, Tobyhanna Army Depot (TYAD) stock support to ensure J-TNT laptops are maintained and distributed to users, Network Management Reference Implementation Laboratory (NM RIL) help desk support for continued maintenance, and J-TNT engineering change management.\n\nFY 2020 Base Procurement dollars in the amount of $10.914 million provides Government, Federally Funded Research and Development Center (FFRDC), and contractor support services to execute the duties required to create Data Products in support of the entire Mission Command Network, across multiple software versions, to include current baselines, baselines in sustainment, and emerging or future baselines.  Data Products are a vital enabling element to achieve multiple objectives across several Lines of Effort within the Mission Command Network Modernization Implementation Plan.  Data Products are created in accordance with the Army Forces Generation (ARFORGEN) model, Unit Set Fielding (USF) and other top Army priorities for deployment, training, and reset. In addition, these dollars also provide the fielding, training, and support of the Initialization Tool Suite (ITS) which includes Warfighter Initialization Tool - Server (WIT-S), and Warfighter Initialization Tool - Manager (WIT-M).  This ITS capability allows Soldiers the necessary flexibility to customize the Data Product to meet Commander's intent or mission requirements. Static Data Products are still necessary due to the requirements of the legacy systems that consume this data.  FY 2020 requirements increase due to an overlap in on-site instructor lead training and online-based training for ITS in an effort to transition to all computer-based training in the out years. Historical trends show growth in data product requirements, complexity, and quantity as the Mission Command Network continues to evolve. Data Products are an essential part in achieving interoperability across multiple domains, environments, disparate networks\/systems capabilities, enabling tactical digital messaging such as Variable Messaging Format (VMF), enabling and informing the Common Operational Picture (COP) and other automated Command and Control (C2) functions.  \n\nIAW Section 1815 of the FY08 NDAA this item is necessary for use by the active components and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Various"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "NETWORK MANAGEMENT SYSTEM"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "NETWORK MANAGEMENT SYSTEM"
                                            },
                                            "ItemNumber": {
                                                "val": "BA9312"
                                            },
                                            "SecondaryDistribution": {
                                                "ComponentList": {
                                                    "Component": [
                                                        {
                                                            "Name": {
                                                                "val": "Army Active"
                                                            },
                                                            "Cost": {
                                                                "TotalCost": {
                                                                    "PriorYear": {
                                                                        "val": "5.006"
                                                                    },
                                                                    "CurrentYear": {
                                                                        "val": "6.896"
                                                                    },
                                                                    "BudgetYearOneBase": {
                                                                        "val": "13.534"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "13.534"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    ]
                                                }
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "36.759"
                                                    },
                                                    "PriorYear": {
                                                        "val": "5.006"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "6.896"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "13.534"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "13.534"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "36.759"
                                        },
                                        "PriorYear": {
                                            "val": "5.006"
                                        },
                                        "CurrentYear": {
                                            "val": "6.896"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.534"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.534"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "36.759"
                            },
                            "PriorYear": {
                                "val": "5.006"
                            },
                            "CurrentYear": {
                                "val": "6.896"
                            },
                            "BudgetYearOneBase": {
                                "val": "13.534"
                            },
                            "BudgetYearOne": {
                                "val": "13.534"
                            }
                        }
                    }
                }
            ],
            "P5Item": [
                {
                    "Name": {
                        "val": "DATA PRODUCTS"
                    },
                    "ItemNumber": {
                        "val": "BA9315"
                    },
                    "SecondaryDistribution": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "5.189"
                                            },
                                            "CurrentYear": {
                                                "val": "4.178"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "5.567"
                                            },
                                            "BudgetYearOne": {
                                                "val": "5.567"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Army National Guard"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "3.255"
                                            },
                                            "CurrentYear": {
                                                "val": "2.621"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "3.492"
                                            },
                                            "BudgetYearOne": {
                                                "val": "3.492"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Army Reserve"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "1.729"
                                            },
                                            "CurrentYear": {
                                                "val": "1.392"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.855"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.855"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "281.813"
                            },
                            "PriorYear": {
                                "val": "10.173"
                            },
                            "CurrentYear": {
                                "val": "8.191"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.914"
                            },
                            "BudgetYearOne": {
                                "val": "10.914"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "281.813"
                            },
                            "PriorYear": {
                                "val": "10.173"
                            },
                            "CurrentYear": {
                                "val": "8.191"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.914"
                            },
                            "BudgetYearOne": {
                                "val": "10.914"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "281.813"
                            },
                            "PriorYear": {
                                "val": "10.173"
                            },
                            "CurrentYear": {
                                "val": "8.191"
                            },
                            "BudgetYearOneBase": {
                                "val": "10.914"
                            },
                            "BudgetYearOne": {
                                "val": "10.914"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Recurring Production"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "190.079"
                                                        },
                                                        "PriorYear": {
                                                            "val": "7.195"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "5.816"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "7.749"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "7.749"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "14.647"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMO"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "58.737"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Training"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "18.35"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.285"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.802"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "2.401"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2.401"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "281.813"
                                            },
                                            "PriorYear": {
                                                "val": "9.48"
                                            },
                                            "CurrentYear": {
                                                "val": "7.618"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "10.15"
                                            },
                                            "BudgetYearOne": {
                                                "val": "10.15"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "281.813"
                                        },
                                        "PriorYear": {
                                            "val": "9.48"
                                        },
                                        "CurrentYear": {
                                            "val": "7.618"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.15"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.15"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "System Engineering"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.693"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.573"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.764"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.764"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0.693"
                                        },
                                        "CurrentYear": {
                                            "val": "0.573"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.764"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.764"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "System Engineering"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}