{
    "id": "2020-Army-PB-2035A-JBOOK-ffd9e522016155822ff405752ab066bad8691a671e35376b94f41dbe6a64b3a9-47",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_OTHER_3-4-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "9552ML5355"
        },
        "LineItemTitle": {
            "val": "Items Less Than $5.0M (Float\/Rail)"
        },
        "P1LineNumber": {
            "val": "170"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "55"
        },
        "BudgetSubActivityTitle": {
            "val": "Rail Float Containerization Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "173.493"
                },
                "PriorYear": {
                    "val": "2.877"
                },
                "CurrentYear": {
                    "val": "8.385"
                },
                "BudgetYearOneBase": {
                    "val": "6.92"
                },
                "BudgetYearOne": {
                    "val": "6.92"
                },
                "BudgetYearTwo": {
                    "val": "1.846"
                },
                "Total": {
                    "val": "193.521"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "173.493"
                },
                "PriorYear": {
                    "val": "2.877"
                },
                "CurrentYear": {
                    "val": "8.385"
                },
                "BudgetYearOneBase": {
                    "val": "6.92"
                },
                "BudgetYearOne": {
                    "val": "6.92"
                },
                "BudgetYearTwo": {
                    "val": "1.846"
                },
                "Total": {
                    "val": "193.521"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "173.493"
                },
                "PriorYear": {
                    "val": "2.877"
                },
                "CurrentYear": {
                    "val": "8.385"
                },
                "BudgetYearOneBase": {
                    "val": "6.92"
                },
                "BudgetYearOne": {
                    "val": "6.92"
                },
                "BudgetYearTwo": {
                    "val": "1.846"
                },
                "Total": {
                    "val": "193.521"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "2.877"
                                },
                                "CurrentYear": {
                                    "val": "8.385"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.92"
                                },
                                "BudgetYearOne": {
                                    "val": "6.92"
                                },
                                "BudgetYearTwo": {
                                    "val": "1.846"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "2.877"
                    },
                    "CurrentYear": {
                        "val": "8.385"
                    },
                    "BudgetYearOneBase": {
                        "val": "6.92"
                    },
                    "BudgetYearOne": {
                        "val": "6.92"
                    },
                    "BudgetYearTwo": {
                        "val": "1.846"
                    }
                }
            }
        },
        "Description": {
            "val": "This budget line funds two separate programs.  One program supports Float and the other program supports Rail.\n\nThe Float program funds hardware and material in support of Army Watercraft Systems. The watercraft fleet performs a Title 10 mission and provides the Army Combatant Commander with a waterborne transportation capability to deliver tracked and wheeled vehicles, containers, and personnel as a ship to shore or shore to shore connector. Watercraft bridges the gap between strategic sealift and sustains lethality in littoral areas or where mature ports and road networks are unavailable.\n\nThe principle capabilities of Army Watercraft Systems are 1) movement\/maneuver and distribution of combat equipment and sustainment material; 2) access to degraded and\/or austere ports; 3) seaport operations, to include docking\/undocking, firefighting, towing and rescue; 4) ship to shore access to \"no port\" areas such as austere and remote, bare beaches; and 5) heavy lift in support of damaged seaport and\/or vessel repair and salvage; and 6) watercraft security operations.\n\nArmy Watercraft Systems are categorized under Landing Craft, Towing and Terminal Operations, Ship-to-Shore Enablers and Watercraft Operations Support. Landing Craft consist of Logistic Support Vessels (LSV), Landing Craft Utility 2000 (LCU-2000), Landing Craft Mechanized 8 (LCM-8) MOD 1, and LCM-8 MOD 2 (Watercraft Operations Support). Towing and Terminal Operations consist of Large Tug 800 (LT-800), Small Tug 900 (ST-900), and Barge Derrick Crane 115-ton (BD-115). Ship-to-Shore Enablers consist of Modular Causeway Systems (MCS) [each MCS includes Roll-On\/Roll-Off Discharge Facilities (RRDF), Modular Warping Tugs (MWT), Causeway Ferry (CF), Floating Causeway (FC)]. Landing Craft discharge combat equipment or troops to austere beaches, undeveloped coastlines and operate in a non-permissive environment. Towing and Terminal Operations and Ship-to-Shore Enablers support ocean and port\/harbor towing\/salvage operations. Both are critical in denied\/degraded ports, Joint Logistics Over-the-Shore (JLOTS) operations, and operations throughout the littorals.  Rescue Boats with outboard engines to meet Safety-of-Life at Sea (SOLAS) requirements for the Watercraft LSV, LCU-2000, LT-800 and MCS fleet, including cranes, cradles, and davit assemblies (support assemblies). Security Patrol Boats intercept and divert vessels that have strayed outside the public channel into restricted waters.\n\nFor the Rail program, railroad equipment consists of locomotives, rolling stock, railway passenger cars, track maintenance equipment, etc., used to support Army ammunition plants, Army Materiel Command (AMC) depots, Installation Management Command (IMCOM), Forces Command (FORSCOM) and Training and Doctrine Command (TRADOC) installations in peacetime, training and mobilization missions. This Railway Equipment is procured for the replacement of logistically unsupportable assets where current items are in some cases already unserviceable and in other cases, either unsafe or not cleared for use under the Federal Railroad Administration (FRA). Funding has been provided to procure shop equipment and tools to assist in the Army's move of its railroad locomotive overhaul facility, the Defense Generator & Rail Center from Hill, AFB, UT to Anniston, AL. \n\nLocomotive procurement consists of commercial off-the-shelf GENSET switcher locomotives in direct support of the Army Rail Modernization Program. The program mandates systematic replacement of an aging fleet, that for the respective installations are becoming increasingly more costly to maintain. The GENSET Locomotives are industry proven, state of the art technology that will position the Army to meet current EPA air quality restrictions, and future fuel economy mandates.\n\nComments: In accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestics emergency responses, and providing military support to civil authorities."
        },
        "Justification": {
            "val": "FY 2020 Base procurement dollars in the amount of $5.500 million procures 11 Security Patrol Boats in support of watercraft security operations at Military Ocean Terminal Sunny Point (MOTSU) & Military Ocean Terminal Concord (MOTCO). The lifecycle replacement of the requested watercraft is mission essential at MOTSU and MOTCO as both provide containerized ammunition surface transshipment in support of COCOM Commanders worldwide. The watercraft fleet provides restricted waterway enforcement of critical assets and personnel, IAW 33 CFR. The sensitivity of the installations security department mission equipment is crucial to minimizing the risk of mission failure during cargo operations. Ensuring adequate watercraft equipment is vital to readiness and security efforts.\n\nFY 2020 Base procurement dollars in the amount of $1.420 million supports Army Watercraft Systems for material and\/or hardware for modifications to maintain readiness, correct safety discrepancies, increase interoperability, maintain useful life, improve supportability, increase efficiency, meet new and changing statutory and regulatory requirements. FY 2020 Base procurement dollars also support Program Management Support which includes Program Management Matrix support and System Engineering oversight required to manage the program and provide contractor oversight.  Matrix salaries, benefits, travel, personnel training and other government costs are included for retaining a professional acquisition workforce."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "ITEMS LESS THAN $5.0M (FLOAT\/RAIL)"
                    },
                    "ItemNumber": {
                        "val": "MA8900"
                    },
                    "SecondaryDistribution": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "2.877"
                                            },
                                            "CurrentYear": {
                                                "val": "8.385"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "6.92"
                                            },
                                            "BudgetYearOne": {
                                                "val": "6.92"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "173.493"
                            },
                            "PriorYear": {
                                "val": "2.877"
                            },
                            "CurrentYear": {
                                "val": "8.385"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.92"
                            },
                            "BudgetYearOne": {
                                "val": "6.92"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "173.493"
                            },
                            "PriorYear": {
                                "val": "2.877"
                            },
                            "CurrentYear": {
                                "val": "8.385"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.92"
                            },
                            "BudgetYearOne": {
                                "val": "6.92"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "173.493"
                            },
                            "PriorYear": {
                                "val": "2.877"
                            },
                            "CurrentYear": {
                                "val": "8.385"
                            },
                            "BudgetYearOneBase": {
                                "val": "6.92"
                            },
                            "BudgetYearOne": {
                                "val": "6.92"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "AWS Material \/ Hardware"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "173.493"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.595"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "7.545"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.222"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.222"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.282"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "0.84"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "0.198"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.198"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "173.493"
                                            },
                                            "PriorYear": {
                                                "val": "2.877"
                                            },
                                            "CurrentYear": {
                                                "val": "8.385"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.42"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.42"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "173.493"
                                        },
                                        "PriorYear": {
                                            "val": "2.877"
                                        },
                                        "CurrentYear": {
                                            "val": "8.385"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.42"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.42"
                                        }
                                    }
                                }
                            }
                        ],
                        "Hardware": [
                            {
                                "NonRecurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Security Patrol Boats"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "11"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "11"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "5.5"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "5.5"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "500"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "500"
                                                        }
                                                    }
                                                },
                                                "ManufacturerList": {
                                                    "Manufacturer": [
                                                        {
                                                            "Name": {
                                                                "val": "TBD"
                                                            },
                                                            "Location": {
                                                                "val": "TBD"
                                                            },
                                                            "HistoryPlanningList": {
                                                                "HistoryPlanning": [
                                                                    {
                                                                        "FiscalYear": {
                                                                            "val": "2020"
                                                                        },
                                                                        "PCOLocation": {
                                                                            "val": "Rock Island, IL"
                                                                        },
                                                                        "AwardDate": {
                                                                            "val": "2020-01"
                                                                        },
                                                                        "FirstDeliveryDate": {
                                                                            "val": "2020-04"
                                                                        },
                                                                        "Quantity": {
                                                                            "val": "11"
                                                                        },
                                                                        "UnitCost": {
                                                                            "val": "500"
                                                                        },
                                                                        "SpecsAvailableNow": {
                                                                            "val": "true"
                                                                        },
                                                                        "ContractMethod": {
                                                                            "val": "C"
                                                                        },
                                                                        "ContractType": {
                                                                            "val": "FFP"
                                                                        }
                                                                    }
                                                                ]
                                                            }
                                                        }
                                                    ]
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "5.5"
                                            },
                                            "BudgetYearOne": {
                                                "val": "5.5"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "5.5"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.5"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "OverallHistoryPlanningRemarks": {
                        "val": "Items to be procured are Commercial-off-the-Shelf (COTS)\/Government-off-the-Shelf (GOTS) components."
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}