{
    "id": "2020-Army-PB-2035A-JBOOK-ae1ed46873d9bdf25873e5689835ba301fffafb48f21f5afd9fbcf4edb5f072b-94",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_OTHER_2-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "3051BD3501"
        },
        "LineItemTitle": {
            "val": "CSS Communications"
        },
        "P1LineNumber": {
            "val": "117"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "92"
        },
        "BudgetSubActivityTitle": {
            "val": "Elect Equip - Automation"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "386.049"
                },
                "BudgetYearOneBase": {
                    "val": "24.7"
                },
                "BudgetYearOne": {
                    "val": "24.7"
                },
                "BudgetYearTwo": {
                    "val": "57.7"
                },
                "BudgetYearThree": {
                    "val": "80"
                },
                "BudgetYearFour": {
                    "val": "109.6"
                },
                "BudgetYearFive": {
                    "val": "116.3"
                },
                "Total": {
                    "val": "774.349"
                }
            },
            "UnitCost": {
                "BudgetYearOneBase": {
                    "val": "14.702"
                },
                "BudgetYearOne": {
                    "val": "14.702"
                },
                "BudgetYearTwo": {
                    "val": "14.652"
                },
                "BudgetYearThree": {
                    "val": "15.595"
                },
                "BudgetYearFour": {
                    "val": "14.431"
                },
                "BudgetYearFive": {
                    "val": "14.372"
                },
                "Total": {
                    "val": "29.293"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "386.049"
                },
                "BudgetYearOneBase": {
                    "val": "24.7"
                },
                "BudgetYearOne": {
                    "val": "24.7"
                },
                "BudgetYearTwo": {
                    "val": "57.7"
                },
                "BudgetYearThree": {
                    "val": "80"
                },
                "BudgetYearFour": {
                    "val": "109.6"
                },
                "BudgetYearFive": {
                    "val": "116.3"
                },
                "Total": {
                    "val": "774.349"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "386.049"
                },
                "BudgetYearOneBase": {
                    "val": "24.7"
                },
                "BudgetYearOne": {
                    "val": "24.7"
                },
                "BudgetYearTwo": {
                    "val": "57.7"
                },
                "BudgetYearThree": {
                    "val": "80"
                },
                "BudgetYearFour": {
                    "val": "109.6"
                },
                "BudgetYearFive": {
                    "val": "116.3"
                },
                "Total": {
                    "val": "774.349"
                }
            }
        },
        "Description": {
            "val": "The Combat Service Support (CSS) Communications funding line supports the Army's Network Modernization Strategy Line Of Effort (LOE) 1 (Unified Network).\n\nThe Combat Service Support (CSS) Communications program funding line will support the Army's full spectrum logistics communication requirements currently supported under two programs: A wireless capability, Combat Service Support Automated Information System Interface (CAISI) and Combat Service Support Satellite Communications (CSS SATCOM) Very Small Aperture Terminal (VSAT) terminal capability. The SATCOM VSAT Terminal augments the tactical communications network of the current force, at all logistics levels, with tailored commercial off-the-shelf (COTS) network capabilities for enabling Sustainment Information Systems (SIS) communications. Currently the VSAT and CAISI programs have a ROM of 32,600 end items fielded; 3,600 VSAT terminals and 36,175 CAISI systems (Fielded at an 8 to 1 ratio) supporting Army logistics operations, all of which were originally fielded in 2004 and cannot be technically or economically sustained past their 2022 end of life.\n\nThe VSAT modernization terminals are a COTS solution that will provide the (DoD Information Network -Army) DODIN-A access which SIS rely on, at home station (garrison) and into the tactical, operational and strategic battle space. This connectivity is provided where and when it is needed by user supported hardware, to support SIS within personnel administrative and logistical support areas, sustainment nodes, and even as far down as maintenance support teams providing front line maintenance actions. The emergence of new sustainment business process systems that use Enterprise Resource Planning (ERP) software, such as Global Combat Support System-Army (GCSS-Army), Integrated Personnel and Pay System-Army (IPPS-A) and GCSS-Marine, require global connectivity capabilities. These programs and associated data are enterprise level services that require units to have reliable, redundant and continuous reach back capabilities to the DODIN. Terminals will be optimized for sustainment operations in support of the Army as a component of a Joint Force and have the capabilities to support the Army's strategy for transitioning to Transport Convergence.\n\nThe CAISI modernization provides wireless and wired network access point services, which functions as a gateway to the enterprise data network in both the deployed and garrison environment. The wireless capability is a user operated and maintained system for SIS to exchange information, which is transmitted over COTS equipment utilizing the Transport Control Protocol\/Internet Protocol networks. The CAISI overcomes current wireless and wired network security and distance limitations, by leveraging modern wireless technology and firewalls, which will increase the cyber secure security posture and be maintainable into the future. \n\nThe current iterations of the VSAT and CAISI programs were procured at a total RDT&E and Procurement cost of $506.6M across two funding lines. The VSAT program began in 2004 and required $325.3M in OPA, while CAISI was a pre-existing system and required $56.5M RDT&E and $124.8M OPA. Both the VSAT and CAISI system's technology is at end of life in 2022. O&M requirements to continue sustainment of the original systems are forecasted to drastically increase beyond 2022, as components are no longer in production or supported by manufacturers.\n\nCurrently, all funding for VSAT and CAISI is under BD3501\/3513 (CSS SATCOM VSAT).  These requirements will be broken out into BD3513 (CSS SATCOM VSAT) and BD3512 (CAISI) in future budget submissions."
        },
        "Justification": {
            "val": "The Combat Service Support (CSS) Communications funding line supports the Army's Network Modernization Strategy Line Of Effort (LOE) 1 (Unified Network).\n\nFY 2020 Base procurement dollars in the amount of $24.700 million procures the modernization of Combat Service Support Automated Information Systems (CAISI) wireless capability and the Very Small Aperture Terminal (VSAT) for Beyond Line Of Sight (BLOS) ($8.954 million for CAISI INC 2\/ $15.746 million for VSAT). Equipment is critical for a more capable and cyber resilient replacement for existing VSAT\/ CAISI systems which are at end of life in 2022. Deployable satellite-based tactical logistics communication systems that include a wireless Local Area Network (LAN), support logisticians in deployed motor pools, warehouses, and airfields not collocated with Command Post Communications networks. Tactical satellite communications systems will deliver faster wireless with more efficient and secure commercial antenna solutions supporting Enterprise Resource Planning (ERP) software, such as Global Combat Support System-Army (GCSS-Army), Integrated Personnel and Pay System-Army (IPPS-A) and GCSS-Marine.\n\nCurrently, all funding for VSAT and CAISI is under BD3501\/3513 (CSS SATCOM VSAT).  These requirements will be broken out into BD3513 (CSS SATCOM VSAT) and BD3512 (CAISI) in future budget submissions.  \n\nIAW Section 1815 of the FY08 NDAA this item is necessary for use by the active components and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\""
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "CSS SATCOM"
                    },
                    "ItemNumber": {
                        "val": "BD3513"
                    },
                    "Remarks": {
                        "val": "Ratio of equipment for modernization being procured will be dictated by finalization of revised requirements document.\n\nCurrently, all funding for modernization of VSAT and CAISI is under BD3501\/3513 (CSS SATCOM VSAT).  These requirements need to be broken out into BD3513 (CSS SATCOM VSAT) and BD3512 (CAISI).  The BD3512 (CAISI) needs to be re-activated in order to align requirements and funding properly.  Also, quantities reflected on P40 are incorrect and should align with breakout in P5."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "386.049"
                            },
                            "BudgetYearOneBase": {
                                "val": "24.7"
                            },
                            "BudgetYearOne": {
                                "val": "24.7"
                            }
                        },
                        "UnitCost": {
                            "BudgetYearOneBase": {
                                "val": "14.702"
                            },
                            "BudgetYearOne": {
                                "val": "14.702"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "386.049"
                            },
                            "BudgetYearOneBase": {
                                "val": "24.7"
                            },
                            "BudgetYearOne": {
                                "val": "24.7"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "386.049"
                            },
                            "BudgetYearOneBase": {
                                "val": "24.7"
                            },
                            "BudgetYearOne": {
                                "val": "24.7"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Combat Service Support Automated Information Systems (CAISI) Modernization"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "157"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "157"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "193.025"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "7.935"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "7.935"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "50.541"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "50.541"
                                                        }
                                                    }
                                                },
                                                "ManufacturerList": {
                                                    "Manufacturer": [
                                                        {
                                                            "Name": {
                                                                "val": "TBD"
                                                            },
                                                            "Location": {
                                                                "val": "TBD"
                                                            },
                                                            "HistoryPlanningList": {
                                                                "HistoryPlanning": [
                                                                    {
                                                                        "FiscalYear": {
                                                                            "val": "2020"
                                                                        },
                                                                        "PCOLocation": {
                                                                            "val": "ACC-RI"
                                                                        },
                                                                        "AwardDate": {
                                                                            "val": "2020-01"
                                                                        },
                                                                        "FirstDeliveryDate": {
                                                                            "val": "2021-01"
                                                                        },
                                                                        "Quantity": {
                                                                            "val": "157"
                                                                        },
                                                                        "UnitCost": {
                                                                            "val": "50.541"
                                                                        },
                                                                        "SpecsAvailableNow": {
                                                                            "val": "false"
                                                                        },
                                                                        "ContractMethod": {
                                                                            "val": "C"
                                                                        },
                                                                        "ContractType": {
                                                                            "val": "FFP"
                                                                        }
                                                                    }
                                                                ]
                                                            }
                                                        }
                                                    ]
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Very Small Aperture Terminal (VSAT) Modernization"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "93"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "93"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "193.024"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "15.746"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "15.746"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "169.312"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "169.312"
                                                        }
                                                    }
                                                },
                                                "ManufacturerList": {
                                                    "Manufacturer": [
                                                        {
                                                            "Name": {
                                                                "val": "TBD"
                                                            },
                                                            "Location": {
                                                                "val": "TBD"
                                                            },
                                                            "HistoryPlanningList": {
                                                                "HistoryPlanning": [
                                                                    {
                                                                        "FiscalYear": {
                                                                            "val": "2020"
                                                                        },
                                                                        "PCOLocation": {
                                                                            "val": "ACC-RI"
                                                                        },
                                                                        "AwardDate": {
                                                                            "val": "2020-01"
                                                                        },
                                                                        "FirstDeliveryDate": {
                                                                            "val": "2021-01"
                                                                        },
                                                                        "Quantity": {
                                                                            "val": "93"
                                                                        },
                                                                        "UnitCost": {
                                                                            "val": "169.312"
                                                                        },
                                                                        "SpecsAvailableNow": {
                                                                            "val": "false"
                                                                        },
                                                                        "ContractMethod": {
                                                                            "val": "C"
                                                                        },
                                                                        "ContractType": {
                                                                            "val": "FFP"
                                                                        }
                                                                    }
                                                                ]
                                                            }
                                                        }
                                                    ]
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "386.049"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "23.681"
                                            },
                                            "BudgetYearOne": {
                                                "val": "23.681"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "386.049"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.681"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.681"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Government Management"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.651"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.651"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "0.651"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.651"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Program Management"
                                }
                            },
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "System Engineering"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.368"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.368"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "0.368"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.368"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "System Engineering"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}