{
    "id": "2020-Navy-PB-1109N-JBOOK-b326adbe914504e2b61de725ef983e7223e072a57601b3e4ae0ec2b7f58a6709-30",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "4645"
        },
        "LineItemTitle": {
            "val": "Cyberspace Activities"
        },
        "P1LineNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "19"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support (Non-Tel)"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "27.632"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "27.632"
                },
                "BudgetYearTwo": {
                    "val": "89.9"
                },
                "BudgetYearThree": {
                    "val": "75.766"
                },
                "BudgetYearFour": {
                    "val": "89.088"
                },
                "BudgetYearFive": {
                    "val": "105.573"
                },
                "Total": {
                    "val": "387.959"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "27.632"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "27.632"
                },
                "BudgetYearTwo": {
                    "val": "89.9"
                },
                "BudgetYearThree": {
                    "val": "75.766"
                },
                "BudgetYearFour": {
                    "val": "89.088"
                },
                "BudgetYearFive": {
                    "val": "105.573"
                },
                "Total": {
                    "val": "387.959"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "27.632"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "27.632"
                },
                "BudgetYearTwo": {
                    "val": "89.9"
                },
                "BudgetYearThree": {
                    "val": "75.766"
                },
                "BudgetYearFour": {
                    "val": "89.088"
                },
                "BudgetYearFive": {
                    "val": "105.573"
                },
                "Total": {
                    "val": "387.959"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206313M"
                },
                {
                    "val": "0305251M"
                }
            ]
        },
        "Description": {
            "val": "Beginning in FY20, efforts in this line item (LI) were transferred from existing LIs in order to consolidate Marine Corps Cyberspace Procurement Activities into one LI.  MARINE CORPS CYBERSPACE OPERATIONS GROUP (MCCOG), and UNITED STATES MARINE CORPS FORCES CYBERSPACE COMMAND (MARFORCYBER) efforts were transferred from LI 4630, Common Computer Resources.  PUBLIC KEY INFRASTRUCTURE (PKI) was transferred from LI 4635, Comm and Elec Infrastructure Support.\n\nMARINE CORPS CYBERSPACE OPERATIONS GROUP (MCCOG) will execute Marine Corps Global Information Grid Operations and Marine Corps Defensive Cyber Operations in support of Marine Corps operational requirements in order to enhance freedom of action across all warfighting domains, while denying the efforts of adversaries to degrade or disrupt this advantage through cyberspace.  MCCOG is the Network Operations (NETOPS) component of Marine Corps Forces Cyberspace Command and provides network situational awareness, command and control, and technical support to Marine Corps operating forces and supporting establishment organizations, both in garrison and while deployed. MCCOG is the primary DOD Computer Network Defense Service Provider for the U.S. Marine Corps and directs Service actions to prevent and respond to security incidents. The MCCOG delivers numerous enterprise services for the Marine Corps, to include mainframe computer services management, Defense Message System (DMS), DOD Public Key Infrastructure (PKI), and Active Directory\/Global Address List. The MCCOG is responsible for the operations and defense of MCEITS, which delivers data center services to the Marine Corps. Finally, MCCOG provides technical expertise to HQMC, Marine Corps Combat Development Command (MCCDC), Marine Corps Systems Command (MCSC), and Marine Corps organizations around the world in support of Information Technology initiatives undertaken within the Marine Corps and DOD. The PMC funding will support Core Competencies in the Computer Networks Defense and Network Ops areas with skilled cyber-warriors (24x7x365).  The added responsibilities and network security events have required continued operational employment of current assets and personnel. PMC funding is based on increased mission requirements dictated by DoD\/USSTRATCOM\/USCYBERCOM Operations to defend the network. The procurement funding will be used to refresh the MCCOG Alternate Network Operations Security Center, USMC Site R refresh, Network Common Operational Picture Tools, Host Based Security Systems, Secure Configuration Compliance Validation Initiative and Secure Configuration Remediation Initiative (SCCVI\/SCRI), Intrusion Prevention and scanning tools, Virtual Private Network, and other operations and defense tools.  \n\nUNITED STATES MARINE CORPS FORCES CYBERSPACE COMMAND (MARFORCYBER) will procure hardware and software for Deployable Mission Support Systems (DMSS) suites.  DMSS Cyber Mission Forces (CMF) weapon system in direct support of global missions.   DMSS suites are maintained with hardware support and software renewals, and refresh perpetual software licenses and engineering support.  As directed by United States Cyberspace Command (USCC) in FY20 PBD 700A1, MARFORCYBER was directed to man, train and equip a Joint Mission Operation Center (JMOC) at Fort Meade.  This is one of four JMOCs in support of United States Cyberspace Command (USCC) and Joint Forces Headquarters Cyber (JFHQ-C) mission.\n\nPUBLIC KEY INFRASTRUCTURE (PKI) is a framework of laws, policies, procedures, and technologies for the use of digital credentials, which provide confidentiality, integrity, authenticity, and non-repudiation in electronic communications and transactions. PKI allows secure access to IT systems. PKI has the ability to electronically sign documents, encrypt messages and documents, and to authenticate and protect web access... In compliance with DOD policy and direction, the USMC Public Key Infrastructure Program (PKI) program provides the resources, manpower and equipment (hardware and software), dedicated to the management (i.e.: generation, production, distribution, control, accounting and destruction) of keys and certificates used by public key-based security services to include NIPRNet and SIPRNet both garrison and deployed.  The PKI program operates the USMC Certificate Validation Infrastructure necessary to ensure that only authorized users and server based applications are allowed to operate on the Marine Corps Enterprise Network (MCEN).  These services are required for user access to all information system components on the MCEN including network accounts, applications and web sites.  PKI must be operable in garrison and tactical\/deployed environments.\n\nUSMC MAGTF DCO-IDM Suite:  The USMC Marine Corps Air Ground Task Force (MAGTF) Defensive Cyberspace Operations-Internal Defensive Measures (DCO-IDM) Suite program provides the self-contained, fly-away equipment (hardware and software) for MAGTF DCO-IDM Teams to conduct vulnerability analysis (VA), incident response (IR), and other DCO-IDM functions concurrently on classified and unclassified networks.  The teams utilize the interface (a laptop), data from passive and active sensors (servers, laptops, and taps), and the analytic capability from the hardware and software in order to determine the state of the supported commander's network, host, and major weapon systems.  Software includes Government Off-the-Shelf (GOTS), Commercial Off-the-Shelf (COTS), and free and open-source software (FOSS). MAGTF DCO Suites are intended to be part of a common family of systems in support of MAGTF cyberspace operations.  MAGTF DCO-IDM Suites must be operable in garrison and tactical\/deployed environments."
        },
        "Justification": {
            "val": "Beginning in FY20, efforts in this line item (LI) were transferred from existing LIs in order to consolidate Marine Corps Cyberspace Procurement Activities into one LI.  MARINE CORPS CYBERSPACE OPERATIONS GROUP (MCCOG), and UNITED STATES MARINE CORPS FORCES CYBERSPACE COMMAND (MARFORCYBER) efforts were transferred from LI 4630, Common Computer Resources.  PUBLIC KEY INFRASTRUCTURE (PKI) was transferred from LI 4635, Comm and Elec Infrastructure Support.\n\nFY18 Base Appropriation:  $21.111M\n\nMARFORCYBER:\nFY18 Base Appropriation Request: $20.902M completed MARFORCYBER's headquarters MILCON facility on the East Campus at Fort Meade. It also completed the FY14 MILCON project number P001 items such as Distributed Computing Equipment, Video Teleconferencing and Multi-media Equipment, Network Hardware, Telephone Equipment, Cable Infrastructure, Wireless Center, and Operations Center. In addition it procured hardware and software for Deployable Mission Support Systems (DMSS). DMSS kits are maintained with hardware support, software renewals, and refresh perpetual software licenses. DMSS kits are required in order for MARFORCYBER to support Marine units all across the globe.\n\nPUBLIC KEY INFRASTRUCTURE (PKI):\n$0.209M funding supported the continuation of PKI hardware and software implementation across the (NIPRNet and SIPRNet) for both garrison and deployed networks in order to meet CYBERCOM's Tasking Order requiring the use of hardware tokens for access to networks, network resources and secure email in accordance with DODI 8520.02 and DODI 8520.03. Funding will also be utilized to procure necessary tokens and equipment for SIPRNet Token issuance across the MCEN as well as implementation of the DOD PKI NIPRNet Enterprise Alternate Token Management System.\nFY19 Base Appropriation:\n\nFY19 Base Appropriation:  $21.150M\n\nMARINE CORPS CYBERSPACE OPERATIONS GROUP (MCCOG):\nFY19 Base Appropriation Request: $7.683M procures hardware and software for Defensive Cyber Operations support and network infrastructure upgrades. The increase of $4.455M from FY18 to FY19 is due to increased\nequipment procurement and technology insertion for defensive cyberspace operations capabilities, Department of Defense Information Network operations, and continuity of operations requirements.\n\nMARFORCYBER:\nFY19 Base Appropriation Request: $13.348M procures hardware and software for Deployable Mission Support Systems (DMSS). DMSS kits are maintained with hardware support, software renewals, and refresh perpetual\nsoftware licenses. DMSS kits are required in order for MARFORCYBER to support Marine Corps units all across the globe. $8.488M will procure DMSS for MARFORCYBER and $4.860M will procure DMSS for the Marine\nCorps Operating Forces. The $4.326M decrease from FY18 to FY19 is a result of the completion of the MARFORCYBER Headquarters Building, FY14 MILCON Project P001.\n\nPUBLIC KEY INFRASTRUCTURE (PKI):\n$0.119M funding supports the continuation of PKI hardware and software implementation across the (NIPRNet and SIPRNet) for both garrison and deployed networks in order to meet CYBERCOM's Tasking Order requirement. Funding decrease of $0.090M from FY18 to FY19 is the result of virtualization of tactical hardware and the reclassification of NIPRNet Enterprise Alternate Tokens and SIPRNet Tokens from equipment to consummables.\n\nFY20 Base Appropriation:  $27.632M\n\nMARINE CORPS CYBERSPACE OPERATIONS GROUP (MCCOG):\nFY20 Base Appropriation Request:  $7.841M will procure hardware and software for Defensive Cyber Operations Support, remote forensics solutions, and Hunt Deployable suites.  The increase of $0.158M will provide technical refresh for the USMC Unified Communications project items such as Distributed Computing Equipment, Video Teleconferencing and Multi-Media Equipment, Network Hardware, Telephone Equipment, and Telepresence Content Server.  Prior to FY20 this program was aligned to LI 4630.\n\nMARFORCYBER:\nFY20 Base Appropriation Request: $14.289M will procure hardware and software for Deployable Mission Support Systems (DMSS). The $0.941M increase from FY19 to FY20 is a result of DMSS suites that are maintained with hardware support, software renewals, and refresh perpetual software licenses.  DMSS kits are required in order for MARFORCYBER to provide Marine Corps units all across the globe with cyberspace activity support.  $6.800M will procure tools, platforms, infrastructure, and sustainment for various Offensive Cyberspace Operations (OCO) requirements to encourage an appropriate Service-Level analysis for the Joint Mission Operations Center (JMOC) Meade requirement in support of United States Cyberspace Command (USCC) and Joint Forces Headquarters Cyber (JFHQ-c) mission.  $4.271M will procure a Defensive Cyberspace Operations War room, Commercial Solutions for Classified (CSfC), engineering, tools, platforms, OCO, DCO infrastructure, and sustainment requirements.  Prior to FY20 this program was aligned to LI 4630.\n\nPUBLIC KEY INFRASTRUCTURE (PKI):\nFY20 Appropriation Request:  $0.502M funding will support the continuation of PKI hardware and software implementation across the (NIPRNet and SIPRNet) for both garrison and deployed networks in order to meet DOD CIO requirement. The $0.383M increase from FY19 to FY20 is a result of Certificate Validate Infrastructure (CVI) component refresh requirement. CVI is required in order for end users to authenticate themselves when signing onto Marine Corps Enterprise\nNetwork (MCEN) accounts. These services are required for user access to all information system components on the MCEN including network accounts, applications and web sites. PKI must be operable in garrison and tactical\/deployed environments.  Prior to FY20 this program was aligned to LI 4635.\n\nPrior to FY20 this program was aligned to LI 4635.\n\nUSMC MAGTF DCO-IDM Suite:\n$5.000M will procure MAGTF DCO-IDM Suites for fielding to I, II, & III MEF DCO-IDM Companies and Marine Corps Communications-Electronics School.  Previously the Operating Forces utilized the DMSS kits for Defensive Cyberspace Operations.  This is a new start in FY20."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Cyberspace Activities"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Cyberspace Activities"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Prior to FY20, DMSS kits were utilized to meet this requirement.  Beginning in FY20 USMC Operating Forces will begin procurement of a system that meets their unique requirements; the MAGTF DCO-IDM Suite.",
                                                "val": "1.1) MAGTF DCO-IDM Suite"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Prior to FY20, DMSS kits were requested in LI 4630, Cost Element 7.1.  Increase of $11.071 from FY19 to FY20 is due to  Joint Mission Operations Center (JMOC) Meade requirement in support of United States Cyberspace Command (USCC) and Joint Forces Headquarters Cyber (JFHQ-c) mission.  Procure Defensive Cyberspace Operations (DCO) War room, Commercial Solutions for Classified (CSfC), engineering, tools, platforms, OCO, DCO infrastructure and sustainment requirements.",
                                                "val": "1.2) MARFORCYBER"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "18.56"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "18.56"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Prior to FY20, MCCOG funds were requested in LI 4630, Cost Elements 4.2 and 4.3.",
                                                "val": "1.3) MCCOG"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "3.57"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.57"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Prior to FY20, PKI funds were requested in LI 4635, Cost Element 3.1.",
                                                "val": "1.4) PKI"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.502"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.502"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.632"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.632"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "27.632"
                            },
                            "BudgetYearOne": {
                                "val": "27.632"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}