{
    "id": "2020-Navy-PB-1109N-JBOOK-b326adbe914504e2b61de725ef983e7223e072a57601b3e4ae0ec2b7f58a6709-40",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6438"
        },
        "LineItemTitle": {
            "val": "Physical Security Equipment"
        },
        "P1LineNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Materials Handling Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "282.563"
                },
                "PriorYear": {
                    "val": "38.462"
                },
                "CurrentYear": {
                    "val": "28.306"
                },
                "BudgetYearOneBase": {
                    "val": "15.404"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "15.404"
                },
                "BudgetYearTwo": {
                    "val": "23.546"
                },
                "BudgetYearThree": {
                    "val": "93.861"
                },
                "BudgetYearFour": {
                    "val": "44.475"
                },
                "BudgetYearFive": {
                    "val": "41.023"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "282.563"
                },
                "PriorYear": {
                    "val": "38.462"
                },
                "CurrentYear": {
                    "val": "28.306"
                },
                "BudgetYearOneBase": {
                    "val": "15.404"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "15.404"
                },
                "BudgetYearTwo": {
                    "val": "23.546"
                },
                "BudgetYearThree": {
                    "val": "93.861"
                },
                "BudgetYearFour": {
                    "val": "44.475"
                },
                "BudgetYearFive": {
                    "val": "41.023"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "282.563"
                },
                "PriorYear": {
                    "val": "38.462"
                },
                "CurrentYear": {
                    "val": "28.306"
                },
                "BudgetYearOneBase": {
                    "val": "15.404"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "15.404"
                },
                "BudgetYearTwo": {
                    "val": "23.546"
                },
                "BudgetYearThree": {
                    "val": "93.861"
                },
                "BudgetYearFour": {
                    "val": "44.475"
                },
                "BudgetYearFive": {
                    "val": "41.023"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206313M"
                }
            ]
        },
        "Description": {
            "val": "Installation Physical Security provides precise, uniform technological solutions to manpower intensive security requirements. Systems used at bases and stations protected our most critical assets vital to operations - people, flight lines, classified information, Arms, Ammunition, and Explosives (AA&E), shorelines, open desert areas, critical assets and infrastructure and providing constant, vigilant capabilities that control and restrict access and provide notification of actual and attempted unauthorized intrusion. Mass Notification System (MNS) provides immediate notice and warning to personnel living and working aboard our bases and stations in the event of security breaches via interior and exterior speaker systems, telephones and computers in the event of natural disasters, terrorist activities, weather emergencies or other events requiring immediate guidance to ensure the safety and security of personnel. These systems upgrade and replace antiquated individually purchased systems that are costly to maintain and may not meet prescribed requirements for securing U.S. assets. The Marine Corps Electronic Security System (MCESS) Program provides a comprehensive electronic security system suite that supports collateral equipment including intrusion detection, surveillance, installation, and facility automated access control and tracking capabilities. These systems increase efficiency and effectiveness of available security manpower and improve security and safety at installation perimeter, flight line, restricted area, facility entry points and is now expanding to meet installation access control requirements. Ground-based radars support surveillance of the vast regions aboard Marine Corps installations such as expansive waterways, open airfields and desert areas (improved assessment at long distances) allowing for greater defensive posture and response capabilities.   \n\nCollateral Equipment (CE) funds the one time initial outfitting of equipment not defined as built-in for new facilities (MILCONs), newly renovated\/refurbished facilities, and Host Nation funded construction projects.  The one time procurement includes equipment such as Mass Notification Systems, Intrusion Detection Systems, Closed Circuit TVs, Information Technology switches and routers, Passive Optical Networks, Internal Grounding Systems, Voice over Internet Protocol (VOIP), Audio Visual\/Video Teleconferencing Systems and other industrial equipment such as recycling and pulping systems, warehouse conveyor systems, and heavy maintenance equipment."
        },
        "Justification": {
            "val": "Beginning in FY19, Identity Dominance System has been realigned from BLI 6438 PHYSICAL SECURITY EQUIPMENT, to BLI 4652, MODIFICATIONS KIT C4FIRE SUPPORT SYSTEM\n\n\nFY2018 Base Appropriation Request:  $38.462M\n\nInstallation Physical Security $10.648M:  Funding obligation directed toward the procurement of physical security systems and program initiatives supporting flight line security, waterside\/shoreline security, protection of classified material storage areas, AA&E and other critical assets. Funds will support the enhancement of command and control systems for the MCESS. As well as required upgrades to the family of systems to maintain compliance with DoD requirements to deploy an enterprise access control system capable of interfacing with DoD databases such as Defense Enrollment Eligibly Reporting System (DEERS) and other federal government authoritative databases. This funding also supported Defense Policy Review Initiatives (DPRI) for Guam, Okinawa, and Iwakuni. Financing executed by Space and Naval Warfare Center (SPAWAR), procured, installed and accredited, access control and intrusion detection for five MILCON projects. The five projects, funded by the Government of Japan (GoJ), are in direct support of the Futenma Replacement Facility (FRF) program. The GoJ projects are (1) MC0508-T Base Communications Building, (2) MC0510-T Exchange Complex, (3) MC0514-T Bachelor Enlisted Quarters C & D, (4) MC0590-T Magazines A-D, and (5) MC2579-T Electrical Substation. The FRF program is a bilateral agreement with the GoJ to support the relocation of operations at MCAS Futenma to Camp Schwab. Implementation of the installation physical access control systems approval occurred in FY17.\n\nCollateral Equipment $27.814M:  Funds procured equipment for one time initial outfitting of equipment for new construction (MILCONs) and newly renovated\/refurbished facilities.  Equipment included Electronic Security Systems such as Mass Notification, Access Control and Intrusion Detection for 25 facilities, Audio Visual (AV) and Video Teleconferencing (VTC) systems for 4 facilities, Passive Optical Networks (PON), Voice over Internet Protocol (VOIP), routers and switches for estimated 14 facilities, and Low Altitude Range Communications Systems (LARCS) for Johnson Valley Land Expansion at MCAGCC 29 Palms.  Funds in the amount of $4.000M were realigned from Utilities to Collateral Equipment higher priorities to complete the outfitting of all facilities that were coming to completion in FY18.  \n\n\nFY2019 Base Appropriation Request: $28.306M\n\nInstallation Physical Security $4.262M:  Funds the procurement of physical security systems and program initiatives supporting flight line security, waterside\/shoreline security, protection of SCIFS, AA&E and other critical assets. Funds will support the enhancement of command and control systems for the MCESS. Funding will also support upgrades to the family of systems to maintain compliance with federal and DoD requirements to deploy an enterprise access control system capable of interfacing with DoD databases such as DEERS and other federal government authoritative databases. This funding also supports DPRI Guam needs to install physical security measures at Futenma Replacement Facility Camp Schwab for multiple structures to include the electrical substation, the Weapons Assembly Facility, magazines, maintenance hangars, water storage tanks and camp gate upgrades.  Also supports DPRI Okinawa installation of intrusion detection and mass notification systems on Camps Foster and Hansen for multiple facilities to include: fire stations, BEQs, BOQs, Commissary, Exchange, Garrison Maintenance Facility, main gates, and town center. \n\n\nThe decrease in funding of $6.386M from FY18 to FY19 is due to the implementation of funding for physical access control systems in the previous years.\n\nCollateral Equipment $24.044M:  Funds will procure security systems, AV, VTC, VOIP, routers, switches and industrial equipment for one time outfitting of new construction and renovated\/refurbished facilities that will be close to completion in FY19.  This includes 7 new facilities, and approx. 21 renovated facilities.   \n\n\nFY2020 Base Appropriation Request:  $15.404M\n\nInstallation Physical Security $6.345M:  Funding obligation directed toward the procurement of physical security systems and program initiatives supporting flight line security, waterside\/shoreline security, protection of SCIFS, AA&E and other critical assets. Funding will also support upgrades to all protection equipment including intrusion detection, surveillance, installation and facility automated access control, and tracking capabilities to maintain compliance with Federal and DoD requirements. Funding will ensure critical assets are provided protection to approximately (10) Airfields, (138) flight line turnstiles, (65) flight line automated gates, (1347) AA&E facilities\/spaces (i.e. magazines, armories, consolidated armory spaces, Ready Service Lockers (RSL's), (42) SCIFs, (12) facilities in support of the Joint Strike Fighter (JSF), (193) classified material storage spaces. There are an additional (1854) areas protected that include museums & museum warehouses, medical\/dental\/pharmacy facilities, banks\/disbursing offices, site headquarters buildings & law centers, brigs, CID\/evidence rooms, communication\/network operation centers, gas stations & fuel farms, schools, warehouses, commissaries & exchanges, perimeter installation gate access points, installation perimeters (designated facilities),  designated critical infrastructure (water towers, water treatment facilities, utility facilities), motor pools, general quarters & barracks (with MCESS MNS, IDS, & Access Control), building access control to all Marine Corps secure buildings, and simulator trainers. Funding in the amount of $2.648M will also support the Defense Policy Review Initiatives (DPRI) Physical Security Requirements for Guam, Okinawa and Iwakuni.\n\nThe increase in funding of $2.083M from FY19 to FY20 is due to DPRI support. \n\nCollateral Equipment $9.059M:  Funds will procure security systems, AV, VTC, VOIP, routers and switches for one time outfitting of new construction and renovated\/refurbished facilities that will be close to completion in FY20. The estimated number of facilities to be outfitted during FY20 is approximately 9, contingent upon completion dates of new and renovated facilities.\n\nFY2020 funding request was reduced by $5.221M to account for the availability of prior year execution balances. It also reflects the type and number of facilities that will need to be outfitted with collateral equipment in FY20.\nThe additional decrease from FY19 to FY20 is due to the flexibility of MILCON schedules."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Physical Security Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Collateral Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) Collateral Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "139.571"
                                                    },
                                                    "PriorYear": {
                                                        "val": "27.814"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "24.044"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "9.059"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9.059"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "139.571"
                                        },
                                        "PriorYear": {
                                            "val": "27.814"
                                        },
                                        "CurrentYear": {
                                            "val": "24.044"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.059"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.059"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Installation Physical Security"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Installation Physical Security"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "122.976"
                                                    },
                                                    "PriorYear": {
                                                        "val": "10.648"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.262"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "6.345"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6.345"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "122.976"
                                        },
                                        "PriorYear": {
                                            "val": "10.648"
                                        },
                                        "CurrentYear": {
                                            "val": "4.262"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.345"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.345"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) Prior Year Cumulative Funding"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) Prior Year Cumulative Funding"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "78"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "20.016"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "256615.38"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "20.016"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "282.563"
                            },
                            "PriorYear": {
                                "val": "38.462"
                            },
                            "CurrentYear": {
                                "val": "28.306"
                            },
                            "BudgetYearOneBase": {
                                "val": "15.404"
                            },
                            "BudgetYearOne": {
                                "val": "15.404"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}