{
    "id": "2020-AirForce-PB-3080F-JBOOK-436af14163fe2e9306ff706b86ab44f2d525ceb9c7dd74301eaba5aa16959d87-47",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_OTHER-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "837190"
        },
        "LineItemTitle": {
            "val": "Radio Equipment"
        },
        "P1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "7"
        },
        "BudgetSubActivityTitle": {
            "val": "Organization and Base"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "15.736"
                },
                "CurrentYear": {
                    "val": "11.961"
                },
                "BudgetYearOneBase": {
                    "val": "15.402"
                },
                "BudgetYearOne": {
                    "val": "15.402"
                },
                "BudgetYearTwo": {
                    "val": "15.285"
                },
                "BudgetYearThree": {
                    "val": "14.79"
                },
                "BudgetYearFour": {
                    "val": "15.052"
                },
                "BudgetYearFive": {
                    "val": "15.323"
                },
                "Total": {
                    "val": "103.549"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "15.736"
                },
                "CurrentYear": {
                    "val": "11.961"
                },
                "BudgetYearOneBase": {
                    "val": "15.402"
                },
                "BudgetYearOne": {
                    "val": "15.402"
                },
                "BudgetYearTwo": {
                    "val": "15.285"
                },
                "BudgetYearThree": {
                    "val": "14.79"
                },
                "BudgetYearFour": {
                    "val": "15.052"
                },
                "BudgetYearFive": {
                    "val": "15.323"
                },
                "Total": {
                    "val": "103.549"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "15.736"
                },
                "CurrentYear": {
                    "val": "11.961"
                },
                "BudgetYearOneBase": {
                    "val": "15.402"
                },
                "BudgetYearOne": {
                    "val": "15.402"
                },
                "BudgetYearTwo": {
                    "val": "15.285"
                },
                "BudgetYearThree": {
                    "val": "14.79"
                },
                "BudgetYearFour": {
                    "val": "15.052"
                },
                "BudgetYearFive": {
                    "val": "15.323"
                },
                "Total": {
                    "val": "103.549"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This capital equipment replacement program procures, integrates, and fields High Frequency Global Communications System (HFGCS) high frequency (HF) radio equipment, network infrastructure, and transmit \/receive antennas for 13 strategically located ground stations worldwide. All hardware and software, including radios and antennas, is commercial-off-the-shelf (COTS) with the exception of the integrating software.  The integrating software is a COTS-based product that has been configured for the Department of Defense (DOD) to provide the unique capabilities required to function as a strategic HF system. The need for modern, robust, and dependable radio stations with beyond line of sight radio coverage has been identified to ensure HF radio communications is available in areas of interest to the United States. \n\nHFGCS is the DoD's single global, strategic, high-power HF Nuclear Command, Control and Communication (NC3) and non-nuclear Command and Control (C2) network serving the DOD. HFGCS consists of the two major components: the radio \/network infrastructure (Scope Command) and the antenna infrastructure (Antenna Program Support) which communicate with mobile assets (aircraft, ships, and land-based platforms). HFGCS is USSTRATCOM's primary strategic HF pre-attack NC3 dependency system providing broadcasts to the US Air Force bomber and US Navy TACAMO fleets. HFGCS supports aircrews, ground forces, naval operations (USN and USCG), and control stations, and is the primary C2 resource for Air Mobility Command cargo and tanker aircraft. Additional customers include White House Communications Agency (WHCA), Defense Communications System HF Entry, and other US government agencies. HFGCS supports war plan dissemination and daily operational requirements for USSTRATCOM, WHCA, Joint Chiefs of Staff (JCS), National Military Command Center's Emergency Action Message distribution, Special Air Mission communications, Major Air Force Commands and Combatant Commanders. HFGCS provides radio connectivity to other governmental organizations such as the Department of Homeland Security, Federal Emergency Management Agency, Transportation Security Administration, State Department and Civil Air Patrol. The HFGCS network supports Overseas Contingency Operations with secure, robust, physically diverse terrestrial and airborne transmission paths providing information services between fixed and deployed operating locations. HFGCS has also been identified as a key communications component in supporting operations in an anti-access area-denial (A2AD) environment. \n\nThe HFGCS program continues to update system consoles and routers to replace unsupportable end-of-life components and to provide increased mandated information assurance system security compliance requirements. This requires replacement of the obsolete switches and communications infrastructure supporting NC3 \/C2 operations.  Included is also Direct Mission Support \/Program Management Administration (DMS \/PMA), System Engineering, Joint Interoperability Test Center (JITC) installation testing and shipping costs for these procurement efforts. \n\nFunding for this exhibit contained in PE 0303133F. \n\nMilitary Necessity:  Controlled Item will be funded with investment funds to purchase military communications equipment classified as critical protection items.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "1. SCOPE COMMAND RADIO\/NETWORK INFRASTRUCTURE: The Scope Command Radio\/Network Infrastructure projects continue the implementation of replacement COTS radio and console capabilities into the HFGCS network. The FY20 HFGCS Network Infrastructure program includes, but is not limited to, the Unified Capabilities\/Audio Communications Functionality (UC\/ACF) switch modernization, continued Receive Matrix Replacement Fielding, and Scope Command Server Replacement\/Integration. This funding request will support potential DMS and obsolescence solutions, to include if optimal, life of type buys or bridge buys limited to the program of record quantity. Funds will be utilized for hardware updates and spares that do not qualify for Centralized Asset Management (CAM) funding to include, but not limited to updating existing site configurations to support modified network baselines and mandated cyber security compliance requirements.\n\nA. FY20 funding continues the Unified Capabilities\/Audio Communications Functionality audio switch modernization to replace the obsolete and unsupportable 1990s era audio switch.  This replaces the obsolete Digital Electronic Switch (DES), as neither the an IDPX-1000 nor Liberty Star-3 (LS-3) switch is on the Defense Information Systems Agency (DISA) Approved Product List (APL) and have become logistically unsupportable. \n\nB. FY20 continues funding the global replacement of the new 15 Receive Matrices at the 13 radio stations, system integration lab, and spares. Funding updates existing interfacing software to control the new Receive Matrix. The existing receive matrices have become obsolete with no spare parts being manufactured to maintain the capability to interface between the radios and antennas. Installation purchase and fielding is estimated to finish in FY21.\n\n2. HIGH FREQUENCY GLOBAL ANTENNA REPLACEMENT: A majority of the HFGCS system antennas have been in operation for up to 45 years and have been subjected to degradation due to exposure to severe environmental conditions such as salt water and hurricane force winds. FY20 funds continue the replacement of critical antennas at HFGCS sites; actual locations and antenna selections will be based on technical assessment of the antenna condition and the operational requirements of the weapon system during execution. FY20 efforts include, but not limited to, replacements at Yokota, Sigonella, Lajes, and Elmendorf. Site surveys will be conducted at, but not limited to, Yokota, Lajes, and Elmendorf (current plan, but not limited to, replacing 5 antennas). This funding request will support potential DMS and obsolescence solutions, to include if optimal, life of type buys or bridge buys limited to the program of record quantity. Funds will be utilized for hardware updates and spares that do not qualify for Centralized Asset Management (CAM) funding to include, but not limited to updating existing site configurations, compliance with local site installation restrictions, and mitigation of potential local environmental considerations.\n\n3. FY20 funds for program management administration costs will provide travel, financial management, engineering and technical support for the program office. FY20 also funds Direct Mission Support, including support associated with engineering, sustainment engineering, shipping, and implementation. This includes operational acceptance testing and technical interchange meetings."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Radio Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Scope Command Radio\/Network Infrastructure"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Ethernet Switch Replacement"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.66"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "0.66"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Unified Capabilities\/Audio Communications Functionality (UC\/ACF)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "6.753"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.5"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "6.753"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.5"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Receive Matrix Replacement"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "3.315"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.173"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.173"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "3.315"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.173"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.173"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Server Replacement"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "3.5"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "3.5"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "6.753"
                                        },
                                        "CurrentYear": {
                                            "val": "9.975"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.173"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.173"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Antenna Replacement"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "HFGCS Station Antenna Replacements"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "8"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "7.2"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "6.651"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6.651"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.9"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.33"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.33"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Antenna Site Support"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.733"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.808"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.3"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.733"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.808"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.3"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.3"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "7.933"
                                        },
                                        "CurrentYear": {
                                            "val": "0.808"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.951"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.951"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "DMS\/PMA"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Direct Mission Support (DMS) [Systems Engineering, Testing, Shipping]"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.3"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.65"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.75"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.75"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "PMA Contractor Services"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.35"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.403"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.403"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.403"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "PMA Other Government Costs"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.4"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.125"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.125"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.125"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "1.05"
                                        },
                                        "CurrentYear": {
                                            "val": "1.178"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.278"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.278"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "1). Due to different levels of complexity, differences in equipment to be updated and length of required time necessary for modification total cost will fluctuate between fiscal years.\n2). Differences in site specific setup (due to variations between mission specific needs and differences in site type will drive differences in site specific requirements (e.g., time required, hardware required and software required). This makes quantification impossible, as there is no single baseline to produce a quantity against.\n3). UC\/ACF contracts combined into single effort for technical and fielding efficiencies"
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "15.736"
                            },
                            "CurrentYear": {
                                "val": "11.961"
                            },
                            "BudgetYearOneBase": {
                                "val": "15.402"
                            },
                            "BudgetYearOne": {
                                "val": "15.402"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}