{
    "id": "2020-AirForce-PB-3020F-JBOOK-0e195e968cc33336774365ca06d2f0273358182c5cf3eb457fda69482213adbb-16",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-AIRFORCE_MISSILE-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3020F",
        "appropriation_name": "Missile Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "00098A-00099K"
        },
        "LineItemTitle": {
            "val": "Missile Spares\/Repair Parts"
        },
        "P1LineNumber": {
            "val": "19-21"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3020F"
        },
        "AppropriationTitle": {
            "val": "Missile Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Spares and Repair Parts"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Missile Spares and Repair Parts"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "94.153"
                },
                "CurrentYear": {
                    "val": "97.481"
                },
                "BudgetYearOneBase": {
                    "val": "84.4"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "84.4"
                },
                "BudgetYearTwo": {
                    "val": "91.447"
                },
                "BudgetYearThree": {
                    "val": "97.66"
                },
                "BudgetYearFour": {
                    "val": "97.397"
                },
                "BudgetYearFive": {
                    "val": "99.304"
                },
                "Total": {
                    "val": "661.842"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "94.153"
                },
                "CurrentYear": {
                    "val": "97.481"
                },
                "BudgetYearOneBase": {
                    "val": "84.4"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "84.4"
                },
                "BudgetYearTwo": {
                    "val": "91.447"
                },
                "BudgetYearThree": {
                    "val": "97.66"
                },
                "BudgetYearFour": {
                    "val": "97.397"
                },
                "BudgetYearFive": {
                    "val": "99.304"
                },
                "Total": {
                    "val": "661.842"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "94.153"
                },
                "CurrentYear": {
                    "val": "97.481"
                },
                "BudgetYearOneBase": {
                    "val": "84.4"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "84.4"
                },
                "BudgetYearTwo": {
                    "val": "91.447"
                },
                "BudgetYearThree": {
                    "val": "97.66"
                },
                "BudgetYearFour": {
                    "val": "97.397"
                },
                "BudgetYearFive": {
                    "val": "99.304"
                },
                "Total": {
                    "val": "661.842"
                }
            }
        },
        "Description": {
            "val": "Missile Initial Spares (Budget Program 26) and Replenishment Spares (Budget Program 25)\n\nProgram Description: MISSILE INITIAL SPARES (Budget Program 26).  Missile Initial Spares are required to fill the initial spare parts pipeline or inventory for all new ballistic and non-ballistic  missile systems, including modifications, support equipment, and other production categories.  Initial spares include peculiar reparable and consumable components, assemblies, and subassemblies that must be available for issue at all levels of supply in time to support and maintain newly fielded end items.  \n\nInitial spares are funded in the two program segments described below.\n\nWorking Capital Fund (WCF) Spares.  Since FY94 most spares are purchased using obligation authority in the WCF.  When the spares are delivered, this central procurement account reimburses the WCF.  Types of spares in this program segment are Readiness Spares Packages, New Acquisition Spares, Modification Spares, Support Equipment, Other Production, and Consumables.\n\nExempt Spares.  This program segment finances spares that are not purchased through the WCF.  The budget authority is a direct cite on the contract.  Types of spares in this program segment are Contractor Logistics Support, Simulators\/Trainers, Classified Equipment, and Munitions.\n\nProgram Description: MISSILE REPLENISHMENT SPARES (Budget Program 25).  The Missile Replenishment Spares program funds all ballistic and non-ballistic missile replenishment spares.  The replenishment and repair spare parts are needed to support and maintain ballistic and non-ballistic missile systems.  Replenishment spares include such items as rocket motors, cables, telemetry packages, and electronic components.  Procurements will include spares with long production lead items.\n\nThe following Major Defense Acquisition Programs (MDAP) have funding in this line:\n\nAMRAAM, 185\nSDB II, 439\nAIM-9X Blk II, 442\nJASSM, 555\n\nThis program has associated Research Development Test and Evaluation funding in PEs 11120F, 11213F, 27161F, 11122F, and 27163F.\n\nAs directed in the FY 2018 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY 2018 Air Force penalty total is $14.373M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "AIM-9\/AIM-9X:  The Missile Initial Spares program funds depot level post warranty repairs and procures initial spares for all variants.  These spares are essential for repairs that do not have parts available. \n\nAir Launched Cruise Missile (ALCM):  The Missile Initial Spares program (319k) BP-26 funding in FY-2020 procures modification spare hardware supporting multiple Service Life Extension Program (SLEP) modifications to ensure that the AGM-86B Air Launched Cruise Missile (ALCM) nuclear cruise missile remains viable through 2030 when the Long Range Stand Off (LRSO) missile is fielded. On-going ALCM modifications include SLEP 1(Air Cycle Machine and Linear Actuators), SLEP 2 (warhead arming device, guided missile flight controller, and rotary switch), SLEP 3 (fuze assembly impact sensor and W-10 cable), and the Inertial Navigation Element, as well as on-going SLEP programs for ALCM support equipment.\n\nAMRAAM:  The Missile Initial Spares program funds depot level post warranty repairs.  \n\nJoint Air-Surface Standoff Missile:  The Missile Initial Spares program funds are required to fill the initial spare parts pipeline and replenishment\/repair spare parts under the contractor logistic support program.  These parts include items such as cables, telemetry packages, and electronic components to support and maintain fielded end items.  These spares meet Air Combat Command's bed-down plans for JASSM.\n\nMM III Modifications: The Missile Initial and Replenishment Spares program funds all Minuteman III spares required to support and maintain the Minuteman III missile system to include support equipment. Spares support the major sub-systems of the weapon system, comprised of the Re-entry System, Re-entry Vehicle, Guidance System, Propulsion System, Launch Facility and Launch Control Center. FY20 replenishment spares funding will specifically procure items such as batteries, ordnance, cables, antenna kits, Mod 7 wafers, telemetry packages, torque motors, and other electronic components supporting weapon system operations and operational test launches. FY20 initial replenishment spares will procure initial spare parts for the Payload Transporter Replacement program.\n\nAIM-9 Sidewinder\/AIM-9X:  The Missile Replenishment Spares program funds repairs for CATMs and AURs. These repairs include items such as live and inert batteries, Control Actuation System (CAS) and Inert Measurement Units.\n\nAGM-86 Air Launched Cruise Missile (ALCM):  The Missile Replenishment Spares program funds support and maintain the ALCM service life extension program components. Spares funding for ALCM currently includes the fuze assembly and related parts.\n\nAGM-88A (HARM):  The Missile Replenishment Spares program funds all HARM replenishment spares parts are needed to support and maintain the HARM weapon system. The Missile Replenishment Spares program procures parts required for depot level repairs that are necessary to sustain HARM.  This includes items such as wing dampers, telemetry kits, batteries and fuzes.\n\nAIM-120 Advanced Medium Range Air to Air Missile:  The Missile Replenishment Spares program funds AMRAAM field unit repairs and intermediate level repairs on Captive Air Training Missiles (CATM). These repairs include such items as filter rectifiers, harness assemblies, wings and fins.\n                                                                       \nAGM-65D Maverick:  The Missile Replenishment Spares program procures telemetry kits for annual reliability testing to ensure inventory health and warfighter readiness.  These funds also support limited procurement of obsolete components in launcher assemblies, missile guidance sections and test support equipment essential to maintain the Maverick Weapon System.\n\nHellfire:  The Missile Replenishment Spares funding supports repair and replacement of Hellfire parts not covered by warranty.\n              \nSmall Diameter Bomb I (SDB I):  The Missile Replenishment Spares program supports procurement of flight termination and telemetry kits to covert GBU-39\/B's into SDB I Guided Test Vehicles for the Weapon System Evaluation Program (WSEP)."
        },
        "ItemExhibitList": {
            "P18Item": {
                "Name": {
                    "val": "Missile Spares\/Repair Parts"
                },
                "InitialSpares": {
                    "EndItemBudgetActivity": [
                        {
                            "BudgetActivityNumber": {
                                "val": "4"
                            },
                            "BudgetActivityTitle": {
                                "val": "Spares and Repair Parts"
                            },
                            "EndItemList": {
                                "EndItem": [
                                    {
                                        "Name": {
                                            "val": "AIM-9 Sidewinder"
                                        },
                                        "LineItemNumber": {
                                            "val": "M09BA1"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "3.479"
                                            },
                                            "CurrentYear": {
                                                "val": "2.455"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.256"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.256"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Air Launch Cruise Missile (ALCM)"
                                        },
                                        "LineItemNumber": {
                                            "val": "MALCBG"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "0.304"
                                            },
                                            "CurrentYear": {
                                                "val": "0.308"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.119"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.119"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "AMRAAM"
                                        },
                                        "LineItemNumber": {
                                            "val": "MAMRA0"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "2.067"
                                            },
                                            "CurrentYear": {
                                                "val": "2.023"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.529"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.529"
                                            }
                                        },
                                        "MDAPCode": {
                                            "val": "185"
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "JOINT AIR-SURFACE STANDOFF MISSILE"
                                        },
                                        "LineItemNumber": {
                                            "val": "JASSM0"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "0.424"
                                            },
                                            "CurrentYear": {
                                                "val": "0.425"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.434"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.434"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "MM III MODIFICATIONS"
                                        },
                                        "LineItemNumber": {
                                            "val": "M30MLG"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "3.136"
                                            },
                                            "CurrentYear": {
                                                "val": "8.372"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.338"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.338"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Sidewinder (AIM-9X)"
                                        },
                                        "LineItemNumber": {
                                            "val": "M09HAI"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "2.241"
                                            },
                                            "CurrentYear": {
                                                "val": "1.8"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.234"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.234"
                                            }
                                        }
                                    }
                                ]
                            }
                        }
                    ],
                    "SubtotalSparesCost": {
                        "PriorYear": {
                            "val": "11.651"
                        },
                        "CurrentYear": {
                            "val": "15.383"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.91"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.91"
                        }
                    }
                },
                "ReplenishmentSpares": {
                    "EndItemBudgetActivity": [
                        {
                            "BudgetActivityNumber": {
                                "val": "4"
                            },
                            "BudgetActivityTitle": {
                                "val": "Spares and Repair Parts"
                            },
                            "EndItemList": {
                                "EndItem": [
                                    {
                                        "Name": {
                                            "val": "AIM-9 Sidewinder"
                                        },
                                        "LineItemNumber": {
                                            "val": "M09BAI"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "5.541"
                                            },
                                            "CurrentYear": {
                                                "val": "5.535"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "5.636"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "5.636"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "AIM-9X"
                                        },
                                        "LineItemNumber": {
                                            "val": "M09HAI"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "5.681"
                                            },
                                            "CurrentYear": {
                                                "val": "5.713"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "5.818"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "5.818"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "AGM-86 Air Launched Cruise Missile (ALCM)"
                                        },
                                        "LineItemNumber": {
                                            "val": "MALCBG"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "2.942"
                                            },
                                            "CurrentYear": {
                                                "val": "2.28"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "2.321"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.321"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "LGM-30 MINUTEMAN  (MM III)"
                                        },
                                        "LineItemNumber": {
                                            "val": "M30MLG"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "47.065"
                                            },
                                            "CurrentYear": {
                                                "val": "50.201"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "50.963"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "50.963"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "AGM-88A Tactical AGM Missile (HARM)"
                                        },
                                        "LineItemNumber": {
                                            "val": "M88AAG"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "8.799"
                                            },
                                            "CurrentYear": {
                                                "val": "7.675"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "8.258"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "8.258"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "AIM-120 Advanced Medium Range Air to Air Missile  (AMRAAM)"
                                        },
                                        "LineItemNumber": {
                                            "val": "MAMRA0"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "0.834"
                                            },
                                            "CurrentYear": {
                                                "val": "0.839"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.854"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.854"
                                            }
                                        },
                                        "MDAPCode": {
                                            "val": "185"
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "AGM-65D Maverick"
                                        },
                                        "LineItemNumber": {
                                            "val": "M65DAG"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "1.537"
                                            },
                                            "CurrentYear": {
                                                "val": "1.545"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "1.575"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1.575"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Predator Hellfire Missile"
                                        },
                                        "LineItemNumber": {
                                            "val": "PRDTA2"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "0.298"
                                            },
                                            "CurrentYear": {
                                                "val": "0.298"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.305"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.305"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Small Diameter Bomb"
                                        },
                                        "LineItemNumber": {
                                            "val": "SDB000"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "9.805"
                                            },
                                            "CurrentYear": {
                                                "val": "8.012"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "6.76"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "6.76"
                                            }
                                        },
                                        "MDAPCode": {
                                            "val": "439"
                                        }
                                    }
                                ]
                            }
                        }
                    ],
                    "SubtotalSparesCost": {
                        "PriorYear": {
                            "val": "82.502"
                        },
                        "CurrentYear": {
                            "val": "82.098"
                        },
                        "BudgetYearOneBase": {
                            "val": "82.49"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "82.49"
                        }
                    }
                },
                "TotalSparesCost": {
                    "PriorYear": {
                        "val": "94.153"
                    },
                    "CurrentYear": {
                        "val": "97.481"
                    },
                    "BudgetYearOneBase": {
                        "val": "84.4"
                    },
                    "BudgetYearOneOCO": {
                        "val": "0"
                    },
                    "BudgetYearOne": {
                        "val": "84.4"
                    }
                }
            }
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}