{
    "id": "2020-Army-PB-2035A-JBOOK-ae1ed46873d9bdf25873e5689835ba301fffafb48f21f5afd9fbcf4edb5f072b-40",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_OTHER_2-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "9666BU8000"
        },
        "LineItemTitle": {
            "val": "Emergency Management Modernization Program"
        },
        "P1LineNumber": {
            "val": "61"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "73"
        },
        "BudgetSubActivityTitle": {
            "val": "Comm - Base Communications"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "162.729"
                },
                "PriorYear": {
                    "val": "4.49"
                },
                "CurrentYear": {
                    "val": "4.736"
                },
                "BudgetYearOneBase": {
                    "val": "4.854"
                },
                "BudgetYearOne": {
                    "val": "4.854"
                },
                "BudgetYearTwo": {
                    "val": "4.905"
                },
                "BudgetYearThree": {
                    "val": "4.939"
                },
                "BudgetYearFour": {
                    "val": "4.94"
                },
                "BudgetYearFive": {
                    "val": "4.989"
                },
                "Total": {
                    "val": "196.582"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "162.729"
                },
                "PriorYear": {
                    "val": "4.49"
                },
                "CurrentYear": {
                    "val": "4.736"
                },
                "BudgetYearOneBase": {
                    "val": "4.854"
                },
                "BudgetYearOne": {
                    "val": "4.854"
                },
                "BudgetYearTwo": {
                    "val": "4.905"
                },
                "BudgetYearThree": {
                    "val": "4.939"
                },
                "BudgetYearFour": {
                    "val": "4.94"
                },
                "BudgetYearFive": {
                    "val": "4.989"
                },
                "Total": {
                    "val": "196.582"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "162.729"
                },
                "PriorYear": {
                    "val": "4.49"
                },
                "CurrentYear": {
                    "val": "4.736"
                },
                "BudgetYearOneBase": {
                    "val": "4.854"
                },
                "BudgetYearOne": {
                    "val": "4.854"
                },
                "BudgetYearTwo": {
                    "val": "4.905"
                },
                "BudgetYearThree": {
                    "val": "4.939"
                },
                "BudgetYearFour": {
                    "val": "4.94"
                },
                "BudgetYearFive": {
                    "val": "4.989"
                },
                "Total": {
                    "val": "196.582"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "4.49"
                                },
                                "CurrentYear": {
                                    "val": "4.736"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.854"
                                },
                                "BudgetYearOne": {
                                    "val": "4.854"
                                },
                                "BudgetYearTwo": {
                                    "val": "4.905"
                                },
                                "BudgetYearThree": {
                                    "val": "4.939"
                                },
                                "BudgetYearFour": {
                                    "val": "4.94"
                                },
                                "BudgetYearFive": {
                                    "val": "4.989"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "4.49"
                    },
                    "CurrentYear": {
                        "val": "4.736"
                    },
                    "BudgetYearOneBase": {
                        "val": "4.854"
                    },
                    "BudgetYearOne": {
                        "val": "4.854"
                    },
                    "BudgetYearTwo": {
                        "val": "4.905"
                    },
                    "BudgetYearThree": {
                        "val": "4.939"
                    },
                    "BudgetYearFour": {
                        "val": "4.94"
                    },
                    "BudgetYearFive": {
                        "val": "4.989"
                    }
                }
            }
        },
        "Description": {
            "val": "The Emergency Management Modernization Program (EM2P) is a single integrated acquisition program for the design, procurement, fielding, new equipment training, and life-cycle management of emergency management capabilities in support of Army installations, Soldiers and their Families, civilians, and contractors.  EM2P provides capabilities that increase situational awareness, decrease responder time, and allow for quicker warning and notification of personnel during the management of an active incident.  EM2P consists of Enterprise Mass Warning and Notification (EMWN) technologies, Enhanced 911 (E911) solutions and Computer Aided Dispatch (CAD) capability (fielding beginning in FY20). \n\nCAD is a central hub capable of dispatching law enforcement\/fire\/medical services.  CAD is integrated with Automated Installation Entry (AIE), Enterprise Mass Warning and Notification (EMWN), and law enforcement (LE) authoritative data sources as well as with local civilian CAD and civilian LE authoritative data sources.  CAD is a technical software\/hardware system which assists dispatchers, call-takers, and 911 operators in tracking, monitoring and rapid dispatching of first responders using geographic information system (GIS) mobile technology, pre-programmed protocols getting the nearest responders quickest to critical incidents, while maintaining records of these responses. CAD is a system used by dispatchers and first responders to log, track, dispatch and assign calls for service.\n\nCurrently, various locally procured Computer Aided Dispatch (CAD) systems are being used on Army installations posing cybersecurity risks and are not in compliance with Army Regulation (AR) 70-1, Army Acquisition Policy, as some systems are not accredited and are vulnerable to cyber threats.  CAD systems on Army installations do not fully integrate with Enhanced 911 and other emergency services like Land Mobile Radio. Many do not have the capability to digitally communicate reports of incidents, location, situational information, and background information by interfacing with authoritative informational data sources and providing enterprise level situational awareness\/information sharing to assist military and civilian law enforcement, fire and medical. This causes delays in dispatch and response times, increased risk to property and personnel, and resource management constraints. The desired CAD capability will provide secure and reliable digital communications to assist military and civilian emergency personnel with emergency management operations.  A standardized CAD system procured and implemented on an enterprise level will reduce the loss of life and property, increase situational awareness and improve reporting and analysis of incidents. CAD systems reduce the loss of life and property by automating incident creation and minimizing dispatch and response times as identified in the Fort Hood Army Internal Review. The system also improves situational awareness by sharing information from authoritative data sources (i.e. communications systems, law enforcement databases, etc.) with military and civilian first responders.  Additionally, CAD allows for real time asset management, tracking the location and status of individual assets (personnel and equipment) which provides a superior real time common operating picture throughout the entire incident lifecycle. This data can be used during or after the incident, providing forensics of key performance indicators. Furthermore this data improves future manpower modeling based on calls for service tracked within the CAD system. The monetary return on investment is based on a scalable solution that takes into consideration the size and scope of the installation mission set, this will provide a cost effective strategy.\n\nThe EM2P provides capabilities that will save lives by enabling Commanders to quickly and effectively respond to any installation emergency events, to include insider threats, terrorist activity and natural disasters."
        },
        "Justification": {
            "val": "FY 2020 Base procurement funding in the amount of $4.854 million supports Computer Aided Dispatch (CAD) capability fielding.   The CAD capability leverages a System of Systems approach that integrates e911 and other emergency services.  Funding will also procure the Hardware\/Software required to provide secure and reliable digital communications to assist military and civilian emergency personnel with emergency management operations.    \n\nCAD capabilities are currently employed in a fragmented operational, training and sustainment environment and are managed at the individual installation level.  CONUS and Outside the Continental US (OCONUS) installations have historically procured non-standard equipment with closed architecture and proprietary software.  In accordance with AR 70-1, the CAD capability must use a System of Systems approach that leverages aspects of the Chief Information Officer (CIO)\/G-6, Assistant Secretary of the Army for Acquisition, Logistics and Technology (ASA (ALT)), Common Operating Environment (COE) Architecture and the DOD IT Strategy Roadmap. This will allow for a standardized, scalable and common technical solution across diverse installation sizes with the ability to integrate and interoperate with emergency response capabilities. \n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}