{
    "id": "2020-Navy-PB-1109N-JBOOK-b326adbe914504e2b61de725ef983e7223e072a57601b3e4ae0ec2b7f58a6709-37",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "6366"
        },
        "LineItemTitle": {
            "val": "Power Equipment Assorted"
        },
        "P1LineNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "390.473"
                },
                "PriorYear": {
                    "val": "10.28"
                },
                "CurrentYear": {
                    "val": "16.885"
                },
                "BudgetYearOneBase": {
                    "val": "22.441"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "22.441"
                },
                "BudgetYearTwo": {
                    "val": "24.42"
                },
                "BudgetYearThree": {
                    "val": "24.92"
                },
                "BudgetYearFour": {
                    "val": "26.443"
                },
                "BudgetYearFive": {
                    "val": "26.972"
                },
                "Total": {
                    "val": "542.834"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "390.473"
                },
                "PriorYear": {
                    "val": "10.28"
                },
                "CurrentYear": {
                    "val": "16.885"
                },
                "BudgetYearOneBase": {
                    "val": "22.441"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "22.441"
                },
                "BudgetYearTwo": {
                    "val": "24.42"
                },
                "BudgetYearThree": {
                    "val": "24.92"
                },
                "BudgetYearFour": {
                    "val": "26.443"
                },
                "BudgetYearFive": {
                    "val": "26.972"
                },
                "Total": {
                    "val": "542.834"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "390.473"
                },
                "PriorYear": {
                    "val": "10.28"
                },
                "CurrentYear": {
                    "val": "16.885"
                },
                "BudgetYearOneBase": {
                    "val": "22.441"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "22.441"
                },
                "BudgetYearTwo": {
                    "val": "24.42"
                },
                "BudgetYearThree": {
                    "val": "24.92"
                },
                "BudgetYearFour": {
                    "val": "26.443"
                },
                "BudgetYearFive": {
                    "val": "26.972"
                },
                "Total": {
                    "val": "542.834"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206624M"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "8.492"
                                },
                                "CurrentYear": {
                                    "val": "16.885"
                                },
                                "BudgetYearOneBase": {
                                    "val": "20.573"
                                },
                                "BudgetYearOne": {
                                    "val": "20.573"
                                },
                                "BudgetYearTwo": {
                                    "val": "22.512"
                                },
                                "BudgetYearThree": {
                                    "val": "22.973"
                                },
                                "BudgetYearFour": {
                                    "val": "24.455"
                                },
                                "BudgetYearFive": {
                                    "val": "24.944"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "1.788"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.868"
                                },
                                "BudgetYearOne": {
                                    "val": "1.868"
                                },
                                "BudgetYearTwo": {
                                    "val": "1.908"
                                },
                                "BudgetYearThree": {
                                    "val": "1.947"
                                },
                                "BudgetYearFour": {
                                    "val": "1.988"
                                },
                                "BudgetYearFive": {
                                    "val": "2.028"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "10.28"
                    },
                    "CurrentYear": {
                        "val": "16.885"
                    },
                    "BudgetYearOneBase": {
                        "val": "22.441"
                    },
                    "BudgetYearOne": {
                        "val": "22.441"
                    },
                    "BudgetYearTwo": {
                        "val": "24.42"
                    },
                    "BudgetYearThree": {
                        "val": "24.92"
                    },
                    "BudgetYearFour": {
                        "val": "26.443"
                    },
                    "BudgetYearFive": {
                        "val": "26.972"
                    }
                }
            }
        },
        "Description": {
            "val": "FAMILY OF POWER EQUIPMENT - The Family of Mobile Electric Power Equipment consists of command and control systems for power management and distribution (intelligent power management), tactical generators ranging from 2 to 100 kilowatts, power distribution systems, energy storage systems, load banks, floodlights, cabling, and electrician tool kits. This equipment is procured and fielded to manage and provide electricity on the battlefield. Systems may be mounted on prime movers, skids or trailers. Systems support maneuver, combat support, and combat service support units requiring tactical power to operate weapons systems, Command, Control, Communications, Computers and Intelligence (C4I) systems, medical and messing facilities, environmental control equipment, and water purification systems. With over 10,000 generators and using diesel engines in the Operating Forces, improving their fuel efficiency and reliability will be a significant contribution to reducing the USMC fuel demand, and lightening the Marine Air-Ground Task Force (MAGTF). The Warfighter benefit includes a decreased logistics footprint, less reliance on petroleum derived fuels, increased local energy security, and reduced tanker losses (fewer on the road). The operational imperative to reduce fuel usage will consequently reduce refueling operations and exposing Marines to hazardous fuel convoy operations.\n\nEfforts encompass procurement and testing of the following principal end items and ancillary equipment:\n(1) Intelligent Power Management Systems (IPMS) provide a robust, modular, and scalable solution to interconnect, control, store and distribute power from various sources. As a result, the power requirements will be met in a more efficient manner by matching power production to load demand, reducing spinning reserve, extending maintenance cycle times, and reducing fuel consumption. The IPMS will consist of a micro-gridding capability which will consist of the Advance Digital Control System, which is a product improvement for the Advance Medium Mobile Power Source generators, an Intelligent Power Distribution (IPD) system, an Energy Storage Unit (ESU), a Metering and Monitoring capability, and it will eventually integrate renewables.\n(2)  Advanced Medium Mobile Power Source (AMMPS): procurement of the remaining Generator Sets needed to complete the Approved Acquisition Objective.\n(3) Advanced AMMPS Digital Control System (ADCS): procurement to provide tactical micro-gridding capability that will provide greater flexibility and reduce fuel consumption of networked generators.\n\nFAMILY OF ADVANCED POWER SOURCES FOR COMMUNICATIONS EQUIPMENT (APSCE) - This family consists of multiple suites of devices, grouped into sub-families, that are used to provide highly expeditionary power (worn on the Marine, hand-carried, or vehicle mounted) to operate and power communications equipment, computers and peripheral equipment in place of disposable batteries, and for scenarios where fuel powered generators are too large, too heavy, unsuitable for use, or provide undue logistics burden due to refueling needs\n\nThe first suite of devices encompasses renewable and hybrid energy based systems, and includes the man-portable Ground Renewable Expeditionary Energy Network System (GREENS) that supports a company level operations center and Forward Operating Base, the man-packable Solar Portable Alternative Communications Energy Systems (SPACES) that supports Combat Outposts and Observation Points, and the Mobile Electric Hybrid Power Source (MEHPS) that provides light systems (up to  5kW) and medium (up to 10kW) to power mission command and control, information networks, communications, environmental control, life support, sustainment and illumination at the battalion level. All of these exploit the use of solar energy and power management technologies to recharge batteries and directly power electronic equipment without a need, or with a reduced need for re-fueling generators.\n\nThe second suite of devices includes both shelter based (semi-rugged) and fully ruggedized (operate outdoors) power supplies that convert alternating current (AC) to direct current (DC) and vice versa. These power supplies support all elements across the USMC with standard models that provide variable electrical output to support a wide electrical range of operations. \n\nThe third suite of devices is the vehicle mounted inverters that convert vehicle 24 Volt direct current to 120 Volt alternating current to allow on-the-move operation of equipment that previously was only able to be used while stationary. These inverters are used throughout all theaters of operations by Marine Corps aviation and ground units requiring 120 VAC, 60Hz electrical power. The inverter based power systems reduce the requirement for tactical generators needed for small operations.\n\nThe fourth suite of devices provides an alternative power source for each radio in the Marine Corps (seven different models). These radio power adapters allow radios to be powered from central power sources (such as GREENS and SPACES) or grid power (120 volt AC generator), reducing the consumption of rechargeable and non-rechargeable batteries when in garrison\/shelter operations. These systems lead to cost avoidance, conservation of batteries, and flexibility of operations.\n\nThe fifth suite supports all lead-acid batteries used in vehicles and artillery systems, and a host of battery chemistries (nickel-cadmium (NiCd),  nickel metal hydride (NiMH), and lithium-ion (Li-ion))  used in command, control and communications systems. The suite consists of battery chargers, battery conditioners, battery maintainers, battery analyzers, and battery safety management systems for both garrison (semi-rugged) and deployed operations (ruggedized). As the USMC (and all services) move towards fully adopting rechargeable batteries for energy efficiency and logistics demand reduction, this suite of devices is critical to support numerous weapons, robots, and IED jammers."
        },
        "Justification": {
            "val": "FY2018 Base Appropriation Request: $10.280M (ACTIVE: $8.492M\/RESERVE: $1.788M)\n\nMOBILE POWER EQUIPMENT $5.614M (ACTIVE: $5.614M\/RESERVE: $0.000M)\nFunds the procurement of Intelligent Power Management (IPM) subsystems: AMMPS ADCS, AMMPS generators, FDT charges and various logistics support. Legacy equipment is fueled by fossil fuels. Intelligent Power Management System (IPMS) and micro-gridding serve to decrease the size of diesel-fueled generators required by networking equipment. The \"brains\" of the system, the controller (Advanced Digital Control System), tells the system when to run off the generator, and when to run off energy storage systems (batteries). The phases of this IPMS system will first acquire Intelligent Power Distribution (IPD), and in a later phase, Energy Storage Units (batteries) that will reduce the need for LAMPS, reduce reliance on fossil fuel, and reduce the volume and frequency of resupply missions required to provide consumable items for corrective or preventive maintenance activities, reducing logistics footprint and lightening the load. Increase during FY18 is due to AMMPS receiving a Table of Equipment Change Request (TOECR) to procure more systems to support the Operational Force's needs.\n  \nADVANCED POWER SOURCES $4.666M (ACTIVE:$2.878M\/RESERVE: $1.788M) \nFunds the procurement and fielding of Advanced Battery Charger.  Funding required to meet the Approved Acquisition Objectives outlined in the Total Force Structure Management System.  Advanced Power Sources favorably impact the Warfighter by funding renewable and hybrid power solutions. Collectively, these help to reduce reliance on fossil fuels, expand mission reach by extending both the mission and overall serviceable life of equipment. Additionally, they reduce the volume and frequency of resupply missions required to provide consumable items for corrective or preventive maintenance activities, reducing logistics footprint and lightening the load. Currently, hybrid\/renewable systems do not scale as well as diesel-fueled systems. Continued development is required to increase this capability over time.  \n \nFY2019 Base Appropriation Request: $16.885M (ACTIVE: $16.885M\/RESERVE: $0.000M)\n\nMOBILE POWER EQUIPMENT $9.447M (ACTIVE: $9.447M\/RESERVE: $0.000M)\nFunds the procurement of IPM subsystems AMMPS ADCS, AMMPS generators, FDT charges and various logistics support. Legacy equipment is fueled by fossil fuels. Intelligent Power Management System and micro-gridding serve to decrease the size of diesel-fueled generators required by networking equipment. The \"brains\" of the system, the controller (Advanced Digital Control System), tells the system when to run off the generator, and when to run off energy storage systems (batteries). The phases of this IPMS system will first acquire IPD, and in a later phase, Energy Storage Units (batteries) that will reduce the need for LAMPS, reduce reliance on fossil fuel, and reduce the volume and frequency of resupply missions required to provide consumable items for corrective or preventive maintenance activities, reducing logistics footprint and lightening the load. Increase in FY19 is due to procuring additional AMMPS and MADCS to support the IPM System.  The Approved Acquisition Objective (AAO) for Micro-grid Advanced Digital Control System (MADCS), formerly titled AMMPS DCS Kits in PB-19, increased from 179 to 328 units. This increase is largely being supported by the budget originally identified for Large Advanced Mobile Power System (LAMPS) Program which cancelled in FY18, and IPMS Energy Storage Unit (ESU), formerly titled Micro-grid Storage\/IPM in PB-19, which experienced programmatic adjustments also in FY18.\n\nADVANCED POWER SOURCES $7.438M (ACTIVE:$7.438M\/RESERVE: $0.000M) \nContinues to fund the procurement and fielding of Advanced Battery Charger as well as the systems needed for product verification testing of MEHPS' solar panels and system integration, then awarding the solar panel production contract and associated Integrated Logistics Support.  Will also procure the systems needed for product verification testing for the next generation SPACES. \n\nFY2020 Base Appropriation Request: $22.441M (ACTIVE: $20.573\/RESERVE: $1.868M)\n\nMOBILE POWER EQUIPMENT $12.058M (ACTIVE: $12.058M\/RESERVE: $0.000M)\nFunds the procurement of (AMMPS, Advanced Digital Control System (ADCS), Advance Medium Mobile Power System (AMMPS) generators, FDT charges and various logistics support. Funding increased from FY19 to FY20 by $2.611M due to production of Intelligent Power Distribution (IPD) Panels which is a subsystem of the IPMS. \n\nADVANCED POWER SOURCES $10.383M (ACTIVE:$8.515M\/RESERVE: $1.868M) \nContinues to fund the procurement and fielding of Advanced Battery Charger as well as awarding the MEHPS production contract.  The increase in Advanced Power Sources funding of $2.945M from FY19 to FY20 is due to increase in procurement and fielding of MEHPS.\n\nOCO: \nFY 2020 Overseas Contingency Operations (OCO) Request:  N\/A"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Power Equipment Assorted"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "Remarks": {
                        "val": "[Hardware] Mobile Power Equipment is a portion of Expeditionary Energy Initiatives. With IPMS becoming a program of record, there is no reason to procure any more LAMPS as originally planned. IPMS & micro-gridding allows multiple generators of smaller sizes to work together and eliminate the need for additional larger generators, reducing fuel consumption and reducing the logistics footprint. IPMS is a program with phases with the Intelligent Power Distribution (IPD) Panels to be developed and fielded ahead of the energy storage units. Thus, the energy storage unit funding has been pushed to the right. Note that the AAOs for generators and associated power equipment have been changed external to MCSC a number of times over the past year. The current plan provides the best support for what is currently known. If requirements are changed again, a new plan will be developed to support.\n\n[Hardware] Advanced Power Sources is a portion of Expeditionary Energy Initiatives."
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "390.473"
                            },
                            "PriorYear": {
                                "val": "10.28"
                            },
                            "CurrentYear": {
                                "val": "16.885"
                            },
                            "BudgetYearOneBase": {
                                "val": "22.441"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "22.441"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "390.473"
                            },
                            "PriorYear": {
                                "val": "10.28"
                            },
                            "CurrentYear": {
                                "val": "16.885"
                            },
                            "BudgetYearOneBase": {
                                "val": "22.441"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "22.441"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "390.473"
                            },
                            "PriorYear": {
                                "val": "10.28"
                            },
                            "CurrentYear": {
                                "val": "16.885"
                            },
                            "BudgetYearOneBase": {
                                "val": "22.441"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "22.441"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "Mobile Power Equipment"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "@footnote": "Increase in FY18 is due to AMMPS receiving a Table of Equipment Change Request (TOECR) to procure more systems to support the Operational Force's needs.  In FY19, additional systems are being procured to support the IPMS program.  AMMPS is also on step ladder pricing.",
                                                    "val": "1.1.1) Advanced Medium Mobile Power Systems (AMMPS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "168.763"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.988"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "3.007"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "@footnote": "Decrease for FY18 is due to the need to fulfill the TOECR requirement to procure more AMMPS.  Therefore, MADCS increased in FY19 to compensate for those we did not procure as originally planned.",
                                                    "val": "1.1.2) Micro-grid ADCS (MADCS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "1.234"
                                                        },
                                                        "PriorYear": {
                                                            "val": "1.615"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "6.44"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.3) IPMS Intelligent Power Distribution (IPD)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "12.058"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "12.058"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.5) Large Advanced Mobile Power Systems (LAMPS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "2.17"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.6) MEPDIS-R Panels"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "0.482"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.7) Power Equipment Logistics Support Items"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "4.486"
                                                        },
                                                        "PriorYear": {
                                                            "val": "0.529"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "176.653"
                                            },
                                            "PriorYear": {
                                                "val": "5.614"
                                            },
                                            "CurrentYear": {
                                                "val": "9.447"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "12.058"
                                            },
                                            "BudgetYearOne": {
                                                "val": "12.058"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "176.653"
                                        },
                                        "PriorYear": {
                                            "val": "5.614"
                                        },
                                        "CurrentYear": {
                                            "val": "9.447"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.058"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.058"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Advanced Power Sources"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "2.1.1) Alternate Power Sources for Communications\/Electronic Equipment (APSCE)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "112.504"
                                                        },
                                                        "PriorYear": {
                                                            "val": "2.878"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "7.438"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "8.515"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "8.515"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2.1.2) Alternate Power Sources for Comm\/Electric Equip (APSCE)-Reserves"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "9.486"
                                                        },
                                                        "PriorYear": {
                                                            "val": "1.788"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "1.868"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.868"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "121.99"
                                            },
                                            "PriorYear": {
                                                "val": "4.666"
                                            },
                                            "CurrentYear": {
                                                "val": "7.438"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "10.383"
                                            },
                                            "BudgetYearOne": {
                                                "val": "10.383"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "121.99"
                                        },
                                        "PriorYear": {
                                            "val": "4.666"
                                        },
                                        "CurrentYear": {
                                            "val": "7.438"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.383"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.383"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "3.1) Prior Year Cumulative Funding"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "91.83"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "91.83"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}