{
    "id": "2020-Army-PB-2035A-JBOOK-ffd9e522016155822ff405752ab066bad8691a671e35376b94f41dbe6a64b3a9-2",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_OTHER_3-4-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2035A",
        "appropriation_name": "Other Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "2300M90101"
        },
        "LineItemTitle": {
            "val": "Base Defense Systems (BDS)"
        },
        "P1LineNumber": {
            "val": "125"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2035A"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Other Support Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Chemical Defensive Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "25.926"
                },
                "CurrentYear": {
                    "val": "39.2"
                },
                "BudgetYearOneOCO": {
                    "val": "47.11"
                },
                "BudgetYearOne": {
                    "val": "47.11"
                },
                "BudgetYearTwo": {
                    "val": "47.581"
                },
                "BudgetYearThree": {
                    "val": "24.028"
                },
                "BudgetYearFour": {
                    "val": "24.028"
                },
                "BudgetYearFive": {
                    "val": "24.509"
                },
                "Total": {
                    "val": "232.382"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "25.926"
                },
                "CurrentYear": {
                    "val": "39.2"
                },
                "BudgetYearOneOCO": {
                    "val": "47.11"
                },
                "BudgetYearOne": {
                    "val": "47.11"
                },
                "BudgetYearTwo": {
                    "val": "47.581"
                },
                "BudgetYearThree": {
                    "val": "24.028"
                },
                "BudgetYearFour": {
                    "val": "24.028"
                },
                "BudgetYearFive": {
                    "val": "24.509"
                },
                "Total": {
                    "val": "232.382"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "25.926"
                },
                "CurrentYear": {
                    "val": "39.2"
                },
                "BudgetYearOneOCO": {
                    "val": "47.11"
                },
                "BudgetYearOne": {
                    "val": "47.11"
                },
                "BudgetYearTwo": {
                    "val": "47.581"
                },
                "BudgetYearThree": {
                    "val": "24.028"
                },
                "BudgetYearFour": {
                    "val": "24.028"
                },
                "BudgetYearFive": {
                    "val": "24.509"
                },
                "Total": {
                    "val": "232.382"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "25.926"
                                },
                                "CurrentYear": {
                                    "val": "39.2"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "47.11"
                                },
                                "BudgetYearOne": {
                                    "val": "47.11"
                                },
                                "BudgetYearTwo": {
                                    "val": "47.581"
                                },
                                "BudgetYearThree": {
                                    "val": "24.028"
                                },
                                "BudgetYearFour": {
                                    "val": "24.028"
                                },
                                "BudgetYearFive": {
                                    "val": "24.509"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "25.926"
                    },
                    "CurrentYear": {
                        "val": "39.2"
                    },
                    "BudgetYearOneOCO": {
                        "val": "47.11"
                    },
                    "BudgetYearOne": {
                        "val": "47.11"
                    },
                    "BudgetYearTwo": {
                        "val": "47.581"
                    },
                    "BudgetYearThree": {
                        "val": "24.028"
                    },
                    "BudgetYearFour": {
                        "val": "24.028"
                    },
                    "BudgetYearFive": {
                        "val": "24.509"
                    }
                }
            }
        },
        "Description": {
            "val": "Base Defense Systems (BDS) includes Non-Intrusive Inspection Systems (NIIS) (M90108), Battlefield Anti-Intrusion System (BAIS) (M90202), Lighting Kit Motion Detection (LKMD) (M90204), Integrated Ground Security, Surveillance and Response Capability (IGSSR-C)(M90106) Ground-Based Operational Surveillance System (Expeditionary) (GBOSS-E) (M90212), Tactical Security System (TSS) (M90220) and Integrated Base Defense (IBD) Kitting (M90115) \n\nNIIS is a family of systems that inspects for the presence of explosives, weapons and other contraband in vehicles, cargo containers and personnel from a distance providing stand-off ballistic and blast protection.  All systems are either mobile or fully re-locatable.  It is a force multiplier that maximizes protection of personnel, equipment and installations while minimizing manpower requirements.  NIIS provides the capability to non-intrusively inspect vehicles, cargo containers and personnel for the presence of explosives, weapons or other contraband which can kill or injure Soldiers and destroy critical warfighting materiel.  NIIS supports the urgent need for Counter-Improvised Explosive Device equipment to support military operations.   \n\nThe IGSSR-C is a Joint Requirement that provides a layered approach to integrate sensors, sensor systems and unmanned systems with automated fusion capabilities to create an in-depth security, surveillance and response Force Protection (FP) COP capability for CONUS fixed, OCONUS semi-fixed or expeditionary elements in all Operating Environments (OE).  This capability will enable rapid decision analysis, speed the response process as well as increase information dissemination horizontally and vertically along the chain of command and with outside supporting organizations.  IGSSR-C is a software centric fusion engine that connects legacy and emerging FP systems, legacy Chemical, Biological, Radiological, Nuclear, and Explosive (CBRNE), unmanned systems, biometric identification and forensic data systems. The desired end state is to achieve interoperability with current and emerging FP systems used by Joint Forces, Department of Defense (DoD) agencies and multi-national forces.\n\nGround-Based Operational Surveillance System (Expeditionary) (GBOSS-E) will replace the interim Persistent Surveillance System-Ground (PSS-G) Increment 1 towers with improved persistent surveillance capabilities and will provide network integration and better mobility utilizing modular configurations. GBOSS-E will replace obsolete, quick reaction capability (QRC) surveillance and force protections systems utilizing modular configurations: Light (man transportable\/detachable) for extra small base camps or small outpost\/company, Medium variant (mid sensor height) for small to medium size base, and Heavy variant (high level sensor height) for large contingency base camps. GBOSS-E will operate in a stand-alone mode or as part of an integrated network utilizing government owned software, be easily operated and maintained, and be rugged enough to support employment in expeditionary operations worldwide.\n\nThe Tactical Security System (TSS) provides a modular, scalable, lightweight, rapidly deployable, ground based security and surveillance Family of Systems designed for hasty emplacement to support short and long term security, surveillance and detection missions.  The system will be tailorable to support various missions including internment\/resettlement operations; perimeter security; internal security within base camps or installations; external security outside the perimeter and route clearance.  TSS will be employed at fixed, semi-fixed or expeditionary sites providing all weather imaging during daylight\/twilight and during periods of limited visibility regardless of environmental conditions to enhance the Commander's situational awareness and increase Soldier survivability.  TSS is designed to be employed as a stand-alone, in a layered effort or integrated with additional force protection systems including motion, acoustic, seismic, surface and subterranean detection technologies. TSS will address four of the five base camp core protection\/security capabilities identified in the IBD Concept of Operations including perimeter security, entry control, persistent surveillance and warning and alerting.  TSS can be employed in support of contingency, short-notice, early-entry operations in a variety of weather and terrain from open desert to complex urban environments.  TSS will assist in countering individuals and provide clandestine observation of detainees, individuals, either on foot or in vehicles from intruding into areas designated for security purposes.  TSS will allow the Commander to detect and observe enemy or adversarial forces from a distance prior to entering the base area of operations.  This advanced warning will allow the Commander to better deploy forces in a more effective manner to mitigate threat.\n\nThe purpose of IBD Kitting is to harvest and refurbish physical security and FP Non-Standard Equipment and package them into integrated and interoperable IBD capabilities.  IBD packages support expeditionary ground operations and provide a bridge to the enduring IBD capability.  IBD kits are integrated into a System of Systems (SoS) to provide an interim IBD capability to increase protective effectiveness, enhance situational awareness and reduce troop-to-task requirements. \n\nCounter Vehicle Borne Improvised Explosive Device (CVBIED) is an integrated suite of systems developed in response to CENTCOM JUONS CC-0540. CVBIED provides an early VBIED detection capability prior to vehicles reaching entry into Forward Operating Bases. Counter Vehicle Borne Improvised Explosive Device equipment includes passive cargo inspection technologies, wide area motion imaging sensors, stand-off bulk and trace explosive detection sensors, enhanced optical vehicle inspections systems and other vehicle inspection equipment. Additional sensor systems will be procured and integrated into the current Force Protection infrastructure as part of CVBIED.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities."
        },
        "Justification": {
            "val": "FY 2020 OCO procurement in the amount of $47.110 million procures passive cargo inspection technologies, wide area motion imaging sensors, stand-off bulk and trace explosive detection sensors, enhanced optical vehicle inspections systems and other vehicle inspection equipment in support of JUONS CC-0540 capability gaps.\n\nIn accordance with Section 1815 of the FY2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities. All quantities and funding are for Active Components."
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "INTEG BASE DEF NONSTAND EQUIP (IBD NS-E) KITTING"
                    },
                    "ItemNumber": {
                        "val": "M90115"
                    },
                    "SecondaryDistribution": {
                        "ComponentList": {
                            "Component": [
                                {
                                    "Name": {
                                        "val": "Army Active"
                                    },
                                    "Cost": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "25.926"
                                            },
                                            "CurrentYear": {
                                                "val": "39.2"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "47.11"
                                            },
                                            "BudgetYearOne": {
                                                "val": "47.11"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "25.926"
                            },
                            "CurrentYear": {
                                "val": "39.2"
                            },
                            "BudgetYearOneOCO": {
                                "val": "47.11"
                            },
                            "BudgetYearOne": {
                                "val": "47.11"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "25.926"
                            },
                            "CurrentYear": {
                                "val": "39.2"
                            },
                            "BudgetYearOneOCO": {
                                "val": "47.11"
                            },
                            "BudgetYearOne": {
                                "val": "47.11"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "25.926"
                            },
                            "CurrentYear": {
                                "val": "39.2"
                            },
                            "BudgetYearOneOCO": {
                                "val": "47.11"
                            },
                            "BudgetYearOne": {
                                "val": "47.11"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "JUONS CC-0540 Equipment"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "PriorYear": {
                                                            "val": "12"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "2"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "2"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "25.092"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "35.302"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "43.47"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "43.47"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "PriorYear": {
                                                            "val": "2091"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "17651"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "21735"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "21735"
                                                        }
                                                    }
                                                },
                                                "ManufacturerList": {
                                                    "Manufacturer": [
                                                        {
                                                            "Name": {
                                                                "val": "TBD"
                                                            },
                                                            "Location": {
                                                                "val": "TBD"
                                                            },
                                                            "HistoryPlanningList": {
                                                                "HistoryPlanning": [
                                                                    {
                                                                        "FiscalYear": {
                                                                            "val": "2020"
                                                                        },
                                                                        "OCO": {
                                                                            "val": "true"
                                                                        },
                                                                        "PCOLocation": {
                                                                            "val": "Various"
                                                                        },
                                                                        "AwardDate": {
                                                                            "val": "2020-01"
                                                                        },
                                                                        "FirstDeliveryDate": {
                                                                            "val": "2020-07"
                                                                        },
                                                                        "Quantity": {
                                                                            "val": "2"
                                                                        },
                                                                        "UnitCost": {
                                                                            "val": "21735"
                                                                        },
                                                                        "SpecsAvailableNow": {
                                                                            "val": "false"
                                                                        },
                                                                        "FundingVehicle": {
                                                                            "val": "Various"
                                                                        }
                                                                    }
                                                                ]
                                                            }
                                                        }
                                                    ]
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JUONS CC-0540 Program Mgt Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "1.22"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "0.456"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.456"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JUONS CC-0540 Initial Fielding Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "2.678"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "3.184"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "3.184"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "25.092"
                                            },
                                            "CurrentYear": {
                                                "val": "39.2"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "47.11"
                                            },
                                            "BudgetYearOne": {
                                                "val": "47.11"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "25.092"
                                        },
                                        "CurrentYear": {
                                            "val": "39.2"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "47.11"
                                        },
                                        "BudgetYearOne": {
                                            "val": "47.11"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Contractor Management"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.834"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "0.834"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Program Management"
                                }
                            }
                        ]
                    },
                    "OverallHistoryPlanningRemarks": {
                        "val": "JUONS CC-0540 equipment is comprised of a combination of COTS and GOTS items purchased via MIPR or from the Defense Logistics Agency (DLA). JUONS CC-0540 equipment is comprised of passive cargo inspection technologies, wide area motion imaging sensors, stand-off bulk and trace explosive detection sensors, enhanced optical vehicle inspections systems and other vehicle inspection equipment in support of JUONS CC-0540 capability gaps."
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}