{
    "id": "2020-DefenseThreatReductionAgency-PB-0300D-MJBOOK-0-10-2e0184583989233b47783dd7d56850e6e26000bce2d09e7f4f3d4ed63ea3e571-2",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-DEFENSE_VOL1_ALL-U_PROCUREMENT_MasterJustificationBook_Defense-Wide_PB_2020.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Defense-Wide_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "40"
        },
        "LineItemTitle": {
            "val": "Counter IED and Improvised Threat Technologies"
        },
        "P1LineNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "23"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, Defense Threat Reduction Agency"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "5.2"
                },
                "CurrentYear": {
                    "val": "5.534"
                },
                "BudgetYearOneOCO": {
                    "val": "4.59"
                },
                "BudgetYearOne": {
                    "val": "4.59"
                },
                "BudgetYearTwo": {
                    "val": "4.73"
                },
                "BudgetYearThree": {
                    "val": "5.37"
                },
                "BudgetYearFour": {
                    "val": "6.01"
                },
                "BudgetYearFive": {
                    "val": "6.16"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "5.2"
                },
                "CurrentYear": {
                    "val": "5.534"
                },
                "BudgetYearOneOCO": {
                    "val": "4.59"
                },
                "BudgetYearOne": {
                    "val": "4.59"
                },
                "BudgetYearTwo": {
                    "val": "4.73"
                },
                "BudgetYearThree": {
                    "val": "5.37"
                },
                "BudgetYearFour": {
                    "val": "6.01"
                },
                "BudgetYearFive": {
                    "val": "6.16"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "5.2"
                },
                "CurrentYear": {
                    "val": "5.534"
                },
                "BudgetYearOneOCO": {
                    "val": "4.59"
                },
                "BudgetYearOne": {
                    "val": "4.59"
                },
                "BudgetYearTwo": {
                    "val": "4.73"
                },
                "BudgetYearThree": {
                    "val": "5.37"
                },
                "BudgetYearFour": {
                    "val": "6.01"
                },
                "BudgetYearFive": {
                    "val": "6.16"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "FY 2018 funding totals include $5.200 million appropriated for Overseas Contingency Operations (OCO).\nFY 2019 funding totals include $5.534 million appropriated for OCO.\n\nFY 2020 funding includes OCO for Enduring Requirements ($4.590 million): OCO for Enduring Requirements are enduring in-theater and in-CONUS costs that will likely remain after combat operations cease, and have previously been funded in OCO.\n\nThe countering improvised threats mission enables the Department of Defense (DoD) to counter improvised explosive devices and emerging threats in support of Combatant Commands (CCMDs) and deployed warfighters.  DTRA accomplishes this mission by procuring items to support the following:\n\n-  Sustaining an advanced information technology and fusion infrastructure that enables a threat awareness and understanding capability.\n-  Providing expeditionary, forward-deployed operations, intelligence, training, and advisory capabilities with reachback support; enabling rapid and innovative counter-improvised threat solution development and delivery.\n-  Supporting Military Departments\/Services' predeployment training and Combatant Commanders' (CCDRs) priority training-exercise support requirements as requested and validated.\n-  Leveraging broad Communities of Action that include DoD, other U.S. Government departments and agencies, key coalition allies and partners, academia, and the private sector to employ their capabilities, expertise, access, and authorities to counter threat networks and their use and facilitation of improvised weapons."
        },
        "Justification": {
            "val": "The FY 2018 Overseas Contingency Operations (OCO) funding of $5.200 million resourced the following new and continuing efforts:\n-  Procurement and delivery of mission Information Technology (IT) Continuity of Operations and off-site Disaster Recovery systems. \n-  Funded the deployment of a complete system composed of hardware, specifically racks, server cartridges, CPU, memory, data storage components, network connectivity equipment and power supplies, and software. \n-  Procurement and deployment of Expeditionary Kits in support of Enterprise Information Technology (EIT). These systems are composed of ruggedized laptops, portable satellite terminals and modems, secure network routers, hard drives, cryptographic equipment, and ruggedized pelican cases for system deployment for expeditionary forces for use in austere environments.\n\nThe FY 2019 OCO funding of $5.534 million will fund the following new and continuing efforts:\n-  Funded the contingency operations in Iraq and Afghanistan by providing U.S. Joint Force Combatant Commanders (CCDRs) with an awareness and understanding of the threat as well as the resources needed to support other contingencies including those with the mission to defeat the Islamic State of Iraq and Syria (ISIS). \n-  Supports the provision of technologies to defeat improvised threats such as: advanced wireless signals and compatible electronic countermeasures for improvised explosive device (IED) defeat\/ neutralization; miniaturized and integrated sensors; handheld detectors; and the procuring of IT capabilities to support the DoD's goal to rapidly close the gap between the enemy's innovation cycles and the preparedness and operational capabilities of deploying and deployed U.S. Joint Forces by procuring mission-critical support items rapidly.\n\nThe FY 2020 OCO budget of $4.590 million will fund the following efforts:\n-  Funds lifecycle replacement and additional procurement of Expeditionary Kits used by forward-deployed troops operating in austere locations around the globe. These kits support combat operations by equipping troops with a self-contained analytical tool kit that extends DTRA's combat support and intelligence analysis capabilities into forward operating locations.  These locations have minimal or no existing communications infrastructure or tactical intelligence support. \n-  Support lifecycle replacement of a high-performance computing platform (primary system and disaster recovery fail-over system) that supports warfighter capabilities for use by Combatant Commands, Theater Special Operations Commands, forward-deployed combat troops, and mission partners in the DoD, Intelligence Community, Services, Homeland Security, and Law Enforcement community.\n\nThe decrease from FY 2019 to FY 2020 is due to the transition of the Catapult program to sustainment operations starting in FY 2020."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}