{
    "id": "2020-Army-PB-2034A-JBOOK-e2540b0eaa48aabab1dc2fd5fb8e17e7a3c6279809b49fad20b1827915472d81-30",
    "meta": {
        "filename": "2020-BASE_PROCUREMENT-2020-ARMY_AMMO-U_PROCUREMENT_JustificationBook_Army_PB_2020.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2020.xml",
        "doctype": "2020-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2020",
        "budget_cycle": "PB",
        "submission_date": "2019-03",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "0572EP1000"
        },
        "LineItemTitle": {
            "val": "Industrial Facilities"
        },
        "P1LineNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2020"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2019-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition Production Base Support"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Production Base Support"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "7992.958"
                },
                "PriorYear": {
                    "val": "432.641"
                },
                "CurrentYear": {
                    "val": "450.947"
                },
                "BudgetYearOneOCO": {
                    "val": "474.511"
                },
                "BudgetYearOne": {
                    "val": "474.511"
                },
                "BudgetYearTwo": {
                    "val": "583.344"
                },
                "BudgetYearThree": {
                    "val": "456.086"
                },
                "BudgetYearFour": {
                    "val": "338.659"
                },
                "BudgetYearFive": {
                    "val": "342.2"
                },
                "Total": {
                    "val": "11071.346"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "7992.958"
                },
                "PriorYear": {
                    "val": "432.641"
                },
                "CurrentYear": {
                    "val": "450.947"
                },
                "BudgetYearOneOCO": {
                    "val": "474.511"
                },
                "BudgetYearOne": {
                    "val": "474.511"
                },
                "BudgetYearTwo": {
                    "val": "583.344"
                },
                "BudgetYearThree": {
                    "val": "456.086"
                },
                "BudgetYearFour": {
                    "val": "338.659"
                },
                "BudgetYearFive": {
                    "val": "342.2"
                },
                "Total": {
                    "val": "11071.346"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "7992.958"
                },
                "PriorYear": {
                    "val": "432.641"
                },
                "CurrentYear": {
                    "val": "450.947"
                },
                "BudgetYearOneOCO": {
                    "val": "474.511"
                },
                "BudgetYearOne": {
                    "val": "474.511"
                },
                "BudgetYearTwo": {
                    "val": "583.344"
                },
                "BudgetYearThree": {
                    "val": "456.086"
                },
                "BudgetYearFour": {
                    "val": "338.659"
                },
                "BudgetYearFive": {
                    "val": "342.2"
                },
                "Total": {
                    "val": "11071.346"
                }
            }
        },
        "Description": {
            "val": "FY 2020 funding totals include $0.0M for Base and $474.511M for Overseas Contingency Operations (OCO); of which $474.511M is realigned as part of the OCO for Base Requirements. FY 2020 OCO for Base Requirements is OCO funding for base budget requirements in support of the National Defense Strategy. The Budget requests these funds in OCO to comply with the base budget defense caps included in the Budget Control Act of 2011.\n\nThis budget line provides funding for modernization efforts at Government-Owned, Contractor-Operated Army Ammunition Plants (AAPs) and commercial facilities.  The AAPs were constructed during World War II;  the facilities have served and supported numerous theater operations, providing the warfighter with expansive ammunition requirements.  Due to their age, the facilities and infrastructure experience frequent failures, and the production lines operate with outdated technology processes and equipment.  The Industrial Facilities (IF) budget line consists of three separate programs, Provision of Industrial Facilities (PIF), Layaway of Industrial Facilities (LIF) and Maintenance of Inactive Facilities (MIF).  Its mission includes replacement of obsolete or worn production equipment, correction of deficiencies and upgrades to infrastructures.  This line represents an enduring, exhaustive mission to modernize and equip the Army's Ammunition Plants and provide decisive advantage of the warfighter's small caliber, explosives and propellant ammunition requirements, without delay and at optimal cost.  Project Director (PD) Joint Services, under Joint Program Executive Office Armaments and Ammunition, manages the Industrial Facilities budget line.\n\nThe Provision of Industrial Facilities program (PIF), SSN EP1200, establishes, augments and improves ammunition production capabilities through strategic modernization efforts, expands production capacity, maintains environmental compliance, and improves quality of work environment and safety at ammunition plants.  It also addresses emergency modernization and associated construction to mitigate production disruptions at various sites.  \n\nThis budget line provides funding for preservation, storage and movement of real property facilities and equipment required for anticipated future requirements at active and inactive Army ammunition installations, also known as Layaway of Industrial Facilities (LIF) activities, SSN EP2000.  Funding will also support consolidation of layaway production equipment and redistribution of production equipment that cannot be stored on-site.  Layaway efforts also include retaining critical operational and technical knowledge of production equipment, such as engineering designs, process data and control manufacturing practices.  Layaway program also includes safety-related decontamination, disposal and demolition of production equipment and facilities, and environmental site assessments.\n\nProcurement funds also support the Maintenance of Inactive Facilities (MIF), SSN EP1500, to include utilities, buildings, plant equipment, special tooling, and special test equipment being retained to support future production requirements.  Additional efforts include support of associated MIF costs such as grounds maintenance, fire protection, equipment security, and administrative support."
        },
        "Justification": {
            "val": "FY 2020 funding totals include $0.0M for Base and $474.551 million for Overseas Contingency Operations which was realigned as part of the OCO for Base Requirements funding which reflects the Department's compliance with the Budget Control Act of 2011.\n\nFY 2020 procurement dollars will support modernization projects to include modernization design and upgrades to the small caliber production lines at Lake City Army Ammunition Plant (AAP) in support of the Next Generation Squad Weapon ammunition round, modernization design of a new nitrate ester manufacturing facility at Radford AAP, and design efforts for construction of a new tank line at Iowa AAP.  Funds support modernization projects to expand the annual production capacity of Research Development Explosive (RDX) at Holston AAP from approximately eight million pounds to sixteen million.  Efforts include construction of a modern analytical lab, construction of a RDX wastewater point source treatment facility, and modernization and construction of the Ammonium Nitrate Solution (ANSOL) filtration facility.  Funds also support infrastructure upgrades at Holston, Iowa, Lake City, Radford, and Scranton AAPs, as well as the Quad City Cartridge Case Facility and work environment projects, improvements for personnel safety and health, and efforts to maintain environmental compliance at the ammunition plants.  Funds will provide engineering support of industrial facilities, pre-design efforts for future-year modernization projects.\n\nFY 2020 funding also supports the protection and preservation of industrial facilities at active and inactive Army ammunition installations and equipment that is no longer required for current production but must be retained for future production needs.  Funds support the decontamination and demolition of excess production equipment and facilities buildings at Lake City and the layaway of various load, assemble and pack production lines at Iowa and Milan AAP.  \n\nFY 2020 funding supports the care and maintenance of layaway equipment and facilities at active and inactive ammunition installations."
        },
        "FacilityList": {
            "ProductionSupportFacility": [
                {
                    "Name": {
                        "val": "Maintenance of Inactive Facilities"
                    },
                    "Location": {
                        "val": "Various AAPs"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "1.583"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "6.387"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "6.461"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "6.461"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX4073"
                                },
                                "Title": {
                                    "val": "Maintenance of Inactive Facilities"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.583"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "6.387"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "6.461"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "6.461"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-12"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-04"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount $6.461 million supports the care and maintenance of laid-away equipment and facilities at active and inactive ammunition installations."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Holston Army Ammunition Plant"
                    },
                    "Location": {
                        "val": "Kingsport, Tennessee"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "12"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193214"
                                },
                                "Title": {
                                    "val": "Treatment Technology Alternatives to Open Burning, Design"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Develop Expl(RDX),High Melt Expl(HMX),Insensitive Mun Expl(IMX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "12"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2021-04"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-08"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $12.000 million supports the design of a thermal and non-thermal treatment facility at Holston Army Ammunition Plant (AAP).  Contaminated materials including contaminated plastics, rubber and other materials are generated during the explosives manufacturing process.  These materials are currently open burned at the installation.  Holston AAP is required to reduce or eliminate open burning of Material Potentially Presenting an Explosive Hazard (MPPEH) in compliance with DoD Explosives Safety Board (DDESB) and Tennessee Department of Environment and Conservation (TDEC) requirements.  This effort supports the modernization initiative to expand annual production capacity of RDX at Holston AAP from eight million pounds to sixteen million pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "0.212"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183296"
                                },
                                "Title": {
                                    "val": "Industrial Wastewater Settling & Equalization Basins"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.212"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-10"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2018-12"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement funds in the amount of $0.212 million supports infrastructure improvements to the industrial wastewater settling and equalization basins at Holston Army Ammunition Plant (AAP).  Effort is required to repair and modernize approximately 2,000 square yards of asphalt roadways and concrete curb supporting the industrial wastewater facilities.  The roads have deteriorated with visible signs of degradation to the sub base.  Effort supports operations continuity of the wastewater treatment facilities at Holston AAP."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.5"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193376"
                                },
                                "Title": {
                                    "val": "Castables Packaging Facility, Design"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Insensitive Munitions Explosives (IMX), Research Development Explosives (RDX), High Melt Explosives"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.5"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-03"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.500 million supports the design of castable packaging facility modernization upgrades at Holston Army Ammunition Plant.  The existing castable packaging operations in Building N-5 are inadequate to meet production capacities.  The design effort will support building assessments, management and systems engineering, civil, structural, mechanical, utilities, and infrastructure modernization improvements for expanded operations."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "6.82"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "6.82"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5203579"
                                },
                                "Title": {
                                    "val": "Landfill Expansion, Facilities & Maintenance"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "6.82"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "6.82"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-11"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $6.820 million supports this facilities and maintenance effort to expand existing Holston Army Ammunition Plant (AAP) landfill.  The existing Class II landfill will reach capacity in 2022.  This effort will create more waste disposal capacity at Holston AAP and support future production operations.  The project will include an associated leachate management system which will reduce wastewater treatment operation costs.  The design phase was initiated in 2017 and funded in FY 2017 and will complete October 2020."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "20.286"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "18"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "18"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183668"
                                },
                                "Title": {
                                    "val": "Sewer Line Replacement, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX), High Melt Explosives (HMX), IMX"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "20.286"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "18"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "18"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $18.000 million supports this facilities maintenance effort to repair and replace industrial and sanitary sewer lines at Holston Army Ammunition Plant.  The existing sewer system is aging and suffers significant leaks.  Rain water infiltration has increased flow to the waste water treatment facility and impacted its ability to treat Research Development Explosives (RDX).  This effort will ensure Holston AAP remains in compliance with Environmental Protection Agency (EPA) and other environmental regulations."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "0.243"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183754"
                                },
                                "Title": {
                                    "val": "Aeration Basins Mod Upgrades"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Develop Expl(RDX),High Melt Expl(HMX),Insensitive Mun Expl(IMX)"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.243"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-12"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-04"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $0.243 million supports modernization repairs to Aeration Basins 1W and 3W at Holston Army Ammunition Plant.  The supporting infrastructure of Basins 1W and 2W have experienced failures and cracks.  Modernization improvements are required to ensure the Basins maintain compliance with the National Pollutant Discharge Elimination System permit.  This effort supports the Industrial Waste Treatment Facility which treats process waste water from the production of RDX, HMX, and IMX.  These basins primary support removal of excess ammonia and organic pollutants prior to discharge."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "3.073"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "67"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "67"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX3783"
                                },
                                "Title": {
                                    "val": "Analytical Lab"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Develop Expl(RDX),High Melt Expl(HMX),Insensitive Mun Expl(IMX)"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "67"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "67"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "3.073"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2019-07"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-03"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-02"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $67.000 million supports the construction of an analytical lab at Holston Army Ammunition Plant (AAP).  The facility would replace the current lab facility at Holston AAP as well as provide expanded laboratory capabilities. The analytical lab will be used for acceptance testing of all explosives produced at the facility.  The laboratory will be constructed to allow larger load limits within the lab facilities which will improve the throughput.  This effort supports the modernization initiative to expand annual production capacity of Research Development Explosives (RDX) at Holston AAP from eight million pounds to sixteen million pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "3.028"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183785"
                                },
                                "Title": {
                                    "val": "Elevator and Lift Upgrades, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX), High Melt Explosives (HMX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "3.028"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $3.028 million supports this facilities and maintenance effort to repair and the installation of lift and elevator equipment at Holston Army Ammunition Plant.  The lifts and elevators carry explosives and other chemicals from ground floors to loading docks or second and third floors for production operations, including Comp-C4, CSM-AF-7 and High Bulk Density nitroguanidine (NQ).  The existing elevator system has not been upgraded in several decades.  The system experiences numerous failures and leaks.  Routine maintenance is no longer feasible.  This project will bring the building elevator systems in plant wide production buildings to modern safety standards, and significantly reduce risk of downtime of explosive operations."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "5.074"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183964"
                                },
                                "Title": {
                                    "val": "A2B Modernization Improvements, Facilities and Maintenance"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "5.074"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-12"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-08"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $5.074 million supports this facilities and maintenance effort modernizes and improves the Acid Area Consolidation effort (A2B) at Holston Army Ammunition Plant (AAP).  The A2B initiative relocated acid production operations in Area A and consolidated them in Area B at Holston AAP.  Effort includes improvements to the AZEO columns, main condensers, base heaters, flash column condensers, column trays, and interchangers."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "3"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193970"
                                },
                                "Title": {
                                    "val": "Boxway Upgrade for Spill Prevention & Containment, Design"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX), High Melt Explosives (HMX), IMX"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "3"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-09"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $3.000 million support design of modernization upgrades and repairs to the boxway network at Holston Army Ammunition Plant.  The transfer of materials between the buildings are conducted through a series of pipelines. The pipelines are typically found within a boxway that has steam present to prevent freezing in the winter months. The pipes are antiquated and have experienced numerous failures or leaks.  The existing chemical pipeline boxway at Holston AAP will not designed to provide containment.  This effort will design an upgraded boxway network to provide for spill containment and storm water exclusion."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "15"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "15"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5205055"
                                },
                                "Title": {
                                    "val": "Modernized Melt-Cast Facility, Construct"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Insensitive Munitions (IM) Explosives, TNT, Research Development Explosives (RDX)"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "15"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "15"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-10"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $15.000 million supports construction of a melt-cast facility at Holston Army Ammunition Plant (AAP).  Holston AAP is currently implementing an Insensitive Munitions Explosives (IMX) modernization strategy to achieve an annual IMX capacity of eight million pounds.  The expanded production capacity will require additional, modernized casting capacity.  The existing facility, Building M-4, cannot meet the future production requirements; additionally it lacks precise temperature control and uniform agitation necessary to attain insensitive properties and consistent quality that IMX class of products require.  Holston AAP is the only qualified source of IMX melt-cast explosives in the National Technology and Industrial Base.  This is a new start."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "10"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185096"
                                },
                                "Title": {
                                    "val": "Ansol Treatment"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX), High Melt Explosives (HMX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "10"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-09"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $10.000 million supports design of an Ammonium Nitrate Solution (ANSOL) treatment facility at Holston Army Ammunition Plant (AAP).  In the past, ANSOL has been transferred as a low-cost feed stock into the ammonium nitrate\/fuel oil (ANFO) explosives industry (mining, quarry, civil usages).  Existing users of ANFO are not utilizing this material at this time due to composition fluctuations and odor issues.  Failure to treat ANSOL will result shutdown of explosives production operations at Holston AAP.  This effort supports the modernization initiative to expand annual production capacity of RDX at Holston AAP from eight million pounds to sixteen million pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "65"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195097"
                                },
                                "Title": {
                                    "val": "Combined Wash\/Filter Facility, Construct"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX),  High Melt Explosives (HMX)"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "65"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-06"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-11"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $65.000 million supports construction of a combined Wash and Filtration facility at Holston Army Ammunition Plant.  This effort supports the modernization initiative to expand annual production capacity of RDX at Holston AAP from eight million pounds to sixteen million pounds.   The existing Wash\/Filtration capabilities at building E-6 cannot support future RDX production requirements.  The new facility will be designed to support a minimum annual production of nine million pounds of washed crude RDX or 2.3 million pounds of High Melt Explosives (HMX)."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "5.13"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "20"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "20"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX5098"
                                },
                                "Title": {
                                    "val": "RDX Wastewater Point Source Treatment, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "5.13"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "20"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "20"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-03"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2017-11"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $20.000 million supports this facilities and maintenance project which expands and modernizes the Research Development Explosives (RDX) Wastewater Point Source Treatment facility at Holston Army Ammunition Plant.  The Industrial Waste Water Treatment Facility (IWWTF) treats process wastewater from the production of nitramine-based explosive compounds, acetic acid and acetic anhydride, nitric acid production, and insensitive munitions production.  Additional treatment capacities are required to support the modernization initiative to expand annual RDX production capacity from eight million pounds to sixteen million pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "110.836"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185099"
                                },
                                "Title": {
                                    "val": "Natural Gas Fired Stream Plant, Design\/Construct"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX)"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "101.259"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "9.577"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-03"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2017-11"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2019-02"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $110.836 million supports expansion of the Natural Gas fired Stream Plant at Holston Army Ammunition Plant (AAP).  Additional capacities are required to support the modernization initiative to expand annual RDX production capacity from eight million pounds to sixteen million pounds.  This project will allow Holston AAP to maintain compliance with federal and state regulatory requirements, including the Prevention of Significant Deterioration (PSD) mandate and utilize Best Available Control Technologies (BACT)."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "1.499"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "55"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "55"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX5100"
                                },
                                "Title": {
                                    "val": "WAARP Facility Train II, Design\/Construct"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX), High Melt Explosives (HMX)"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.499"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "55"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "55"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2019-05"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-07"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $55.000 million supports the construction of a second modernized facility to recover weak acetic acid for RDX\/HMX production at Holston Army Ammunition Plant.  The existing weak acetic acid recovery (WAARP) facility, Building B-4, cannot meet RDX production requirements.  Additional capacities are required to support the modernization initiative to expand annual RDX production capacity from eight million pounds to sixteen million pounds.  The new right-sized facility addresses the increase in volume of dilute acetic acid, a byproduct of manufacturing explosives, as well as the requirement for denitrification and solids separation concentration, the byproduct of acetic anhydride manufacturing."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.018"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "40"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "40"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX5101"
                                },
                                "Title": {
                                    "val": "Acid Tank Farms, B-3, Construct"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "40"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "40"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.018"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $40.000 million supports construction of the modernized B-Acids tank farm at Holston Army Ammunition Plant.  The current tank farm was installed in the 1970s.  Tank contents include nitric acid and Ammonium Nitrate Solution (ANSol) and waste acid from explosives manufacturing.  The storage capability is critical to maintaining explosives operations.  This project will expand and replace the aging chemical storage tanks, transfer equipment and containment dike at the B-3 tank farm.  This is a continuation of Project 5195102 funded in FY 2019 and is not a new start."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "13.483"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185103"
                                },
                                "Title": {
                                    "val": "New Fluid Energy Mill (FEM) Facility"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Develop Expl(RDX)"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "13.483"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "ConceptDesignComplete": {
                                        "val": "2021-05"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-08"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-02"
                                    },
                                    "EquipmentInstallationComplete": {
                                        "val": "2021-02"
                                    },
                                    "ProveOutBegins": {
                                        "val": "2021-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $13.483 million supports the construction of a second FEM Facility dedicated to RDX at Holston Army Ammunition Plant.  Currently, only one facility (Building N-3) can produce RDX FEM material, and its capacity is inadequate to support future demand.  Future production requirements for CXM-AF-7 necessitate a significant increase in FEM production.  FEM throughput is one of the main chokepoints in producing this product.  This effort supports the modernization initiative to expand annual production capacity of RDX at Holston AAP from eight million pounds to sixteen million pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "74.756"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185104"
                                },
                                "Title": {
                                    "val": "Activate Building G-3 for RDX\/NQ Recrystallization Construction"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Develop Expl(RDX), Insensitive Mun Expl(IMX)"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "74.756"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-12"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-10"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $74.756 million supports this construction project to reactivate and modernize Building G-3 at Holston Army Ammunition Plant (AAP) to perform RDX\/NQ Recrystallization and RDX formulation.  This project will increase Holston AAP's capacity to produce RDX as well as continue to produce High Bulk Density Nitroguanidine (NQ) from the current industrial stock of NQ.  This effort supports the modernization initiative to expand annual production capacity of RDX at Holston AAP from eight million pounds to sixteen million pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "1.678"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "20"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "20"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX5106"
                                },
                                "Title": {
                                    "val": "Ansol Filtration, Facilities & Modernization"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX), High Melt Explosives (HMX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.678"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "20"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "20"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2019-09"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-10"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $20.000 million supports this facilities and maintenance effort to improve filtration processes of Ammonium Nitrate Solution (ANSol) at Holston Army Ammunition Plant (AAP).  Effort will remove as much solids and explosive material as possible from the ANSol by-product at the Holston AAP.  The ANSol Filtration System will mitigate and eliminate the current use of deep well injection for disposal of the ANSol by-product.  This effort supports the modernization initiative to expand annual production capacity of Research Development Explosives (RDX) at Holston AAP from eight million pounds to sixteen million pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "2.5"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195107"
                                },
                                "Title": {
                                    "val": "IMX Production Building, Design"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Insensitive Mun Expl(IMX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "2.5"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-07"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $2.500 million supports modernization design of a second Insensitive Munitions Explosives (IMX) Production Building at Holston Army Ammunition Plant.  This production building will produce the additional required Dinitroanisole and Nitrotriazalone IMX base explosives to meet the projected requirements for IMX explosives.  This project supports the modernization initiative to increase annual IMX production capacity to eight million pounds.  The effort will design a second IMX production facility that will leverage the design and lessons learned of the first IMX production building G-8.  The second facility will be located within Area B."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "8"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195110"
                                },
                                "Title": {
                                    "val": "Area B Third Acid Train, Design"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "8"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-11"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $8.000 million supports design of a third acid train facility at Holston Army Ammunition Plant (AAP).  This effort supports the modernization initiative to expand annual production capacity of RDX at Holston AAP from eight million pounds to sixteen million pounds.  Holston AAP requires expansion of the Acetic Acid and Acetic Anhydride production capacity which is utilized in the nitration of hexamine to crude for RDX and HMX.  This modernization project will design a third acetic acid and replicated acetic anhydride train facility at Holston.  This modernization effort will eliminate reliance on the Area A process operations and improve safety as well as process reliability."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "3"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195116"
                                },
                                "Title": {
                                    "val": "New Kettle Drying Facility, Design"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "3"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-06"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $3.000 supports design of a new kettle drying facility at Holston Army Ammunition Plant.  The existing drying facilities utilize 1940s processes and operate with degraded equipment, which have exceeded their useful life and created contamination risks in explosives products.  This project will design a fourth kettle drying facility at Building L-7 which will allow for higher drying capacity and permit shutdown and modernization of existing, antiquated drying facilities.  The new kettle drying facility is critical in the production of CXM-7 which is a premix for PBXN-107, bomb fill, as well as other explosive products."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "6"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195151"
                                },
                                "Title": {
                                    "val": "Nitration Facility, Design"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX), High Melt Explosives (HMX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "6"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-12"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $6.000 million supports design of a nitration facility at Holston Army Ammunition Plant.  The existing batch nitration facility, Building D-5, cannot support future production requirements of RDX and HMX.  The effort will produce a design, to include all relevant system engineering documentation, support infrastructure, and utility tie-ins of a new modernized nitration facility.  This effort supports the modernization initiative to expand annual production capacity of RDX at Holston AAP from eight million pounds to sixteen million pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "5"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195152"
                                },
                                "Title": {
                                    "val": "Recrystallization Facility, Design"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Development Explosives (RDX) and High Melt Explosives (HMX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "5"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-12"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $5.000 million supports design of a recrystallization facility at Holston Army Ammunition Plant.  The process for recrystallization of RDX involves receipt of crude RDX in weigh tanks at the G-Building area where it is subsequently pumped into a dissolver.  The solvent is introduced with the slurry and the resulting solution is heated.  When the explosives are dissolved, the solution is dropped into a still, where distillation of the solvent results in a controlled recrystallization and particle size distribution.  The addition of a G-building would support future RDX production requirements.  This modernization effort will design a new facility that will support increased capacity for RDX and HMX recrystallization, increased capacity for dewatering, and ability to recrystallize Ammonium Nitrate Solution (ANSol) final Sludge solids (RES) to support RDX and HMX operations.  This effort supports the modernization initiative to expand annual production capacity of RDX at Holston AAP from eight million pounds to sixteen million pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "20"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "20"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5205153"
                                },
                                "Title": {
                                    "val": "NQ Point Source Wastewater Treatment, Construct"
                                },
                                "EndItemSupportedModel": {
                                    "val": "IMX-101"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "20"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "20"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-05"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $20.000 million supports the construction of a nitroguanidine (NQ) Point Source Wastewater Treatment facility at Holston Army Ammunition Plant (AAP).  The existing Industrial Waste Water Treatment Facility (IWWTF) has insufficient capacity to support future production requirements of insensitive munition explosives (IMX.)  NQ is a production intermediate of IMX.  This effort will construct a point source treatment facility to complement the existing industrial waste water treatment facility processes.  This effort will provide an effective and efficient treatment solution for the NQ waste stream.  Effort will maintain environmental compliance and support the Holston AAP modernization initiative to increase annual IMX production capacity from three million pounds to eight million pounds.  This is a new start."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "7"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "7"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5205154"
                                },
                                "Title": {
                                    "val": "Critical Spares"
                                },
                                "CostElementList": {
                                    "Equipment": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "7"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "7"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-12"
                                    },
                                    "EquipmentInstallationComplete": {
                                        "val": "2021-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $7.000 million supports facilities and maintenance and procures critical spares for explosive production operations at Holston Army Ammunition Plant.  This project will include procurement of long lead equipment spares to prevent long-term production interruptions and will decrease production downtime and provide reliable backup supply for the aging components and parts across the plant to ensure production continuity."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "10"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195169"
                                },
                                "Title": {
                                    "val": "Cyber Critical Infrastructure Risk Management (CIRM) Resiliency"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Research Develop Expl(RDX),High Melt Exp(HMX),Insensitive Mun Exp(IMX)"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "10"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-06"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $10.000 million supports modernization upgrades to support Cyber Critical Infrastructure Risk Management (CIRM) Resiliency at Holston Army Ammunition Plant.  Modernization effort will replace and upgrade existing industrial operations information technology and operational technology  systems to ensure a cyber-secure environment.   These systems include industrial control systems, Supervisory Control and Data Acquisition (SCADA) systems, distributed control systems, Programmable Logic Controllers (PLC), as well as standard IT systems."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Iowa Army Ammunition Plant"
                    },
                    "Location": {
                        "val": "Middletown, Iowa"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "8.79"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "8.79"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193410"
                                },
                                "Title": {
                                    "val": "Replace Main Sewage"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Artillery, Mortars, Demolitions, Tank, 40mm Ammo and Missiles"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "8.79"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "8.79"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-08"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $8.790 million supports replacement of the main sewage treatment system at Iowa Army Ammunition Plant.  The existing treatment facility was constructed in the 1940s and has exceeded its useful life.   This effort will ensure the Plant's treatment facility achieves state and federal environmental compliance.  This effort will construct a right-sized treatment facility and integrate state-of-the-art technology to improve energy efficiency and reduce operational costs.  This is a new start."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "0.769"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183536"
                                },
                                "Title": {
                                    "val": "Critical Bridge Repair"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Artillery, Mortars, Demolitions, Tank, 40mm Ammo and Missiles"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.769"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $0.769 million supports replacement of bridge H-11 at Iowa Army Ammunition Plant.  Bridge H-11 provides access to yard E which is the primary yard in support of production.  The bridge was installed in 1945 and experiences significant defects, including rust and corrosion on railings, an unsupported post base, corroded and delaminated bearing plates.  The new bridge shall comply with American Association of State Highway and Transportation Officials (ASSHTO) and Iowa Department of Transportation standards."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "2.28"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193692"
                                },
                                "Title": {
                                    "val": "Central Fire Alarm Reporting System, Facilities and Maintenance Phase 2"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Artillery, Mortars, C4 Extrusion, 40mm"
                                },
                                "CostElementList": {
                                    "Equipment": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.75"
                                            }
                                        }
                                    },
                                    "EquipmentInstallation": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "0.53"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    },
                                    "EquipmentInstallationComplete": {
                                        "val": "2020-11"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $2.280 million supports second phase of this facilities and maintenance effort to modernize the central fire alarm reporting system at Iowa Army Ammunition Plant (AAP).  Effort will procure and install equipment for alerting personnel of a fire event or faulty conditions in thirty buildings.  Project will ensure Iowa AAP maintains compliance with applicable fire alarm and reporting system regulations."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "6.3"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "6.3"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5203745"
                                },
                                "Title": {
                                    "val": "Roadway Mod Improvements (Roads A & C) Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "40mm, Artillery, Mortar, Tank"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "6.3"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "6.3"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-12"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO to Base Requirements procurement dollars in the amount of $6.300 million supports facilities and maintenance efforts to Roads A & C at Iowa Army Ammunition Plant (AAP).  These roads have deteriorated to a condition in which routine maintenance is no longer economically feasible.  Effort will rehabilitate approximately 5 miles of roadways.  The rehabilitation of these roads will ensure safe travel of explosive laden trucks and maintain continuity of 40mm, artillery and mortar load, assemble and pack (LAP) operations at Iowa AAP."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "2.3"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193788"
                                },
                                "Title": {
                                    "val": "Security Automation, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Artillery, Mortars, Demolitions, Tank, 40mm Ammo and Missiles"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "2.3"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-06"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $2.300 million supports installation of a new automated security system at Iowa Army Ammunition Plant.  The existing security program relies on stationary guard support for production line gates and roving security patrols.  The modernized automated system will include security cameras, proximity badge scanners, remote monitoring, and automatic gates.  This facilities and maintenance effort will reduce the number of security personnel, reduce overhead costs, increase security capability, and improve safety management program."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "6.126"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "4.73"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX3794"
                                },
                                "Title": {
                                    "val": "Rail System Upgrades, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "40mm, Artillery, Mortars"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "6.126"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "4.73"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2019-05"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-11"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $4.730 million supports additional upgrades to rail tracks in storage yards on the eastern portion of Iowa Army Ammunition Plant.  A 2014 rail inspection identified several critical deficiencies and deterioration of trackage and culverts.  This facilities and maintenance effort will assure continued viability of the installation rail system for the transport of raw production materials and finished production.  Rail systems supports 40mm, as well as 60mm, 81mm, and 120mm mortars production."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "6.874"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195030"
                                },
                                "Title": {
                                    "val": "IAAAP Footprint Reduction - Melt Pour Operations Phase"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Mortars, Artillery"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "6.874"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-10"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $6.874 million supports Phase I design for footprint reduction at Iowa Army Ammunition Plant.  The existing artillery and mortar melt pour process line was built during the 1940s.  The design included high rate, labor intensive production with minimal process controls.  The facility contains aging equipment and infrastructure and cannot meet production capacity requirements for load operations of insensitive munitions.  Phase I will evaluate the transfer of Line 3A to the east side of the plant.  Effort will develop ninety percent design plans for the construction of a Melt Pour facility to achieve efficient manufacturing operations, reduce maintenance costs and consolidate production areas to a central location on the Plant."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "2.689"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX5036"
                                },
                                "Title": {
                                    "val": "Roof Replacement, Production Areas, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "M112 C4, 40mm, Hellfire warheads"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "2.689"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $2.689 million supports roof replacement in various production areas, including Lines 1, 2, 3A, and 4A at Iowa Army Ammunition Plant.  Existing roofs have exceeded their life expectancy;  if these roofs fail, production equipment and stored materials would be compromised resulting in interruption of operations.  This facilities and maintenance effort will improve safety and work environment within the production areas."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.51"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195034"
                                },
                                "Title": {
                                    "val": "Storage Yard Magazines Mod Upgrades, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Artillery, Mortars, C4 Extrusion, Tank Ammunition, 40mm"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.51"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-06"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.510 million supports modernization upgrades to the storage yard magazines at Iowa Army Ammunition Plant.  The existing magazines were constructed in the 1940s.  The magazines are deteriorating and routine maintenance is no longer economically viable.  This facilities and maintenance effort will rehabilitate storage magazines, extend the useful life and improve access to rail and trailers."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "2.8"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195093"
                                },
                                "Title": {
                                    "val": "40mm X-Ray & DICONDE Implementation"
                                },
                                "EndItemSupportedModel": {
                                    "val": "40mm"
                                },
                                "CostElementList": {
                                    "EquipmentInstallation": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "2.8"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-06"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-12"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $2.800 million supports implementation of Digital Imaging and Communications in Nondestructive Evaluation (DICONDE) X-ray system at Iowa Army Ammunition Plant (AAP).  This equipment replacement effort will install modern technology to improve x-raying of 40mm cartridge cases and primer mixes throughout the load, assemble, and pack (LAP) operations at Iowa AAP.  This effort will reduce production costs and improve quality and round reliability."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "0.608"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185118"
                                },
                                "Title": {
                                    "val": "Line 1 Compressor"
                                },
                                "EndItemSupportedModel": {
                                    "val": "C4, 40mm, Hellfire"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.608"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-08"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-08"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $0.608 million supports installation of an air compressor on Line 1 at Iowa Army Ammunition Plant.  There is no reliable backup sources for air on Line 1 due to age and parts obsolescence.  The current system includes two air compressors, though neither is capable of handling additional load in the event of a failure.  This project will also mitigate risk of moisture or oil in the compressed air system."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "5.2"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195119"
                                },
                                "Title": {
                                    "val": "Centralized Solid Waste Processing"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Artillery, Mortars, Demolitions, Tank, 40mm Ammo and Missiles"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "5.2"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-10"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $5.200 million supports modernization of the centralized solid waste processing operations at Iowa Army Ammunition Plant (AAP).  The Iowa AAP existing recycling and disposal operations are spread across several areas of the Plant.  Due to aging and deteriorated conditions, the Plant has received several environmental violations in the last three years.  The new, modernized processing center will increase waste diversion rates, reduce operations costs and eliminate risk of environmental violations from existing facilities."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "1.71"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "1.71"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195122"
                                },
                                "Title": {
                                    "val": "Automate M112 Bagging Operations, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "M112"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "1.71"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "1.71"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-12"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $1.710 million supports development and installation of automated bagging operations of M112 at Iowa Army Ammunition Plant.  Effort will install an alternate bag for M112 demolition block production and install automated equipment for packaging the C4 pellet into the new bag.  The existing process is labor intensive and lengthy.  The new process will eliminate rejects and reduce packaging costs."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "0.41"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195123"
                                },
                                "Title": {
                                    "val": "Power Factor Capacitors"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Artillery, Mortars, C4 Extrusion, Tank Ammunition, 40mm"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "0.41"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-05"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $0.410 million supports installation of power factor capacitors at Iowa Army Ammunition Plant.  Effort will install a power factor bank and capacitors at various locations throughout the plant to reduce electrical demand and extend the equipment useful life.  Effort will reduce production overhead costs."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "4.903"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185301"
                                },
                                "Title": {
                                    "val": "Isostatic Press, Line 1"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Artillery, Tank and 40mm"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "3.139"
                                            }
                                        }
                                    },
                                    "Equipment": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.764"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "ConceptDesignComplete": {
                                        "val": "2020-01"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-12"
                                    },
                                    "EquipmentInstallationComplete": {
                                        "val": "2019-12"
                                    },
                                    "ProveOutBegins": {
                                        "val": "2020-01"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $4.903 million supports modernization effort to install an isostatic press on Line 1 at Iowa Army Ammunition Plant.  Pressed high explosive projectiles require a modernized process to ensure explosive density near theoretical maximum density.  The isostatic pressed billet in a projectile body achieves these performance requirements and avoids density gradients.  This project will design, procure, install, and prove-out a modernized production isostatic press facility."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "4.8"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "4.8"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5205304"
                                },
                                "Title": {
                                    "val": "Improve 40mm Grenade & Spitback Pressing, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "40mm"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "4.8"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "4.8"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-11"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-11"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $4.800 million supports modernization improvements and relocation of pressing operations at Iowa Army Ammunition Plant.  During a recent safety site plan review, the existing facilities that house the spitback pressing process lack sufficient production load limit requirements.  This facilities and maintenance effort will acquire and install new production presses, increase efficiencies and improve safety."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Lake City Army Ammunition Plant"
                    },
                    "Location": {
                        "val": "Independence, Missouri"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "2.473"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183018"
                                },
                                "Title": {
                                    "val": "Water Supply & Water Tower Upgrades"
                                },
                                "EndItemSupportedModel": {
                                    "val": ".50 Cal (all types except SLAP-T), 5.56mm, 7.62mm (all types)"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "2.473"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-01"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2018-08"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-07"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $2.473 million supports water supply and water tower modernization upgrades at Lake City Army Ammunition Plant.  The water towers are used as a backup water supply for fire protection and support production processes.  The existing towers were constructed in 1941;  the exterior coating has deteriorated and requires media blasting and replacement.  Aged water towers have failed recently resulting in a five day production stoppage.  This project will repair and upgrade the water towers, including addressing interior and exterior coatings as well as the piping systems and valves.  The new coating system will be compliant with National Fire Protection Association (NFPA) code."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "26.804"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "18.6"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "40"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "40"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX3356"
                                },
                                "Title": {
                                    "val": "Small Caliber Modernization, Production Line Upgrades"
                                },
                                "EndItemSupportedModel": {
                                    "val": ".50 Cal (all types except SLAP-T), 5.56mm, 7.62mm"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "18.626"
                                            }
                                        }
                                    },
                                    "CorpsOfEngineersSupport": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "3.6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "6.001"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "6.001"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "8.178"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "15"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "33.999"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "33.999"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2021-12"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2017-12"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $40.000 million supports modernization improvements in small caliber ammunition manufacturing at Lake City Army Ammunition Plant (AAP).  Project includes sixty-five percent design efforts to support the Next Generation Squad Weapon (NGSW) Ammunition production facility at Lake City AAP.  Joint Program Executive Office (JPEO) Armaments and Ammunition is the agency lead for the development of a new squad weapon ammunition round to increase soldier lethality.  Lake City AAP was identified as the production site for the NGSW round due to its existing ammunition production support infrastructure and its ability to retain highly qualified, expert small caliber ammunition manufacturing personnel.  The project also establishes a Prototype Energetic Center (PEC) at Lake City AAP to conduct manufacturing studies and testing to strengthen the new ammunition round effectiveness.  The project objective is to meet full rate production of the NSGW round by FY 2025."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "0.816"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193432"
                                },
                                "Title": {
                                    "val": "Bldg 45 Fire Sprinkler Lines"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "0.816"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $0.816 million supports modernization upgrades to fire sprinkler lines for Building 45 at Lake City Army Ammunition Plant.  Building 45 supports outdoor range testing of small caliber ammunition.  The existing fire suppression system lacks an adequate main water supply line.  This project will ensure Building 45 maintains National Fire Protection Association fire protection codes for water pressure and volume and prevents production interruptions."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "2.387"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183459"
                                },
                                "Title": {
                                    "val": "Primer Assembly Wing, Building 35, HVAC (Design)"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "2.387"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2019-09"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $2.387 million supports design of modernization upgrades to the heating, ventilation and air conditioning (HVAC) throughout the primer assembly wing in Building 35 at Lake City Army Ammunition Plant.  The existing HVAC system was installed in the early 1970s and operates with antiquated pneumatic controls and compressors utilized phased-out refrigerant.  The system lacks proper filtration and it has far exceeded its life expectancy.  Proper temperature and conditioned air is important in producing consistent, high quality primers for 5.56mm, 7.62mm, and .50 cal, as well and helping to maintain employee health and alertness while handling explosives.  This effort will include design of modular air handler with filtration, reheat, humidification, and monitoring and alarming tie-ins to the plantwide Metasys Building Management Systems."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "9"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183463"
                                },
                                "Title": {
                                    "val": "B3 Roofing Upgrades, Phase 1"
                                },
                                "EndItemSupportedModel": {
                                    "val": "7.62mm"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "8.02"
                                            }
                                        }
                                    },
                                    "CorpsOfEngineersSupport": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.663"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.317"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2019-01"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2019-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-12"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $9.000 million supports the replacement and upgrade of Building 3 roofing at Lake City Army Ammunition Plant (AAP).  Building 3 supports production of 7.62mm small caliber ammunition.  The existing, ethylene propylene roofing has failed in several areas which risks interruption of production operations and equipment damage.  Deteriorated and failing roofs also place production equipment and machines at risk of water damage, increasing production operation maintenance costs.  The new roof will be a thermoplastic polyolefin system and a new lightning protection system will be installed."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "0.216"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183611"
                                },
                                "Title": {
                                    "val": "Building 1 & 2 Load Center Transformer Replacement, Design"
                                },
                                "EndItemSupportedModel": {
                                    "val": "5.56mm, 20mm"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.216"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2019-06"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $0.216 million supports evaluation and design of Building 1 and 2 load center transformer at Lake City Army Ammunition Plant.  The transformers are the main power conversion feeding the 5.56mm production operations.  This effort will perform an engineering study and design of Buildings 1 and 2 transformers center.  The existing, twenty-two transformers have exceeded their service life and failure of these transformers has the potential to interrupt 5.56mm production operations."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.869"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193619"
                                },
                                "Title": {
                                    "val": "Covered Walkways in Explosives Area"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.869"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-08"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.869 million support installation of covered walkways in explosives area at Lake City Army Ammunition Plant.  The project will provide covered walkways between all explosive area manufacturing buildings in order to prevent employee exposure to inclement weather while transporting explosives.  The current manufacturing processes and equipment require substantial product movement across areas and buildings.  This project will improve the quality of work environment for personnel and reduce risk of weather impact on explosive materials."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.775"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193718"
                                },
                                "Title": {
                                    "val": "Conceptual Design, Building 15 Boiler Plant"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.775"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-05"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.775 million supports the conceptual design of a new centralized steam plan to replace the aging Building 15 steam plant at Lake City Army Ammunition Plant (AAP). This will reduce the energy footprint at Lake City AAP, increase efficiencies, maintain compliance with National Fire Protection Association safety standards, and support production of small caliber ammunition."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "1.123"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183758"
                                },
                                "Title": {
                                    "val": "Structural Upgrades, Building 8, Phase 2"
                                },
                                "EndItemSupportedModel": {
                                    "val": "5.56mm, 7.62mm, 0.50 Cal and 20mm"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.123"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2017-11"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-02"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.123 million supports replacement of additional roofing to Building 8 at Lake City Army Ammunition Plant.  This phase will also support asbestos abatement and electrical repair efforts.  Phase one was awarded in March 2015 to correct structural deficiencies found in Buildings 8, 11 and 16.  The project improves personnel safety and work environment and reduces risk of production interruption due to building deterioration."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "16.339"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183778"
                                },
                                "Title": {
                                    "val": "Exterior Steam Main Supports, Ph 2"
                                },
                                "EndItemSupportedModel": {
                                    "val": "5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "16.339"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-05"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $16.339 million supports modernization of exterior steam supports at Lake City Army Ammunition Plant.  Steam mains provide steam to manufacturing buildings for process steam in metal forming process and comfort heat.  Existing wooden support structures have deteriorated, increasing risk of collapsing and interrupt production operations.  This project will replace the structures with steel frame supports.  Effort will improve safety, reduce steam loss to manufacturing buildings and reduce risk of production interruptions for small caliber ammunition."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "1.265"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183795"
                                },
                                "Title": {
                                    "val": "Bldg 19 Series Controls and Monitoring Upgrades"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.265"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2017-12"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.265 million supports upgrades to Building 19 series controls and monitoring at Lake City Army Ammunition Plant.  Effort will remove and replace HVAC controls in nineteen buildings of the series powder storage bunkers.  The buildings currently lack adequate heating controls, impacting the quality of stored ammunition.  This project will add modulated steam valves, air dampers, variable fan speed controls, and air temperature monitoring as well as alarm equipment."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.083"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193796"
                                },
                                "Title": {
                                    "val": "Bldg 8 Indoor Firing Range, HVAC I&C (Design)"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.083"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-05"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.083 million supports design effort to upgrade the instruments and controls of the heating, ventilation and air conditioning system in Building 8 at Lake City Army Ammunition Plant.  Building 8 contains the indoor firing range.  The HVAC system was installed in the early 1970s.  The system has exceeded its useful life and does not comply with modern firing range design standards.  The building also experiences contamination due to failing equipment, increasing risk of personnel health hazards.  This project will include design of modular air handler with filtration, preheat, chilled glycol cooling, reheat, humidification, ductwork and ventilation."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "3.127"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183934"
                                },
                                "Title": {
                                    "val": "Install Flame Mgmt on Gas Furnaces"
                                },
                                "EndItemSupportedModel": {
                                    "val": "5.56mm, 7.62mm"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "3.127"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-04"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $3.127 million supports installation of flame management on gas furnaces at Lake City Army Ammunition Plant.  This effort will install gas safety shutoff valves on legacy gas furnaces in various production buildings.  The current combustion equipment lacks automatic protection to prevent explosions from reintroduction of natural gas into the buildings."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "3.76"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193937"
                                },
                                "Title": {
                                    "val": "Electrical Poles Mod Upgrades"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "3.76"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $3.760 million supports modernization upgrades and replacement of deteriorated electrical poles at Lake City Army Ammunition Plant.  A 2015 study conducted by the US Army Corps of Engineers identified a list of approximately 188 wooden utility poles for replacement.  These poles have now exceeded their useful life.  The poles are required to maintain production capabilities for small caliber ammunition."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.478"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195007"
                                },
                                "Title": {
                                    "val": "Bldgs 12B, 93 Roof Replacement"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.478"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-05"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the $1.478 million supports the modernization upgrades and replacement of roofs on Buildings 12B (Industrial Waste Treatment Plant) and 93 (production maintenance operations) at Lake City Army Ammunition Plant.  The existing roofs are at the end of their service life and experience frequent leaks. Several leaks are in close proximity to electrical infrastructure, posing a safety risk to personnel."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "48.729"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185117"
                                },
                                "Title": {
                                    "val": "New Water Plant, Construct"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "40.25"
                                            }
                                        }
                                    },
                                    "CorpsOfEngineersSupport": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "7.1"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.379"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2018-09"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-01"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-01"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of the $48.729 million support construction of a new water plant at Lake City Army Ammunition Plant.  The existing water plant has significant deterioration, antiquated controls and inefficient processes and equipment.  This project will construct a new water plant on a greenfield site, and it will provide zero and five grain water as well as fire suppression."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "12.072"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185131"
                                },
                                "Title": {
                                    "val": "Hill - Neutralization Tanks (Design-Replacement)"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "12.072"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-10"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-04"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $12.072 million supports design and replacement of the Hill explosives neutralization tanks in Building 81 at Lake City Army Ammunition Plant (AAP).  Lake City AAP currently uses a hydrogenation process to reduce aromatic nitro groups to amines to neutralize the energetic waste generated.  The existing rectangular shaped neutralization tanks, as well as the lack of agitation, contributes to the non-homogeneity of the batch and increased sediment.  This project will improve the mixing dynamics, integrate real-time sensor technology and incorporate remote operation capability."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "5.074"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185134"
                                },
                                "Title": {
                                    "val": "Dry Chemical Conditioning System Upgrades"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "5.074"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-11"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $5.074 million supports modernization upgrades to the dry chemical conditioning system at Lake City Army Ammunition Plant.  In the current Building 38 conditioning process, chemical raw materials are weighed and loaded into trays containing no more than thirty-vive pounds each, and are conditioned in steam-heated ovens before being mixed and granulated with other materials.  These ovens have exceeded their useful life and experience frequent failures.  The current operational limitations and process design prevent a replacement solution.  This project will modernize the chemical conditioning processes in Building 38, reduce drying times, and improve process control and product quality."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "1.63"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185135"
                                },
                                "Title": {
                                    "val": "121 Warehouse Study"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.374"
                                            }
                                        }
                                    },
                                    "CorpsOfEngineersSupport": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.256"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.630 million supports assessment of Building 121 Warehouse at Lake City Army Ammunition Plant (AAP).  Building 121 provides storage of ammunition to support Lake City AAP's annual small caliber production capacity of 1.6 billion rounds.  It was constructed in the 1940s and has aged and deteriorated.  It is no longer economical to perform periodic repairs and upgrades.  This project will conduct an assessment of Building 121 on potential new solutions, including modernization upgrades or new production opportunities."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.588"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195138"
                                },
                                "Title": {
                                    "val": "B50 Fire Pump Replacement"
                                },
                                "EndItemSupportedModel": {
                                    "val": "20mm, 5.56mm, 7.62mm, Cal .50"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.588"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.588 million supports the fire pump replacement in Building 50 at Lake City Army Ammunition Plant.  Effort replaces two deficient fire pumps and their respective diesel engines in Building 50 as well as supporting structures such as pump valves and defective piping sections.  Diesel engines? batteries, fuel tanks, and fuel piping will be removed, and a new diesel powered back-up generator will be installed."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "18.196"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185225"
                                },
                                "Title": {
                                    "val": "Mod Upgrades for 7.62mm Facility"
                                },
                                "EndItemSupportedModel": {
                                    "val": "7.62mm"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "9.746"
                                            }
                                        }
                                    },
                                    "Equipment": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "8.45"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "ConceptDesignComplete": {
                                        "val": "2020-01"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-01"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-11"
                                    },
                                    "EquipmentInstallationComplete": {
                                        "val": "2019-11"
                                    },
                                    "ProveOutBegins": {
                                        "val": "2019-11"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $18.195 million supports construction and installation of equipment for future manufacturing requirements of the 7.62mm ammunition at Lake City Army Ammunition Plant.  The West Charging Wing in Building 2 will be upgraded for bullet assembly and cartridge load, assemble and pack (LAP) upgrades.  Installed equipment will include precision die-set press, cartridge loading machine, vacuum propellant handling equipment and high speed deluge equipment."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Radford Army Ammunition Plant"
                    },
                    "Location": {
                        "val": "Radford, Virginia"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "2.462"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5182736"
                                },
                                "Title": {
                                    "val": "Construct New Nitrocellulose (NC) Facility"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.487"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.975"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2019-01"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-08"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $2.462 million supports the effort to continue the modernization and construction of a new, right-sized facility to produce high quality Nitrocellulose (NC) at Radford Army Ammunition Plant.  The current NC facility has exceeded its useful life and experienced as many as 70 failures in 12 months.  The new facility efficiently address safety, environmental and production requirements.   This phase includes design and construction of the deep foundations required for the new NC facility and construction of NC production train # 2."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "9.9"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "9.9"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5203120"
                                },
                                "Title": {
                                    "val": "NAC\/SAC Process Improvements, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "9.9"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "9.9"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-12"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $9.900 million supports various process improvements to the nitric acid concentrator and sulfuric acid concentrator (NAC\/SAC) at Radford Army Ammunition Plant.  This facilities and maintenance effort includes modernization design, procurement and installation of various process equipment.  Effort will enhance the process operations of the NAC\/SAC facility to support Radford AAP's annual NC production capacity of 24-28M pounds."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "4.364"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183140"
                                },
                                "Title": {
                                    "val": "Replace Chemical Grind, Design"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "4.364"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-03"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $4.364 million supports design of a chemical grind facility and a caustic cleaning facility at Radford Army Ammunition Plant (AAP).  The existing facilities were constructed in the 1940s, utilize antiquated equipment and are in poor condition.  The chemical grind facility is required to prepare, screen, visually inspect, and de-lump dry chemicals, which are received from bulk shipping containers, for propellant production.  The caustic cleaning facility decontaminates process equipment from propellants and energetics residues;  this legacy, daily process has been in service since the 1940s.  The facility design plans will enhance environmental and personnel safety controls, improve material management practices and improve manufacturing operations."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "9.307"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183407"
                                },
                                "Title": {
                                    "val": "Plant Operations"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "9.307"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-01"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-12"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $9.307 million supports maintenance activities at Radford Army Ammunition Plant (AAP).  Effort will fund preventive, scheduled and unscheduled maintenance of production equipment and facilities that would prevent serious injury to personnel or effects to the environment.  Funding is also provided for cyber security requirements, fire and emergency services and to execute an environmental program to ensure compliance with existing Federal, State, and local environmental laws."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "4.022"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183434"
                                },
                                "Title": {
                                    "val": "Plant-Wide Road Upgrades"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "4.022"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $4.022 million supports road upgrades and pavements within production areas at Radford Army Ammunition Plant.  The production areas, to include nitrocellulose and acid processes, roadways are heavily used by both vehicle and foot traffic and exhibit significant deterioration.  Routine and temporary maintenance or repair efforts are no longer economically feasible.  This effort will ensure safe transportation of energetic material throughout the installation and prevent personnel hazards due to uneven and deteriorated pavement."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "2.557"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183439"
                                },
                                "Title": {
                                    "val": "Acid Sewer Upgrades, Ph 3"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "2.557"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-12"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $2.557 million supports modernization upgrades to the main acid sewer lines located in the acid production area at Radford Army Ammunition Plant.  The existing system was installed over 50 years ago and experiences frequent leaks and failures.  The legacy system is no longer economically viable.  Upgrades are required to ensure adequate acidic wastewater processing capabilities to support production operations, maintain production continuity and to comply with environmental regulations."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "16.186"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183557"
                                },
                                "Title": {
                                    "val": "Electrical Distribution System Upgrades, Ph 3"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "16.186"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-04"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $16.186 million supports upgrades to the electrical distribution system at Radford Army Ammunition Plant.  This modernization effort will replace electrical poles, cable connections, 480V substations, old switches, cross arms, insulators, and surge arresters.  The existing infrastructure is unreliable and susceptible to catastrophic failure during adverse weather events.  This phase supports the Fourth Roll Powder and CASBL areas and ensures reliability and continuity of electrical service."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "9.474"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193559"
                                },
                                "Title": {
                                    "val": "Upgrade Water System, Fire Protection"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "9.474"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-07"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-07"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $9.474 million supports modernization upgrades to the fire protection, water system at Radford Army Ammunition Plant (AAP).  This effort will replace the existing deluge valves and Primac fire suppression system with a modern, effective fire protection system.  The new system will also eliminate the explosively actuated Primac.  Effort will maintain production continuity of propellants at Radford AAP.  The new system will be a rapid response deluge system, engineered turnkey package consisting of all required flame detectors, electronic controls and high-speed deluge valves designed specifically for fire suppression and deflagration encountered in the energetic process industry.  The new system will meet the National Fire Codes and Army Regulations for fire protection."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "9.4"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "9.4"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5203567"
                                },
                                "Title": {
                                    "val": "Barricade Replacement, Ph 1"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "9.4"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "9.4"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $9.400 million supports replacement of barricades at Radford Army Ammunition Plant.  This project will support the demolition and replacement of wooden barricades identified to support production at Radford Army Ammunition Plant (AAP).  Project will properly dispose of the wood, metal, fill dirt, and obsolete electrical components from each barricade demolished.  Install foundations as needed and rebuild wooden barricades to current Corp of Engineers specifications.  This is a new start."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "0.556"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183570"
                                },
                                "Title": {
                                    "val": "Sanitary Sewage Treatment Upgrade"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.556"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-07"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $0.556 million supports condition assessment of the sanitary sewer treatment facility at Radford Army Ammunition Plant (AAP).  The existing sewer treatment facility was constructed in the 1940s and has not received significant modernization.  The facility processes approximately one million gallons of waste per day.  If the facility were to fail, Radford AAP production operations would be halted and Radford AAP military housing would be abandoned.  This initial phase will assess the facility's condition, determine requirements for future modernization upgrades or replacement of the facility."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "3.656"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183672"
                                },
                                "Title": {
                                    "val": "Lightning  Protection, Production Areas"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "3.656"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $3.656 million supports upgrade and replacement of lightning protection system on production buildings at Radford Army Ammunition Plant (AAP).  The upgrades will cover production buildings and storage magazines in areas of the plant that lack lightning protection systems or do not meet current standards.  Buildings without lightning protection are susceptible to detonation and destruction due to lightning strikes.  Project will allow Radford AAP to achieve Army and national compliance standards, including NFPA-780, DA PAM 385-64 and UL96, UL96A compliant and certifiable condition."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "114.24"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193723"
                                },
                                "Title": {
                                    "val": "Combined EWI-CWP Facility, Construction"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "114.24"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-08"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2023-08"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $114.240 million supports construction of a combined energetic waste incinerator (EWI) and contaminated waste processor (CWP) at Radford Army Ammunition Plant (AAP).  Effort will allow a centralized, air-pollution controlled facility to handle all energetic waste and contaminated waste generated at Radford AAP.  The existing EWI facility has exceeded its useful life.  Radford AAP is the principal domestic source of propellants for small, medium and large caliber ammunition.  The new facility is critical in maintaining production operations and maintaining compliance with federal and state regulations."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "13.488"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183724"
                                },
                                "Title": {
                                    "val": "Permanent Energy Center (Design)"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "13.488"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-03"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $13.488 million supports design of a new permanent energy center at Radford Army Ammunition Plant (AAP).  Radford AAP currently utilizes the package boiler facility for steam supply however it relies on legacy steam mains for distribution within the facility and electrical generation.  The legacy steam main systems are inefficient and deteriorating due to age.  This modernization project will provide design plans to develop a fully modernized system of steam and electricity co-generation and distribution, and tie-in points to the steam and electrical distribution."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "7.353"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5183735"
                                },
                                "Title": {
                                    "val": "Acid Area Improvements, Ph 3"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "7.227"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "0.126"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2018-06"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2019-06"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $7.353 million supports phase three of repair of critical bulk storage tanks and containment dikes in the acid area at Radford Army Ammunition Plant.  Bulk storage tanks vary in age and several existing tanks were installed in the 1940s.  Containment dikes surrounding these bulk storage tanks have deteriorated and repairs are required to contain an acid release in the event of a catastrophic failure.  Acid bulk storage capacity is required to handle sulfuric acid, oleum, strong nitric acid, weak nitric acid, and processed (pyro) acid.  The safe and reliable storage of acids is critical for nitrocellulose manufacturing operations."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "20.082"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5193741"
                                },
                                "Title": {
                                    "val": "Water Intake Pump Upgrade (Building 407)"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "20.082"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-03"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $20.082 million supports upgrades to three intake pumps in Building 407 and the water distribution system, other process equipment and infrastructure at Radford Army Ammunition Plant (AAP).  These upgrades provide a viable backup and continuous source of water for fire suppression, process water, drinking water and steam which greatly impact operations at Radford AAP.  Radford AAP operates within a footprint of 4,000 acres which required modernized pumps and distribution lines for production and fire suppression to ensure production continuity."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.08"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195088"
                                },
                                "Title": {
                                    "val": "Structural Repairs"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.08"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-04"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-03"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.080 million supports structural repair requirements within various production buildings at Radford Army Ammunition Plant (AAP).  This modernization initiative seeks to improve the structural integrity of active facilities at Radford AAP.  These facilities were constructed during the 1940s and have exceeded their expected life.  Structural deficiencies are risks to personnel safety and continuity of Radford AAP's mission of propellant production."
                                }
                            },
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "5.865"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5185112"
                                },
                                "Title": {
                                    "val": "Solvent Pack-Out Building (Design)"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "5.865"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2020-05"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2018-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $5.865 million support design of a solvent propellant pack-out building at Radford Army Ammunition Plant (AAP).  Radford AAP produces single base solvent propellant.  All large caliber propellants are processed in Building 1814 for batching and pack out operations.  The existing facility requires frequent production processes change overs which delays throughput and increases facility maintenance.  This project will design a new solvent single base propellant pack out building to complement operations in Building 1814 and improve throughput, reduce maintenance costs and increase product quality.  The design will incorporate state-of-the-art automation to fill final propellant pack weight, automate drum lidding, and on-site palletization and wrapping operation."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "13.15"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195140"
                                },
                                "Title": {
                                    "val": "NC Solvent Dewatering, Design\/Construct"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Construction": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "10.99"
                                            }
                                        }
                                    },
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "2.16"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "FinalDesignComplete": {
                                        "val": "2019-12"
                                    },
                                    "InitialProjectAward": {
                                        "val": "2019-08"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-12"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $13.150 million supports design and construction of a nitrocellulose (NC) solvent dewatering facility at Radford Army Ammunition Plant.  This effort will design and construct an NC material transfer and handling system from the new NC facility to the dehydration building legacy propellant production operations (green lines) and design the material handling and transfer system to the Wringer House building which will be built in Phase 2.  The new system will receive and process the water-wet NC from the new NC facility to the Dehydration building and the Wringer House building.  The upgraded facility will allow the processing of the NC produced in the new NC facility until a new solvent propellant production facility is designed, constructed and commissioned.  The upgraded facilities will improve personnel safety, improve environmental controls and maintain production continuity of NC."
                                }
                            },
                            {
                                "Cost": {
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "8.5"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5195141"
                                },
                                "Title": {
                                    "val": "Solventless\/Rocket Area, Prod Operations, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "8.5"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-08"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2020-08"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $8.500 million supports modernization efforts to sustain production operations of solventless propellant at Radford Army Ammunition Plant.  Effort will stabilize the solventless areas, rocket and roll powder, to maintain production continuity.  This facilities and maintenance effort includes replacement of critical equipment and identification assessment of corrective maintenance actions."
                                }
                            },
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "7.5"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "7.5"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5205145"
                                },
                                "Title": {
                                    "val": "Solvent Propellant Facility Sustainment, Ph 1"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Propellants for Large, Medium, and Small Cal Munitions"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "7.5"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "7.5"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-01"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-01"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $7.500 million supports modernization and sustainment of the solvent propellant facility at Radford Army Ammunition Plant.  The facility was constructed during the 1940s and has operated beyond its useful life.  This facilities and maintenance effort will replace critical production equipment and infrastructure and provide assessment of future corrective actions.  Effort is required to ensure production continuity of solvent propellants until a new, modernized facility is designed and constructed."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Scranton Army Ammunition Plant"
                    },
                    "Location": {
                        "val": "Scranton, Pennsylvania"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "3.59"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "3.59"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5205150"
                                },
                                "Title": {
                                    "val": "Infrastructure & Safety Efforts, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "M795, 120mm Mortar, M1 HE, 5\"\/54"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "3.59"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "3.59"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-04"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2021-09"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $3.590 million supports facilities maintenance, infrastructure and safety modernization efforts at Scranton Army Ammunition Plant.  Effort will fund preventive, scheduled and unscheduled maintenance of production equipment and facilities that would prevent serious injury to personnel or effects to the environment."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Quad City Cartridge Case Facility"
                    },
                    "Location": {
                        "val": "Rock Island Arsenal, IL"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "2"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "2"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5205139"
                                },
                                "Title": {
                                    "val": "Infrastructure & Safety Efforts, Facilities and Maintenance"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Large Caliber Steel and Brass Cartridge Cases"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "2"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2020-08"
                                    },
                                    "ConstructionComplete": {
                                        "val": "2022-08"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $2.000 million supports facilities maintenance, infrastructure and safety modernization infrastructure and safety modernization efforts at the Quad City Cartridge Case Facility.  Effort will fund preventive, scheduled and unscheduled maintenance of production equipment and facilities that would prevent serious injury to personnel or effects to the environment."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Various Army Ammunition Plants"
                    },
                    "Location": {
                        "val": "Various Army Ammunition Plants"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "14.725"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "5.348"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "93.716"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "93.716"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX0000"
                                },
                                "Title": {
                                    "val": "Planning & Design in Support of Provision of Industrial Facilities"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Multiple"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "14.725"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "5.348"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "93.716"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "93.716"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": [],
                                "NarrativeExplanation": {
                                    "val": "FY 2020 OCO for Base Requirements procurement dollars in the amount of $93,716 million supports planning and design services to support ongoing, planned and unforeseen issues and requirements at the Government-Owned, Contractor-Operated (GOCO) Army Ammunition Plants (AAP).  Due to their age, the facilities experience frequent failures and production line delays. This project provides quick response capabilities to unforeseen issues and planned requirements requiring planning, design and engineering services necessary for facilities management and restoration efforts, modernization support, quality improvements, as well as but not limited to safety and environmental issues.\n\nFY 2020 Procurement dollars focus on a variety of projects to include preliminary design of thermal and non-thermal alternatives to open burning\/open detonation efforts to achieve compliance with Department of Defense Explosives Safety Board Policy and Tank Line Modernization efforts to replace existing tank line that was constructed in the 1940's at the Iowa AAP;   Modernization of Water Distribution (supporting process water, drinking water and fire suppression water) and design of a new Alternative Nitrate Ester Manufacturing Facility to support annual nitroglycerin production requirements at the Radford AAP;  Small Caliber ammunition modernization efforts will also continue in support the Next Generation Squad Weapon at the Lake City AAP."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Yuma Proving Ground \/ Aberdeen Test Center"
                    },
                    "Location": {
                        "val": "Yuma, Arizona \/ Aberdeen, Maryland"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "1.529"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "1.448"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX5060"
                                },
                                "Title": {
                                    "val": "Replace Test Instrumentation in Production Acceptance Testing (Ammunition)"
                                },
                                "EndItemSupportedModel": {
                                    "val": "Initial Production Acceptance & Product Improvements for Ammunition"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "1.529"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "1.448"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": [],
                                "NarrativeExplanation": {
                                    "val": "Procurement dollars in the amount of $1.448 million continues to support test mission activities at Aberdeen Test Center (ATC) and Yuma Test Center (YTC).  \n\nSupports the procurement of ammunition\/weapons components including gun mounts, gun tubes, breech assemblies, and other main weapon system components. These components are required to support proof and acceptance testing at ATC and Yuma Test Center YTC. Without these components, the Army will be unable to conduct the testing required to accept ammunition end items into its inventory and to mitigate operational risk due to ammunition shortfalls across the Army.\n\nAt ATC, continues replacement and procurement for Weapon and Weapon Components which have experienced wear and tear during repetitive testing of production ammunition items. Typical purchases include: rifle\/carbine\/machine gun barrels, receivers, and parts; large caliber barrels; small and medium caliber Mann-type test barrels, mortar barrels and bipod\/baseplates.  Timely replacement of worn or unserviceable weapons\/components will permit test execution without delays for acquisition of supporting equipment.\n\nAt YTC, procures Ammo Components to continue support Production Acceptance Test (PAT) of artillery and mortar ammunition components at YTC throughout the year.  Also procures replacement parts for large and small caliber direct fire weapon systems for production based support, which will improve weapon reliability and reduce potential testing downtime if sudden repairs are needed.\n\nThis project increases test efficiencies and decreases costs and risks to Army Program Managers."
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "Layaway Of Industrial Facilities"
                    },
                    "Location": {
                        "val": "Various AAPs"
                    },
                    "Type": {
                        "val": "GOCO"
                    },
                    "FacilityProjectList": {
                        "FacilityProject": [
                            {
                                "Cost": {
                                    "PriorYear": {
                                        "TotalCost": {
                                            "val": "16.916"
                                        }
                                    },
                                    "CurrentYear": {
                                        "TotalCost": {
                                            "val": "11.391"
                                        }
                                    },
                                    "BudgetYearOneBase": {
                                        "TotalCost": {
                                            "val": "0"
                                        }
                                    },
                                    "BudgetYearOneOCO": {
                                        "TotalCost": {
                                            "val": "11.524"
                                        }
                                    },
                                    "BudgetYearOne": {
                                        "TotalCost": {
                                            "val": "11.524"
                                        }
                                    }
                                },
                                "Number": {
                                    "val": "5XX8000"
                                },
                                "Title": {
                                    "val": "Layaway Of Industrial Facilities"
                                },
                                "CostElementList": {
                                    "Other": {
                                        "PriorYear": {
                                            "TotalCost": {
                                                "val": "16.916"
                                            }
                                        },
                                        "CurrentYear": {
                                            "TotalCost": {
                                                "val": "11.391"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "TotalCost": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "TotalCost": {
                                                "val": "11.524"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "TotalCost": {
                                                "val": "11.524"
                                            }
                                        }
                                    }
                                },
                                "MilestoneList": {
                                    "InitialProjectAward": {
                                        "val": "2019-11"
                                    },
                                    "FinalProjectAward": {
                                        "val": "2020-05"
                                    }
                                },
                                "NarrativeExplanation": {
                                    "val": "FY 2020 Base procurement dollars in the amount of $11.524 million supports the protection and preservation of industrial facilities at active and inactive Army ammunition installations and equipment that are no longer required for current production but must be retained for future peacetime or emergency production needs.  Funds support the decontamination and demolition of excess production equipment and facilities buildings at Lake City AAP and the layaway of various load, assemble and pack production lines at Iowa and Milan AAP."
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}