{
    "id": "2021-AirForce-PB-3080F-JBOOK-e27cd2de2dad0f674c2097e83311f6a5c4a2de51cf3a352a68efe26efda300ef-36",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-AIRFORCE_OTHER-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "834520"
        },
        "LineItemTitle": {
            "val": "Theater Battle Mgt C2 System"
        },
        "P1LineNumber": {
            "val": "38"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "4"
        },
        "BudgetSubActivityTitle": {
            "val": "Spcl Comm-Electronics Projects"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "5.191"
                },
                "CurrentYear": {
                    "val": "6.337"
                },
                "BudgetYearOneBase": {
                    "val": "3.392"
                },
                "BudgetYearOne": {
                    "val": "3.392"
                },
                "BudgetYearTwo": {
                    "val": "5.106"
                },
                "BudgetYearThree": {
                    "val": "0.396"
                },
                "BudgetYearFour": {
                    "val": "0.421"
                },
                "BudgetYearFive": {
                    "val": "0.429"
                },
                "Total": {
                    "val": "21.272"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "5.191"
                },
                "CurrentYear": {
                    "val": "6.337"
                },
                "BudgetYearOneBase": {
                    "val": "3.392"
                },
                "BudgetYearOne": {
                    "val": "3.392"
                },
                "BudgetYearTwo": {
                    "val": "5.106"
                },
                "BudgetYearThree": {
                    "val": "0.396"
                },
                "BudgetYearFour": {
                    "val": "0.421"
                },
                "BudgetYearFive": {
                    "val": "0.429"
                },
                "Total": {
                    "val": "21.272"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "5.191"
                },
                "CurrentYear": {
                    "val": "6.337"
                },
                "BudgetYearOneBase": {
                    "val": "3.392"
                },
                "BudgetYearOne": {
                    "val": "3.392"
                },
                "BudgetYearTwo": {
                    "val": "5.106"
                },
                "BudgetYearThree": {
                    "val": "0.396"
                },
                "BudgetYearFour": {
                    "val": "0.421"
                },
                "BudgetYearFive": {
                    "val": "0.429"
                },
                "Total": {
                    "val": "21.272"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0207438F"
                },
                {
                    "val": "0305015F"
                },
                {
                    "val": "0305984F"
                }
            ]
        },
        "Description": {
            "val": "PE 0207438F, Theater Battle Management (TBM) C4I - P-40A\n1. Theater Battle Management Core System - Force Level (TBMCS FL): An integrated battle management system used to plan, execute, and assess an air campaign. It provides automated planning tools enabling consistent, coordinated battle management at both Air Operations Center (AOC) and non-AOC entities for operations and intelligence functions. TBMCS FL is a United States Air Force lead system with joint interest responsible for generation and dissemination of the Air Tasking Order (ATO) and inter-operates with allied units.\n\nIn FY 2021, TBMCS FL effort was transferred from PE 0305015F, C2 Air Operations Suite - C2 Information Services (C2AOS-C2IS), to PE 0207438, Theater Battle Management (TBM) C4I, in order to improve program transparency.\n\nPE 0305015F, C2 Air Operations Suite - C2 Info Services - P-40A\n2. TBMCS FL: An integrated battle management system used to plan, execute, and assess an air campaign. It provides automated planning tools enabling consistent, coordinated battle management at both AOC and non-AOC entities for operations and intelligence functions. TBMCS FL is a United States Air Force lead system with joint interest responsible for generation and dissemination of the ATO and inter-operates with allied units.\n\nIn FY 2021, TBMCS FL effort was transferred to PE 0207438, TBM C4I, from PE 0305015F, C2AOS-C2IS, in order to improve program transparency.\n\n3. Command and Control, Incident Management and Emergency Response Application (C2IMERA; formerly Unit Command and Control [UC2]) provides the wing and base commanders, and their battle staffs, with timely and accurate information for effective decision making. C2IMERA also provides a secure, automated, deployable, and distributed wing-level command and control system with connectivity to TBMCS.\n\nPE 0305984F, Personnel Recovery Command and Control (PRC2) - P40A\n4. Provides PRC2 services supporting all Combatant Commands, Joint Services and other government agencies. Capabilities include web-based access to isolated personnel reports for all Department of Defense (DoD) personnel, C2 tools for performing command and control of recovery efforts for downed airmen\/isolated ground troops, and rapid identification of personnel in distress. PRC2 is used within AOC\/Areas Of Responsibility (AOR), Joint Personnel Recovery Centers, and Rescue Coordination Centers to provide the capabilities and services for planning and executing recovery of isolated personnel, and rapidly collaborate, disseminate, and store time-sensitive personnel recovery information.\n\nFunding for this exhibit contained in PE 0207438F, PE 0305015F and PE 0305984F.\n\nThe FY 2021 funding request was reduced by $2.234 million to account for the availability of prior year execution balances."
        },
        "Justification": {
            "val": "PE 0207438F, Theater Battle Management (TBM) C4I - P-40A; $3.045 million\n1. TBMCS FL: Provides the Combined\/Joint Force Air Component Commander (C\/JFACC) with the automated tools necessary to effectively and efficiently plan, monitor, and execute the air campaign. This includes planning and issuing the ATO and Airspace Control Order (ACO) that ensure the theater commander's intent is supported through the application of airpower using the latest intelligence. FY21 funding will field TBMCS FL Capital Equipment Replacement (CER) to the systems to maintain security posture and field to more than 40 locations.\n\na. TBMCS FL PROGRAM MANAGEMENT ADMINISTRATION (PMA): FY21 funding includes provisions for government contract oversight, technical expertise, and program office support associated with the fielding of TBMCS FL.\n\nb. TBMCS FL FIELDING: FY21 funding will continue to support fielding of the TBMCS FL upgrades.\n\nc. TBMCS FL: FY21 funding will continue to be used to procure hardware and associated software licenses for fielding to various sites.\n\nPE 0305015F, C2 Air Operations Suite - C2 Info Services - P-40A; $0.000 million\n2. TBMCS FL: No FY21 funding requested.\n\n3. C2IMERA (formerly UC2): No FY21 funding requested.\n\nPE 0305984F, Personnel Recovery Command and Control (PRC2) - P40A; $0.347 million\n4. PRC2: Provides PRC2 services supporting all Combatant Commands, Joint Services and other government agencies. Capabilities include web-based access to isolated personnel reports for all DoD personnel, C2 tools for performing command and control of recovery efforts for downed airmen\/isolated ground troops, and rapid identification of personnel in distress. PRC2 is used within AOC\/AOR, Joint Personnel Recovery Centers, and Rescue Coordination Centers to provide the capabilities and services for planning and executing recovery of isolated personnel, and rapidly collaborate, disseminate, and store time-sensitive personnel recovery information.\n\na. PRC2 HARDWARE AND COTS SOFTWARE: FY21 funding will continue to procure various hardware pieces and associated software licenses for fielding to the 517th Software Engineering Squadron (SWES) Development Network (DevNet).\n\nb. PRC2 PMA: FY21 funding will provide for government program oversight, technical expertise, and program office support associated with the PRC2 fielding."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}