{
    "id": "2021-AirForce-PB-3010F-JBOOK-15bb579b423117a7d022b4b799e5cfe3d94f24567d65626f3558f79cc7a6e58f-15",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-AIRFORCE_AIRCRAFT_VOL1-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3010F",
        "appropriation_name": "Aircraft Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "PRDTB1"
        },
        "LineItemTitle": {
            "val": "MQ-9"
        },
        "P1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3010F"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Other Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Aircraft"
        },
        "ResourceSummary": {
            "Quantity": {
                "PriorYear": {
                    "val": "24"
                },
                "CurrentYear": {
                    "val": "24"
                },
                "Total": {
                    "val": "48"
                }
            },
            "TotalCost": {
                "PriorYear": {
                    "val": "401.603"
                },
                "CurrentYear": {
                    "val": "468.6"
                },
                "BudgetYearOneBase": {
                    "val": "29.409"
                },
                "BudgetYearOneOCO": {
                    "val": "142.49"
                },
                "BudgetYearOne": {
                    "val": "171.899"
                },
                "BudgetYearTwo": {
                    "val": "65.052"
                },
                "BudgetYearThree": {
                    "val": "65.565"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "1172.719"
                }
            },
            "UnitCost": {
                "PriorYear": {
                    "val": "16.733"
                },
                "CurrentYear": {
                    "val": "19.525"
                },
                "Total": {
                    "val": "24.432"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "401.603"
                },
                "CurrentYear": {
                    "val": "468.6"
                },
                "BudgetYearOneBase": {
                    "val": "29.409"
                },
                "BudgetYearOneOCO": {
                    "val": "142.49"
                },
                "BudgetYearOne": {
                    "val": "171.899"
                },
                "BudgetYearTwo": {
                    "val": "65.052"
                },
                "BudgetYearThree": {
                    "val": "65.565"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "1172.719"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "401.603"
                },
                "CurrentYear": {
                    "val": "468.6"
                },
                "BudgetYearOneBase": {
                    "val": "29.409"
                },
                "BudgetYearOneOCO": {
                    "val": "142.49"
                },
                "BudgetYearOne": {
                    "val": "171.899"
                },
                "BudgetYearTwo": {
                    "val": "65.052"
                },
                "BudgetYearThree": {
                    "val": "65.565"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "1172.719"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "48.248"
                },
                "CurrentYear": {
                    "val": "110.012"
                },
                "BudgetYearOneBase": {
                    "val": "47.396"
                },
                "BudgetYearOne": {
                    "val": "47.396"
                },
                "BudgetYearTwo": {
                    "val": "49.212"
                },
                "BudgetYearThree": {
                    "val": "41.974"
                },
                "Total": {
                    "val": "296.842"
                }
            },
            "FlyawayUnitCost": {
                "PriorYear": {
                    "val": "15.883"
                },
                "CurrentYear": {
                    "val": "17.41"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0304260F"
                },
                {
                    "val": "0305206F"
                },
                {
                    "val": "0305219F"
                }
            ]
        },
        "Description": {
            "val": "FY19 funding totals include $265.700M appropriated for OCO.\nFY20 funding totals include $376.440M appropriated for OCO.\n\nOCO funds 16 of the 24 aircraft in FY19 to support lifecycle sustainment and projected attrition\/combat loss numbers.\nOCO funds 21 of the 24 aircraft in FY20 to support lifecycle sustainment and projected attrition\/combat loss numbers.\n\nMQ-9 Reaper procurement includes all components of the MQ-9 weapon system. The basic MQ-9 Reaper system consists of the aircraft, sensors, a Ground Control Station (GCS), communications equipment, weapon kits, support equipment, simulator and training devices, technical data\/training, and personnel required to operate, maintain, and sustain the system. The system is designed to be modular and open-ended. Mission-specific equipment is employed in a plug-and-play mission kit concept allowing specific aircraft and GCS configurations to be tailored to fit mission needs.\n\nThe MQ-9 Reaper aircraft is a single-engine, turbo-prop Remotely Piloted Aircraft (RPA) designed to operate over-the-horizon at medium-to-high altitudes for long endurance sorties. The aircraft is primarily designed for critical emerging Time-Sensitive-Targets (TST) as a radar, Electro-Optical\/Infra-Red (EO\/IR), and laser designator-based attack asset with on-board hard-kill capability (hunter-killer) while performing Intelligence, Surveillance, Reconnaissance and Target Acquisition (ISR TA). In the hunter-killer role, the aircraft employs fused multi-spectral sensors to find, fix, and track ground targets and assess post-strike results using Automatic Target Cueing (ATC), Target Location Accuracy (TLA), Metric Sensor, and other capabilities. \n\nThe GCS functions as the aircraft cockpit and can control the aircraft from either within Line-of-Sight (LOS) or Beyond Line-of-Sight (BLOS) via a combination of satellite relay and terrestrial communication architectures. The GCS is either mobile to support forward operating locations or fixed at a facility to support Remote Split Operations (RSO). The GCS has the capability to perform mission planning functions; provides a means for manual and\/or autonomous command and control; allows personnel to launch, recover, and monitor aircraft, payloads, and the system's communications status; secure data links to receive payload sensor data and command links; monitor threats to the aircraft; display common operational picture information; and provide support functions. Additionally, a Launch and Recovery GCS (LRGCS) allows for servicing, systems checks, maintaining, launching, and recovering aircraft under LOS control for hand-off to a mobile or fixed GCS. The GCS will continue to evolve and upgrade its capabilities to keep pace with MQ-9 system capabilities, Concept of Operations (CONOPS), and the missions they perform. Upgrades include new LINUX processors, high definition monitors, and ergonomic improvements. Future planned upgrades include integrating improved human-machine interfaces, open systems architecture, improved crew habitability, and multiple aircraft control. \n\nFlyaway cost subtotal includes GCS, Ground Data Terminals (GDTs), and Predator Primary Satellite Links (PPSLs), which are not procured in the same quantities as aircraft. Thus, the unit flyaway cost will fluctuate from year to year as different quantities of GCSs, GDTs, and PPSLs are procured.\n\nMQ-9s are procured sole-source with General Atomics-Aeronautical Systems Incorporated (GA-ASI). GA-ASI is responsible for the aircraft and Ground Control Station (GCS), Raytheon Company for the DAS-4 EO\/IR sensor, and L3 Communications for the operator simulator and satellite communication (SATCOM) infrastructure components. \n\nThis program has associated Research Development Test and Evaluation Air Force (AF) funding in Program Element (PE) 0205219F MQ-9 Reaper UAV.\n\nFunding for this exhibit is contained in PE 0205219F.\n\nFunding may be used to address Diminishing Manufacturing Sources (DMS) and Non-Recurring Engineering (NRE) issues.  MQ-9 will complete Bridge or Life of Type Buys (LOTB), to protect the production lines as long as such a procurement is more optimal than other DMSMS solutions.\n\nMQ-9 Integrated Program Review (IPR) was completed 11 Sep 2017, program ID Code is now A. A formal Full Rate Production (FRP) will not be completed due to the de facto production decision provided by continued funding beyond Low Rate Initial Production. Developmental specifications are being used for contracting."
        },
        "Justification": {
            "val": "A.  Production Line Shutdown - FY21 funding will be used for production line shutdown activities.\n\nB.  Training Device\/Simulator - FY21 funding procures brief\/debrief stations, local area network (LAN) cabinets, and other mission requirements to support aircrew training.  Simulator quantities are various configurations of Instructor Operator Stations (IOS) with mission coordination capabilities to support aircrew training. \n\nC.  Predator Primary Satellite Link (PPSL) - FY21 procures PPSL hardware for aircraft and GCS operations.\n\nD.  DMS - FY21 funding will be used for DMSMS solutions to include but not limited to bridge or life of type buys."
        },
        "MDAPCode": {
            "val": "424"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "MQ-9"
                    },
                    "IdCode": {
                        "val": "A"
                    },
                    "Remarks": {
                        "val": "Aircraft procurement ends in FY20. Production line shutdown is funded starting in FY21.\n\nThe Minimum Sustaining Rate (MSR) for the MQ-9 is 16 aircraft. Reduced quantities below the economic order quantity result in increased unit costs. \n\nGround Control Station (GCS) & Government Furnished Equipment (GFE) - The GCS functions as the aircraft cockpit and can control the aircraft from either within Line-of-Sight (LOS) or Beyond Line-of-Sight (BLOS) via a combination of satellite relay and terrestrial communication architectures. GCSs are used primarily to support Remote Split Operations (RSO) from Continental United States locations. Block 30 GCS procurement began in FY15 and ended in FY18. Air Combat Command (ACC) analysis has caused GCS quantities to change in year of execution based on need. \n\nFlyaway cost subtotal includes GCS, Ground Data Terminals (GDT), and Predator Primary Satellite Link (PPSL), which are not procured in the same quantities as aircraft. Thus, the flyaway cost will fluctuate from year to year as different quantities of GCSs, GDTs, and PPSLs are procured."
                    },
                    "ResourceSummary": {
                        "Quantity": {
                            "PriorYear": {
                                "val": "24"
                            },
                            "CurrentYear": {
                                "val": "24"
                            }
                        },
                        "TotalCost": {
                            "PriorYear": {
                                "val": "401.603"
                            },
                            "CurrentYear": {
                                "val": "468.6"
                            },
                            "BudgetYearOneBase": {
                                "val": "29.409"
                            },
                            "BudgetYearOneOCO": {
                                "val": "142.49"
                            },
                            "BudgetYearOne": {
                                "val": "171.899"
                            }
                        },
                        "UnitCost": {
                            "PriorYear": {
                                "val": "16.733"
                            },
                            "CurrentYear": {
                                "val": "19.525"
                            }
                        },
                        "NetProcurementP1": {
                            "PriorYear": {
                                "val": "401.603"
                            },
                            "CurrentYear": {
                                "val": "468.6"
                            },
                            "BudgetYearOneBase": {
                                "val": "29.409"
                            },
                            "BudgetYearOneOCO": {
                                "val": "142.49"
                            },
                            "BudgetYearOne": {
                                "val": "171.899"
                            }
                        },
                        "TotalObligationAuthority": {
                            "PriorYear": {
                                "val": "401.603"
                            },
                            "CurrentYear": {
                                "val": "468.6"
                            },
                            "BudgetYearOneBase": {
                                "val": "29.409"
                            },
                            "BudgetYearOneOCO": {
                                "val": "142.49"
                            },
                            "BudgetYearOne": {
                                "val": "171.899"
                            }
                        },
                        "InitialSpares": {
                            "PriorYear": {
                                "val": "48.248"
                            },
                            "CurrentYear": {
                                "val": "110.012"
                            },
                            "BudgetYearOneBase": {
                                "val": "47.396"
                            },
                            "BudgetYearOne": {
                                "val": "47.396"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Flyaway": [
                            {
                                "Name": {
                                    "val": "Flyaway End Item"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "MQ-9 Reaper Aircraft and GFE"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "PriorYear": {
                                                            "val": "24"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "24"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "PriorYear": {
                                                            "val": "381.193"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "406.34"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "PriorYear": {
                                                            "val": "15.883"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "16.931"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Production Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "1.13"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Mobile Ground Control Station and GFE"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "0.28"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Predator Primary Satellite Link (PPSL)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "10.1"
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "val": "9"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "9"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "PriorYear": {
                                                "val": "381.193"
                                            },
                                            "CurrentYear": {
                                                "val": "417.85"
                                            },
                                            "BudgetYearOneOCO": {
                                                "val": "9"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "381.193"
                                        },
                                        "CurrentYear": {
                                            "val": "417.85"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "9"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Other Government Costs (OGC)"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "20.41"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "13.52"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "15.2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "15.2"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Initial Spares\/Deployment Support Kits"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Support Equipment"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "14.88"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Training Device\/Simulator"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "12"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "11.15"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "11.15"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Production Shutdown"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "29.409"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "75.99"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "105.399"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "DMS"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "10.35"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "13.95"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "13.95"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "MQ-9 ECP's"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneOCO": {
                                                        "val": "17.2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "17.2"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "20.41"
                                        },
                                        "CurrentYear": {
                                            "val": "50.75"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.409"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "133.49"
                                        },
                                        "BudgetYearOne": {
                                            "val": "162.899"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Support End Item"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}