{
    "id": "2021-Army-PB-2034A-JBOOK-8ab8ef5e1c6c1bb089b01b4868627eb6838a82679e6f3e89c6d7dde168d3f35e-27",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-ARMY_AMMO-U_PROCUREMENT_JustificationBook_Army_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "1430E91901"
        },
        "LineItemTitle": {
            "val": "Non-Lethal Ammunition, All Types"
        },
        "P1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "50"
        },
        "BudgetSubActivityTitle": {
            "val": "Miscellaneous"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "7.62"
                },
                "PriorYear": {
                    "val": "2.81"
                },
                "Total": {
                    "val": "10.43"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "7.62"
                },
                "PriorYear": {
                    "val": "2.81"
                },
                "Total": {
                    "val": "10.43"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "7.62"
                },
                "PriorYear": {
                    "val": "2.81"
                },
                "Total": {
                    "val": "10.43"
                }
            }
        },
        "Description": {
            "val": "This budget line item procures Non-Lethal Ammunition, All Types.\n\n(E91505) CTG NL FIRING DEVICE: TASER, XP25\nThe Cartridge, NL Firing Device is a 25-foot single shot fired from the Launched Electrode Stun Device (LESD), which is a hand held device used for Electro-Muscular Incapacitation (EMI). LESD increases soldier survivability by allowing Soldiers to quickly incapacitate hostile personnel.  LESD enables Force Protection (FP) and enhances the security of personnel and materiel by allowing alternatives to lethal force.  This cartridge is a conducted energy weapon that delivers an incapacitating electrical shock capable of arcing through 2 inches of clothing. Maximum effective range is 15 feet. This item is Code A, approved for service use.\n\n(E86401) CTG 12 GA NL, EXT RG, MARK M1116\nThe M1116 is a 12 gauge non-lethal cartridge that provides target marking capability at an extended range of 30-50m. It utilizes a drag stabilized tear-shaped bag with fluorescent green marking powder to deliver its marking capability. It can be fired from Army standard shotguns, and provides blunt force trauma to stop, confuse, disorient, or deter a potential threat.   The M1116 increases soldier survivability by allowing Soldiers to quickly mark and deter hostile personnel.  M1116 enables Force Protection (FP) and enhances the security of personnel and materiel by allowing alternatives to lethal force.  This item is Code A, approved for service use."
        },
        "Justification": {
            "val": "FY 2021 Base Budget supports critical Army Title 10 war reserve\/operational, training, and test requirements in accordance with Department of Defense Instruction 3000.04 (Munitions Requirements Process) and Army Regulation 5-13 (Total Army Munitions Requirements Process and Prioritization System).  War reserve requirements support Office of the Secretary of Defense (OSD)-approved Combatant Commander Operational Plans, Homeland Defense, and other OSD-directed missions.  Training requirements support individual and collective training of Active and Reserve Component forces at Army schools, home station, and the combined training centers.  Test requirements support the development, fielding, safety, and quality assurance of Army munitions and equipment throughout their life-cycle.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\n\n(E91505) Ctg, NL Firing Device: Taser XP25 f\/X26E Taser\nThis is a training standard item used in both training and combat.  There is no FY 2021 funding request.\nTYPE CLASSIFICATION DATE: August 2011\n\n(E86401) Ctg, 12G, Non-Lethal, Ext RG, Marking M1116 Series\nThis is a training standard item used in both training and combat. There is no FY 2021 funding request.\nTYPE CLASSIFICATION DATE: October 2015"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}