{
    "id": "2021-Navy-PB-1109N-MJBOOK-0-0-387299c8d3345c1328c53c3aecc95f283208355ac9b563faa2f445e0599764f2-43",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-NAVY_MARINECORPS-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@suppressOutfittingDeliveryBY2ToBY5": "true",
        "LineItemNumber": {
            "val": "6522"
        },
        "LineItemTitle": {
            "val": "Field Medical Equipment"
        },
        "P1LineNumber": {
            "val": "48"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "3"
        },
        "BudgetSubActivityTitle": {
            "val": "General Property"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "33.723"
                },
                "CurrentYear": {
                    "val": "2.898"
                },
                "BudgetYearOneBase": {
                    "val": "4.187"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.187"
                },
                "BudgetYearTwo": {
                    "val": "10.159"
                },
                "BudgetYearThree": {
                    "val": "5.115"
                },
                "BudgetYearFour": {
                    "val": "5.217"
                },
                "BudgetYearFive": {
                    "val": "10.741"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "33.723"
                },
                "CurrentYear": {
                    "val": "2.898"
                },
                "BudgetYearOneBase": {
                    "val": "4.187"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.187"
                },
                "BudgetYearTwo": {
                    "val": "10.159"
                },
                "BudgetYearThree": {
                    "val": "5.115"
                },
                "BudgetYearFour": {
                    "val": "5.217"
                },
                "BudgetYearFive": {
                    "val": "10.741"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "33.723"
                },
                "CurrentYear": {
                    "val": "2.898"
                },
                "BudgetYearOneBase": {
                    "val": "4.187"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.187"
                },
                "BudgetYearTwo": {
                    "val": "10.159"
                },
                "BudgetYearThree": {
                    "val": "5.115"
                },
                "BudgetYearFour": {
                    "val": "5.217"
                },
                "BudgetYearFive": {
                    "val": "10.741"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206623M"
                }
            ]
        },
        "Description": {
            "val": "Family of Field Medical Equipment (FFME) is the sole organic medical capability for the Marine Corps, and is comprised of multiple and modular capabilities that provide the full spectrum of healthcare and life saving equipment on the battlefield.  FFME provides medical equipment and supplies to medical units.  This program's objective is to plan for lifecycle replacements and upgrades while also modernizing equipment in order to provide the most effective medical care for Marine and Sailors in any mission. Some items will replace current line items within the Authorized Medical Allowance Lists (AMAL) and provide increases in performance characteristics, and other items represent new, emerging technology not currently included in fielded capabilities which will provide improved clinical outcomes. \n\nFamily of Field Medical Equipment (FFME) is comprised of items such as:\n\nThe Authorized Medical Allowance List (AMAL) modernization is comprised of numerous assemblages required to support current standards of care and treatment protocols while enhancing capabilities for battlefield casualties such as: The Expeditionary Medical Refrigeration Unit (EMRU), Patient Active Warming System, Infrascanner Intracranial Pressure (ICP), Bloodborne Pathogen Test Kit, Expeditionary Portable Oxygen Generation System and the Acute Care Cover for Severely Injured Limbs.\n\nThe Forward Resuscitative Surgery System (FRSS) provides Level I and II Health Service Support (HSS). The FRSS is a highly mobile, rapidly deployable, trauma surgical unit that provides emergency surgical interventions to stabilize casualties that might otherwise die or lose limbs before reaching treatment. The FRSS is the lightest and most mobile of the Marine Corps HSS elements capable of providing trauma surgical care. The FRSS is modular, rapidly transportable and deployable by air or surface means. Included in the FRSS are medical materials, a shelter, ancillary equipment, and mobile electric power.\n\nThe Battalion Aid Station (BAS) AMAL provides the equipment necessary to support a BAS manned by a Medical Officer, a Physician Assistant and the Hospital Corpsman assigned to a Battalion or Squadron.  One BAS AMAL provides initial resuscitative and stabilizing care for 50 surgical patients with major wounds. The BAS AMAL is scalable, expeditionary and employed to provide immediate pre-surgical resuscitation and stabilization of patients with battle injuries prior to transport to higher echelons of care. The BAS AMAL is rugged enough to survive rough handling and austere environments. Equipment and material contained in the BAS AMAL is similar to that used in garrison medical clinics and in FFME kits organic to supported units. \n\nThe Sick Call AMAL provides medical personnel with 30 days of equipment to treat 300 deployed Marines and Sailors for Disease and Non-Battle Injuries (DNBI).  The Sick Call AMAL can be deployed independently or used to augment the BAS. The Sick Call AMAL is light, mobile, and capable of providing Level One Health Service Support (HSS) and it is ruggedized to survive rough handling and austere environments. Equipment and material contained in the Sick Call AMAL is similar to that used in garrison medical clinics and in FFME kits organic to supported units.\n\nThe Shock Trauma Platoon (STP) AMAL provides equipment to perform initial resuscitative care for 50 non-surgical combat casualties for 30 days and establish 10 post trauma care patient holding litters for up to 48 hours.  When co-located with the Forward Resuscitative Surgery System AMAL 645, the STP becomes a triage center and pre\/postoperative care ward.  STPs provide patient medical support for Surgical Companies deployed in its Area of Responsibility (AOR) or can be deployed independently to provide trauma resuscitation capabilities beyond that of the BAS. The AMALs are staffed by a mix of Emergency Medicine, Family Practice and support staff and the capabilities are scalable, rugged, easily transported and operate reliably in expeditionary environments.\n\nThe En Route Care System (ERCS) provides equipment for the care of two critically injured\/ill, but stabilized casualties in a theater operations for up to a two hour medical evacuation (MEDEVAC) flight from a field treatment facility to the next higher echelon of medical care. The ERCS is a modular system that includes medical equipment, medical treatment protocols and supplies. \n\nThe Acute Care Ward AMAL provides the equipment necessary to support six cots and four critical care beds for up to 72 hours for each patient or 50-bed days total. The AMAL is scalable, rugged and operates reliably in expeditionary environments, provide medical equipment and supplies to perform clinical procedures for patient conditions for the Acute Care Ward for the first 30 days of deployment.  The Acute Care Ward AMAL is employed within the Surgical Company and represents the primary patient holding capacity within the USMC medical capability portfolio.  It is expected that the demand for this capability may increase in AORs that require distributed operations, have long evacuation distances, and have denied air space. \n\nPreventive Medicine AMALs contain the equipment necessary to provide technical preventive medicine advice, inspect food service operations, waste disposal, water potability vector control and surveillance, field sanitation, heat\/cold injury prevention and disease surveillance and control measures for communicable diseases for 30 days.  This AMAL is deployed with the Preventive Medicine Technician, Environmental Officer, or Industrial Hygiene Officer and is critical to the combat effectiveness in austere environments where personnel can be exceptionally susceptible to diseases and illnesses endemic to areas US forces are not frequently located.\n\nDigital Radiography Equipment program (AMAL 627) provides radiological capability to surgical trauma platoons to diagnose injuries and medical abnormalities. AMAL 627 contains equipment to support one x-ray machine and develop x-rays. The x-ray unit is a compact, mobile and lightweight system that enables all imaging functions to be performed at the point of patient care. The unit is comprised of a low capacity x-ray and a digitally computed radiographic (CR) reader, which scans the x-ray plates and displays the images on a laptop computer. The unit can be broken down into components for transportation and storage. It is operable and maintainable under all conditions of altitude, climate and terrain.\n\nThe Laboratory AMAL provides the equipment to perform hematology, blood chemistry, urinalysis, blood banking, microbiology, and other miscellaneous laboratory tests essential to support a field medical facility treating casualties requiring surgery and trauma resuscitation.  Laboratory AMALs are also used for the identification of non-battle related diseases which historically have claimed as many or more lives than combat itself and also has the potential to render troops non-combat effective due to illness.  Further, it provides the capability to establish a blood bank for immediate supply of blood products to treat combat casualties during mass-casualty events.\n\nThe Short Range Casualty Evacuation (CASEVAC) AMAL provides the Marine Corps with the capability to provide medical treatment during the air or ground evacuation of injured\/ill personnel from the point of injury to a Surgical Company. The system provides the equipment and supplies necessary to provide care for up to eight patients, one critically injured\/ill casualty, five other litter patients and two ambulatory patients for up to two hours flight time.\n\nThe Field Dental Operatory Authorized Dental Allowance List (ADAL) provides dental services to the Marine Expeditionary Force (MEF). In an operational environment, the Dental Battalion's primary mission is to provide dental health maintenance with a focus on emergency care. ADALs contain equipment required by dentists and their technicians to perform dental procedures on Marines in an expeditionary environment and can be broken down into component sets or scaled down to fit the size and mission of the deploying unit. The ADAL is primarily designed for standalone dental treatment, but can be used in conjunction with other AMALs."
        },
        "Justification": {
            "val": "FY 2019: $33.723M; BLI 6522 New Start FY 2019. Funding procures improved and modernized equipment for AMALs such as the Laboratory AMAL and the Acute Care Ward Equipment. Equipment procurements for these blocks will increase performance, reduce power requirements, and improve expeditionary capabilities to better support changes in USMC CONOPS for distributed operations. Funding will also procure equipment such as the Expeditionary Medical Refrigeration Unit (EMRU) which will replace the current Hemacool Refrigeration Unit currently employed in the Laboratory, Forward Resuscitative Surgery System (FRSS) and Shock Trauma Platoon (STP) AMALs. Equipment such as the EMRU will provide significant increases in performance, using less than half of the current power than the Hemacool and able to run on batteries for more than twice the amount of time as the Hemacool (up to 48 hours), greatly improving the expeditionary capabilities of the supported AMALs. The EMRU expands clinical refrigeration capabilities beyond just blood products as it can be used for extended transport and storage of vaccines and reagents. Additionally, the EMRU uses new technology with Environmental Protection Agency (EPA) compliant gases and will not require the R-134a refrigerant used in the Hemacool which will be phased out by the EPA in FY19. Funding will procure critical shortfalls of Class VIII Medical Equipment Sets required in the USMC Prepositioning Objective (PREPO) which support two major Operation Plans (OPLANs). Currently, there are no surgical AMALs in PREPO as a result of the obsolescence and disposal of the Main Operating Room AMALs which presents a significant capability gap for medical support in major combat operations. The FY19 funds will close that gap entirely by procuring FRSS AMALs. There are no patient movement equipment AMALs in PREPO at this time; current OPLANs require the USMC to have the ability to move critically injured personnel and post-surgical patients both from the point of injury, and the forward deployed surgical site locations to the next echelon of medical care as detailed in Joint Publication 4-02. The FY19 funds will close that gap entirely by procuring En Route Care System (ERCS) AMALs. USMC policy designates Class VIII material as War Reserve Material (WRM) and aside from the capabilities maintained in the PREPO Program, there is a critical shortfall in WRM stocks which cannot be rapidly procured and configured on short notice. Currently each MEF maintains 15 Days of Supply (DOS) and the USMC Logistics Command (LOGCOM) does not maintain Class VIII War Reserve Material and Contingency Preparedness equipment sets and supplies for the Operating Force (OPFOR). The OPFOR (I and II MEF) have determined there are significant AMAL shortfalls across all AMAL types for the purpose of providing medical support for rapid, large scale deployments. Therefore, the MEFs must increase their AMAL stocking levels held in a contingency status in order to have the ability to rapidly deploy the medical capabilities required to support two concurrent, full Marine Expeditionary Brigades. FY19 funds will provide the initial issue of AMALs which will close this gap and significantly increase readiness.\n\nFY 2020: $2.898M procures improved and modernized equipment for AMALs such as the ERCS and Short Range Casualty Evacuation (CASEVAC), as well as the Field Dental Operatory ADAL. The ERCS AMAL provides the capability to AERO-MEDEVAC critical casualties and post-surgical patients with critical portable patient life support systems to the next echelon of care such as an Expeditionary Medical Facility, Army Combat Hospital, or Hospital Ship afloat. The CASEVAC AMAL provides the capability to rapidly evacuate patients from the point of injury on the battlefield, to a higher level of care such as the STP and FRSS Team.  The Field Dental Operatory ADAL provides the capability to perform critical field surgical dentistry in combination with Trauma Resuscitative and Forward Surgical care, or as an independent capability which can significantly improve forward deployed readiness through treatments that can prevent MEDEVACs and keep troops in the fight. Equipment procurements for these blocks will increase performance, reduce power requirements, and improve expeditionary capabilities to better support changes in USMC CONOPS for distributed operations. Funding will procure equipment to support the Chemical Biological Incident Response Force capability to rapidly respond to incidents in the National Capital Region within mere hours of an occurrence, and also provides a pre-staged capability in support of planned efforts where an elevated readiness posture is required.  Funding will also procure equipment such as the Expeditionary Portable Oxygen Generation System (EPOGS) which will replace the aging Portable Oxygenation Generation System (POGS) with a lighter, smaller, and more capable system that produces a higher concentration of oxygen which is a critical requirement to forward expeditionary medical care.  Funding will also procure equipment such as Foldable High G-force Resistant Patient Litter (FHGRPL) which will replace the currently fielded TALON-3, which does not meet the recently approved Joint Patient Movement requirements for G-force resistance.  The FHGRPL will greatly improve patient survivability of hard aircraft landings and help address the difficulties associated with Ground CASEVAC over challenging, rough terrain. \n\nFY 2021 Base Appropriation: $4.187M procures improved and modernized Authorized Medical Allowance Lists such as the Biomedical Test and Repair Equipment, and the FRSS\/STP Equipment AMAL blocks.  The Biomedical Test and Repair AMALs are instrumental for the purpose of maintenance and repair for all of the other medical equipment sets fielded across the USMC.  As equipment is added to AMALs during the quadrennial modernization periods either as new technology or replacement items to address obsolescence, it is necessary to also procure proprietary tools, test and calibration equipment for preventive maintenance and repair of these new items.  Additionally, common use and expected replacement wear parts for fielded equipment sets must also be stocked, and it is in the Biomedical Test and Repair Equipment and Consumable blocks that this material will be stocked.  The FRSS is the only Role II Surgical capability utilized by the USMC and is a critical capability that is required in all OPLANs in which the USMC has an active combat role.  It is utilized by only the Medical Battalions, but can also be integrated and function in the joint environment.  It is doctrinally the primary casualty receiving point from the point of injury for patients requiring emergency damage control surgery to preserve life, limb and eyesight.  It is staffed and equipped for general and orthopedic surgery, as well as pre-operative care, with limited post-operative holding prior to medical evacuation to the next echelon of medical care.  The STP is staffed and equipped to serve as the USMC's only fielded emergency medicine and trauma resuscitation capability.  It is utilized by both the Medical Battalions and the Marine Expeditionary Units.  This capability is required in all OPLANs in which the USMC has an active combat role, and is most commonly planned for as a co-located capability with the FRSS.  Under this construct the collocated assets greatly enhance the casualty receiving and mass casualty treatment capability by means of enhanced triage, trauma resuscitation, and critical patient bed capacity, and short-term patient holding for MEDEVAC to the next echelon of medical care.  Additionally, the STP is afloat on the Marine Expeditionary Units and provides the Combatant Commanders a rapidly deployable advanced trauma resuscitation capability that supports the maneuver element ashore, as well as provides a breadth of capability across the full range of military operations, to include humanitarian assistance and disaster relief.\n\nFY20 to FY21 Increase ($1.289M):  Due to the nature and complexity of the equipment sets included in the FRSS and STP, as well as the pace at which medical technology is developed, these blocks require an additional $1.289M to fully modernize and replace anticipated obsolescent equipment, and other line items that original equipment manufacturers will no longer produce. FY21 funding aligns with the scheduled AMAL review cycle."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Field Medical Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Family of Field Medical Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "FY20 to FY21 Increase ($1.289M):  Due to the nature and complexity of the equipment sets included in the FRSS and STP, as well as the pace at which medical technology is developed, these blocks require an additional $1.289M to fully modernize and replace anticipated obsolescent equipment, and other line items that original equipment manufacturers will no longer produce. FY21 funding aligns with the scheduled AMAL review cycle.",
                                                "val": "1.1) Authorized Medical Allowance List (AMAL) - Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "16.849"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.354"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.465"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.465"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.2) Acute Care Ward Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.514"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.3) Laboratory - Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.249"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.4) En Route Care System (ERCS) - Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "6"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.5"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.5) Field Dental Operatory - ADAL Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.02"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.544"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.6) Short Range Casualty Evacuation (CASEVAC) - Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.5"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.7) Forward Resuscitative Surgery System (FRSS) - Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "6.5"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.222"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.222"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.8) Shock Trauma Platoon (STP) - Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1.591"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.5"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "33.723"
                                        },
                                        "CurrentYear": {
                                            "val": "2.898"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.187"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.187"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "33.723"
                            },
                            "CurrentYear": {
                                "val": "2.898"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.187"
                            },
                            "BudgetYearOne": {
                                "val": "4.187"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}