{
    "id": "2021-Army-PB-2031A-JBOOK-aa0816b56f96b34819fd36fa5a36cb7659e6a165246ea98a667445a091c8aa1d-28",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-ARMY_AIRCRAFT-U_PROCUREMENT_JustificationBook_Army_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2031A",
        "appropriation_name": "Aircraft Procurement, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "9555A00018"
        },
        "LineItemTitle": {
            "val": "RQ-7 UAV MODS"
        },
        "P1LineNumber": {
            "val": "33"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2031A"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Modification of Aircraft"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Modification of Aircraft"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "2065.395"
                },
                "PriorYear": {
                    "val": "154.114"
                },
                "CurrentYear": {
                    "val": "68.983"
                },
                "Total": {
                    "val": "2288.492"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "2065.395"
                },
                "PriorYear": {
                    "val": "154.114"
                },
                "CurrentYear": {
                    "val": "68.983"
                },
                "Total": {
                    "val": "2288.492"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "2065.395"
                },
                "PriorYear": {
                    "val": "154.114"
                },
                "CurrentYear": {
                    "val": "68.983"
                },
                "Total": {
                    "val": "2288.492"
                }
            }
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0305204A"
                },
                {
                    "val": "0305233A"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "150.114"
                                },
                                "CurrentYear": {
                                    "val": "66.983"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Army National Guard"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "4"
                                },
                                "CurrentYear": {
                                    "val": "2"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "154.114"
                    },
                    "CurrentYear": {
                        "val": "68.983"
                    }
                }
            }
        },
        "Description": {
            "val": "The Tactical Unmanned Aircraft System (TUAS) provides Army Brigade Combat Teams, Aviation Brigades, and Special Operation Groups situational awareness, improved wide-area target acquisition, Laser Designation, and high value target (HVT) tracking to conduct both shaping and decisive operations with greatly increased lethality. The TUAS meets the need for a day\/night, multi sensor collection system with improved connectivity to joint forces that provides real time battle information that cannot be observed from standoff airborne sensor systems, ground collection systems, and scouts. The key performance parameters are blocked into RQ-7B (production) thresholds and subsequent upgrade objectives. The RQ-7B system is a Reconnaissance Surveillance Target Acquisition (RSTA), Command, Control, Communications, and Intelligence (C3I) system that supports Brigade, Battalion, and lower level elements. The RQ-7B Shadow has logged approximately 1,225,000 flight hours, most of which were flown in support of Overseas Contingency Operations (OCO).\n\nThe TUAS RQ-7B completed production of 104 Army systems in 2011 (FY 2009 Funding) and entered a modifications phase. These modifications primarily include RQ-7B v2, System Modifications, the RQ-7B v2 Block III System Modification and the improved Electro Optical \/ Infrared \/ Laser Designator (EO\/IR\/LD) payload.\n\nThe RQ-7B v2 or Shadow v2 effort incorporates Type 1 Encryption, STANAG 4586 Compliant Software, a Universal Ground Control Station (UGCS), a Universal Ground Data Terminal (UGDT), a STANAG 4586 compliant Portable Ground Control Station, and standardizes modifications introduced during the wars in Iraq and Afghanistan. The last Shadow v2 delivery is currently scheduled in 4th Quarter FY2020.\n\nThe RQ-7B v2 Block III System Modification includes Weatherization, Small Mission (SMC) Computer A-kit, Electro Optical \/ Infrared \/Laser Designator (EO\/IR\/LD) Universal Interface Assembly, Block III Engine, Communications Relay Installation Kit, and Voice over Internet Protocol (VoIP). Weatherization modifications allow the AV to fly in low visibility conditions and in up to two inches of rain per hour. The SMC is an onboard computer that provides airborne processing power. The SMC addresses obsolescence concerns, features a dual processor, and also contains 50x more processing power than the current computer.\nThe EO\/ IR\/LD Universal Interface Assembly eliminates reliance on a proprietary payload interface, introducing the capability to support payloads from multiple vendors. The Block III engine improves reliability over the current engine, increases thrust and reduces the noise signature of the Shadow system. The Communication Relay upgrade will enable voice communications to additional users who utilize other waveforms in the VHF and UHF bands. The VoIP upgrade will extend voice communications range from 85 km to 125 km, and will also provide a more reliable means of voice communications. The overall performance enhancements increase the Shadow's mission capability and survivability.\nThe Improved EO\/IR\/LD payload features a modular design that includes enhanced high-resolution HD imagery, improved geo-location precision and an extended long-range target designation capability.\n\nOn 16 Nov 17, the Army Acquisition Executive (AAE) approved an increase to the Shadow Army Acquisition Objective (AAO) from 104 to 115 Shadow systems which provides additional capability in the Combat Aviation Brigades (CABs). \n\nChanged the P-Form Modification structure to comply with MIL-STD-881C, align with the R-Forms, and align with ACAT-I reporting requirements. The OSRVT Modification moved to Modification Line A00121 in 2017.\n."
        },
        "Justification": {
            "val": "President's Budget 2021 submission for RQ-7 UAV MODS is zero ($0).\n\nIn accordance with Section 1815 of the FY2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\n\n\nFY2020 Shadow OCO Procurement Funding of $60.0 M will be utilized for the following:\nBlock III Air Vehicles (minus payload)   26 ea.     40,800 \nMX-10 G4 Payloads                              26 ea.     13,000 \nBoresight Tools                                     13 ea.       1,200 \nExpeditionary Kits                                       2 ea.       2,400 \nPM                                                                         2,600"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}