{
    "id": "2021-AirForce-PB-3021F-MJBOOK-0-0-c133b5c69c0dacb3cfbca25b78206ead128e9faae1b5290eac9bb261214046ee-10",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-AIRFORCE_SPACE-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3021F",
        "appropriation_name": "Space Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "MC0MSE"
        },
        "LineItemTitle": {
            "val": "Spaceborne Equip (Comsec)"
        },
        "P1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3021F"
        },
        "AppropriationTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "28.478"
                },
                "CurrentYear": {
                    "val": "32.031"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "60.509"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "28.478"
                },
                "CurrentYear": {
                    "val": "32.031"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "60.509"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "28.478"
                },
                "CurrentYear": {
                    "val": "32.031"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "60.509"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "Space Communications Security (COMSEC) procures cryptographic products to operate in the space environment and for ground nodes that link to space assets. Space COMSEC equipment is a foundational element in achieving Air Force space and information superiority. Space COMSEC provides cybersecurity (confidentiality and integrity) for DOD satellite platforms. Space COMSEC is an enabler for space system compliance with DoDI 8581.01 - Information Assurance (IA) Policy for Space Systems Used by the Department of Defense. Space COMSEC mission provides communications security products and lifecycle sustainment support to all DoD satellite systems and commercial systems supporting DOD missions. Secure communication allows the DoD to achieve and maintain decision superiority, the key to successful application of the military instrument of national power in modern, high-tempo, full-spectrum operations. Space COMSEC equipment protects information such as warfighter positions, mission planning, target strikes, commanders' orders, intelligence, force strength, and force readiness and ensures adversaries cannot interpret, manipulate, or destroy information. When an adversary is capable of interpretation, manipulation, or destruction of the information used by the warfighter, DoD military forces will suffer significant and\/or devastating mission degradation that can result in loss of life and resources and\/or exceptionally grave damage to national security. Space COMSEC enables secure Command and Control (C2) of satellites and prevents unauthorized access and destruction. It enables secure transmission of satellite systems' health and status telemetry data (satellite health and relative orbital position) to ground control stations, thus protecting critical information about the capabilities of DoD satellite systems. The capability of a system must be protected from an adversary to avoid exploitation of a system weakness\/limitation, knowledge of which could assist an adversary in a successful mission against DoD military forces. Space COMSEC also provides secure transmission of information collected by satellite sensors (mission data), which provides the warfighter an integrated view of the battle space. Space COMSEC provides for secure SATCOM, positioning, navigation, timing, weather, nuclear detection and early warning missions. Space COMSEC also enables Transmission Security (TRANSEC) for space platforms. Space COMSEC mission procures crypto end items and logistics elements to support developing and operational space systems. The Space Modular Common Cryptography (SMCC) Program of Record will procure a family of common cryptography (crypto) solutions that integrate Telemetry, Tracking, and Command (TT&C), Mission Data (MD), and TRANSEC key stream functions for the Air Force, Department of Defense (DoD), and Intelligence Community space systems. The SMCC requirements to procure cryptographic solutions are documented in the Capability Development Document (CDD) dated 21 August 2014. The SMCC Program's mission is to secure communication links and the data transmitted, incorporate standard interfaces that leverage existing technologies, provide a basis for future technologies, and design solutions that are scalable, upgradeable, and reconfigurable. \n\nFunding for this exhibit contained in program element (PE) 1203140F.  Starting in FY21 all Space Procurement funding moved from APPN 3021 to APPN 3022 (Space Force).  SPACE PROCUREMENT AF BSA 1 is now SPACE FORCE BSA 10 starting in FY21."
        },
        "Justification": {
            "val": "1. Space Communications Security (COMSEC): Procures cryptographic products to operate in the space environment and for ground nodes that link to space assets. Funding provides for the production of Space COMSEC products to meet developing and operational space program needs. Space COMSEC products include End Crypto Units (ECU), Embedded Solutions (ES), TRANSEC and ancillaries. Due to low volume production quantities and high reliability design, Space COMSEC products can range in price from $10K per unit to $2M per unit. As a commodity item, Space COMSEC procures standard crypto products which enable minimized lifecycle footprints. Space COMSEC procures from multiple crypto vendors; however, with the low volume consumption by space programs, the space crypto industry base is less than a dozen companies. Items procured during execution may change based on critical equipment needed to support current Air Force mission requirements. Contractor support costs are included as part of the Space COMSEC products funding line in order to provide for end item operational capability. \n\na. Logistics: FY21 funding provides for the production of Space COMSEC Logistics elements. Space COMSEC products typically have a 20 to 40 year lifecycle to support development, launch and operation of multiple Air Force and DoD space systems. Space COMSEC is provided as Government Furnished Equipment (GFE) to the space system developing contractors and operational ground stations. Space COMSEC products are high cost critical assets and are organically sustained to include component level maintenance exclusively by the Air Force. Logistics procures the necessary lifecycle sustainment elements required to meet the 40 year mission requirements. Logistics elements include, but not limited to, specialized test sets, certified training materials and courses, maintenance manuals, provisioning, spare components, and modifications. Contractor support costs are included as part of the Space COMSEC logistics funding line in order to provide for end item operational capability. \n\nb. Aerospace Vehicle Equipment (AVE) Products: FY21 funding provides Telemetry, Tracking, and Command (TT&C) cryptographic products to operate in the space environment. AVE provides the procurement of space qualified command up link algorithm embedment Application-Specific Integrated Circuits (ASICs).  \n\nc. Ground Operating Equipment (GOE) Products: FY21 funding provides cryptographic products for ground nodes that link to space assets. GOE provide the procurement of ground equipment with space qualified command encryption\/decryption ground equipment used for operational and developmental space systems (Telemetry, Tracking, and Command (TT&C) Mission Data and Satellite Communication (SATCOM) products).\n\n2. Space Modular Common Cryptography (SMCC): Reduces space programs development costs by providing a common, modular and upgradable cryptographic solution set. SMCC is fully endorsed by NSA as the preferred solution for all emerging National Security Space Systems. The SMCC Program will award a separate production contract to procure Common Crypto Solutions in FY21 for Air Force, DOD, and Intelligence Community Space Programs. FY21 funding provides for the production of SMCC for satellite programs such as GPS III. SMCC meets NSA mandated space algorithm transition\/modernization guidance to mitigate evolving threats\/vulnerabilities and will provide modernized cryptographic capabilities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}