{
    "id": "2021-Navy-PB-1109N-JBOOK-9cf80abb15b69f28c5680bbd610d6b63fb9c51c4c1f66cea677aec9a0d624efe-41",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@suppressOutfittingDeliveryBY2ToBY5": "true",
        "LineItemNumber": {
            "val": "6520"
        },
        "LineItemTitle": {
            "val": "EOD Systems"
        },
        "P1LineNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "6826.964"
                },
                "PriorYear": {
                    "val": "55.114"
                },
                "CurrentYear": {
                    "val": "48.37"
                },
                "BudgetYearOneBase": {
                    "val": "20.939"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "20.939"
                },
                "BudgetYearTwo": {
                    "val": "27.153"
                },
                "BudgetYearThree": {
                    "val": "56.212"
                },
                "BudgetYearFour": {
                    "val": "102.123"
                },
                "BudgetYearFive": {
                    "val": "104.166"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "6826.964"
                },
                "PriorYear": {
                    "val": "55.114"
                },
                "CurrentYear": {
                    "val": "48.37"
                },
                "BudgetYearOneBase": {
                    "val": "20.939"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "20.939"
                },
                "BudgetYearTwo": {
                    "val": "27.153"
                },
                "BudgetYearThree": {
                    "val": "56.212"
                },
                "BudgetYearFour": {
                    "val": "102.123"
                },
                "BudgetYearFive": {
                    "val": "104.166"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "6826.964"
                },
                "PriorYear": {
                    "val": "55.114"
                },
                "CurrentYear": {
                    "val": "48.37"
                },
                "BudgetYearOneBase": {
                    "val": "20.939"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "20.939"
                },
                "BudgetYearTwo": {
                    "val": "27.153"
                },
                "BudgetYearThree": {
                    "val": "56.212"
                },
                "BudgetYearFour": {
                    "val": "102.123"
                },
                "BudgetYearFive": {
                    "val": "104.166"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206211M"
                },
                {
                    "val": "0206313M"
                },
                {
                    "val": "0206623M"
                },
                {
                    "val": "0206315M"
                },
                {
                    "val": "0502511M"
                },
                {
                    "val": "0206624M"
                }
            ]
        },
        "Description": {
            "val": "ASSAULT BREACHER VEHICLE (ABV) is a tracked, armored combat engineer vehicle designed to breach minefields and complex obstacles and provide a deliberate and in-stride breaching capability. ABV consists of a rebuilt and upgraded M1A1 Tank chassis with the integration of Non-Developmental Items (NDI), which includes a Full-Width Mine Plow, a Dozer Blade, a Surface Mine Plow, a Rapid Ordnance Removal System, two M58 Linear Demolition Charges, a lane marking system and a self-defense weapon system. The ABV will provide crew protection and vehicle survivability while having the speed and mobility to keep pace with the maneuver force. The M1A1 Tank Chassis will provide economic supportability of the system through its commonality with the tank fleet and armor protection for survivability.\n\nFAMILY OF EOD EQUIPMENT (FEOD) is comprised of over forty Table of Authorized Material Control Numbers (TAMCNs) providing the required tools and capabilities to detect, locate, access, identify, triage, diagnose, stabilize, render safe, neutralize, recover, exploit, and dispose of unexploded explosive ordnance (UXO), improvised explosive devices (IED), and weapons of mass destruction (WMD).  The portfolio includes specialized diagnostic equipment, robotics and energetically actuated tools, which enable EOD to provide the Marine air-ground task force (MAGTF) and Marine Special Operations Forces with critical enabling capabilities that deliver responsive, scalable, strategic depth for special operations, crisis response, and littoral access.\n\nMARINE ELECTRONIC WARFARE GROUND FAMILY OF SYSTEMS (MEGFoS) provides interconnected electronic warfare systems for use at fixed sites, on tactical vehicles, and dismounted that will operate across a range of frequencies in order to provide the Marine Corps that ability to maneuver efficiently inside the electromagnetic spectrum.  MEGFOS provides the ability to protect friendly use of spectrum, sense all spectrum usage in an area of responsibility, and to target adversaries inside spectrum with the intent to deny, delay or degrade an adversary's decision making cycle.  MEGFOS also includes the ability to use spectrum for force protection to counter Radio Controlled Improvised Explosive Devices (RCIED) and Unmanned Aerial Systems.  MEGFOS is the follow on capability to MFEW and will begin developmental efforts in FY20 with production efforts beginning FY23. \n\nFAMILY OF COUNTER-IMPROVISED EXPLOSIVE DEVICE (C-IED) CAPABILITIES (F2C) provides capabilities not found in the current Joint land force structure to defeat explosive hazards and protect Marines and equipment while conducting route and area clearance operations. The Family of Counter-Improvised Explosive Device (C-IED) Capabilities (F2C) will enable Commanders to deliberately operate in explosive hazards environments by detecting and marking explosive hazards, enabling the Commanders to make timely and informed decisions to avoid the explosive hazards, or, if necessary, neutralize explosive hazards that impede their missions. Multiple detection and marking capabilities will detect a broader spectrum of explosive hazards and achieve higher overall effectiveness rates. Standoff and remote-controlled detection and marking capabilities will remove Joint forces from direct contact with explosive hazards and enhance force protection and the vehicles' system survivability. Operational speeds and rates will increase and better support the operational tempo (OPTEMPO) of the current and future force. ENFIRE is a digital surveying kit designed to collect and disseminate engineer-related information while minimizing exposure to enemy observation."
        },
        "Justification": {
            "val": "FY 2019: $47.114M\n\nFAMILY OF EOD EQUIPMENT: ($45.222M) Funding supported various tool kits and the following items: Video Inspection Capability (VIC) that consist of a video fiberscope that enables the inspection of contents and circuity of an IED in a small package with real time imagery. Expeditionary Radiographic Imaging Systems, a Radiographic X-Ray equipment that allows EOD technicians to determine the condition of a device\/munition without having to first gain physical access. Remote Fuze Disassembly kits, an EOD system that allows the EOD Marine to inert live ammunitions. Advanced Bomb Suit which protects EOD technicians from explosive hazards. Tactical Triage kit which includes Chemical, Biological, Nuclear, Radiological and Explosive (CBNRE) kits. Search kits which provides EOD Marines with specialized tools and equipment to perform interior and exterior search operation involving IED. Technician kits, SL-3 kits and IED Kits which provide the EOD Marine with the necessary tools and equipment to support render safe procedures and operations involving IED and WMDs. Table of Equipment plus up which supports the growth of two USMC EOD platoons, and Sensor Detectors. Buried Command Wire Detector (BCWD), a light weight and portable device that detects command wires of any diameter and type, in conductive and non-conductive soils, including laterite and magnetite. R2C Pacbot robot ECP to upgrade parts based on obsolesce issues. \n\nFAMILY OF COUNTER-IMPROVISED EXPLOSIVE DEVICE (C-IED) CAPABILITIES (F2C): ($1.891M) Funding supported procurement of Counter Improvised Explosive Device (C-IED) Capability (F2C) equipment. This procurement provides critical equipment such as Sickle Sticks; a long pole used to positively identify in placed explosive hazard and other F2C tools to detect and mark explosive hazards; provide standoff and remote-controlled detection and marking and remove operating forces from direct contact with explosive hazards.  \n\nASSAULT BREACHER VEHICLE MODIFICATION: ($0.001M) Funding supports ABV Lift Motor modernization efforts.\n  \nFY 2020: $44.700M \n\nFAMILY OF EOD EQUIPMENT: ($43.360M) Funding procures the following: Supply Stock Lists (SL-3), equipment to include Counter-Weapons of Mass Destruction kits. Mans Transportable Robotic System (MTRS) Incr II, robots that allow EOD Marines to investigate and conduct render safe procedures at a stand of distance. These modifications will allow the service life extension of the system. AN\/PVS-31 Optic Sight sustainment will allow the Marine Corps the ability to maintain and fix broken systems. Decrease of $1.862M from FY19 to FY20 is due to completion of mini robot procurement.\n\nASSAULT BREACHER VEHICLE MODIFICATION: ($1.340M) Funding supports ABV Lift Motor modernization efforts and initiate upgrades to mine plows allowing ABV sea to land loading and unloading, Field Service Representative (FSR) support, update Tech Manuals (TM), and Information Assurance (IA) support. Increase of $1.339M from FY19 to FY20 reflects realignment from Engineer Modification Kits (EMK) BLI 6670 supporting upgrades to mine plows, FSR support, TM updates and IA support.\n\nFY 2021 Base Appropriation Request: $20.939M\n\nFAMILY OF EOD EQUIPMENT: ($20.613M) Funding will support various tool kits and the following items: Littoral Explosive Ordnance Neutralization (LEON) robots, robots that allow EOD Marines to investigate and conduct render safe procedures in ocean\/sea under-water missions at a stand of distance. Mini-Mira, a system that detects active microwave, ultrasonic, and infrared signatures emitting from an IED or WMD device. Tactical Triage kit which includes Chemical, Biological, Nuclear, Radiological and Explosive (CBNRE) kits. PM Engineer Systems engineering, cybersecurity, logistical, fielding, and acquisition support. Remote Fuze Disassembly System (RFDS) kits, an EOD system that allows the EOD Marine to inert live ammunitions. Decrease of $22.747M from FY20 to FY21 is due to completion of BCWD and procuring majority of Mini-Mira AAO.\n\nASSAULT BREACHER VEHICLE MODIFICATION:  ($0.326M)  Funding will continue to support ABV ECPs, Field Service Representatives, and Information Assurance support. ECPs allow ABV modifications that enhance operational mission. Decrease of $1.014M from FY20 to FY21 results from completion of ABV Lift Motor modernization efforts.  FSRs are critical to maintain the operational readiness of the ABV Fleet, expert knowledge to advise the fleet on how to repair these low density assets.  ECPs are important to the platform to accomodate changes in command and control components and supporting equipment.\n\nOCO: \nFY 2019 OCO: $8.000M\n\nFAMILY OF COUNTER-IMPROVISED EXPLOSIVE DEVICE (C-IED) CAPABILITIES (F2C): ($8.000M) Procured Buried Command Wire Detector (BCWD), a light weight and portable hand held metal detector that detects command wires of any diameter and type, in conductive and non-conductive soils, including laterite and magnetite. The current hand held metal detector lacks the ability to detect or find command wires associated with buried IED's and leaves Marines to use visual acuity via eyesight or manual intrusive means vis Holley Stick or finger sweeping as a detection method to detect command wire. Manual techniques, without the aid of technological advances, increase the risk of life or limb loss to the operator. \n\nFY 2020 OCO: $3.670M.  \n\nFAMILY OF COUNTER-IMPROVISED EXPLOSIVE DEVICE (C-IED) CAPABILITIES (F2C): ($3.670M) Procures Buried Command Wire Detector (BCWD), a light weight and portable hand held metal detector that detects command wires of any diameter and type, in conductive and non-conductive soils, including laterite and magnetite. The current hand held metal detector lacks the ability to detect or find command wires associated with buried IED's and leaves Marines to use visual acuity via eyesight or manual intrusive means vis Holley Stick or finger sweeping as a detection method to detect command wire. Manual techniques, without the aid of technological advances, increase the risk of life or limb loss to the operator."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "EOD Systems"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Assault Breacher Vehicle (ABV)"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Decrease of $1.014M from FY20 to FY21 results from completion of ABV Lift Motor modernization efforts.",
                                                "val": "1.1) Assault Breacher Vehicle (ABV) Modification"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "7.092"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.001"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.34"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.326"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.326"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "7.092"
                                        },
                                        "PriorYear": {
                                            "val": "0.001"
                                        },
                                        "CurrentYear": {
                                            "val": "1.34"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.326"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.326"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Family of EOD Systems"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "EOD FY21 will support various tool kits and the following items: Littoral Explosive Ordnance Neutralization (LEON) robots, robots that allow EOD Marines to investigate and conduct render safe procedures in ocean\/sea under-water missions at a stand of distance. Mini-Mira, a system that detects active microwave, ultrasonic, and infrared signatures emitting from an IED or WMD device. Tactical Triage kit which includes Chemical, Biological, Nuclear, Radiological and Explosive (CBNRE) kits. PM Engineer Systems engineering, cybersecurity, logistical, fielding, and acquisition support. Remote Fuze Disassembly System (RFDS) kits, an EOD system that allows the EOD Marine to inert live ammunitions. Decrease of $22.747M from FY20 to FY21 is due to completion of BCWD and procuring majority of Mini-Mira AAO.",
                                                "val": "2.1) EOD Specialized Equipment and Tool Kits"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "196.955"
                                                    },
                                                    "PriorYear": {
                                                        "val": "43.137"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "43.36"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "16.023"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "16.023"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "EOD will be funding PM ES acquisition support starting in FY21 continuing to FY25 and potentially beyond.  Naval Surface Warfare Center, Panama City Division (NSWC-PCD) provides systems engineering, configuration management, system production on rebuild, and engineering logistics support for PM ES teams.  PM ES systems require support due to failures in the field, parts availability, systems engineering updates and production, and rebuild issues.",
                                                "val": "2.2) PM ES Acquisition Support"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "2.085"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.59"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.59"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "196.955"
                                        },
                                        "PriorYear": {
                                            "val": "45.222"
                                        },
                                        "CurrentYear": {
                                            "val": "43.36"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.613"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.613"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) Family of Counter-Improvised Explosive Device (C-IED) Capabilities"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) Counter-Improvised Explosive Devices (C-IED)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "9.891"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.67"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "9.891"
                                        },
                                        "CurrentYear": {
                                            "val": "3.67"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) Prior Years Cumulative Funding"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "4.1) Other Prior Year"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "6622.917"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "6622.917"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "6826.964"
                            },
                            "PriorYear": {
                                "val": "55.114"
                            },
                            "CurrentYear": {
                                "val": "48.37"
                            },
                            "BudgetYearOneBase": {
                                "val": "20.939"
                            },
                            "BudgetYearOne": {
                                "val": "20.939"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}