{
    "id": "2021-AirForce-PB-3022F-JBOOK-b7a269190fd98853a4e90104967db8a98889d1a1e63192896eaa4ce98445ff1a-1",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-SPACE-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3022F",
        "appropriation_name": "Procurement, Space Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "AFSCOM"
        },
        "LineItemTitle": {
            "val": "AF Satellite Comm System"
        },
        "P1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3022F"
        },
        "AppropriationTitle": {
            "val": "Procurement, Space Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Space Procurement, SF"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "BudgetYearOneBase": {
                    "val": "48.326"
                },
                "BudgetYearOne": {
                    "val": "48.326"
                },
                "BudgetYearTwo": {
                    "val": "49.317"
                },
                "BudgetYearThree": {
                    "val": "50.231"
                },
                "BudgetYearFour": {
                    "val": "51.136"
                },
                "BudgetYearFive": {
                    "val": "52.075"
                },
                "Total": {
                    "val": "251.085"
                }
            },
            "NetProcurementP1": {
                "BudgetYearOneBase": {
                    "val": "48.326"
                },
                "BudgetYearOne": {
                    "val": "48.326"
                },
                "BudgetYearTwo": {
                    "val": "49.317"
                },
                "BudgetYearThree": {
                    "val": "50.231"
                },
                "BudgetYearFour": {
                    "val": "51.136"
                },
                "BudgetYearFive": {
                    "val": "52.075"
                },
                "Total": {
                    "val": "251.085"
                }
            },
            "TotalObligationAuthority": {
                "BudgetYearOneBase": {
                    "val": "48.326"
                },
                "BudgetYearOne": {
                    "val": "48.326"
                },
                "BudgetYearTwo": {
                    "val": "49.317"
                },
                "BudgetYearThree": {
                    "val": "50.231"
                },
                "BudgetYearFour": {
                    "val": "51.136"
                },
                "BudgetYearFive": {
                    "val": "52.075"
                },
                "Total": {
                    "val": "251.085"
                }
            }
        },
        "Code": {
            "val": "B"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "1203110SF"
                }
            ]
        },
        "Description": {
            "val": "In FY 2021, P-1 Line Item AFSCOM \/ AIR FORCE SATELLITE CONTROL NETWORK SPACE efforts were transferred to Appropriation 3022, Procurement, Space Force, from Appropriation 3021 due to the creation of a new Appropriation for Space Force.\n\nThe Air Force Satellite Control Network (AFSCN) is a satellite ground terminal network comprised of two communication nodes (Schriever AFB & Vandenberg AFB) and 15 antenna systems. The antennas\n      are distributed around the world at seven locations -- Vandenberg Tracking Station (VTS), Diego Garcia Station (DGS), Guam Tracking Station (GTS), Hawaii Tracking Station (HTS), New Hampshire Tracking Station (NHS), Thule Tracking Station (TTS), and Telemetry and Commanding Station (TCS) at RAF Oakhanger, England -- to ensure global coverage for over 170 satellites in various orbits operating in a congested and contested environment. The AFSCN conducts an average of 490 satellite contacts per day supporting Positioning, Navigation and Timing (PNT); Intelligence, Surveillance and Reconnaissance (ISR); Missile Warning; Communications; Weather; and Research and Development (R&D) satellites for Department of Defense (DoD), Intelligence Community (IC), and National Aeronautics and Space Administration (NASA) operations. While most of the 450 satellite contacts\/day are routine command and control (C2) activities, the AFSCN is also used for satellite emergencies (e.g. tumbling satellite) because its high power antennas are often the only earthbound assets that can contact a non-responsive satellite to re-establish command & control. During FY 2019, the AFSCN supported 11 space vehicle emergencies resulting in the preservation of over $4.1B worth of satellites. In addition to routine and emergency satellite operations C2, the AFSCN provides support to launch vehicle and early orbit operations, ensuring worldwide antennas receive telemetry and transmit commands to newly orbiting satellites to initiate early orbit checkout. During FY 2019, the AFSCN supported 19 launches delivering $13.7B worth of satellites to their operational orbits. Finally, the AFSCN provides Factory Compatibility Testing (FCT) to ensure satellites and launch vehicles can communicate via the AFSCN before the satellite is launched. These funds are used to procure modernized equipment and SE&I for the AFSCN to ensure the capability is available to support DoD, Intelligence community, and civil users.  Funds may be used to address Diminishing Manufacturing Sources (DMS) issues, support Enterprise Ground Service (EGS), Commercial Augmentation, Multi-band & Phased Array and Cybersecurity Operations.\n      \n      Space acquisition must respond with speed and agility to emerging adversary threats.  Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture.  Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n      \n      Principal efforts include: \n      \n      AFSCN Interim Supply Support: procures support services, peculiar and common support materials, and required re-procurement data for the Consolidated Air Force Satellite Control Network Modifications, Maintenance and Operations (CAMMO) Contract, and to transition to government supply support.\n      \n      AFSCN Commodity  Procurement: The Air Force will use various contract vehicles to address the highest priority concerns\/issues.  Obsolescence and sustainment \"worst actors\" are prioritized annually in order of criticality to the mission. The potential for failed satellite contacts drives priority. In FY 2021, funds may be used to address Diminishing Manufacturing Sources (DMS) issues, support Enterprise Ground Service  (EGS), Commercial Augmentation, Multi-band & Phased Array and cybersecurity operations, and are planned to be used for required radome replacements, Defensive Cyber Operations activities and other Cyber security related projects. Other projects include: Boundary Defense, Electronic Schedule Dissemination (ESD) obsolescence, AFSCN test bed (ATB) replacements, continued cyber defense work, network automation, and Range\/Network\/Communication obsolescence replacements.  \n      \n      Remote Tracking Station (RTS) Block Change (RBC): The RBC Program was initiated in Dec 2001 to modernize the legacy system. The RBC program replaces legacy remote ground antenna systems that have reached end of life. To date, RBC systems have been installed at VTS, DGS, TCS, GTS, HTS, NHS, and TTS. TTS completed in 1Q FY 2016. In addition, the Air Force is upgrading the electronics in the remaining eight serviceable systems. This \"hybrid\" architecture couples the RBC electronics with existing antennas and normalizes electronics across the network. A prototype effort was implemented in FY 2012 to validate the approach and the first two hybrid articles were awarded in FY 2013 to upgrade legacy systems at GTS and HTS. HTS Hybrid was operationally accepted in July 2017. A third article was awarded in FY 2014 to upgrade the legacy system at VTS and funds were applied in FY 2015 to DGS, TTS and FY 2016 to NHS, and FY 2017 to TCS and the last antenna is scheduled at TCS in FY2022. This project is required to prevent a significant increase to sustainment costs and decrease in operational capability of the already obsolete Automated Remote Tracking Station (ARTS) system. There are several significant operational issues that must be corrected as soon as possible within the ARTS system and any delay to the RBC Hybridization of sites requires that ARTS be maintained and sustained well past its expected life. If RBC Hybridization is not sufficiently funded to keep ARTS operationally viable, the system will experience increased failure rates and lost contacts over time with the potential to impact or lose operational capability of on-orbit payloads that rely on the AFSCN for command and control. The antiquated AFSCN system is already operating at the very edge of its capacity supporting over 170 satellites. The RBC Hybridization project is intended to bring the system up to modern standards by FY 2026, and any delay in funding will push that completion date farther into the future, endangering additional satellite contacts and payloads. In addition, the Enhanced High Power Amplifier (EHPA) spacecraft anomaly resolution system will provide high power capability at four sites (GTS, VTS, NHS, and DGS), replaces obsolete parts, and  enables emergency satellite operations. The first article delivery of EHPA at GTS is scheduled to complete in FY 2019. The remaining EHPA procurements and deliveries (VTS, NHS, and DGS) will be executed as separate projects with the first two in FY 2020 and the third in future budget years.\n      \n      Funding for this exhibit contained in PE 1203110SF."
        },
        "Justification": {
            "val": "1) AFSCN Interim Supply Support (P-5): FY 2021 funding provides peculiar and common support material, required re-procurement data, and interim supply support management. In addition, funds procure the most urgently needed capital equipment replacements for items that exceed the O&M dollar threshold. This equipment replaces items such as, but not limited to, high power amplifiers, processors, archival event recorders, router switches, and firewalls, AFSCN Link Projection System (ALPS) equipment, legacy Electronic Scheduling Dissemination (ESD) equipment and Diminishing Manufacturing Sources and Material Shortages (DMSMS) items which are at the top of the sustainers \"worst actors\" list and account for significant maintenance effort, down time, and lost or failed contacts.\n      \n      2) AFSCN Commodity Procurement (P-5): FY 2021 funds are critical to ensuring telemetry, tracking, and commanding are provided for over 170 satellites and that satellite emergencies requiring high-power antennas can be supported.  These projects include required radome replacements, Defensive Cyber Operations activities and other Cyber security related projects. Other FYDP projects include: Boundary Defense, ESD obsolescence, AFSCN test bed (ATB) replacements, continued cyber defense work, network automation, and Range\/Network\/Communication obsolescence replacements.\n      \n      3) RBC (P3a): FY 2021 funding is for the last EHPA procurement and delivery provides spacecraft anomaly resolution by replacing obsolete parts and enables emergency satellite operations. Ensures telemetry, tracking, and commanding are provided for over 170 satellites and that satellite emergencies requiring high-power antennas can be supported.  \n      \n      \n      4) FY 2021 funds will continue program office support and other related support activities.  Rapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain. Activities may include, but are not limited to program office support, studies, technical analysis, etc."
        },
        "ModsOutYearDelta": {
            "Cost": {
                "BudgetYearTwo": {
                    "val": "49.317"
                },
                "BudgetYearThree": {
                    "val": "50.231"
                },
                "BudgetYearFour": {
                    "val": "51.136"
                },
                "BudgetYearFive": {
                    "val": "52.075"
                },
                "Total": {
                    "val": "242.085"
                }
            }
        },
        "ItemExhibitList": {
            "P3AModificationItemGroup": [
                {
                    "ModificationTitle": {
                        "val": "Remote Tracking Station Block Change (RBC)"
                    },
                    "ModificationNumber": {
                        "val": "1"
                    },
                    "ModificationType": {
                        "val": "Capability Improvement"
                    },
                    "ModelsAffectedList": {
                        "ModelAffected": [
                            {
                                "val": "AFSCN"
                            }
                        ]
                    },
                    "IdCode": {
                        "val": "B"
                    },
                    "ResourceSummary": {
                        "Quantity": {
                            "BudgetYearOneBase": {
                                "val": "1"
                            },
                            "BudgetYearOne": {
                                "val": "1"
                            },
                            "Total": {
                                "val": "1"
                            }
                        },
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "9"
                            },
                            "BudgetYearOne": {
                                "val": "9"
                            },
                            "Total": {
                                "val": "9"
                            }
                        },
                        "NetProcurementP1": {
                            "BudgetYearOneBase": {
                                "val": "9"
                            },
                            "BudgetYearOne": {
                                "val": "9"
                            },
                            "Total": {
                                "val": "9"
                            }
                        },
                        "TotalObligationAuthority": {
                            "BudgetYearOneBase": {
                                "val": "9"
                            },
                            "BudgetYearOne": {
                                "val": "9"
                            },
                            "Total": {
                                "val": "9"
                            }
                        }
                    },
                    "ModificationItemList": {
                        "ModificationItem": [
                            {
                                "Title": {
                                    "val": "Enhanced High Power Amplifier"
                                },
                                "Procurement": {
                                    "BKits": {
                                        "NonRecurring": {
                                            "KitList": {
                                                "Kit": [
                                                    {
                                                        "Name": [],
                                                        "Cost": {
                                                            "Quantity": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "1"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "1"
                                                                },
                                                                "Total": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "TotalCost": {
                                                                "BudgetYearOneBase": {
                                                                    "val": "9"
                                                                },
                                                                "BudgetYearOne": {
                                                                    "val": "9"
                                                                },
                                                                "Total": {
                                                                    "val": "9"
                                                                }
                                                            }
                                                        }
                                                    }
                                                ]
                                            },
                                            "CategorySubtotal": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    },
                                                    "Total": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "9"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "9"
                                                    },
                                                    "Total": {
                                                        "val": "9"
                                                    }
                                                }
                                            }
                                        }
                                    },
                                    "ManufacturerList": {
                                        "Manufacturer": [
                                            {
                                                "Name": {
                                                    "val": "KBR Wylie"
                                                },
                                                "Location": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "ContractDates": {
                                                    "CurrentYear": {
                                                        "val": "2020-10"
                                                    }
                                                },
                                                "DeliveryDates": {
                                                    "BudgetYearOne": {
                                                        "val": "2021-07"
                                                    }
                                                },
                                                "AdminLeadTimeAfterOct1InMonths": {
                                                    "val": "0"
                                                },
                                                "ProductionLeadTimeAfterOct1InMonths": {
                                                    "val": "0"
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "BudgetYearOneBase": {
                                                "val": "1"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1"
                                            },
                                            "Total": {
                                                "val": "1"
                                            }
                                        },
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "9"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9"
                                            },
                                            "Total": {
                                                "val": "9"
                                            }
                                        }
                                    }
                                },
                                "Installation": {
                                    "ImplementationMethodList": {
                                        "ImplementationMethod": [
                                            {
                                                "NonOrganicInstallation": {
                                                    "ImplementationMethodName": {
                                                        "val": "Delivery on site"
                                                    },
                                                    "InstallationCost": {
                                                        "BudgetYearOne": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "1"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "1"
                                                                    },
                                                                    "Total": {
                                                                        "val": "1"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                }
                                                            }
                                                        },
                                                        "Total": {
                                                            "Cost": {
                                                                "Quantity": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "1"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "1"
                                                                    },
                                                                    "Total": {
                                                                        "val": "1"
                                                                    }
                                                                },
                                                                "TotalCost": {
                                                                    "BudgetYearOneBase": {
                                                                        "val": "0"
                                                                    },
                                                                    "BudgetYearOne": {
                                                                        "val": "0"
                                                                    },
                                                                    "Total": {
                                                                        "val": "0"
                                                                    }
                                                                }
                                                            }
                                                        }
                                                    },
                                                    "InstallationSchedule": {
                                                        "In": {
                                                            "BudgetYearOne": {
                                                                "FirstQuarter": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "Total": {
                                                                "val": "1"
                                                            }
                                                        },
                                                        "Out": {
                                                            "BudgetYearOne": {
                                                                "ThirdQuarter": {
                                                                    "val": "1"
                                                                }
                                                            },
                                                            "Total": {
                                                                "val": "1"
                                                            }
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "TotalCost": {
                                        "Quantity": {
                                            "BudgetYearOneBase": {
                                                "val": "1"
                                            },
                                            "BudgetYearOne": {
                                                "val": "1"
                                            },
                                            "Total": {
                                                "val": "1"
                                            }
                                        },
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0"
                                            },
                                            "Total": {
                                                "val": "0"
                                            }
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "ProcurementSubtotal": {
                        "Quantity": {
                            "BudgetYearOneBase": {
                                "val": "1"
                            },
                            "BudgetYearOne": {
                                "val": "1"
                            },
                            "Total": {
                                "val": "1"
                            }
                        },
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "9"
                            },
                            "BudgetYearOne": {
                                "val": "9"
                            },
                            "Total": {
                                "val": "9"
                            }
                        }
                    },
                    "InstallationSubtotal": {
                        "Quantity": {
                            "BudgetYearOneBase": {
                                "val": "1"
                            },
                            "BudgetYearOne": {
                                "val": "1"
                            },
                            "Total": {
                                "val": "1"
                            }
                        },
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "Total": {
                                "val": "0"
                            }
                        }
                    },
                    "Description": {
                        "val": "Remote Tracking Station (RTS) Block Change (RBC): FY 2021 funding is for EHPA procurement and delivery. Ensures telemetry, tracking, and commanding are provided for over 170 satellites and that satellite emergencies requiring high-power antennas can be supported.  These efforts include systems engineering and integration (SE&I) activities.\n          \n          The RBC Program was initiated in Dec 2001 to modernize the legacy system. The RBC program replaces legacy remote ground antenna systems that have reached end of life. To date, RBC systems have been installed at VTS, DGS, TCS, GTS, HTS, NHS, and TTS. TTS completed in 1Q FY 2016. In addition, the Air Force is upgrading the electronics in the remaining eight serviceable systems. This \"hybrid\" architecture couples the RBC electronics with existing antennas and normalizes electronics across the network. A prototype effort was implemented in FY 2012 to validate the approach and the first two hybrid articles were awarded in FY 2013 to upgrade legacy systems at GTS and HTS. HTS Hybrid was operationally accepted in July 2017. A third article was awarded in FY 2014 to upgrade the legacy system at VTS and funds were applied in FY 2015 to DGS, TTS and FY 2016 to NHS, FY 2017 to TCS and the last antenna is scheduled at TCS in FY2022.\n          \n          This project is required to prevent a significant increase to sustainment costs and decrease in operational capability of the already obsolete Automated Remote Tracking Station (ARTS) system. There are several significant operational issues that must be corrected as soon as possible within the ARTS system and any delay to the RBC Hybridization of sites requires that ARTS be maintained and sustained well past its expected life. If RBC Hybridization is not sufficiently funded to keep ARTS operationally viable, the system will experience increased failure rates and lost contacts over time with the potential to impact or lose operational capability of on-orbit payloads that rely on the AFSCN for command and control. The antiquated AFSCN system is already operating at the very edge of its capacity supporting over 170 satellites. The RBC Hybridization project is intended to bring the system up to modern standards by FY 2026, and any delay in funding will push that completion date farther into the future, endangering additional satellite contacts and payloads. In addition, the Enhanced High Power Amplifier (EHPA) spacecraft anomaly resolution system will provide high power capability at four sites (GTS, VTS, NHS, and DGS), replaces obsolete parts, and  enables emergency satellite operations. \n          \n          NOTE: Kit costs include all recurring, non-recurring and installation costs.\n          \n          Milestone\/Development Status\n          \n          N\/A"
                    }
                }
            ],
            "P5Item": [
                {
                    "Name": {
                        "val": "Satellite Control Network (SPACE)"
                    },
                    "IdCode": {
                        "val": "B"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "39.326"
                            },
                            "BudgetYearOne": {
                                "val": "39.326"
                            }
                        },
                        "NetProcurementP1": {
                            "BudgetYearOneBase": {
                                "val": "39.326"
                            },
                            "BudgetYearOne": {
                                "val": "39.326"
                            }
                        },
                        "TotalObligationAuthority": {
                            "BudgetYearOneBase": {
                                "val": "39.326"
                            },
                            "BudgetYearOne": {
                                "val": "39.326"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "AF Satellite Control Network"
                                },
                                "NonRecurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Commodities Procurement"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "9.964"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "9.964"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "9.964"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9.964"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "9.964"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.964"
                                        }
                                    }
                                }
                            }
                        ],
                        "Logistics": {
                            "Name": {
                                "val": "AFSCNS"
                            },
                            "Recurring": {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "INTERIM SUPPLY SPT - Labor"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.45"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.45"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "INTERIM SUPPLY SPT -- Materiel"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "4.478"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.478"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Technical Mission Analysis"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "6.189"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6.189"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Test & Evaluation"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.583"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.583"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Enterprise Systems Engineering and Integration (SE&I)"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "10.564"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "10.564"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "23.264"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.264"
                                        }
                                    }
                                }
                            },
                            "CategorySubtotal": {
                                "TotalCost": {
                                    "BudgetYearOneBase": {
                                        "val": "23.264"
                                    },
                                    "BudgetYearOne": {
                                        "val": "23.264"
                                    }
                                }
                            }
                        },
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Advisory & Assistance Services (A&AS)"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "2.511"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.511"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "Other Support"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.626"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.626"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "FFRDC"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.961"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.961"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "6.098"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.098"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "Support End Item"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}