{
    "id": "2021-Navy-PB-1109N-JBOOK-9cf80abb15b69f28c5680bbd610d6b63fb9c51c4c1f66cea677aec9a0d624efe-42",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@suppressOutfittingDeliveryBY2ToBY5": "true",
        "LineItemNumber": {
            "val": "6438"
        },
        "LineItemTitle": {
            "val": "Physical Security Equipment"
        },
        "P1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Materials Handling Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "301.009"
                },
                "PriorYear": {
                    "val": "28.306"
                },
                "CurrentYear": {
                    "val": "15.404"
                },
                "BudgetYearOneBase": {
                    "val": "23.063"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "23.063"
                },
                "BudgetYearTwo": {
                    "val": "169.589"
                },
                "BudgetYearThree": {
                    "val": "44.971"
                },
                "BudgetYearFour": {
                    "val": "33.373"
                },
                "BudgetYearFive": {
                    "val": "42.36"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "301.009"
                },
                "PriorYear": {
                    "val": "28.306"
                },
                "CurrentYear": {
                    "val": "15.404"
                },
                "BudgetYearOneBase": {
                    "val": "23.063"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "23.063"
                },
                "BudgetYearTwo": {
                    "val": "169.589"
                },
                "BudgetYearThree": {
                    "val": "44.971"
                },
                "BudgetYearFour": {
                    "val": "33.373"
                },
                "BudgetYearFive": {
                    "val": "42.36"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "301.009"
                },
                "PriorYear": {
                    "val": "28.306"
                },
                "CurrentYear": {
                    "val": "15.404"
                },
                "BudgetYearOneBase": {
                    "val": "23.063"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "23.063"
                },
                "BudgetYearTwo": {
                    "val": "169.589"
                },
                "BudgetYearThree": {
                    "val": "44.971"
                },
                "BudgetYearFour": {
                    "val": "33.373"
                },
                "BudgetYearFive": {
                    "val": "42.36"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206315M"
                },
                {
                    "val": "0206211M"
                }
            ]
        },
        "Description": {
            "val": "Installation Physical Security provides precise, uniform technological solutions to manpower intensive security requirements. Systems used at bases and stations protect our most critical assets vital to operations - people, flight lines, classified information, Arms, Ammunition, and Explosives (AA&E), shorelines, open desert areas, critical assets and infrastructure as well as provide constant, vigilant capabilities that control and restrict access and provide notification of actual and attempted unauthorized intrusion. The Mass Notification System (MNS) provides immediate notice and warning to personnel living and working aboard our bases and stations via interior and exterior speaker systems, telephones, and computers in the event of security breaches, natural disasters, terrorist activities, weather emergencies, or other events requiring immediate guidance to ensure the safety and security of personnel. These systems upgrade and replace antiquated individually purchased systems that are costly to maintain and may not meet prescribed requirements for securing U.S. assets. The Marine Corps Electronic Security System (MCESS) Program provides a comprehensive electronic security system suite that supports collateral equipment-- including intrusion detection, surveillance (IDS), installation, and facility automated access control and tracking capabilities. These systems increase efficiency and effectiveness of available security manpower and improve security and safety of the installation perimeter, flight line, restricted areas, facility entry points and is now expanding to meet installation access control requirements. Ground-based radars support surveillance of the vast regions aboard Marine Corps installations such as expansive waterways, open airfields, and desert areas; they also improve assessment at long distances and allow for greater defensive posture and response capabilities.   \n\nCollateral Equipment (CE) funds the one-time, initial outfitting of equipment not defined as built-in for new Military Construction (MILCON) facilities, newly renovated\/refurbished facilities, and Host Nation funded construction projects.  The one-time procurement includes equipment such as Mass Notification Systems, Intrusion Detection Systems, Closed Circuit TVs, information technology switches and routers, Passive Optical Networks, Internal Grounding Systems, Voice Over Internet Protocol (VOIP), Audio Visual(AV), Video Teleconferencing Systems (VTC) and other industrial equipment such as recycling and pulping systems, warehouse conveyor systems, and heavy maintenance equipment. Highs and lows in the funding profile are directly related to what type of facilities and how many are scheduled for completion each year.   \n\nCommand Support Equipment (CSE) funds life cycle replacement of industrial equipment and systems with unit cost of $250K or greater to support the operations and mission of United States Marine Corps ground bases, air stations, and districts.  Examples include equipment such as open water spill equipment, warehouse conveyor systems, power generators, and recycling systems.\n\nFacilities Related Control Systems (FRCS) funds the one-time, initial purchase of industrial control systems (ICS) and Operational Technology Equipment (OTE) as well as the accompanying cybersecurity. ICS are devices that manage, command, direct or regulate the behavior of other devices such as Heating, Ventilation, and Air Conditioning (HVAC), electrical, and wastewater treatment systems. ICS include Airfield Control Systems, Electronic Security Control Systems, Fire and Life Safety Control Systems, and others. OTE include servers, computers, software, and monitoring devices to secure and operate Facility-Related Control Systems."
        },
        "Justification": {
            "val": "Beginning in FY 2019, Identity Dominance System has been realigned from BLI 6438 Physical Security Equipment, to BLI 4652, Modifications Kit C4 Fire Support System.\n\nBeginning in FY 2021, Command Support Equipment has been realigned to BLI 6438, Physical Security Equipment, from BLI 6544 Family of Construction Equipment.\n\nFY 2019: $28.306M\n\nInstallation Physical Security $4.262M:  Funds the procurement of physical security systems and program initiatives supporting flight line security, waterside\/shoreline security, protection of Sensitive Compartmented Information Facilities (SCIFS), AA&E and other critical assets. Funds will support the enhancement of command and control systems for the MCESS. Funding will also support upgrades to the family of systems to maintain compliance with federal and DoD requirements to deploy an enterprise access control system capable of interfacing with DoD databases such as Defense Enrollment Eligibility Reporting System (DEERS) and other federal government authoritative databases. This funding also supports Defense Policy Review Initiative Guam (DPRI-Guam)needs to install physical security measures at Futenma Replacement Facility Camp Schwab for multiple structures to include the electrical substation, the Weapons Assembly Facility, Magazine facilities, maintenance hangars, water storage tanks, and camp gate upgrades.  Also supports the Defense Policy Review Initiative Okinawa (DPRI-Okinawa) installation of intrusion detection and mass notification systems on Camps Foster and Hansen for multiple facilities to include: fire stations, Bachelor Enlisted Quarters, Bachelor Officer Quarters, Commissary, Exchange, Garrison Maintenance Facility, main gates, and town center. \n\n\nCollateral Equipment $23.590M:  Funds procured security systems, video teleconferencing systems (VTC), low altitude land mobile radio and emergency land mobile radio systems, routers, switches and industrial equipment to outfit 7 new facilities and ranges, and 21 refurbished facilities.  \n\nFacility Related Control Systems $0.454M: Funds the one-time, initial purchase of industrial control systems (ICS) and Operational Technology Equipment (OTE)and other related requirements such as FRCS Architecture Test Environment, IBM Watson, and OSIsoft PI.\n\n\nFY 2020:  $15.404M\n\nInstallation Physical Security $6.345M:  Funding obligation directed toward the procurement of physical security systems and program initiatives supporting flight line security, waterside\/shoreline security, protection of SCIFS, AA&E and other critical assets. Funding supports upgrades to all protection equipment including intrusion detection, surveillance, installation and facility automated access control, and tracking capabilities to maintain compliance with Federal and DoD requirements. Funding ensures critical assets are provided protection to approximately (10) Airfields, (138) flight line turnstiles, (65) flight line automated gates, (1347) AA&E facilities\/spaces (i.e. magazines, armories, consolidated armory spaces, Ready Service Lockers (RSL's)), (42) SCIFs, (12) facilities in support of the Joint Strike Fighter (JSF), (193) classified material storage spaces. There are an additional (1854) areas protected that include museums & museum warehouses, medical\/dental\/pharmacy facilities, banks\/disbursing offices, site headquarters buildings & law centers, brigs, criminal investigation division evidence rooms, communication\/network operation centers, gas stations & fuel farms, schools, warehouses, commissaries & exchanges, perimeter installation gate access points, installation perimeters (designated facilities),  designated critical infrastructure (water towers, water treatment facilities, utility facilities), motor pools, general quarters & barracks (with MCESS MNS, IDS, & Access Control), building access control to all Marine Corps secure buildings, and simulator trainers. Funding in the amount of $2.648M also supports the Defense Policy Review Initiatives (DPRI) Physical Security Requirements for Guam, Okinawa, and Iwakuni.\n\nThe increase in funding of $2.083M from FY19 to FY20 is due to DPRI support.   \n\nCollateral Equipment $9.059M:  Funds procures the necessary systems and equipment to make new facilities complete and usable.  This includes security systems, audio visual systems, video teleconferencing systems, telephones, routers, and switches for 9 MILCONs currently under construction which includes hangar (1), bachelor housing (2), dining facility (1), fire station (1), combat vehicle repair facility (1), training facilities (2), and water treatment plant (1).\n\nThe decrease of $14.531M from FY19 to FY20 is due to the number and type of facilities being outfitted in FY20.\n\nFacility Related Control Systems $0M.  The decrease in funding of $0.454M from FY19 to FY20 is due to no mature requirements anticipated for FY2020.   \n\nFY 2021 Base Appropriation Request:  $23.603M\n\nInstallation Physical Security $5.833M:  Funds will be used to install automated access control systems (AACS), intrusion detection systems (IDS), closed circuit television systems (CCTV), classified material storage, and flightline systems (FLS) at various USMC installations located worldwide. These systems are being installed in accordance with USMC policy for protection of assets, property, and life safety. Funding will ensure critical assets are provided protection to approximately AA&E (19) facilities, AACS (13) sites, CCTV (11) sites, SCIFS (5) areas, FLS (7) systems.\n\nThe decrease in funding of $0.512M from FY20 to FY21 is due to reduced need to install physical security measures at Futenma Replacement Facility Camp Schwab.\n  \n\nCollateral Equipment $16.730M:  Funds will procure the necessary systems and equipment to make new facilities complete and usable.  This includes security systems, audio visual systems, video teleconferencing systems, telephones, routers, switches, warehouse conveyors and recycling systems for 12 MILCONs  that include HQ building (1), combat vehicle maintenance and warehouse facility (2), hangars (2), fire stations (2), warehouses (2), recycling facility (1),  communications complex (1), and cryogenics facility (1). \n\nThe increase in funding of $7.671M from FY20 to FY21 is due to the number and type of facilities needing outfitting in FY21.\n\nCommand Support Equipment $0.500M:  Funds will procure a re-locatable emergency power generator (1) for Marine Corps Installations Eastern Region. \n\nThe increase in funding of $0.500M is due to CSE moving from budget line item 6544 to budget line item 6438 beginning in FY21."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Physical Security Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Collateral Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "The increase in funding of $7.671M from FY20 to FY21 is due to the number and type of facilities needing outfitting in FY21.",
                                                "val": "1.1) Collateral Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "167.385"
                                                    },
                                                    "PriorYear": {
                                                        "val": "23.59"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "9.059"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "16.73"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "16.73"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "167.385"
                                        },
                                        "PriorYear": {
                                            "val": "23.59"
                                        },
                                        "CurrentYear": {
                                            "val": "9.059"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.73"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.73"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) Installation Physical Security"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Installation Physical Security"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "133.624"
                                                    },
                                                    "PriorYear": {
                                                        "val": "4.262"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "6.345"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "5.833"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "5.833"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "133.624"
                                        },
                                        "PriorYear": {
                                            "val": "4.262"
                                        },
                                        "CurrentYear": {
                                            "val": "6.345"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.833"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.833"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "3) Facility-Related Control Systems"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "3.1) Facility-Related Control Systems"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.454"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "PriorYear": {
                                            "val": "0.454"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "4) Command Support Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "Beginning in FY21, CSE moved from budget line item 6544 to budget line item 6438.",
                                                "val": "4.1) Command Support Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.5"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.5"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.5"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.5"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "301.009"
                            },
                            "PriorYear": {
                                "val": "28.306"
                            },
                            "CurrentYear": {
                                "val": "15.404"
                            },
                            "BudgetYearOneBase": {
                                "val": "23.063"
                            },
                            "BudgetYearOne": {
                                "val": "23.063"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}