{
    "id": "2021-DoDHumanResourcesActivity-PB-0300D-JBOOK-fe944175c9d122148fee2ffeeed625906aaed85a0424128e16cd930a191c31b2-0",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-DEFENSE_DHRA-U_PROCUREMENT_JustificationBook_DoD_Human_Resources_Activity_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_DoD_Human_Resources_Activity_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "DoD Human Resources Activity",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "500"
        },
        "LineItemTitle": {
            "val": "Personnel Administration"
        },
        "P1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "DoD Human Resources Activity"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "20"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DHRA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "28.82"
                },
                "PriorYear": {
                    "val": "10.63"
                },
                "CurrentYear": {
                    "val": "5.03"
                },
                "BudgetYearOneBase": {
                    "val": "4.213"
                },
                "BudgetYearOne": {
                    "val": "4.213"
                },
                "BudgetYearTwo": {
                    "val": "4.31"
                },
                "BudgetYearThree": {
                    "val": "5.104"
                },
                "BudgetYearFour": {
                    "val": "5.233"
                },
                "BudgetYearFive": {
                    "val": "5.265"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "28.82"
                },
                "PriorYear": {
                    "val": "10.63"
                },
                "CurrentYear": {
                    "val": "5.03"
                },
                "BudgetYearOneBase": {
                    "val": "4.213"
                },
                "BudgetYearOne": {
                    "val": "4.213"
                },
                "BudgetYearTwo": {
                    "val": "4.31"
                },
                "BudgetYearThree": {
                    "val": "5.104"
                },
                "BudgetYearFour": {
                    "val": "5.233"
                },
                "BudgetYearFive": {
                    "val": "5.265"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "28.82"
                },
                "PriorYear": {
                    "val": "10.63"
                },
                "CurrentYear": {
                    "val": "5.03"
                },
                "BudgetYearOneBase": {
                    "val": "4.213"
                },
                "BudgetYearOne": {
                    "val": "4.213"
                },
                "BudgetYearTwo": {
                    "val": "4.31"
                },
                "BudgetYearThree": {
                    "val": "5.104"
                },
                "BudgetYearFour": {
                    "val": "5.233"
                },
                "BudgetYearFive": {
                    "val": "5.265"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0901220SE"
                }
            ]
        },
        "Description": {
            "val": "The Department of Defense Human Resources Activity (DHRA) is a consolidated Field Activity under the direction and control of the Under Secretary of Defense (Personnel and Readiness) (USD (P&R)) established for the collection and interaction of manpower and personnel data to support Department-wide tracking, analysis, research, studies, and a wide variety of reporting requirements. DHRA provides functional information management, civilian personnel policy support, and civilian personnel administrative services to DoD Components and activities. The scope of operations is necessarily broad and encompasses all aspects of data collection and utilization of Defense manpower and personnel data records to support DoD-wide analysis, studies, research, and reporting requirements. DHRA is the responsible organization within DoD for the interchange of automated manpower data with other government agencies. \n\nEnterprise Human Resources (HR) Information Systems (EHRIS) is responsible for developing and maintaining the Information Technology (IT) systems that support Civilian HR Management (CHRM) processes across DoD.  The EHRIS mission is to increase Civilian Force effectiveness by deploying innovative, leading-edge technology solutions and strategies for DoD end-users, to include employees, supervisors, managers, and leaders as well as Civilian HR customers and stakeholders.  \n\nDefense Enrollment Eligibility Reporting System (DEERS) is the DoD's authoritative eligibility and enrollment repository for manpower and personnel identity and affiliation data on military, civilian, retirees, family members, and other affiliated populations.  DEERS determines eligibility for statutory benefits and entitlements, and tracks and verifies enrollment in these programs.  DEERS also maintains medical and personnel readiness information on all Uniformed Services members, to include managing TRICARE eligibility, enrollment, and claims processes.  Procurement funding for this program provides a secure self-service portal, known as MilConnect, to allow beneficiaries to securely view and update their DoD benefits and entitlements.  As part of the Defense-Wide Review, DMDC will decommission MilConnect in FY 2021.\n\nThe Identity Credential Management (ICM) program supports the issuance of identification (ID) cards to Service members, civilian employees, contractors, retirees, and other affiliated persons. Supports the Real-time Automated Personnel Identification System (RAPIDS) as the enterprise system that issues the Uniformed Services ID card and provides online personnel and family member updates to the Defense Enrollment Eligibility Reporting System (DEERS). RAPIDS also issues the Common Access Card (CAC) to Service members, civilian employees, and eligible contractors, thus providing an enterprise-wide credential for both physical and logical access to DoD facilities and networks.\n \nThe Personnel Accountability (PA) program designs and implements technological solutions to gather, analyze, and share information on the physical location of DoD members and affiliated personnel in order to ensure the safety and enhance the readiness of the Armed Forces of the United States. PA provides end-to-end tracking, reconciliation and reporting of DoD personnel location and movements, to include Service members, DoD-affiliated civilians and contractors, other DoD-affiliated personnel, and U.S. citizens. This includes DoD travel, contracts, and contractor personnel tracking in support of contingencies, military readiness, reporting of locations at the unit and person level, accountability of DoD personnel during (and after) natural or man-made disasters, and accountability and visibility of noncombatant evacuees.  \n\nAs the Master Data Management (MDM) arm of DMDC, Enterprise Data Services (EDS) governs the collection, storage, and distribution of DMDC data assets to include: data modeling, database standardization, data quality, database architectures, and data distribution safeguarded by the security mechanisms which ensure compliance with the DoD information assurance standards and the PII directives of the DoD.  EDS is also the enterprise focal point for cybersecurity toolset management and data center consolidation."
        },
        "Justification": {
            "val": "Project: EHRIS.  EHRIS is responsible for developing and maintaining the information technology systems that support Civilian Personnel processes across DoD. DMDC has secured Infrastructure-as-a-Service (IaaS) and Software-as-a-Service (SaaS) capabilities to support the majority of this portfolio. A small amount of Procurement funding is still required to support any requirements that are not available as IaaS or SaaS offerings.  \n\nProject: DEERS.  In FY 2021, DMDC reduced Procurement investment in the DEERS program. In compliance with the Data Center Optimization Initiative (DCOI) established by OMB Memorandum M-16-19, DMDC has secured Infrastructure-as-a-Service (IaaS) capabilities from DISA.  With this shift to IaaS, DMDC will no longer procure its own infrastructure, but will instead reimburse service providers annually to provide infrastructure and hosting services.  DMDC has reprogrammed $0.527 million to O&M funding to support this requirement.  DMDC will decommission seven portlets and migrate six portlets to other systems, enabling the decommission of MilConnect by FY 2021, as directed by the Defense-Wide Review, for a -$900 thousand reduction. This decommissioning will eliminate the need for infrastructure funding for the DEERS program.\n\nProject: RAPIDS\/CAC.  FY 2021 investment in Automated Data Processing (ADP) equipment includes the acquisition of upgraded RAPIDS\/CAC infrastructure, allowing the replacement of outdated and\/or maintenance-intensive equipment in order to continue to ensure full functionality, system security, and HSPD-12 compliance of the RAPIDS\/CAC system.\n\nProject: PA. FY 2021 investment in the NEO Tracking System (NTS) will be used to upgrade fielded NTS across the COCOMs and the National Guard. This centralized procurement of equipment will enable DMDC to track the systems in the field and provide support such as software upgrades, training and equipment tracking. Upgraded equipment will provide the COCOMs with more manageable and reliable systems. Other PA programs such as SPOT-ES and JPARR will receive upgraded equipment that decreases their footprint and meets the requirement of reducing redundant IT services across the Department, while providing expanded services.  \n\nProject: EDS. FY 2021 investment will be used to procure hardware and software to implement common access services to improve DMDC's insider threat posture and mature data cyber security capability. DMDC will procure an Intrusion Prevention System (IPS) for layered and defense-in-depth security.  This is a network monitoring preventative measure to detect and prevent vulnerability exploits."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}