{
    "id": "2021-TheJointStaff-PB-0300D-JBOOK-c7961df6f852dbb9b90eaf94592ebd8ac4b867f1d27c2b8f983f1a477bb42b8a-0",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-DEFENSE_TJS-U_PROCUREMENT_JustificationBook_The_Joint_Staff_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_The_Joint_Staff_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "10"
        },
        "LineItemTitle": {
            "val": "Major Equipment, TJS"
        },
        "P1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "15"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, TJS"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "93.358"
                },
                "PriorYear": {
                    "val": "4.36"
                },
                "CurrentYear": {
                    "val": "6.905"
                },
                "BudgetYearOneBase": {
                    "val": "8.329"
                },
                "BudgetYearOne": {
                    "val": "8.329"
                },
                "BudgetYearTwo": {
                    "val": "8.449"
                },
                "BudgetYearThree": {
                    "val": "8.921"
                },
                "BudgetYearFour": {
                    "val": "5.866"
                },
                "BudgetYearFive": {
                    "val": "6.016"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "93.358"
                },
                "PriorYear": {
                    "val": "4.36"
                },
                "CurrentYear": {
                    "val": "6.905"
                },
                "BudgetYearOneBase": {
                    "val": "8.329"
                },
                "BudgetYearOne": {
                    "val": "8.329"
                },
                "BudgetYearTwo": {
                    "val": "8.449"
                },
                "BudgetYearThree": {
                    "val": "8.921"
                },
                "BudgetYearFour": {
                    "val": "5.866"
                },
                "BudgetYearFive": {
                    "val": "6.016"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "93.358"
                },
                "PriorYear": {
                    "val": "4.36"
                },
                "CurrentYear": {
                    "val": "6.905"
                },
                "BudgetYearOneBase": {
                    "val": "8.329"
                },
                "BudgetYearOne": {
                    "val": "8.329"
                },
                "BudgetYearTwo": {
                    "val": "8.449"
                },
                "BudgetYearThree": {
                    "val": "8.921"
                },
                "BudgetYearFour": {
                    "val": "5.866"
                },
                "BudgetYearFive": {
                    "val": "6.016"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "The Chairman of the Joint Chiefs of Staff (CJCS) is the principal military adviser to the President, National Security Council, and Secretary of Defense. The Chairman presides over and serves as a member of the Joint Chiefs of Staff. CJCS relies upon the Joint Staff to craft and distribute guidance for combatant forces' unified strategic direction, operations under unified commands, and integration into effective combat forces. On behalf of the Chairman, the Joint Staff provides Combatant Commands (CCMDs), the Services, and U.S. war fighters with joint policy, strategy, and doctrine necessary to employ effective joint combat forces in contingencies worldwide."
        },
        "Justification": {
            "val": "The Joint Staff requests $8.329M in FY 2021 procurement for mission critical information technology systems and applications investment requirements. The procurement request resources various efforts across the Joint Staff, including National Defense University.  \n\nNote: In FY 2020, Joint Information Operations Range (JIOR) was moved to a new line item (line 15) to improve visibility into Cyber program resources.\n\n1. Planning and Decision Aid System (PDAS):\n\nPDAS is a classified, protected program operated by the Joint Staff.  PDAS is a command and control system that supports the planning and execution of Joint Staff and Unified Combatant Commanders (CCMD) operations.  PDAS is a worldwide network protecting sensitive information that meets the Intelligence Community Directive 503 security requirements.  PDAS provides office automation packages, document and information management tools; collaboration, voice, and video tools in a secure, flexible architecture that promotes a distributed enterprise.  Within the enterprise, PDAS users have access to their data regardless of log-on location, secure data exchange, conferencing and planning sessions among physically distributed continental United States and outside continental United States locations. PDAS provides users with access to a Help Desk and remote troubleshooting within the PDAS enterprise.\n\nPDAS realigned Procurement funding, $3.0M per year, to O&M to fund higher priority requirements for the following years:  FY 2019, FY 2021 – FY 2024.  FY 2020 Procurement funding supports equipment modernizations and technology refresh for major systems and data centers. Due to an expanding base of users, Procurement funding was increased by $1.0M in FY 2020 to support additional equipment modernization and technology refresh requirements.\n\nEquipment modernization will allow the Joint Staff to develop plans to implement materiel solutions to address hardware and software configuration items that are outdated, nearing end-of-life or end-of-support or which can no longer be commercially acquired or supported.  Historically, this equipment has been purchased as required due to failures, end-of-life, or end-of-service which has led to many baselines and configurations of deployed hardware, software and communications equipment. Items reach end-of-life in different years providing a cascade of equipment replacement requirements.  This spacing lessens the financial impact in any one year but requires constant purchase, integration, testing and installation resulting in higher overall cost and effort.  Integration and testing ensures that hardware or software is compatible with other installed hardware and software configuration items and does not introduce vulnerabilities into PDAS, or allow unauthorized personnel to gain access to information for which they are not authorized.  There are four specific procurement requirements as follows.\n\nPDAS funding will be used to procure equipment modernizations, datacenter refresh, and client refresh. Due to the cyclic nature of the PDAS technical refresh requirement of datacenters, client computers and other IT equipment, this program presents a non-linear funding profile with noticeable spikes in funding requirements during technical refresh years.  When possible, equipment is purchased in increments across fiscal years to lessen spikes in funding requirements where possible. Funding spikes support major system upgrades for data centers in FY 2018 and user clients in FY 2020.\n\nPDAS is composed of hundreds of user sites with thousands of users worldwide. In recent years, the number of PDAS sites grew by 25 percent and continues with demand for expansion of both new sites and users.  Funding provides capabilities, services and the infrastructure necessary to meet these operational mission needs. \n\nClient refresh allows the Joint Staff to provide updated computer hardware to the PDAS users in order to be compliant with Security Control 28 (protection of information at rest to prevent insider threats). This periodic refresh will provide users with an updated hardware and software infrastructure, enabling improved performance, security, efficiency, and reducing logistical requirements. Client refresh is planned to begin in FY 2020 and completed in FY 2022.\n\nDatacenter refresh allows the Joint Staff to provide refreshed datacenter hardware and software. The hardware and software will be reaching the end of its service life and approaching obsolescence.  New equipment for the datacenters will enable the PDAS program to consolidate equipment baselines and provide commonality at the datacenters. This periodic refresh provides PDAS with an updated hardware and software infrastructure, enabling improved performance, security, efficiency, and reduced logistical requirements.  From an operational perspective, it moves the program from event-driven, reactive situations of coping with the latest problem to a more proactive, forward-facing operational posture. The focus becomes one of preemptive quality assurance, standardization, and optimization.  Datacenter refresh is planned to begin in FY 2025.\n\n2. Management Headquarters:\n\nManagement Headquarters provides the day-to-day financial resources necessary to conduct Joint Staff operations. Funding supports the mission-unique non-Joint Service Provider (JSP), Joint Staff IT requirements, and technology upgrades for the joint training facility, and Joint Integrated Air & Missile Defense Organization (JIAMDO), Joint Range Extender (JRE). \n\nManagement Headquarters funds are also used to procure major hardware and software technology upgrade investments for the Suffolk, VA, joint training facility. These funds provide significant network distribution\/security, data processing, and capacity upgrades to the Suffolk Data Center to increase performance, security, reliability, and accessibility to the Combatant Commands and Services. Capability upgrades are required to host current joint training applications (Joint Knowledge Online, Joint Training Information Management System, Joint Lessons Learned Information Systems, and Joint Live, Virtual, and Constructive simulations). Additionally, the upgrades provide support to multi-site, multi-command, distributed live, virtual, and constructive joint force training events addressing transregional, multi-domain, and multi-functional threat environments.\n\nThe Deputy Secretary of Defense approved the alignment of common IT services in the Pentagon and the National Capital Region to JSP operating as a field service activity in Defense Information Systems Agency (DISA). In FY 2018, the Joint Staff Information Network resources permanently transferred to the JSP (DISA PE 0305830K).  The overall effect to the Department was a net-zero profile change for FY 2018 and beyond.  Limited IT procurement funding was retained for mission-unique, non-JSP Joint Staff IT requirements. \n\n3.  National Defense University (NDU):\nThe mission of the National Defense University (NDU) is to educate joint warfighters in critical thinking and the creative application of military power to inform national strategy and globally integrated operations, under conditions of disruptive change, in order to conduct war.  NDU seeks to create strategic advantage by developing warfighters and other national security leaders and forging relationships though whole-of-nations and whole-of-government educational programs, research, and engagement.  \n\nNDU requests $6.000M in FY 2021 procurement for mission critical information technology systems and applications.  This is a new procurement line item required to acquire IT systems and components that exceed the threshold for using Operation and Maintenance funds (Department of Defense Financial Management Regulation - DoD 7000.14-R) and is a net-zero realignment of funds from Operations and Maintenance to Procurement within the NDU program.  \n\nThe objective is to modernize NDU's outdated IT infrastructure and associated classroom technology which will offset years of deferred lifecycle maintenance. This modernization includes replacing archaic and insecure network infrastructure, updating teaching spaces and tools, and providing the necessary resources to meet the operating standards defined by the Department of Defense (DOD) and the University accrediting standards. Specifically, NDU plans the following IT modernization efforts: \n\nUpgrade Campus Servers: Currently, 49% (67\/136 servers) of NDU campus servers are at End of Service (EOS) status.\n\nUpgrade Telecommunications Closets: Communication closets throughout NDU did not originally follow a configuration management process at installation.  As such, cable and physical security (e.g., badge readers) are not in accordance with industry standards, space layout is inefficient, and space environmental support is insufficient. Power temperature (due to HVAC limitations), electrical, and fire safety requirements are at maximum capacity. These inadequacies impose a significant risk to physical and information security as well as to personnel safety.\n\nUpgrade Teaching Facilities: Technology in 97 classrooms, conferences rooms, and auditoriums are also at end of service life.\n\nIn order to accomplish the aforementioned modernization goals, NDU will execute a long term strategy that involves both acquisition and execution elements over a multi-fiscal year timeframe.  Planned FY 2021 procurement include: \nClassroom Technology Audiovisual Upgrades: $1.5M (estimate)\nStorage and Server Upgrades: $1.1M (estimate)\nWorkstation Upgrades: $1.3M (estimate)\nAuditorium Upgrades: $2.1M (estimate)\n\nThis effort will enable NDU to meet its Professional Military Education mission requirement while maintaining an IT operational environment that is robust, efficient and agile to meet the vision of the Chairman of the Joint Chiefs."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}