{
    "id": "2021-AirForce-PB-3021F-MJBOOK-0-0-c133b5c69c0dacb3cfbca25b78206ead128e9faae1b5290eac9bb261214046ee-19",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-AIRFORCE_SPACE-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3021F",
        "appropriation_name": "Space Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "SPRNGE"
        },
        "LineItemTitle": {
            "val": "Spacelift Range System Space"
        },
        "P1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3021F"
        },
        "AppropriationTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "109.596"
                },
                "PriorYear": {
                    "val": "117.637"
                },
                "CurrentYear": {
                    "val": "118.14"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "345.373"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "109.596"
                },
                "PriorYear": {
                    "val": "117.637"
                },
                "CurrentYear": {
                    "val": "118.14"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "345.373"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "109.596"
                },
                "PriorYear": {
                    "val": "117.637"
                },
                "CurrentYear": {
                    "val": "118.14"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "345.373"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "1203182F"
                }
            ]
        },
        "Description": {
            "val": "In FY2021, P-1 Line Item SPRNGE\/Spacelift Range System Space efforts were transferred to Appropriation 3022, Procurement, Space Force, from Appropriation 3021 due to the creation of a new Appropriation for Space Force.\n\nThe Spacelift Range System (SLRS), also known as the Launch and Test Range System (LTRS), provides public safety and assured access to space. LTRS operates at the Eastern Range (ER) at Patrick AFB\/Cape Canaveral AFS, FL and the Western Range (WR) at Vandenberg AFB, CA. LTRS provides tracking, telemetry, communications, flight safety, and other capabilities to support launch of national security space (NSS), civil and commercial space payloads, Intercontinental and Sea Launched ballistic missile and missile defense evaluations, and aeronautical and guided weapon tests. LTRS ensures ability to meet the national launch requirement, safely support the launch cadence of ER\/WR launch requirement holders, and provide assured access to space for the nation.  The ER and WR are designated as Department of Defense Major Range and Test Facility Bases (MRTFB). LTRS is comprised of twelve subsystems that together provide this capability to the ranges. The Range Safety and Command Destruct subsystems provide the capability to destroy an errant rocket, if necessary to protect public safety. These subsystems rely on the Telemetry, Radar, and Optics subsystems to provide tracking data. The Weather and Surveillance subsystems allow range operators and customers to determine if conditions are safe for launch. The Communications, Data Handling, and Timing & Sequencing subsystems ensure critical data is expeditiously routed from remote sensors (e.g., radars, optics) to range operators and customers. Finally, the Planning and Scheduling subsystem ensures all assets are available when needed for a launch or test operation. The Air Force prioritizes procurement funds to ensure aging range equipment is modernized to support mission requirements. Sustainment trends are continuously analyzed and assessed across all twelve subsystems and procurement funds are used to modernize the most critical mission equipment and procure replacement components.\n\n1) LTRS Interim Supply Support: Provides peculiar and common support material, required re-procurement data, and interim supply support management.\n\n2) LTRS Support Services: FFRDC mission assurance activities ensure all twelve subsystems are compatible with mission rules and do not pose a risk to safe and cost-effective satellite launches. Funds are also used for Systems Engineering and Integration (SE&I) to ensure baseline documentation and modernization activities remain synchronized with the sustainment baseline.\n\n3) LTRS Commodity Procurement: The Air Force will use various contract vehicles to procure, configure, install, and checkout replacement commercial-off-the-shelf (COTS)commodity equipment to address the highest priority requirements. Obsolescence and sustainment \"worst actors\" in all twelve subsystems are prioritized annually in order of their criticality to the mission; priority is driven by likelihood of causing a launch delay\/scrub.\n\n4) Range Communications Facility (RCF): Relocate communications capabilities from the Eastern Range XY building to a new RCF, resolving building degradation, code non-compliance, and high risk off loading. The Air Force will either move existing equipment or procure new COTS equipment if necessary, to meet system requirements and minimize impacts to scheduled launches.\n\n5) Range Command Destruct Modernization (RCDM): Modernizes the Eastern Range Command Destruct Systems. The Range Command Destruct modernization will provide the capability to use a new secure Command Destruct code, the Enhanced Flight Termination System (EFTS), mandated by the NSA for cyber security on the Eastern Range. The Eastern Range Command Destruct system will replace a sustainment \"worst actor\" that has been the cause of an expensive launch scrub as well as several near scrubs. \n\n6) Modernization of Eastern Range Network (MEN): Upgrades the communications subsystem on the Eastern Range from outdated Asynchronous Transfer Mode (ATM) technology to Internet Protocol\n(IP) version 4\/6 (IPV4\/IPV6). MEN resolves obsolescence issues facing the program.  Starting in FY 2020, addresses high-priority sustainment issues, and provides improved cyber security for range operations. The contract was awarded as a small business set aside.\n\n7) Western Range Modernization of Network (WMN): Upgrades the communications subsystem on Western Range from Asynchronous Transfer Mode (ATM) technology to an IPv6 based\/IPv4 compatible network, resolving obsolescence issues, numerous high-priority sustainment issues, and providing improved cyber security for range operations. The WMN contract was awarded as a small business set aside.\n\nSpacelift Range Reduction divests funds from the current Spacelift Range System (SLRS) budgeted for future upgrades now made unnecessary by Autonomous Flight Safety System (AFSS) implementation. ROTF Projects will enable agile and resilient LTRS operations following full AFSS implementation.\n\nSpace acquisition must respond with speed and agility to emerging adversary threats.  Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture.  Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n\nFunding for this exhibit is contained in PE 1203182F.\n\nAs directed in the FY 2019 NDAA, Sec 825, amendment to PL 114-92 FY 2016 NDAA, Sec 828 Penalty for Cost Overruns, the FY19 penalty total is $50.0M. The calculated percentage reduction to each research, development, test and evaluation and procurement account will be allocated proportionally from all programs, projects, or activities under such account."
        },
        "Justification": {
            "val": "N\/A"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}