{
    "id": "2021-AirForce-PB-3080F-MJBOOK-0-0-c590c9030350a891429f5470b1c27c39f5e6d0801b3c9c48250d8688aab8f0e8-43",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-AIRFORCE_OTHER-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "835160"
        },
        "LineItemTitle": {
            "val": "USSTRATCOM"
        },
        "P1LineNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Air Force Communications"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "11.244"
                },
                "BudgetYearOneBase": {
                    "val": "4.337"
                },
                "BudgetYearOne": {
                    "val": "4.337"
                },
                "BudgetYearTwo": {
                    "val": "4.45"
                },
                "BudgetYearThree": {
                    "val": "4.527"
                },
                "BudgetYearFour": {
                    "val": "4.61"
                },
                "BudgetYearFive": {
                    "val": "4.695"
                },
                "Total": {
                    "val": "33.863"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "11.244"
                },
                "BudgetYearOneBase": {
                    "val": "4.337"
                },
                "BudgetYearOne": {
                    "val": "4.337"
                },
                "BudgetYearTwo": {
                    "val": "4.45"
                },
                "BudgetYearThree": {
                    "val": "4.527"
                },
                "BudgetYearFour": {
                    "val": "4.61"
                },
                "BudgetYearFive": {
                    "val": "4.695"
                },
                "Total": {
                    "val": "33.863"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "11.244"
                },
                "BudgetYearOneBase": {
                    "val": "4.337"
                },
                "BudgetYearOne": {
                    "val": "4.337"
                },
                "BudgetYearTwo": {
                    "val": "4.45"
                },
                "BudgetYearThree": {
                    "val": "4.527"
                },
                "BudgetYearFour": {
                    "val": "4.61"
                },
                "BudgetYearFive": {
                    "val": "4.695"
                },
                "Total": {
                    "val": "33.863"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The USSTRATCOM COMMAND AND CONTROL FACILITY (C2F) IT Enterprise will incorporate all facets of the previously reported within PE 0303255F, USSTRATCOM C2 SYSTEMS LIFECYCLE HARDWARE MANAGEMENT (old C2 Modernization), ANALYSIS AND TARGETING, and FORCE SURVIVABILITY, ANALYSIS, AND MANAGEMENT SYSTEM (FSAM). The USSTRATCOM REPLACEMENT FACILITY FIT-OUT program does not have funding in FY20. All programs and systems will now ride on enterprise infrastructure, and be reported under BPAC 835160 PE 11301F, except the GDC2 program. It will continue to be reported under PE 0303255F, but is a separate program included in BPAC 835160.\n\nThis is not a new start.\n\n     a. USSTRATCOM C2 SYSTEMS LIFECYCLE HARDWARE MANAGEMENT:  This effort provides the C2 infrastructure and hardware to acquire, process, and deliver information, as needed, to enhance decision making for USSTRATCOM.  This effort employs a set of underlying information services, technologies, and tools that enable the Commander of USSTRATCOM to achieve broad operational warfighting capabilities.   The C2F IT Enterprise adds capability as it builds to a final architecture. The cyber architecture is a collection of distributed databases and applications, integrated through a grid of supporting services. This effort was previously referred to as \"C2 Modernization and reported under BPAC 833140, PE 0303255F and is NOT a new start.\n\nBeginning in FY20 this program will be captured under the USSTRATCOM IT Enterprise construct, BPAC 835160, PE 0101301F\n\n     b. ANALYSIS AND TARGETING - JOINT WARFARE ANALYSIS CENTER (JWAC):  effort provides the hardware that enables the JWAC to develop and recommend strategic technical solutions.  JWAC coordinates directly with the staffs of all Unified Commands, Department of Defense (DoD) elements, Combatant Commands, military services, and other government departments and agencies to respond to crises.\n\nBeginning in FY20 this program will be captured under the USSTRATCOM IT Enterprise construct, BPAC 835160, PE 0101301F\n\n\n     c. FORCE SURVIVABILITY, ANALYSIS, AND MANAGEMENT: Provides a decision support system and is designed to provide the commander with Force Management (pre attack) and Force Survival (post attack) information needed to ensure survival of strategic forces.  Provides the commander vital decision making data by correlating strategic force status reported by Force Status Reporting (FSR) with missile attack warning information. Processing and Display Subsystem - Migration (PDS-M) will continue to provide the commander with missile attack warning information\n\nBeginning in FY20 this program will be captured under the USSTRATCOM IT Enterprise construct, BPAC 835160, PE 0101301F\n\n     d. GLOBAL DISTRIBUTED COMMAND AND CONTROL (GDC2):  Detailed information is classified and will be provided on a need to know basis. For further information please contact the Strategic C2 Systems Branch (SAF\/AQID) at (202) 404-3405.  This effort will not be reported as part of the IT Enterprise.  GDC2 will continue to be reported under PE 0303255F within BPAC 835160\n\n     e. USSTRATCOM REPLACEMENT FACILITY FIT-OUT:  No funding in FY20 and out"
        },
        "Justification": {
            "val": "USSTRATCOM IT Enterprise - This effort provides the Command and Control infrastructure and hardware to acquire, process, and deliver information, as needed, to enable and enhance decision making for USSTRATCOM.  USSTRATCOM is tasked with vital roles for our nation.  These roles require secure and survivable infrastructure in order to conduct strategic planning, warfighting operations, provide global situational awareness to the National Command Authorities and Combatant Commands, aid the President's nuclear response decision-making process.  This effort employs a set of underlying information services, technologies, and tools to ensure a standard configuration of information technology architecture that operationalizes USSTRATCOM's mission priorities, with a Combat-Ready Force prepared for Decisive Response.  The enterprise architecture is a collection of distributed databases and applications, integrated through a cloud-based infrastructure. The facility includes features and capabilities such as secure High-Altitude Electromagnetic Pulse (HEMP) Shielded Command and Control Center, Installation Processing Node, multiple 24\/7 mission operations centers, storage and maintenance areas, labs\/workrooms, backup generators, Uninterruptible Power Source, and Technical Control Facility."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}