{
    "id": "2021-AirForce-PB-3010F-MJBOOK-0-0-0855568a0397934f117decffb4c5a1baaeed4bd9a13c818c396a669d1b137dfa-22",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-AIRFORCE_AIRCRAFT_VOL2-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3010F",
        "appropriation_name": "Aircraft Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "B05200"
        },
        "LineItemTitle": {
            "val": "B-52"
        },
        "P1LineNumber": {
            "val": "76"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3010F"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Aircraft Supt Equipment & Facilities"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Post Production Support"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "12.819"
                },
                "CurrentYear": {
                    "val": "2.341"
                },
                "BudgetYearOneBase": {
                    "val": "1.034"
                },
                "BudgetYearOne": {
                    "val": "1.034"
                },
                "BudgetYearTwo": {
                    "val": "5.756"
                },
                "BudgetYearThree": {
                    "val": "5.859"
                },
                "BudgetYearFour": {
                    "val": "0.104"
                },
                "BudgetYearFive": {
                    "val": "0.106"
                },
                "Total": {
                    "val": "28.019"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "12.819"
                },
                "CurrentYear": {
                    "val": "2.341"
                },
                "BudgetYearOneBase": {
                    "val": "1.034"
                },
                "BudgetYearOne": {
                    "val": "1.034"
                },
                "BudgetYearTwo": {
                    "val": "5.756"
                },
                "BudgetYearThree": {
                    "val": "5.859"
                },
                "BudgetYearFour": {
                    "val": "0.104"
                },
                "BudgetYearFive": {
                    "val": "0.106"
                },
                "Total": {
                    "val": "28.019"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "12.819"
                },
                "CurrentYear": {
                    "val": "2.341"
                },
                "BudgetYearOneBase": {
                    "val": "1.034"
                },
                "BudgetYearOne": {
                    "val": "1.034"
                },
                "BudgetYearTwo": {
                    "val": "5.756"
                },
                "BudgetYearThree": {
                    "val": "5.859"
                },
                "BudgetYearFour": {
                    "val": "0.104"
                },
                "BudgetYearFive": {
                    "val": "0.106"
                },
                "Total": {
                    "val": "28.019"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0101113F"
                }
            ]
        },
        "Description": {
            "val": "The B-52H Combat Network Communication Technology (CONECT) acquisition project supports nuclear and conventional operations by upgrading the B-52H fleet with data and voice communications capabilities along with improved threat and situational awareness to support participation in network centric operations. This CONECT modification includes procurement of 74 aircraft kits + 2 EMD kits that will be installed in conjunction with Programmed Depot Maintenance (PDM). Ground station mission planning hardware, support equipment, initial spares, and Interim Contractor Support will be procured. Additional initial support\/readiness efforts will develop and upgrade B-52H training devices with CONECT functionality. The CONECT training device upgrades provide full CONECT functionality to support aircrew training. The Aircrew Training Devices (ATDs) include three B-52H Weapon System Trainers (WST) and two Offensive Station Mission Trainers (OSMT), and the upgrades will also be installed in the Systems Integration Lab (SIL). The Other Government Cost line includes, but is not limited to, Diminishing Manufacturing Sources (DMS) costs to maintain the production configuration through the identification, review and monitoring of items with high obsolescence risk potential, classification of identified items according to criticality, identification of alternatives and implementation of resolutions. Resolutions may include non-recurring engineering (NRE) and\/or replacement costs for DMS components, bridge buys of DMS components until NRE can be completed or Life of Type buys, whichever is most appropriate. Included in the Support Equipment line is the planning for establishment of an organic Depot capability, stand-up of the depot, procurement of depot equipment and procurement of the CONECT ground station. Funds may be used to address emerging and short-notice Diminishing Manufacturing and Material Shortage (DMSMS) issues. DMS efforts to include removal of end-of-life software\/hardware within simulators systems and move to a modular, common open system architecture that is sustainable and cyber-resilient. Implement requirements and standards defined under the Simulator Common Architecture Requirements and Standards (SCARS) initiative.\n  \nThis modification is planned to be done in conjunction with Programmed Depot Maintenance (PDM).  In addition, training devices will be upgraded to include CONECT functionality to meet user training requirements.\n\nPost Production Support funds Interim Contract Support (ICS) until the depot is established for CONECT.  Diminishing Manufacturing Sources (DMS) costs to maintain the production configuration through the identification, review and monitoring of items with high obsolescence risk potential, classification of identified items according to criticality, identification of alternatives and implementation of resolutions. Resolutions may include non-recurring engineering (NRE) and\/or replacement costs for DMS components, bridge buys of DMS components until NRE can be completed or Life of Type buys, whichever is most appropriate. Funds may be used to address emerging and short-notice Diminishing Manufacturing and Material Shortage (DMSMS) issues. DMS efforts to include removal of end-of-life software\/hardware within simulators systems and move to a modular, common open system architecture that is sustainable and cyber-resilient. Implement requirements and standards defined under the Simulator Common Architecture Requirements and Standards (SCARS) initiative.\n\nThis program has associated Research Development Test and Evaluation (RDT&E) funding in PE 0101113F.\n\nFunds may be used for emerging DMS, DMSMS, and Interim Contract Support that is required.\n\nFunds may be used to address emerging and short notice DMS and DMSMS issues. Funds may be used to resolve emerging safety of flight and DMS issues, accommodate technology insertion and fulfill FAA or other mandates necessary to ensure continued aircrew safety and mission effectiveness."
        },
        "Justification": {
            "val": "Post Production Support funds Interim Contract Support (ICS) are required until the depot is established for CONECT."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}