{
    "id": "2021-Navy-PB-1109N-JBOOK-9cf80abb15b69f28c5680bbd610d6b63fb9c51c4c1f66cea677aec9a0d624efe-48",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@suppressOutfittingDeliveryBY2ToBY5": "true",
        "LineItemNumber": {
            "val": "7000"
        },
        "LineItemTitle": {
            "val": "Spares and Repair Parts"
        },
        "P1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Spares and Repair Parts"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Spares And Repair Parts"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "24.137"
                },
                "CurrentYear": {
                    "val": "33.47"
                },
                "BudgetYearOneBase": {
                    "val": "27.295"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "27.295"
                },
                "BudgetYearTwo": {
                    "val": "33.304"
                },
                "BudgetYearThree": {
                    "val": "34.028"
                },
                "BudgetYearFour": {
                    "val": "34.709"
                },
                "BudgetYearFive": {
                    "val": "43.142"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "24.137"
                },
                "CurrentYear": {
                    "val": "33.47"
                },
                "BudgetYearOneBase": {
                    "val": "27.295"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "27.295"
                },
                "BudgetYearTwo": {
                    "val": "33.304"
                },
                "BudgetYearThree": {
                    "val": "34.028"
                },
                "BudgetYearFour": {
                    "val": "34.709"
                },
                "BudgetYearFive": {
                    "val": "43.142"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "24.137"
                },
                "CurrentYear": {
                    "val": "33.47"
                },
                "BudgetYearOneBase": {
                    "val": "27.295"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "27.295"
                },
                "BudgetYearTwo": {
                    "val": "33.304"
                },
                "BudgetYearThree": {
                    "val": "34.028"
                },
                "BudgetYearFour": {
                    "val": "34.709"
                },
                "BudgetYearFive": {
                    "val": "43.142"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206211M"
                },
                {
                    "val": "0206625M"
                },
                {
                    "val": "0204460M"
                },
                {
                    "val": "0206313M"
                },
                {
                    "val": "0206315M"
                },
                {
                    "val": "0305208M"
                }
            ]
        },
        "Description": {
            "val": "Spares - Funds are required to reimburse the Navy Working Capital Fund for both repairable and consumable components at the time the initial spare parts package is released with the principal end item (PEI) to the Fleet Marine Force.  This concept complies with the Navy Working Capital Fund funding of Initial Spares with reimbursement from the Procurement Account.  Funds also provide for direct vendor support of the PEI delivery to the Fleet Marine Force.  \n\nThis account has funding for the following programs:\nSecure Mobile Anti-Jam Reliable Tactical-Terminal (SMART-T), Tactical Remote Sensor System (TRSS), Intelligence Analysis System (IAS), Terrestrial Collection, LAV-Anti Tank System Program, LAV Reset Program, M1A1 Modification, Family of Material Handling Equipment (FMHE), Ground\/Air Task Oriented Radar (G\/ATOR AN\/TPS-80), RQ-21A Small Tactical UAS, General Purpose Tool and Test Systems (GPTTS), Amphibious Combat Vehicle Family of Vehicles (ACV FOV), and Training Simulation Support (TSS)\/Training Devices."
        },
        "Justification": {
            "val": "FY 2019: $24.137M \n\nACV Family of Vehicles (FOV) BLI 2025:  $6.145M provides for initial spares for communication suites, Driver's Vision Enhancer, Exportable Power, Joint Battle Command-Platform (JBC-P), and Amphibious Remote Weapon Stations (ARWS).  Initial spares for ACV FOV are procured commensurate with the end items they support based on lead time for procurement.\n\nLAV Reset BLI 2038: $5.735M procures spares for direct vendor support required for the fielding of the Reset kits on the Light Armored Vehicle.\n\nGeneral Purpose Tool and Test Equipment BLI 4181: $0.174M supports reimbursement to the working capital funds for spares acquired and needed during test support.\n\nAN\/TPS-80 Ground Air Task Oriented Radar (G\/ATOR) BLI 4655: $11.611M provides spares funding to support Gallium Nitride (GaN) LRIP systems procured in FY18. FY19 Spares funding is required to procure the initial provisioning package to primarily support those GaN LRIP systems being procured in FY18 and fielded in FY20, as over 90 percent of the G\/ATOR spares have a lead time exceeding 12 months. The spares funding increases ($0.194M) from FY18 to FY19 supporting the fielding of three (3) new systems in FY20 for a total of fifteen (15) G\/ATOR systems fielded through FY20. Adequate sparing is essential so Marine Operational Forces will have the necessary repair parts to operate and maintain newly fielded G\/ATOR Radar Systems and to avoid a significant risk of not meeting the program's important Key Performance Parameter (KPP) 8; Sustainment.\n\nIAS BLI 4747: $0.160M of spares funding provides for direct vendor support of the principal end item (PEI) components delivery to the Fleet Marine Force.\n\nTerrestrial Collection BLI 4747: $0.261M provides for purchase of equipment spares necessary to keep ground-based imagery collection and dissemination assets and sensor systems in operation, ensuring spares are available to the warfighter when breakage occurs to minimize equipment down-time.\n\nTraining Simulation Support (TSS)\/Training Devices BLI 6532: $0.051M funds procurement of low density, minor (low cost) MAGTF ground training equipment, simulators and simulations to include devices such as medical training kits, climbing walls, weapons models and mockups that enhance basic occupational and combat skills across the wide spectrum of tactics, techniques, procedures and proficiency. \n\n\nFY 2020: $33.470M\n\nACV FOV BLI 2025:  $13.954M will provide for initial spares for communication suites, Driver's Vision Enhancer, Exportable Power, Joint Battle Command-Platform (JBC-P), and Amphibious Remote Weapon Stations (ARWS).  Initial spares for ACV 1.1 are procured commensurate with the end items they support based on lead time for procurement. \n\nLAV Reset Program BLI 2038: $5.883M funding will provide spares for direct vendor support required for the fielding of the Reset kits on the Light Armored Vehicle.\n\nGeneral Purpose Tool and Test Equipment BLI 4181: $0.178M procures equipment spares for newly fielded mechanical test equipment, electrical test equipment, and tool sets and kits.  Funding ensures critical spares are available to the warfighter when breakage occurs to minimize equipment down time.\n\nAN\/TPS-80 Ground Air Task Oriented Radar (G\/ATOR) BLI 4655: $13.235M provides spares funding to support the Lot One Full Rate Production (FRP) systems procured in FY19. FY20 spares funding is required to procure the initial provisioning package (IPP) which consists of over one hundred assemblies\/parts with over 60 critical items to include Five-Axis Motor Controllers and Dual Leaf Assemblies. Funding will primarily support the Lot One FRP systems being procured in FY19 and fielded in FY22, as over 90 percent of the G\/ATOR spares have a lead time exceeding 12 months. Thus, the FY20 spares funding will obligate in FY20 and deliver Spares in FY22 to align with end item systems deliveries. The funding in FY20 is also required for the decentralized distribution of initial spares from LOGCOM to the Repair Inventory Points at each Marine Expeditionary Force, as required. Additionally, adequate sparing is essential so Fleet Marine Forces will have the necessary repair parts to operate and maintain newly fielded G\/ATOR Radar Systems and to avoid placing the program at significant risk of not meeting its important Key Performance Parameter (KPP) 8 of Sustainment.\n\nIntelligence Analysis System (IAS) BLI 4767: $0.166M of spares funding will provide for direct vendor support of the principal end item (PEI) components delivery to the Fleet Marine Force.\n\nFamily of Material Handling Equipment (FMHE) BLI 6544: $0.054M provides for the replacement and Service Life Extension Program (SLEP) of Marine Corps MHE such as forklifts, cranes, and container handlers.  This budget line item also includes funding for equipment such as the Light Capability Rough Terrain Forklift (LCRTF), Hydraulic Excavator (HYEX), Extendable Boom Forklift Modernization (EBFL-M), Rough Terrain Container Handler (RTCH) SLEP and the Tractor, Rubber Tires, and Articulated Steering, Multiple Purpose (TRAM) SLEP.  \n\nFY 2021 Base Appropriation Request: $27.295M\n\nThe primary reason for the $6.175M decrease between FY20 and FY21 is due to the Spares procurement for LAV Reset was completed in FY20. \n\nACV FOV BLI 2025:  $13.557M will provide for initial spares for communication suites, Driver's Vision Enhancer, Exportable Power, Joint Battle Command-Platform (JBC-P), and Amphibious Remote Weapon Stations (ARWS).  Initial spares for ACV FOV are procured commensurate with the end items they support based on lead time for procurement. The decrease of $0.397M between FY20  and FY21 is attributed to decreased requirement for Contractor Furnished Deployment spares.\n\nGeneral Purpose Tool and Test Equipment BLI 4181: $0.180M will procure equipment spares for newly fielded mechanical test equipment, electrical test equipment, and tool sets and kits.  Funding ensures critical spares are available to the warfighter when breakage occurs to minimize equipment down time.\n\nFamily of Material Handling Equipment (FMHE) BLI 6544: $0.052M will provide for the replacement and Service Life Extension Program (SLEP) of Marine Corps MHE such as forklifts, cranes, and container handlers.  This budget line item also includes funding for equipment such as the Light Capability Rough Terrain Forklift (LCRTF), Hydraulic Excavator (HYEX), Extendable Boom Forklift Modernization (EBFL-M), Rough Terrain Container Handler (RTCH) SLEP and the Tractor, Rubber Tires, and Articulated Steering, Multiple Purpose (TRAM) SLEP.\n\nAN\/TPS-80 Ground Air Task Oriented Radar (G\/ATOR) BLI 4655: $13.506M will provide spares funding to support the Lot Two Full Rate Production (FRP) systems procured in FY20. FY21 spares funding is required to procure the initial provisioning package (IPP) which consists of over one hundred assemblies\/parts with over 60 critical items to include Five-Axis Motor Controllers and Dual Leaf Assemblies. Funding will primarily support the Lot Two FRP systems being procured in FY20 and fielded in FY23, as over 90 percent of the G\/ATOR spares have a lead time exceeding 12 months. Thus, the FY21 spares funding will obligate in FY21 and deliver Spares in FY23 to align with end item systems deliveries. The spares funding increase of $0.271M will support the fielding of eight (8) new systems beginning in FY23 for a total of twenty five (25) G\/ATOR systems fielded through FY23. The funding in FY21 is also required for the decentralized distribution of initial spares from LOGCOM to the Repair Inventory Points at each Marine Expeditionary Force, as required. Additionally, adequate sparing is essential so Fleet Marine Forces will have the necessary repair parts to operate and maintain newly fielded G\/ATOR Radar Systems and to avoid placing the program at significant risk of not meeting its important Key Performance Parameter (KPP) 8 of Sustainment."
        },
        "ItemExhibitList": {
            "P18Item": {
                "Name": {
                    "val": "PMC spares"
                },
                "InitialSpares": {
                    "EndItemBudgetActivity": [
                        {
                            "BudgetActivityNumber": {
                                "val": "2"
                            },
                            "BudgetActivityTitle": {
                                "val": "Weapons and combat vehicles"
                            },
                            "EndItemList": {
                                "EndItem": [
                                    {
                                        "Name": {
                                            "val": "Amphibious Combat Vehicle Family of Vehicles"
                                        },
                                        "LineItemNumber": {
                                            "val": "2025"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "6.145"
                                            },
                                            "CurrentYear": {
                                                "val": "13.954"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "13.557"
                                            },
                                            "BudgetYearOne": {
                                                "val": "13.557"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "LAV PIP"
                                        },
                                        "LineItemNumber": {
                                            "val": "2038"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "5.735"
                                            },
                                            "CurrentYear": {
                                                "val": "5.883"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0"
                                            }
                                        }
                                    }
                                ]
                            }
                        },
                        {
                            "BudgetActivityNumber": {
                                "val": "4"
                            },
                            "BudgetActivityTitle": {
                                "val": "Communications and Electronics Equipment"
                            },
                            "EndItemList": {
                                "EndItem": [
                                    {
                                        "Name": {
                                            "val": "Repair and Test Equipment"
                                        },
                                        "LineItemNumber": {
                                            "val": "4181"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "0.174"
                                            },
                                            "CurrentYear": {
                                                "val": "0.178"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.18"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.18"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Ground\/Air Task Oriented Radar (G\/ATOR)"
                                        },
                                        "LineItemNumber": {
                                            "val": "4655"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "11.611"
                                            },
                                            "CurrentYear": {
                                                "val": "13.235"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "13.506"
                                            },
                                            "BudgetYearOne": {
                                                "val": "13.506"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Intelligence Support Equipment"
                                        },
                                        "LineItemNumber": {
                                            "val": "4747"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "0.421"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Distributed Common Ground System (DCGS-MC)"
                                        },
                                        "LineItemNumber": {
                                            "val": "4767"
                                        },
                                        "Cost": {
                                            "CurrentYear": {
                                                "val": "0.166"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0"
                                            }
                                        }
                                    }
                                ]
                            }
                        },
                        {
                            "BudgetActivityNumber": {
                                "val": "6"
                            },
                            "BudgetActivityTitle": {
                                "val": "Engineer and Other Equipment"
                            },
                            "EndItemList": {
                                "EndItem": [
                                    {
                                        "Name": {
                                            "val": "Training Devices"
                                        },
                                        "LineItemNumber": {
                                            "val": "6532"
                                        },
                                        "Cost": {
                                            "PriorYear": {
                                                "val": "0.051"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0"
                                            }
                                        }
                                    },
                                    {
                                        "Name": {
                                            "val": "Family of Construction Equipment"
                                        },
                                        "LineItemNumber": {
                                            "val": "6544"
                                        },
                                        "Cost": {
                                            "CurrentYear": {
                                                "val": "0.054"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.052"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0.052"
                                            }
                                        }
                                    }
                                ]
                            }
                        }
                    ],
                    "SubtotalSparesCost": {
                        "PriorYear": {
                            "val": "24.137"
                        },
                        "CurrentYear": {
                            "val": "33.47"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.295"
                        },
                        "BudgetYearOne": {
                            "val": "27.295"
                        }
                    }
                },
                "TotalSparesCost": {
                    "PriorYear": {
                        "val": "24.137"
                    },
                    "CurrentYear": {
                        "val": "33.47"
                    },
                    "BudgetYearOneBase": {
                        "val": "27.295"
                    },
                    "BudgetYearOne": {
                        "val": "27.295"
                    }
                }
            }
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}