{
    "id": "2021-Navy-PB-1109N-JBOOK-9cf80abb15b69f28c5680bbd610d6b63fb9c51c4c1f66cea677aec9a0d624efe-39",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-NAVY_MARINECORPS-U_PROCUREMENT_JustificationBook_Navy_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@suppressOutfittingDeliveryBY2ToBY5": "true",
        "LineItemNumber": {
            "val": "6366"
        },
        "LineItemTitle": {
            "val": "Power Equipment Assorted"
        },
        "P1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Engineer and Other Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "393.086"
                },
                "PriorYear": {
                    "val": "14.683"
                },
                "CurrentYear": {
                    "val": "22.441"
                },
                "BudgetYearOneBase": {
                    "val": "23.43"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "23.43"
                },
                "BudgetYearTwo": {
                    "val": "24.019"
                },
                "BudgetYearThree": {
                    "val": "26.419"
                },
                "BudgetYearFour": {
                    "val": "26.946"
                },
                "BudgetYearFive": {
                    "val": "27.486"
                },
                "Total": {
                    "val": "558.51"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "393.086"
                },
                "PriorYear": {
                    "val": "14.683"
                },
                "CurrentYear": {
                    "val": "22.441"
                },
                "BudgetYearOneBase": {
                    "val": "23.43"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "23.43"
                },
                "BudgetYearTwo": {
                    "val": "24.019"
                },
                "BudgetYearThree": {
                    "val": "26.419"
                },
                "BudgetYearFour": {
                    "val": "26.946"
                },
                "BudgetYearFive": {
                    "val": "27.486"
                },
                "Total": {
                    "val": "558.51"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "393.086"
                },
                "PriorYear": {
                    "val": "14.683"
                },
                "CurrentYear": {
                    "val": "22.441"
                },
                "BudgetYearOneBase": {
                    "val": "23.43"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "23.43"
                },
                "BudgetYearTwo": {
                    "val": "24.019"
                },
                "BudgetYearThree": {
                    "val": "26.419"
                },
                "BudgetYearFour": {
                    "val": "26.946"
                },
                "BudgetYearFive": {
                    "val": "27.486"
                },
                "Total": {
                    "val": "558.51"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206624M"
                }
            ]
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Navy Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "14.683"
                                },
                                "CurrentYear": {
                                    "val": "20.573"
                                },
                                "BudgetYearOneBase": {
                                    "val": "21.521"
                                },
                                "BudgetYearOne": {
                                    "val": "21.521"
                                },
                                "BudgetYearTwo": {
                                    "val": "22.072"
                                },
                                "BudgetYearThree": {
                                    "val": "24.431"
                                },
                                "BudgetYearFour": {
                                    "val": "24.918"
                                },
                                "BudgetYearFive": {
                                    "val": "25.417"
                                }
                            }
                        }
                    },
                    {
                        "Name": {
                            "val": "Navy Reserve"
                        },
                        "Cost": {
                            "TotalCost": {
                                "CurrentYear": {
                                    "val": "1.868"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.909"
                                },
                                "BudgetYearOne": {
                                    "val": "1.909"
                                },
                                "BudgetYearTwo": {
                                    "val": "1.947"
                                },
                                "BudgetYearThree": {
                                    "val": "1.988"
                                },
                                "BudgetYearFour": {
                                    "val": "2.028"
                                },
                                "BudgetYearFive": {
                                    "val": "2.069"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "14.683"
                    },
                    "CurrentYear": {
                        "val": "22.441"
                    },
                    "BudgetYearOneBase": {
                        "val": "23.43"
                    },
                    "BudgetYearOne": {
                        "val": "23.43"
                    },
                    "BudgetYearTwo": {
                        "val": "24.019"
                    },
                    "BudgetYearThree": {
                        "val": "26.419"
                    },
                    "BudgetYearFour": {
                        "val": "26.946"
                    },
                    "BudgetYearFive": {
                        "val": "27.486"
                    }
                }
            }
        },
        "Description": {
            "val": "FAMILY OF MOBILE POWER EQUIPMENT - The Family of Mobile Electric Power Equipment consists of command and control systems for power management and distribution (intelligent power management), tactical generators ranging from 2 to 100 kilowatts, power distribution systems, energy storage systems, load banks, floodlights, cabling, and electrician tool kits. This equipment is procured and fielded to manage and provide electricity on the battlefield. Systems may be mounted on prime movers, skids or trailers. Systems support maneuver, combat support, and combat service support units requiring tactical power to operate weapons systems, Command, Control, Communications, Computers and Intelligence (C4I) systems, medical and messing facilities, environmental control equipment, and water purification systems. With over 10,000 generators and using diesel engines in the Operating Forces, improving their fuel efficiency and reliability will be a significant contribution to reducing the USMC fuel demand, and lightening the Marine Air-Ground Task Force (MAGTF). The Warfighter benefit includes a decreased logistics footprint, less reliance on petroleum derived fuels, increased local energy security, and reduced tanker losses (fewer on the road). The operational imperative to reduce fuel usage will consequently reduce refueling operations and exposing Marines to hazardous fuel convoy operations.\n\nEfforts encompass procurements of the following principal end items and ancillary equipment:\nIntelligent Power Management Systems (IPMS) provide a robust, modular, and scalable solution to interconnect, control, store and distribute power from various sources. As a result, the power requirements will be met in a more efficient manner by matching power production to load demand, reducing spinning reserve, extending maintenance cycle times, and reducing fuel consumption. The IPMS will consist of a micro-gridding capability which will consist of the Advance Digital Control System, which is a product improvement for the Advance Medium Mobile Power Source generators, an Intelligent Power Distribution (IPD) system, an Energy Storage Unit (ESU), a Metering and Monitoring capability, and it will eventually integrate renewables.\n\nFAMILY OF ADVANCED POWER SOURCES (APS) - This family consists of multiple suites of devices, grouped into sub-families, that are used to provide highly expeditionary power (hand-carried or vehicle mounted) to operate and power communications equipment, computers and peripheral equipment in place of disposable batteries, and for scenarios where fuel powered generators are too large, too heavy, unsuitable for use, or provide undue logistics burden due to refueling needs\n\nEfforts encompass procurements of the following principal end items and ancillary equipment:\nDevices encompass renewable and hybrid energy based systems, and includes the man-portable Ground Renewable Expeditionary Energy Network System (GREENS) that supports a company level operations center and Forward Operating Base, the man-packable Solar Portable Alternative Communications Energy Systems (SPACES) that supports Combat Outposts and Observation Points, and the Mobile Electric Hybrid Power Source (MEHPS) that provides up to 10kW to power mission command and control, information networks, communications, environmental control, life support, sustainment and illumination at the battalion level. All of these exploit the use of solar energy and power management technologies to recharge batteries and directly power electronic equipment without a need, or with a reduced need for re-fueling generators."
        },
        "Justification": {
            "val": "FY 2019: $14.683M (Active: $14.683M\/Reserve: $0.000M)\n\nMOBILE POWER EQUIPMENT $8.122M (ACTIVE: $8.122M\/RESERVE: $0.000M)\nFunded the procurement of IPMS subsystems Advanced Medium Mobile Power Source (AMMPS) Advanced AMMPS Digital Control System (ADCS), AMMPS generators, and various logistics support. Legacy equipment is fueled by fossil fuels. Intelligent Power Management System and micro-gridding serve to decrease the size of diesel-fueled generators required by networking equipment. The \"brains\" of the system, the controller (Advanced Digital Control System), tells the system when to run off the generator, and when to run off energy storage systems (batteries). The phases of this IPMS system will first acquire IPD, and in a later phase, Energy Storage Units (batteries) that will reduce reliance on fossil fuel, and reduce the volume and frequency of resupply missions required to provide consumable items for corrective or preventive maintenance activities, reducing logistics footprint and lightening the load. The Approved Acquisition Objective (AAO) for Micro-grid Advanced Digital Control System (MADCS), formerly titled AMMPS DCS Kits in the FY 2019 request, increased from 179 to 328 units. This increase is largely being supported by the budget originally identified for Large Advanced Mobile Power System (LAMPS) Program which cancelled in FY18, and IPMS Energy Storage Unit (ESU), formerly titled Micro-grid Storage\/IPM in the FY 2019 request, which experienced programmatic adjustments also in FY 2018.\n\nADVANCED POWER SOURCES $6.561M (Active: $6.561M\/Reserve: $0.000M) \nContinues to fund the procurement and fielding of Advanced Battery Chargers. \n\nFY 2020: $22.441M (Active: $20.573M\/Reserve: $1.868M)\n\nMOBILE POWER EQUIPMENT $12.058M (Active: $12.058M\/Reserve: $0.000M)\nFunds the procurement of (AMMPS, Advanced Digital Control System (ADCS), Advance Medium Mobile Power System (AMMPS) generators, and logistics support. \n\nADVANCED POWER SOURCES $10.383M (Active: $8.515M\/Reserve: $1.868M) \nContinues to fund the procurement and fielding of Advanced Battery Charger as well as awarding the MEHPS production contract.  \n\nFY 2021 Base Appropriation Request: $23.430M (Active: $21.521M\/Reserve: $1.909M)\n\nMOBILE POWER EQUIPMENT $7.670M (Active: $7.670M\/Reserve: $0.000M)\nFunds will continue the procurement of the Intelligent Power Management System (IPMS) Intelligent Power Distribution (IPD) Panels. Funding decreased from FY20 to FY21 by $4.388M due to non-recurring costs absorbed in FY20 with the full rate production of IPDs.  \n\nFunding in this line item has been reprioritized while ensuring the Marine Corps continues to evolve toward a Force that is aligned with the National Defense Strategy.\n\nADVANCED POWER SOURCES $15.760M (Active: $13.851M\/Reserve: $1.909M)\nContinues to fund the procurement and fielding of MEHPS.  The increase in Advanced Power Sources funding of $5.377M from FY20 to FY21 is due to the production and fielding of MEHPS.\n\nOCO: \nFY 2019 Overseas Contingency Operations (OCO) Request:  N\/A\nFY 2020 Overseas Contingency Operations (OCO) Request:  N\/A\nFY 2021 Overseas Contingency Operations (OCO) Request:  N\/A"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "Power Equipment Assorted"
                    },
                    "ItemNumber": {
                        "val": "1"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "393.086"
                            },
                            "PriorYear": {
                                "val": "14.683"
                            },
                            "CurrentYear": {
                                "val": "22.441"
                            },
                            "BudgetYearOneBase": {
                                "val": "23.43"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "23.43"
                            }
                        },
                        "NetProcurementP1": {
                            "AllPriorYears": {
                                "val": "393.086"
                            },
                            "PriorYear": {
                                "val": "14.683"
                            },
                            "CurrentYear": {
                                "val": "22.441"
                            },
                            "BudgetYearOneBase": {
                                "val": "23.43"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "23.43"
                            }
                        },
                        "TotalObligationAuthority": {
                            "AllPriorYears": {
                                "val": "393.086"
                            },
                            "PriorYear": {
                                "val": "14.683"
                            },
                            "CurrentYear": {
                                "val": "22.441"
                            },
                            "BudgetYearOneBase": {
                                "val": "23.43"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "23.43"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "Mobile Power Equipment"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "1.1.1) Advanced Medium Mobile Power Systems (AMMPS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "171.751"
                                                        },
                                                        "PriorYear": {
                                                            "val": "3.846"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.2) Micro-grid ADCS (MADCS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "2.849"
                                                        },
                                                        "PriorYear": {
                                                            "val": "4.276"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "1.1.3) IPMS Intelligent Power Distribution (IPD)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "CurrentYear": {
                                                            "val": "12.058"
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "val": "7.67"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "7.67"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "174.6"
                                            },
                                            "PriorYear": {
                                                "val": "8.122"
                                            },
                                            "CurrentYear": {
                                                "val": "12.058"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "7.67"
                                            },
                                            "BudgetYearOne": {
                                                "val": "7.67"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "174.6"
                                        },
                                        "PriorYear": {
                                            "val": "8.122"
                                        },
                                        "CurrentYear": {
                                            "val": "12.058"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.67"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.67"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "Advanced Power Sources"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "2.1.1) Mobile Electric Hybrid Power Source (MEHPS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "13.851"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "13.851"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2.1.2) Mobile Electric Hybrid Power Source (MEHPS) Reserves"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1.909"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.909"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2.1.3) Advanced Power Sources (APS)"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "115.382"
                                                        },
                                                        "PriorYear": {
                                                            "val": "6.561"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "8.515"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "2.1.4) Advanced Power Sources (APS) Reserves"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "AllPriorYears": {
                                                            "val": "11.274"
                                                        },
                                                        "CurrentYear": {
                                                            "val": "1.868"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "AllPriorYears": {
                                                "val": "126.656"
                                            },
                                            "PriorYear": {
                                                "val": "6.561"
                                            },
                                            "CurrentYear": {
                                                "val": "10.383"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "15.76"
                                            },
                                            "BudgetYearOne": {
                                                "val": "15.76"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "126.656"
                                        },
                                        "PriorYear": {
                                            "val": "6.561"
                                        },
                                        "CurrentYear": {
                                            "val": "10.383"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.76"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.76"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "3.1) Prior Year Cumulative Funding"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "91.83"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "91.83"
                                        }
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}