{
    "id": "2021-Navy-PB-1810N-JBOOK-c2242d0ceea716f718cb6a8580fd9729142fc23618eb7e97997bb16c8f908e26-33",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-NAVY_OTHER_BA2-U_PROCUREMENT_JustificationBook_Navy_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1810N",
        "appropriation_name": "Other Procurement, Navy"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@suppressOutfittingDeliveryBY2ToBY5": "true",
        "LineItemNumber": {
            "val": "2960"
        },
        "LineItemTitle": {
            "val": "Integ Combat System Test Facility"
        },
        "P1LineNumber": {
            "val": "70"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1810N"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Communications & Electronics Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Shore Electronic Equipment"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "48.941"
                },
                "PriorYear": {
                    "val": "6.251"
                },
                "CurrentYear": {
                    "val": "6.028"
                },
                "BudgetYearOneBase": {
                    "val": "5.934"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "5.934"
                },
                "BudgetYearTwo": {
                    "val": "6.073"
                },
                "BudgetYearThree": {
                    "val": "6.185"
                },
                "BudgetYearFour": {
                    "val": "6.257"
                },
                "BudgetYearFive": {
                    "val": "6.37"
                },
                "Total": {
                    "val": "92.039"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "48.941"
                },
                "PriorYear": {
                    "val": "6.251"
                },
                "CurrentYear": {
                    "val": "6.028"
                },
                "BudgetYearOneBase": {
                    "val": "5.934"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "5.934"
                },
                "BudgetYearTwo": {
                    "val": "6.073"
                },
                "BudgetYearThree": {
                    "val": "6.185"
                },
                "BudgetYearFour": {
                    "val": "6.257"
                },
                "BudgetYearFive": {
                    "val": "6.37"
                },
                "Total": {
                    "val": "92.039"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "48.941"
                },
                "PriorYear": {
                    "val": "6.251"
                },
                "CurrentYear": {
                    "val": "6.028"
                },
                "BudgetYearOneBase": {
                    "val": "5.934"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "5.934"
                },
                "BudgetYearTwo": {
                    "val": "6.073"
                },
                "BudgetYearThree": {
                    "val": "6.185"
                },
                "BudgetYearFour": {
                    "val": "6.257"
                },
                "BudgetYearFive": {
                    "val": "6.37"
                },
                "Total": {
                    "val": "92.039"
                }
            },
            "InitialSpares": {
                "PriorYear": {
                    "val": "0.15"
                },
                "CurrentYear": {
                    "val": "0.145"
                },
                "BudgetYearOneBase": {
                    "val": "0.255"
                },
                "BudgetYearOne": {
                    "val": "0.255"
                },
                "BudgetYearTwo": {
                    "val": "0.212"
                },
                "BudgetYearThree": {
                    "val": "0.222"
                },
                "BudgetYearFour": {
                    "val": "0.226"
                },
                "BudgetYearFive": {
                    "val": "0.231"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This program supports various Navy Land Based Test Sites (LBTS) required to support integration and interoperability testing. Sites include, but are not limited to: Naval Surface Warfare Center (NSWC) Dahlgren, Surface Combat System Center (SCSC) Wallops Island, and NSWC Dam Neck.\n\nThe United States Navy has a requirement to fully test and certify computer programs for maturity, Interoperability and Integration (I&I) prior to delivery to the Fleet.  Commander, U.S. Fleet Forces Command (CFFC) provided specific direction to develop a unified modernization process and certify all combat system baselines for integration and interoperability as an integral step in the Chief of Naval Operations (CNO) Optimized Fleet Response Plan (O-FRP). Various Navy facilities, serving as LBTS, conduct the required testing in support of CVN, DDG, CG, LHD, LHA, LPD 17 and LSD class ships. These sites also comprise the Navy's Distributed Integration & Interoperability Assessment Capability (DIIAC) (supported through the use of JMETC network) alliance, which performs Interoperability Assessment and Systems Engineering Events (SEEs) for deploying Strike Groups.\n\nThese facilities also provide combat system in-service support to respond to emergent fleet problems. This capability tests and certifies new combat system baseline in a lab based environment, which has significantly reduced the cost of corrective action and shifted the burden of problem discovery away from the operator at sea.  It also provides support to the acquisition community to conduct interoperability (shift to the left) testing earlier in the acquisition cycle. \n\nAs existing system experience parts obsolescence issues and tech refresh updates, the LBTS must procure and install existing test beds to accurately replicate the Command, Control, Communication, Computer, Combat System and Intelligence (C5I) configuration that are designed for the fleet. In addition, new combat systems architectures are under development for new ship classes such as LCS, CVN 78, DDG 1000, as well as new Open Architecture (OA) variants of legacy suites. Procurement of production representative systems of these OA combat systems being delivered to operational fleet units is critical to ensure that testing and subsequent certification of both current and newly installed combat systems is in accordance with NAVSEAINST 9410.2 Naval Warfare Systems Certification Policy (NWSCP) and the Optimized Fleet Response Plan (O-FRP).\n\nThe basic procurement outlined herein is directed at expanding various facilities capability to support Interoperability Integration and Stressful Endurance testing. Procurement requirements are directly tied to the interoperability testing schedule and establish independence between test beds allowing for parallel certification efforts. Procurements are required to build the necessary test beds and for laboratory support equipment. This budget procures lab support equipment that various facilities are able to support the new tactical subsystems that use Commercial Off-the-Shelf (COTS) equipment. \n\nIn addition, the basic program provides for equipment\/upgrades for the Navy's Distributed Integration & Interoperability Assessment Capability (DIIAC) needed to conduct interoperability assessment testing. The DIIAC consists of 14 land based sites networked to certify computer programs prior to their delivery to the fleet and provides support to the acquisition community to conduct interoperability and integration (shift to the left) testing earlier in the acquisition cycle. Interoperability Assessment and Stressful Endurance testing is required for all deploying strike groups per the Joint Fleet Instruction.\n\n[P40A \/ M8400 - SESEF Electronic Equipment]: The Shipboard Electronic Systems Evaluation Facilities (SESEF) are Navy owned and operated test sites located near heavy fleet concentrated areas and strategic Forward Deployed Naval Forces Sites. The SESEF Program mission is to provide electromagnetic systems test and evaluation services to afloat and shore commands for upgraded systems, to validate system performance following new construction and overhaul\/availability, and to provide real-time assessment of material readiness in an operational environment. Also provided are: system modernization and integration, system and equipment component procurement and software (S\/W) upgrades for test systems to include, but not limited to, Tactical Control and Navigation (TACAN), Antenna Radiation Pattern (ARP) systems, Identification Friend or Foe (IFF), Direction Finder (DF)\/Radio Direction Finder (RDF), LINK 11\/16, Electronic Warfare\/Electronic Attack (EW\/EA) and HF\/VHF\/UHF communication systems, including secure voice. SESEFs are used to effectively conduct TACAN certifications, AN\/SLQ-32 Electronic Warfare (EW) Planned Maintenance System (PMS) requirements checks, Ship Signals Exploitation Equipment (SSEE) calibrations and PMS checks, and to detect and to isolate shipboard system deficiencies leading to maintenance action to increase ship material readiness at the completion of construction, delivery availabilities, during routine ship operations, and prior to deployment.\n\n[P40A \/ M8500 - Interoperability Assessment Equipment]: M8500 - Interoperability assessment equipment known as Distributed Integration & Interoperability Assessment Capability (DIIAC) procures upgrades to support the 16 sites that comprise the Navy's DIIAC sites. Procures hardware that provides the DIIAC Operations Center (DOC) the ability to support monitoring and execution of events providing data collection and distribution. Funds are also allocated for site upgrades to meet current standards and allow scalability for DIIAC requirements; and, in addition, to enable the DIIAC to maintain efficiency and product improvement to interface with other Joint communities using Joint Mission Environment Test Community (JMETC) network.  Focused on the force-level impact of new systems and platforms under development, the DIIAC supports testing that ensures Commander, Naval Sea System Command\/Program Executive Offices (NAVSEA\/PEOs) are delivering mature and interoperable warfare systems at the Platform and Strike Group levels, with NAVSEA providing Strike Force Interoperability Certification and Assessments, including IFF Mode 5 Testing.  This is the only such testing of combat systems and Command, Control, Communication, Computer, Combat System and Intelligence (C5I) configuration items prior to shipboard delivery for operational use."
        },
        "Justification": {
            "val": "Funding for procurements and installations for upgrades and modernization of the eight operational sites across the AORs to support the surface fleet spectrum requirements."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "ICSTF Program"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) M8400 - SESEF Electronic Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "1.1) SESEF Electronic Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "30.17"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.027"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "2.772"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.58"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.58"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "30.17"
                                        },
                                        "PriorYear": {
                                            "val": "3.027"
                                        },
                                        "CurrentYear": {
                                            "val": "2.772"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.58"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.58"
                                        }
                                    }
                                }
                            },
                            {
                                "Name": {
                                    "val": "2) M8500 - Interoperability Assessment Equipment"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "2.1) Interoperability Assessment Equipment"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "18.771"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.224"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.256"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "3.354"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "3.354"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "18.771"
                                        },
                                        "PriorYear": {
                                            "val": "3.224"
                                        },
                                        "CurrentYear": {
                                            "val": "3.256"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.354"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.354"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "48.941"
                            },
                            "PriorYear": {
                                "val": "6.251"
                            },
                            "CurrentYear": {
                                "val": "6.028"
                            },
                            "BudgetYearOneBase": {
                                "val": "5.934"
                            },
                            "BudgetYearOne": {
                                "val": "5.934"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}