{
    "id": "2021-AirForce-PB-3010F-JBOOK-15bb579b423117a7d022b4b799e5cfe3d94f24567d65626f3558f79cc7a6e58f-26",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-AIRFORCE_AIRCRAFT_VOL1-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3010F",
        "appropriation_name": "Aircraft Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "F01500"
        },
        "LineItemTitle": {
            "val": "F-15"
        },
        "P1LineNumber": {
            "val": "80"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3010F"
        },
        "AppropriationTitle": {
            "val": "Aircraft Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Aircraft Supt Equipment & Facilities"
        },
        "BudgetSubActivityNumber": {
            "val": "2"
        },
        "BudgetSubActivityTitle": {
            "val": "Post Production Support"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "7.472"
                },
                "CurrentYear": {
                    "val": "2.589"
                },
                "BudgetYearOneBase": {
                    "val": "2.632"
                },
                "BudgetYearOne": {
                    "val": "2.632"
                },
                "BudgetYearTwo": {
                    "val": "2.685"
                },
                "BudgetYearThree": {
                    "val": "2.734"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "18.112"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "7.472"
                },
                "CurrentYear": {
                    "val": "2.589"
                },
                "BudgetYearOneBase": {
                    "val": "2.632"
                },
                "BudgetYearOne": {
                    "val": "2.632"
                },
                "BudgetYearTwo": {
                    "val": "2.685"
                },
                "BudgetYearThree": {
                    "val": "2.734"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "18.112"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "7.472"
                },
                "CurrentYear": {
                    "val": "2.589"
                },
                "BudgetYearOneBase": {
                    "val": "2.632"
                },
                "BudgetYearOne": {
                    "val": "2.632"
                },
                "BudgetYearTwo": {
                    "val": "2.685"
                },
                "BudgetYearThree": {
                    "val": "2.734"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "Total": {
                    "val": "18.112"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The F-15C\/D Eagle is a highly maneuverable all-weather air superiority fighter. The F-15E Strike Eagle retains the basic air-to-air capability of the F-15C\/D Eagle, but adds a weapon systems operator (WSO), rear cockpit, conformal fuel tanks and advanced systems for all-weather, day\/night, all-altitude, deep penetration air-to-surface attack.\n\nF-15E Integrated Aircrew Trainers (IATs) funded in PE 0207134F, supports the procurement of additional IATs in order to better implement formal syllabus training, and meet HAF intent by preparing for 20% increase in FTU production IAW ACC\/A3T memo dated 29 Jun 2016. Future training plans include moving all Computer Based Training (CBTs) from desktop PCs to the IATs for increased fidelity and reduced Subject Matter Expert (SME) hours when teaching basic avionics use in IATs and Mission Training Center (MTC) events. Allows additional time to concentrate on systems integration and crew coordination, further supporting HAF intent. $4.959M P3A in BP11 for IATs was created for this work; funding erroneously loaded in BP11 \n\nThe program continues post-production support of the F-15C\/D and F-15E Electronic Systems Test Set (ESTS) and post production support for the F-15 tooling storage.  \n\nProvides continued support of post production tooling storage at Granite City, IL. This equipment is used for the manufacture, test, support, or repair of the F-15 aircraft and\/or its associated system components. The retention of Special Tooling\/Special Test Equipment (ST\/STE) is based on past usage history, current spare\/repair parts contracts, and projections for future requirements.\n\nIn accordance with Section 1815 of the FY2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency response, and providing military support to civil authorities. \n\nNo Research Development Test and Evaluation funding is associated with this effort.\n\nFunds may be used to address Diminishing manufacturing Sources (DMS) efforts to include removal of end-of-life software\/hardware within simulators systems and move to a modular, common open system architecture that is sustainable and cyber-resilient. DMSMS costs are included in Group B NRE; SE\/PM costs are include in the Group B recurring; and Depot Costs are included in the Support Equipment."
        },
        "Justification": {
            "val": "IATs Funding provides continued support of the Electronic Systems Test Set (ESTS. Grounding of aircraft would result without this repair support.\n\nTooling is loaned\/leased to support manufacturing of spares, as well as to support the execution of modification programs, life extension activities, and sustainment efforts."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}