{
    "id": "2021-Army-PB-2034A-JBOOK-8ab8ef5e1c6c1bb089b01b4868627eb6838a82679e6f3e89c6d7dde168d3f35e-3",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-ARMY_AMMO-U_PROCUREMENT_JustificationBook_Army_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2034A",
        "appropriation_name": "Procurement of Ammunition, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "1450EA3000"
        },
        "LineItemTitle": {
            "val": "CTG, Handgun, All Types"
        },
        "P1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2034A"
        },
        "AppropriationTitle": {
            "val": "Procurement of Ammunition, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Ammunition"
        },
        "BudgetSubActivityNumber": {
            "val": "30"
        },
        "BudgetSubActivityTitle": {
            "val": "Small\/Medium Cal Ammunition"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "149.627"
                },
                "PriorYear": {
                    "val": "15.344"
                },
                "CurrentYear": {
                    "val": "17.824"
                },
                "BudgetYearOneBase": {
                    "val": "0.853"
                },
                "BudgetYearOneOCO": {
                    "val": "0.017"
                },
                "BudgetYearOne": {
                    "val": "0.87"
                },
                "BudgetYearTwo": {
                    "val": "0.884"
                },
                "BudgetYearThree": {
                    "val": "0.901"
                },
                "BudgetYearFour": {
                    "val": "0.694"
                },
                "BudgetYearFive": {
                    "val": "0.694"
                },
                "Total": {
                    "val": "186.838"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "149.627"
                },
                "PriorYear": {
                    "val": "15.344"
                },
                "CurrentYear": {
                    "val": "17.824"
                },
                "BudgetYearOneBase": {
                    "val": "0.853"
                },
                "BudgetYearOneOCO": {
                    "val": "0.017"
                },
                "BudgetYearOne": {
                    "val": "0.87"
                },
                "BudgetYearTwo": {
                    "val": "0.884"
                },
                "BudgetYearThree": {
                    "val": "0.901"
                },
                "BudgetYearFour": {
                    "val": "0.694"
                },
                "BudgetYearFive": {
                    "val": "0.694"
                },
                "Total": {
                    "val": "186.838"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "149.627"
                },
                "PriorYear": {
                    "val": "15.344"
                },
                "CurrentYear": {
                    "val": "17.824"
                },
                "BudgetYearOneBase": {
                    "val": "0.853"
                },
                "BudgetYearOneOCO": {
                    "val": "0.017"
                },
                "BudgetYearOne": {
                    "val": "0.87"
                },
                "BudgetYearTwo": {
                    "val": "0.884"
                },
                "BudgetYearThree": {
                    "val": "0.901"
                },
                "BudgetYearFour": {
                    "val": "0.694"
                },
                "BudgetYearFive": {
                    "val": "0.694"
                },
                "Total": {
                    "val": "186.838"
                }
            }
        },
        "Description": {
            "val": "This budget line includes CTG, Handgun, ALL TYPES.\n\n(E05210) CTG, 9MM BALL M882 (Combat Pack) cartridge contains a bullet comprised of a copper alloy jacket and a lead alloy core. The cartridge is identified by the plain bullet tip. The ammunition complies with North Atlantic Treaty Organization Standard Agreement 4090 and is packed in military type packaging. It is used in the M9, M11, M17 and M18 pistols. This item is Code A, approved for service use.\n\n(E05218) CTG, MODULAR HANDGUN SYSTEM (MHS) AMMUNITION for the M17 and M18 (compact version) of the Modular Handgun System consists of four new 9MM cartridges - Ball M1152, Special Purpose M1153, Drill Dummy Inert (DDI) M1156 and Blank XM1157. The Ball cartridge is intended for use against enemy personnel, for training, and for force protection. The Special Purpose cartridge is required for use in situations where limited over-penetration of targets is necessary to reduce collateral damage. DDI cartridges are completely inert, plated and drilled for easy identification and used for training and weapon familiarization. Blank cartridges are used for K-9 training. The Blank Round (XM1157) is not yet type classified or approved for service use, and is scheduled for Type Classification Material Review Board Mid-August 2019.  It is used in the M17, M18, M9, and M11 pistols. The Modular Handgun System will also utilize three M1041 cartridges - Blue, Red and Yellow through the use of a weapon adapter kit. This item is Code B, not approved for service use.\n\n(E96105) CTG, 9MM MARKING, M1041 (BLUE) is used for force on force training engagements. The cartridge can be fired with the M17, M18, M9, and M11 pistols and M4 rifles with use of a conversion kit. The M9 kit consists of a replacement barrel only. The M11 kit consists of a replacement barrel and training feed ramp. The M17 and M18 both consist of an upper slide assembly.  The M4 kit consists of a replacement upper receiver for 9mm. The replacement barrels are enameled blue and the M4 conversion bolt has a blue mark that is visible through the ejection port of the weapon. The projectile leaves a mark upon impact (similar to paintball), enabling after action evaluation of training scenarios. It differs from paintball in that it is a full complete cartridge with projectile and cartridge case containing a propulsion system for a low velocity launch. The M1041 is required to hit targets accurately out to 12 meters. The cartridge has been safety certified to be fired in close proximity at properly protected human subjects. In FY 2021, the Army will procure the lead free version. This item is Code A, approved for service use.\n\n(E96107) CTG, 9MM MARKING, M1041 (RED) is used for force on force training engagements. The cartridge can be fired with the M17, M18, M9, and M11 pistols, and M4 rifles with use of a conversion kit. The M9 kit consists of a replacement barrel only. The M17 and M18 both consist of an upper slide assembly.  The M11 kit consists of a replacement barrel and training feed ramp. The M4 kit consists of a replacement upper receiver for 9mm. The replacement barrels are enameled blue and the M4 conversion bolt has a blue mark that is visible through the ejection port of the weapon. The projectile leaves a mark upon impact (similar to paintball), enabling after action evaluation of training scenarios. It differs from paintball in that it is a full complete cartridge with projectile and cartridge case containing a propulsion system for a low velocity launch. The M1041 is required to hit targets accurately out to 12 meters. The cartridge has been safety certified to be fired in close proximity at properly protected human subjects. In FY 2021, the Army will procure the lead free version. This item is Code A, approved for service use.\n\n(E99900) CTG, 9MM BALL M882 (Commercial Pack) cartridge contains a bullet comprised of a copper alloy jacket and a lead alloy core. The cartridge is identified by the plain bullet tip. It is packed in commercial type packaging and is not intended for OCONUS shipment. It is used in the M9, M11, M17, and M18 pistols.  This item is Code A, approved for service use."
        },
        "Justification": {
            "val": "FY 2021 Base Budget supports critical Army Title 10 war reserve\/operational, training, and test requirements in accordance with Department of Defense (DoD) Instruction 3000.04 (Munitions Requirements Process) and Army Regulation (AR) 5-13 (Total Army Munitions Requirements Process and Prioritization System). War reserve requirements support Office of the Secretary of Defense (OSD) approved Combatant Commander Operational Plans, Homeland Defense, and other OSD-directed missions. Training requirements support individual and collective training of Active and Reserve Component forces at Army schools, home station, and the combined training centers. Test requirements support the development, fielding, safety, and quality assurance of Army munitions and equipment throughout their life-cycle.\n\nIn accordance with Section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses, and providing military support to civil authorities.\n\nFY 2021 Total procurement dollars in the amount of $0.870 million supports the procurement of 1.174 million cartridges in support of the National Defense Strategy and Combatant Command (COCOM) requirements. The Army intends to convert any price advantage created through contract negotiations, other service procurement, and\/or Foreign Military Sales (FMS) to increase procurement of HANDGUN ALL TYPES when possible.\n\nFY 2021 Total Overseas Contingency Operations (OCO) dollars in the amount of $0.017 million support the enduring COCOM requirement for procurement of 0.084 million CTG, 9mm Ball, M882 (Combat Pack) to deter potential adversaries and support the European Deterrence Initiative.\n\n(E05210) CTG 9MM BALL, M882 (Combat Pack) is a training standard item used in both training and combat. The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals. FY 2021 Overseas Contingency Operations (OCO) procurement dollars in the amount of $0.017 million supports the enduring COCOM requirement for procurement of 0.084 million M882 9mm Ball bullets to deter potential adversaries and support the European Deterrence Initiative.\nType Classification Date: 1985\n\n(E05218) CTG MODULAR HANDGUN SYSTEM AMMUNITION is a training standard item used in both training and combat. The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals. There is no FY 2021 funding request.\nType Classification Date:  M1152\/M1153\/M156 June 2019; XM1157 Blank pending.\n\n(E96105) CTG 9MM MARKING, M1041 (BLUE) is a training unique item not used in combat. The FY 2021 request supports annual training and builds a depot level in accordance with the Army's procurement goals. FY 2021 Base procurement dollars in the amount of $0.640 million supports the procurement of 0.818 million M1041 (Blue) cartridges.\nType Classification Date: 2009\n\n(E96107) CTG, 9MM MARKING, M1041 (RED) is a training unique item not used in combat. The FY 2021 request supports annual training and builds a depot level in accordance with the Army's procurement goals. FY 2021 Base procurement dollars in the amount of $0.213 million supports the procurement of 0.272 million M1041 (Red) cartridges.\nType Classification Date: 2009\n\n(E99900) CTG 9MM BALL M882 (Commercial Pack) is a training standard item packed commercially for training. The request supports annual training and builds a war reserve inventory in accordance with the Army's procurement goals. There is no FY 2021 funding request.\nType Classification Date: 1985"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}