{
    "id": "2021-AirForce-PB-3021F-MJBOOK-0-0-c133b5c69c0dacb3cfbca25b78206ead128e9faae1b5290eac9bb261214046ee-18",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-AIRFORCE_SPACE-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3021F",
        "appropriation_name": "Space Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "SPCMOD"
        },
        "LineItemTitle": {
            "val": "Space Mods"
        },
        "P1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3021F"
        },
        "AppropriationTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Space Procurement, Air Force"
        },
        "BudgetSubActivityNumber": {
            "val": "1"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "60.849"
                },
                "PriorYear": {
                    "val": "139.428"
                },
                "CurrentYear": {
                    "val": "106.33"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "306.607"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "60.849"
                },
                "PriorYear": {
                    "val": "139.428"
                },
                "CurrentYear": {
                    "val": "106.33"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "306.607"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "60.849"
                },
                "PriorYear": {
                    "val": "139.428"
                },
                "CurrentYear": {
                    "val": "106.33"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearTwo": {
                    "val": "0"
                },
                "BudgetYearThree": {
                    "val": "0"
                },
                "BudgetYearFour": {
                    "val": "0"
                },
                "BudgetYearFive": {
                    "val": "0"
                },
                "ToComplete": {
                    "val": "0"
                },
                "Total": {
                    "val": "306.607"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "1203165F"
                },
                {
                    "val": "1203699F"
                },
                {
                    "val": "1203710F"
                }
            ]
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0305614F"
                },
                {
                    "val": "1203710F"
                }
            ]
        },
        "Description": {
            "val": "In FY 2021, P-1 Line Item SPCMOD\/SPACE MODS SPACE efforts were transferred to Appropriation 3022, Procurement, Space Force, from Appropriation 3021, Space Procurement, Air Force, due to the creation of a new appropriation for Space Force.\n\nSpace Mods Space funding enables advanced Command and Control (C2) Battle Management, Intelligence Surveillance and Reconnaissance (ISR), and Command, Control, Communications, Computers, and Intelligence (C4I) systems to conduct effective predictive battle space awareness, facilitate precision attack, and compress the sensor-to-shooter kill chain. Permanent modifications are configuration changes to in-service systems and equipment that correct materiel or other deficiencies, or that add or delete capability. Safety modifications correct deficiencies that produce hazards to personnel, systems, or equipment. This budget line covers both new and on-going modification efforts for space equipment and systems. Modification installation funding is budgeted in the year the installation occurs.\n\nSpace acquisition must respond with speed and agility to emerging adversary threats.  Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/ classified enterprise space architecture.  Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n\nThe following Program Elements are represented in this Budget Line Item:\n\nPE 1203160F DEFENSE METEOROLOGICAL SATELLITE PROGRAM (DMSP)\n\nThe DEFENSE METEOROLOGICAL SATELLITE PROGRAM (DMSP), COMMAND, CONTROL, and COMMUNICATIONS (C3) GROUND SYSTEM (GS) (DC3GS) is the ground system that supports DMSP, a fully operational program supporting a broad range of national security users who require timely and accurate global weather information.  DMSP is a DoD-only assured source of global weather data providing visible and infrared cloud cover imagery (1\/3 nautical miles (nm) constant resolution) and other meteorological, oceanographic, land surface, and space environmental data.  DMSP satellites are flown in sun-synchronous, 450nm polar-orbits to meet mission requirements (sun-synchronous means the satellites cross the equator at the same local sun time on each of their 14 orbits\/day).  DC3GS key elements have not been recapitalized since the equipment was transferred to the National Oceanic and Atmospheric Administration Office of Satellite Operations in 1998.  Critical DC3GS component spares have been depleted, parts cannibalized, and are no longer sustainable. Therefore, DMSP was re-established a procurement funding line in FY 2015 to enable continued DC3GS sustainment through a selective re-capitalization effort.  DC3GS subsystems to be addressed include, but are not limited to the Link\/2 Communication System, and Mission Planning and Scheduling System. Current DMSP planned fly-out date is FY2027, recent guidance has been that if the system is capable, it may continue to fly past that date. This selective re-capitalization effort is intended to ensure the DC3GS remains viable and serviceable to support DMSP while it remains in flight. \n\nPE 1203165F NAVSTAR GPS (SPACE AND CONTROL SEGMENTS)\n\nNAVSTAR GLOBAL POSITIONING SYSTEM (GPS) provides highly accurate time and three dimensional position and velocity information to an unlimited number of users anywhere on or above the surface of the earth, in any weather. This system supplies highly accurate position, velocity, timing, and Nuclear Detonation (NUDET) Detection System (NDS) information to properly equipped air, land, sea, and space-based users worldwide. The GPS system consists of three segments: space, control, and user equipment. The Operational Control System (OCS) is part of the control segment and requires modifications to replace high failure rate parts and preclude system operational degradation.  Without these mods, aging and obsolete equipment will excessively degrade, ultimately resulting in system failure.  System failure or even partial system failure will cause a loss of operational availability and the transmission of inaccurate navigation data to worldwide users, resulting in potential loss of life and\/or operational equipment, including multi-million dollar satellites.  OCS is required to operate until the Next Generation Operational Control System (OCX) transitions to operations, to include support for GPS III and fielding of Military GPS User Equipment (MGUE).\n\nPE 1203614F JSPOC MISSION SYSTEM\n\nSpace Situational Awareness (SSA) and Space Command and Control (C2), formerly known as JSpOC Mission System (JMS), provides integrated SSA information and Battle Management Command and\nControl (BMC2) of space forces for the Joint Functional Component Commander for Space (JFCC-SPACE). It will allow JFCC-SPACE to plan, direct, coordinate, and control operations of assigned forces. The enterprise provides a common government infrastructure and standards for rapid prototyping and deployment of dynamic SSA and BMC2 applications. These applications will deliver capabilities that include but are not limited to the ability to create decision-relevant views of the space environment; rapidly detect, track and characterize objects of interest; identify \/ exploit traditional and non-traditional sources; perform space threat analysis; and enable efficient distribution of data across the Space Surveillance Network (SSN).  Funding for this effort completes in FY 2020.\n\nPE 1203699F Shared Early Warning  System (SEWS)\n\nThe Shared Early Warning System (SEWS) provides accurate and timely ballistic missile warning information generated by space-based infrared sensors. This information is distributed to three combatant commanders (USEUCOM, USCENTCOM, USINDOPACOM), NATO, and multiple foreign partner nations located within each of the serviced Combatant Commands. U.S. forces and foreign partner nations receive missile warning data via a dedicated communications network flowing from the Centralized Distribution Facility (CDF) at Peterson AFB, CO to secondary distribution facilities located with the Combatant Commands and distribution hubs located in foreign partner nation operations centers. Data segregation for the foreign nation partners is maintained through the use of approved cross domain solutions with unique rule sets that reflect Office of the Secretary of Defense policy regarding the dissemination of missile warning data to foreign nations. SEWS utilizes Defense Information Systems Agency (DISA) mandated data processing capabilities, new missile warning message formats, and cyber security requirements set forth in Department of Defense Instruction 8500.1 (DODI 8500.1).\n\nPE 1203710F EO\/IR WEATHER SYSTEMS\n\nELECTRO-OPTICAL\/INFRARED WEATHER SYSTEMS: Residual Geostationary Operational Environmental Satellite (GOES) Relocation is a Department of Defenses (DoD) weather mitigation plan to address Space-based Environmental Monitoring (SBEM) Weather Gaps 1 (Cloud Characterization) and Gap 2 (Theater Weather Imagery) requirements over the Indian Ocean region. The requirements have been validated by the Joint Requirements Oversight Council (JROC) Memo 092-14, dated September 3, 2014. The program will leverage a residual National Oceanic and Atmospheric Agency (NOAA) on-orbit geostationary asset for the DoD use, in order to provide timely and reliable high-quality electro-optical\/infrared (EO\/IR) remote sensing capability that will address the critical weather data needs over the Central Command (CENTCOM) Area of Responsibility (AoR).  Funding for this effort completes in FY 2019.\n\nPE 1203873F Ballistic Missile Defense Radars \n\nCOBRA DANE is the most powerful, sensitive, and accurate Ground-based Midcourse Defense (GMD) radar and the premiere Ballistic Missile Defense (BMD) radar. At the same time it is the most accurate and capable phased array available to the Space Surveillance Network (SSN) for cataloging hazardous and difficult-to-track satellites and space debris objects that clutter the near-earth orbital regime that cannot be detected by most other SSN tracking assets. (U) COBRA DANE's primary mission is to support US Strategic Command's (USSTRATCOM) Ballistic Missile Defense mission by providing midcourse coverage for the Ballistic Missile Defense System (BMDS). COBRA DANE detects Intercontinental Ballistic Missiles (ICBMs) and Sea-Launched Ballistic Missiles (SLBMs), classifies reentry vehicles (RVs) and other missile objects, provides real-time information to the Ground-based Midcourse Defense (GMD) Fire Control (GFC), and provides tracking of threat ballistic missiles with sufficient accuracy to commit the launch of interceptors and to update the target tracks to the interceptor while the interceptor is in flight. \n\n(U) COBRA DANE's corollary mission is to support USSTRATCOM's Space Domain Awareness (SDA) mission by detecting, tracking, correlating, and characterizing man-made resident space objects, primarily in the Low-Earth Orbit (LEO) regime, including space debris and early observation of New Foreign Launches (NFLs). It operates as part of the larger Space Surveillance Network (SSN) and provides metric observation data to its command and control nodes: the Combined Space Operations Center (CSpOC) and the Distributed Space Command and Control - Dahlgren (DSC2-D (U) COBRA DANE also supports USSTRATCOM's Space Object Identification (SOI) mission by providing narrowband radar data of manmade resident space objects in the LEO regime. SOI information is used to ascertain the mission and operational status of various payloads and aids in forecasting maneuvers or deorbits. Cobra Dane mission equipment and associated sustainment suites consist of a mix of unique, custom-built components that are increasingly difficult to maintain on a 40 year old radar due to non-availability of replacement parts. Subsystems are no longer supported by the original equipment manufacturers. In addition, Transmitter Groups, Traveling Wave Tubes, Time Delay units and all associated components and spares requires replacement. Due to the limited spares demand rates, and indefinite system lifespan, Life of Type buys may be required to support this weapon system. Without these replacements there is a high risk that equipment failures will cause unacceptable mission downtime.\n\nPE 1203909F Ballistic Missile Early Warning System (BMEWS)\n\nThe BALLISTIC MISSILE EARLY WARNING SYSTEM (BMEWS) is a ground based radar system with missions to support the Missile Correlation, Space Surveillance, and Missile Defense Centers. The radar system provides United States Strategic Command (USSTRATCOM) with credible Integrated Tactical Warning\/Attack Assessment (ITW\/AA) data on all Inter-Continental Ballistic Missiles (ICBMs) penetrating the coverage area including Launch and Predicted Impact (L&PI) data for attack assessment and response determination. The radar system also supports the Space Situational Awareness (SSA) network providing near-earth satellite surveillance and tracking, reporting observational (metric), SOI on man-made satellites and maintenance of the space catalog as required by the Joint Space Operations Center, Alternate Space Operations Center, and the National Air and Space Intelligence Center mitigating the significantly increasing potential for collisions with national assets, including manned space platforms. \n\nThe BMEWS and PAVE Phased Array Warning Systems (PAVE PAWS) radars share a common baseline and mission with the difference that BMEWS deploys more array elements on its radar faces. BMEWS radars are located at Thule Air Base, Greenland; Clear Air Force Station, AK; and Royal Air Force (RAF) Fylingdales, UK. The BMEWS and PAVE PAWS mission equipment and associated sustainment suites consist of a mix of unique, custom-built components that are increasingly more difficult to maintain due to availability of replacement parts and obsolete COTS based subsystems that are no longer supported by the original equipment manufacturers. In addition, radar transmit & receive components, processing equipment, and power distribution elements, and other radar front-end equipment are 30+ years old, highly inefficient, and require replacement. Without these replacements there is a high risk that equipment failures will cause unacceptable mission downtime in order to troubleshoot and repair.\n\nPE 0305912F SLBM RADAR WARNING SYSTEM \n\nThe primary mission of the 474N SLBM Detection and Warning System is to provide United States Strategic Command (USSTRATCOM) with credible Integrated Tactical Warning\/Attack Assessment (ITW\/AA) data on all SLBMs penetrating the coverage area. This data includes an estimation of launch and predicted impact (L&PI) locations and times. The secondary mission is to provide the Cheyenne Mountain Air Force Station, CO (CMAFS) and other users with ITW\/AA data on Intercontinental Ballistic Missiles (ICBMs) penetrating the coverage area. Additionally, Perimeter Acquisition Radar Attack Characterization System (PARCS) and PAVE Phased Array Warning Systems (PAVE PAWS) support the Space Situational Awareness (SSA) mission by providing near earth satellite surveillance, tracking and identification as required by the Space Control Center, Alternate Space Control Center, and the Joint Intelligence Center. The sensors have an operational availability requirement of 98 percent. The 474N SLBM Detection and Warning System currently consists of: a) the AN\/FPQ-16 PARCS and b) the AN\/FPS-123 PAVE PAWS System (Phased Array Radars for SLBM Detection and Warning System). The PARCS Radar System is located at Cavalier AFB ND. The BMEWS and PAVE Phased Array Warning Systems (PAVE PAWS) radars share a common baseline and mission with the difference that BMEWS deploys more array elements on its radar faces. PAVE PAWS radars are located at Beale AFB, CA and Cape Cod AFS, MA. The Upgraded Early Warning Radar (UEWR) site at Beale AFB also has a Missile Defense (MD) mission supporting the Missile Defense Agency. Additionally there is a site for testing (System Program Agency) located in the Centralized Integration Support Facility (CISF) at Peterson AFB, CO. The BMEWS and PAVE PAWS mission equipment and associated sustainment suites consist of a mix of unique, custom-built components that are increasingly more difficult to maintain due to availability of replacement parts and obsolete COTS based subsystems that are no longer supported by the original equipment manufacturers. In addition, radar transmit & receive components, processing equipment, and power distribution elements, and other radar front-end equipment are 30+ years old, highly inefficient, and require replacement. Without these replacements there is a high risk that equipment failures will cause unacceptable mission downtime in order to troubleshoot and repair."
        },
        "Justification": {
            "val": "N\/A"
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}