{
    "id": "2021-AirForce-PB-3022F-JBOOK-b7a269190fd98853a4e90104967db8a98889d1a1e63192896eaa4ce98445ff1a-9",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-SPACE-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3022F",
        "appropriation_name": "Procurement, Space Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "MILSAT"
        },
        "LineItemTitle": {
            "val": "MILSATCOM"
        },
        "P1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3022F"
        },
        "AppropriationTitle": {
            "val": "Procurement, Space Force"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Space Procurement, SF"
        },
        "BudgetSubActivityNumber": {
            "val": "10"
        },
        "BudgetSubActivityTitle": {
            "val": "Space Programs"
        },
        "ResourceSummary": {
            "TotalCost": {
                "BudgetYearOneBase": {
                    "val": "15.795"
                },
                "BudgetYearOne": {
                    "val": "15.795"
                },
                "BudgetYearTwo": {
                    "val": "28.511"
                },
                "BudgetYearThree": {
                    "val": "20.713"
                },
                "BudgetYearFour": {
                    "val": "11.935"
                },
                "BudgetYearFive": {
                    "val": "12.154"
                },
                "ToComplete": {
                    "val": "172.204"
                },
                "Total": {
                    "val": "261.312"
                }
            },
            "NetProcurementP1": {
                "BudgetYearOneBase": {
                    "val": "15.795"
                },
                "BudgetYearOne": {
                    "val": "15.795"
                },
                "BudgetYearTwo": {
                    "val": "28.511"
                },
                "BudgetYearThree": {
                    "val": "20.713"
                },
                "BudgetYearFour": {
                    "val": "11.935"
                },
                "BudgetYearFive": {
                    "val": "12.154"
                },
                "ToComplete": {
                    "val": "172.204"
                },
                "Total": {
                    "val": "261.312"
                }
            },
            "TotalObligationAuthority": {
                "BudgetYearOneBase": {
                    "val": "15.795"
                },
                "BudgetYearOne": {
                    "val": "15.795"
                },
                "BudgetYearTwo": {
                    "val": "28.511"
                },
                "BudgetYearThree": {
                    "val": "20.713"
                },
                "BudgetYearFour": {
                    "val": "11.935"
                },
                "BudgetYearFive": {
                    "val": "12.154"
                },
                "ToComplete": {
                    "val": "172.204"
                },
                "Total": {
                    "val": "261.312"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "OtherRelatedProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "1203601SF"
                }
            ]
        },
        "Description": {
            "val": "In FY 2021, P-1 Line Item MILSAT \/ MILSATCOM efforts were transferred to Appropriation 3022, Procurement, Space Force, from Appropriation 3021 due to the creation of a new Appropriation for Space Force.\n\nMILITARY SATELLITE COMMUNICATIONS (MILSATCOM) joint-service systems collectively provide a broad range of satellite communication capabilities, including secure, jam-resistant, 24-hour worldwide communications to meet essential strategic, tactical and general-purpose operational requirements. MILSATCOM terminals support communications requirements for the President and Secretary of Defense, unified and specified commanders, uniformed services and defense agencies. Funding for this exhibit is contained in PE 1203601SF, MILSATCOM Terminals, except where otherwise noted.\n      \n      Space acquisition must respond with speed and agility to emerging adversary threats.  Space & Missile Systems Center (SMC) is transforming the organization and implementation of space acquisition to an enterprise approach, maximizing innovation and resiliency, leveraging international, commercial, and mission partnerships, and managing program\/project priorities according to an integrated unclassified\/classified enterprise space architecture.  Expanding the appropriate acquisition authorities and contract mechanisms to deliver capability sooner, SMC will strategically execute experimentation, prototyping, risk reduction, and other efforts to develop new or repurpose capabilities.\n      \n      Space and Missile Systems Center (SMC) is procuring and fielding Protected Tactical Waveform (PTW) capable modems to meet the Ground Multiband Terminal (GMT) mission requirements.  The Air Force \/ Army Anti-jam Modem (A3M) is the program of record for development, procurement, and fielding of the PTW capability.   A3M is teamed with the Army to expand the competitive industry base and gain volume cost savings of a common modem.   The A3M modem will provide high throughput and enhanced anti-jam capability in benign and contested environments to prevent the disruption of communications from electronic jamming at identified threat levels of the Wideband Global SATCOM (WGS) Operational Requirements Document (ORD).  The A3M modem meets the Internet Protocol (IP) mandate, is forward compatible with the future Protected Tactical SATCOM (PTS), and will contain a National Security Agency (NSA) certified End Cryptographic Unit (ECU). \n      \n      A3M Procurement funding includes depot tooling, establishment of the Key Loading and Initialization Facility (KLIF), purchase of Protected Tactical Enterprise Service (PTES) KLIF Host equipment, A3M warehousing equipment, shipping containers, and A3M test equipment and repair work spaces.  Will purchase GMT modification kits, including cable sets to install the modem into the GMT transit cases; a new commercial off the shelf (COTS) Data Collection Unit (DCU) to support A3M data through put; and GMT modification labor to remove and process obsolete hardware, repair and label GMT modified case, and install A3M.  Also required is shipping of modified GMT cases to field units and return shipping of un-modified GMT equipment cases and fielding support, purchase and delivery of technical data, and initial spares in a combination of spare modems and subassembly parts equivalent to 10% sparing.  A3M's Indefinite Quantity Indefinite Delivery (IDIQ) contract will enable future fielding for additional WGS users.\n      \n      \n      Funding for this exhibit is contained in Program Element (PE) 1203601SF MILSATCOM TERMINALS"
        },
        "Justification": {
            "val": "AIR FORCE WIDEBAND ENTERPRISE TERMINALS (AFWET) TERMINAL MODERNIZATION: AFWET terminals form the Satellite Communications (SATCOM) backbone of the DoD Information Network (DoDIN), operating over Wideband Global SATCOM (WGS), Defense Satellite Communications System, commercial and Allied satellites. These Enterprise terminals support the command and control requirements of Combatant Commanders worldwide and the communication requirements of the President, Secretary of Defense, Department of State (DoS), US strategic and tactical forces, and the North Atlantic Treaty Organization. The Air Force is responsible for terminal equipment at Air Force operated and maintained Enterprise ground terminal locations.  \n      \n      In FY 2021, funding will extend the life of the system, modernize operational suitability, safety and effectiveness, and maintain high interoperability with other DoD, Army, Navy, and Air Force strategic and tactical terminals.  Rapidly respond to implement system resiliency and situational awareness necessary to operate in the contested space domain.  Activities may include, but are not limited to, program office support, studies, technical analysis, prototyping, etc.\n      \n      For 10 of 31* new terminals yet to be installed and commissioned; AFWET Terminal Modernization includes: Terminal, installation, engineering, integration and site preparation, radomes, initial spares and acceptance testing. Installation, integration and site preparation costs change substantially based on location.\n      \n      For 21 of 31* installed and already commissioned new terminals; AFWET Maintenance Upgrades and Sustainment includes: Facility Infrastructure Monitoring Systems (FIMS), power and communication infrastructure, and Interconnect Facility (ICF) installations which provide incidental increases in capability, allowing for full utilization of WGS capabilities, compliance with directives on the usage of Internet Protocol, adherence to Unified Capabilities Requirements, compliance with Defense Information Systems Agency (DISA) and National Security Agency directives and more efficient and effective usage of satellite resources for jam-resistant and anti-scintillation wideband links.\n      \n      AFWET Product Support includes: Product Support Services (PSS) skillsets required for specialized SATCOM fielding and training supporting Terminal Modernization. \n      AFWET Other Support includes: Advisory and Assistance Services (A&AS), system engineering, and other related activities supporting successful program execution.\n      \n      *Note:  Total terminals reduced from 32 to 31 due to the Modernization of Enterprise Terminals (MET) terminal at the New Boston Air Force Site being re-allocated.\n      \n      PROTECTED TACTICAL WAVEFORM (PTW), AIR FORCE - ARMY ANTI-JAM MODEM (A3M): Preparation for fielding of Protective Tactical Waveforms (PTW) capable modems.  FY 2021 effort includes depot tooling at Tobyhanna Army Depot and purchase of 60 GMT Terminal modification kits.  Without the modification kits, the new modem cannot be installed.  The modem needs cables and a new DCU to work with the GMT.  Army fielding also includes cable sets to connect the modem to the STT.  If the modification is being completed by a field unit instead of the depot, the unit will receive the modem and detailed instructions as part of the kit to install A3M."
        },
        "MDAPCode": {
            "val": "199"
        },
        "ItemExhibitList": {
            "P5Item": [
                {
                    "Name": {
                        "val": "AFWET"
                    },
                    "IdCode": {
                        "val": "A"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "11.277"
                            },
                            "BudgetYearOne": {
                                "val": "11.277"
                            }
                        },
                        "NetProcurementP1": {
                            "BudgetYearOneBase": {
                                "val": "11.277"
                            },
                            "BudgetYearOne": {
                                "val": "11.277"
                            }
                        },
                        "TotalObligationAuthority": {
                            "BudgetYearOneBase": {
                                "val": "11.277"
                            },
                            "BudgetYearOne": {
                                "val": "11.277"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "AFWET"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Terminal Modernization"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "3.768"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "3.768"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Maintenance Upgrades\/Sustainment"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "4.354"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "4.354"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Support"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1.586"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.586"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "9.708"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9.708"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "9.708"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.708"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Advisory and Assistance Services (A&AS)"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.736"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.736"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "OTHER SUPPORT"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.833"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.833"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "1.569"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.569"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "AFWET"
                                }
                            }
                        ]
                    }
                },
                {
                    "Name": {
                        "val": "PTW Modems"
                    },
                    "IdCode": {
                        "val": "A"
                    },
                    "ResourceSummary": {
                        "TotalCost": {
                            "BudgetYearOneBase": {
                                "val": "4.518"
                            },
                            "BudgetYearOne": {
                                "val": "4.518"
                            }
                        },
                        "NetProcurementP1": {
                            "BudgetYearOneBase": {
                                "val": "4.518"
                            },
                            "BudgetYearOne": {
                                "val": "4.518"
                            }
                        },
                        "TotalObligationAuthority": {
                            "BudgetYearOneBase": {
                                "val": "4.518"
                            },
                            "BudgetYearOne": {
                                "val": "4.518"
                            }
                        }
                    },
                    "CostElementCategoryList": {
                        "Hardware": [
                            {
                                "Name": {
                                    "val": "A3M"
                                },
                                "Recurring": {
                                    "CostElementList": {
                                        "CostElement": [
                                            {
                                                "Name": {
                                                    "val": "Depot Tooling"
                                                },
                                                "Cost": {
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1.669"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.669"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GMT Modification Kit"
                                                },
                                                "Cost": {
                                                    "Quantity": {
                                                        "BudgetYearOneBase": {
                                                            "val": "60"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "60"
                                                        }
                                                    },
                                                    "TotalCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "1.2"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "1.2"
                                                        }
                                                    },
                                                    "UnitCost": {
                                                        "BudgetYearOneBase": {
                                                            "val": "0.02"
                                                        },
                                                        "BudgetYearOne": {
                                                            "val": "0.02"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "CategorySubtotal": {
                                        "TotalCost": {
                                            "BudgetYearOneBase": {
                                                "val": "2.869"
                                            },
                                            "BudgetYearOne": {
                                                "val": "2.869"
                                            }
                                        }
                                    }
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "2.869"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.869"
                                        }
                                    }
                                }
                            }
                        ],
                        "Support": [
                            {
                                "CostElementList": {
                                    "CostElement": [
                                        {
                                            "Name": {
                                                "val": "Advisory and Assistance Services (A&AS)"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "1.2"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.2"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "OTHER SUPPORT"
                                            },
                                            "Cost": {
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "0.449"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.449"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "BudgetYearOneBase": {
                                            "val": "1.649"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.649"
                                        }
                                    }
                                },
                                "Name": {
                                    "val": "A3M"
                                }
                            }
                        ]
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "expandItemSuppressExhibit"
            }
        }
    }
}