{
    "id": "2021-Army-PB-2033A-JBOOK-343f4f0ba9aaf83445b90db376c9f4dd8a3b8926766d60843c497729b4f8654f-36",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-ARMY_WTCV-U_PROCUREMENT_JustificationBook_Army_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Army_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Army",
        "appropriation_code": "2033A",
        "appropriation_name": "Procurement of W&TCV, Army"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Thousands",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "LineItemNumber": {
            "val": "3270GC0050"
        },
        "LineItemTitle": {
            "val": "Production Base Support (WOCV-WTCV)"
        },
        "P1LineNumber": {
            "val": "37"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationNumber": {
            "val": "2033A"
        },
        "AppropriationTitle": {
            "val": "Procurement of W&TCV, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Weapons and Other Combat Vehicles"
        },
        "BudgetSubActivityNumber": {
            "val": "30"
        },
        "BudgetSubActivityTitle": {
            "val": "Support Equipment & Facilities"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "327.976"
                },
                "PriorYear": {
                    "val": "3.296"
                },
                "CurrentYear": {
                    "val": "2.651"
                },
                "BudgetYearOneBase": {
                    "val": "3.045"
                },
                "BudgetYearOne": {
                    "val": "3.045"
                },
                "BudgetYearTwo": {
                    "val": "3.531"
                },
                "BudgetYearThree": {
                    "val": "3.596"
                },
                "BudgetYearFour": {
                    "val": "3.697"
                },
                "BudgetYearFive": {
                    "val": "3.698"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "327.976"
                },
                "PriorYear": {
                    "val": "3.296"
                },
                "CurrentYear": {
                    "val": "2.651"
                },
                "BudgetYearOneBase": {
                    "val": "3.045"
                },
                "BudgetYearOne": {
                    "val": "3.045"
                },
                "BudgetYearTwo": {
                    "val": "3.531"
                },
                "BudgetYearThree": {
                    "val": "3.596"
                },
                "BudgetYearFour": {
                    "val": "3.697"
                },
                "BudgetYearFive": {
                    "val": "3.698"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "327.976"
                },
                "PriorYear": {
                    "val": "3.296"
                },
                "CurrentYear": {
                    "val": "2.651"
                },
                "BudgetYearOneBase": {
                    "val": "3.045"
                },
                "BudgetYearOne": {
                    "val": "3.045"
                },
                "BudgetYearTwo": {
                    "val": "3.531"
                },
                "BudgetYearThree": {
                    "val": "3.596"
                },
                "BudgetYearFour": {
                    "val": "3.697"
                },
                "BudgetYearFive": {
                    "val": "3.698"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "SecondaryDistribution": {
            "ComponentList": {
                "Component": [
                    {
                        "Name": {
                            "val": "Army Active"
                        },
                        "Cost": {
                            "TotalCost": {
                                "PriorYear": {
                                    "val": "3.296"
                                },
                                "CurrentYear": {
                                    "val": "2.651"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.045"
                                },
                                "BudgetYearOne": {
                                    "val": "3.045"
                                },
                                "BudgetYearTwo": {
                                    "val": "3.531"
                                },
                                "BudgetYearThree": {
                                    "val": "3.596"
                                },
                                "BudgetYearFour": {
                                    "val": "3.697"
                                },
                                "BudgetYearFive": {
                                    "val": "3.698"
                                }
                            }
                        }
                    }
                ]
            },
            "TotalCost": {
                "TotalCost": {
                    "PriorYear": {
                        "val": "3.296"
                    },
                    "CurrentYear": {
                        "val": "2.651"
                    },
                    "BudgetYearOneBase": {
                        "val": "3.045"
                    },
                    "BudgetYearOne": {
                        "val": "3.045"
                    },
                    "BudgetYearTwo": {
                        "val": "3.531"
                    },
                    "BudgetYearThree": {
                        "val": "3.596"
                    },
                    "BudgetYearFour": {
                        "val": "3.697"
                    },
                    "BudgetYearFive": {
                        "val": "3.698"
                    }
                }
            }
        },
        "Description": {
            "val": "This program provides funding to the Army Test and Evaluation Command (ATEC) to establish, modernize, expand or replace test facilities used in production testing of Weapons and Tracked Combat Vehicles and their components.  It sustains Army production test capabilities through upgrade and replacement of instrumentation and equipment that is technologically and\/or economically obsolete.  Modernization of test instrumentation and equipment provides increased automation and efficiencies, improved data quality and quantity and cost avoidance to Army Program Managers.  Programmed funding will be used to upgrade or replace production test instrumentation and equipment at Aberdeen Test Center (ATC), Aberdeen Proving Ground, MD; White Sands Test Center (WSTC), White Sands Missile Range, NM and Yuma Test Center (YTC), Yuma Proving Ground, AZ.\n\nThis program provides funding to establish, modernize, expand or replace Army-owned industrial facilities and equipment used in production and production testing of Weapons and Tracked Combat Vehicles and their components.  The program also provides for the preserving, storing and disposing for facilities and equipment that are either not required for current active production or are not needed by the Army. Provisioning of Industrial Facilities (PIF) occurs at Rock Island Arsenal, IL; Watervliet Arsenal, NY; and General Dynamics-Armaments and Technical Products, Saco, ME.  The Layaway of Industrial Facilities (LIF) and Maintenance of Laid-away Industrial Facilities (MLIF) funding supports unique and necessary equipment at Watervliet Arsenal, NY. This program also provides funding for the Arsenal Support Program Initiative."
        },
        "Justification": {
            "val": "FY 2021 Base procurement dollars in the amount of $3.045 million support the following:\n\nAt ATC, will continue to modernize fire control instrumentation required to assess weapon system fire control performance on a wide range of test items.  ATC will continue replacing and upgrading weapon, sight, and target scoring HD video cameras, recorders, digital video processing systems, fiber optic converters, and telemetry systems.  Replacement equipment is scheduled to address obsolescence issues, software compatibility gaps, and deterioration of existing hardware while ensuring test equipment maintains pace with technological advances of test items to preclude lack of test support.\n\nAt ATC, will also continue modernizing the obsolete geodetic equipment which will allow ATC to obtain full Global Positioning System (GPS) functionality for all test missions. Purchases will include:  GPS Rover, GPS Base, Front-end Processor, Data Collectors and Electronic Total Station.  This effort will greatly improve ATC's ability to support all test events that require GPS surveying in real time.\n\nAt YTC, will continue procuring vibration facility support equipment and instrumentation as part of the dynamic test support equipment replacement\/upgrade.  Will also procure fixtures and adapters for vehicle mounted ammo storage racks and containers.  This effort will help YTC maintain vibration and shock testing capabilities for automotive and indirect fire systems in desert environments, such as M-109 Paladin, M-1 Abrams and 155mm Howitzers.\n\nAt YTC, will continue upgrading analytical laboratory analyzers, laboratory equipment, computing equipment and software so the Material Analysis Laboratory will retain the capabilities required to support testing of advanced tactical vehicles and weapon systems.\n\nAt WSTC, will continue to maintain and upgrade existing equipment and instrumentation for the developing and evolving White Sands Missile Range (WSMR) directed energy - High-Power Microwave (HPM), Electromagnetic Pulse (EMP) and lightning effects test simulators.  These items include sensors, oscilloscopes, fiber optic links, vacuum systems, cryogenic superconducting magnets, waveguides, antennas, cathodes, insulators, and various cabling and subassemblies.  These effort will help WSTC meet regulatory, customer, and\/or evolving mission requirements.  \n\nIn accordance with section 1815 of the FY 2008 National Defense Authorization Act (P.L. 110-181), this item is necessary for use by the active and reserve components of the Armed Forces for homeland defense missions, domestic emergency responses and providing military support to civil authorities."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}