{
    "id": "2021-Navy-PB-1109N-MJBOOK-0-0-387299c8d3345c1328c53c3aecc95f283208355ac9b563faa2f445e0599764f2-31",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-NAVY_MARINECORPS-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2021.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Navy_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1109N",
        "appropriation_name": "Procurement, Marine Corps"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@suppressOutfittingDeliveryBY2ToBY5": "true",
        "LineItemNumber": {
            "val": "4645"
        },
        "LineItemTitle": {
            "val": "Cyberspace Activities"
        },
        "P1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationNumber": {
            "val": "1109N"
        },
        "AppropriationTitle": {
            "val": "Procurement, Marine Corps"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Communications and Electronics Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "19"
        },
        "BudgetSubActivityTitle": {
            "val": "Other Support (Non-Tel)"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "27.632"
                },
                "BudgetYearOneBase": {
                    "val": "53.896"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "53.896"
                },
                "BudgetYearTwo": {
                    "val": "46.688"
                },
                "BudgetYearThree": {
                    "val": "44.186"
                },
                "BudgetYearFour": {
                    "val": "47.195"
                },
                "BudgetYearFive": {
                    "val": "47.671"
                },
                "Total": {
                    "val": "267.268"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "27.632"
                },
                "BudgetYearOneBase": {
                    "val": "53.896"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "53.896"
                },
                "BudgetYearTwo": {
                    "val": "46.688"
                },
                "BudgetYearThree": {
                    "val": "44.186"
                },
                "BudgetYearFour": {
                    "val": "47.195"
                },
                "BudgetYearFive": {
                    "val": "47.671"
                },
                "Total": {
                    "val": "267.268"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "0"
                },
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "27.632"
                },
                "BudgetYearOneBase": {
                    "val": "53.896"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "53.896"
                },
                "BudgetYearTwo": {
                    "val": "46.688"
                },
                "BudgetYearThree": {
                    "val": "44.186"
                },
                "BudgetYearFour": {
                    "val": "47.195"
                },
                "BudgetYearFive": {
                    "val": "47.671"
                },
                "Total": {
                    "val": "267.268"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "CodeBProgramElementList": {
            "ProgramElementNumber": [
                {
                    "val": "0206313M"
                },
                {
                    "val": "0305251M"
                }
            ]
        },
        "Description": {
            "val": "Beginning in FY20, efforts in this line item (LI) 4645 (Cyberspace Activities) were transferred from other LIs in order to better align resources with mission and to increase transparency to support better decisions.  Specifically, U.S. Marine Forces Cyberspace Command investments were transferred from LI 4630 (Common Computer Resources) and LI 4635 (Communications and Electrical Infrastructure Support) into LI 4645 (Cyberspace Activities).  \n\nROBUST INFRASTRUCTURE (FORMERLY TITLED MARFORCYBER) directly supports U.S. Cyber Command Execute Order 19-0035: Cyber Capability to Support the Cyber Mission Force.  U.S. Cyber Command Execute Order 19-0035 directs MARFORCYBER to establish and sustain a secure and effective common firing platform for offensive cyber missions. Currently used platforms are not interoperable or efficient, limiting flexibility and effectiveness of cyber mission forces. Through divesting in multiple legacy platforms and investing in a joint common access platform (JCAP) that will be established across all Joint Mission Operations Centers (JMOCs), offensive operations will be more effective and efficient, improving mobility, resiliency, collaboration, force multiplication, and scalability.\n\nSECURE, OPERATE, DEFEND AND ENABLE the Marine Corps Cyberspace Environment (MCCE)(FORMERLY TITLED MCCOG) .  Marine Forces Cyberspace Command is responsible for enhancing freedom of action across the Cyberspace domain, while denying the efforts of adversaries to degrade or disrupt this advantage through cyberspace. The Marine Corps Cyberspace Operations Group (MCCOG) is a command element under Marine Corps Forces Cyberspace Command responsible for securing, operating, and defending the Marine Corps Cyberspace Environment (MCCE) - to include providing network situational awareness; command and control; and technical support to Marine Corps operating forces and supporting establishment organizations, both in garrison and while deployed. In addition to being the primary DOD Cybersecurity Service Provider (CSSP) for the U.S. Marine Corps and only certified Red Team, MCCOG performs Vulnerability Management, Malware Protection, Web Assessment, Hunt Operations, and Cyber Incident Response focused on preventing and responding to prevent and respond to security incidents. The MCCOG delivers enterprise services for the Marine Corps to include Directory, Enterprise Storage, Messaging,  Application Management, Mobility, Deployed Support, Mainframe, and Unified Communication. \n\nPUBLIC KEY INFRASTRUCTURE (PKI) is a framework of laws, policies, procedures, and technologies for the use of digital credentials, which provide confidentiality, integrity, authenticity, and non-repudiation in electronic communications and transactions. PKI allows secure access to IT systems. PKI has the ability to electronically sign documents, encrypt messages and documents, and to authenticate and protect web access... In compliance with DOD policy and direction, the USMC Public Key Infrastructure Program (PKI) program provides the resources, manpower and equipment (hardware and software), dedicated to the management (i.e.: generation, production, distribution, control, accounting and destruction) of keys and certificates used by public key-based security services to include NIPRNet and SIPRNet both garrison and deployed.  The PKI program operates the USMC Certificate Validation Infrastructure necessary to ensure that only authorized users and server based applications are allowed to operate on the Marine Corps Enterprise Network (MCEN).  These services are required for user access to all information system components on the MCEN including network accounts, applications and web sites.  PKI must be operable in garrison and tactical\/deployed environments.\n\nUSMC MAGTF DCO-IDM Suite:  The USMC Marine Corps Air Ground Task Force (MAGTF) Defensive Cyberspace Operations-Internal Defensive Measures (DCO-IDM) Suite program provides the self-contained, fly-away equipment (hardware and software) for MAGTF DCO-IDM Teams to conduct vulnerability analysis (VA), incident response (IR), and other DCO-IDM functions concurrently on classified and unclassified networks.  The teams utilize the interface (a laptop), data from passive and active sensors (servers, laptops, and taps), and the analytic capability from the hardware and software in order to determine the state of the supported commander's network, host, and major weapon systems.  Software includes Government Off-the-Shelf (GOTS), Commercial Off-the-Shelf (COTS), and free and open-source software (FOSS). MAGTF DCO Suites are intended to be part of a common family of systems in support of MAGTF cyberspace operations.  MAGTF DCO-IDM Suites must be operable in garrison and tactical\/deployed environments."
        },
        "Justification": {
            "val": "FY 2020:  $27.632M Active; $0.0M Reserve\n\nMARINE CORPS CYBERSPACE OPERATIONS GROUP (MCCOG):\nFY20 Base Appropriation Request:  $7.841M procures hardware and software for Defensive Cyber Operations Support, remote forensics solutions, and Hunt Deployable suites and provides technical refresh for the USMC Unified Communications project items such as Distributed Computing Equipment, Video Teleconferencing and Multi-Media Equipment, Network Hardware, Telephone Equipment, and Telepresence Content Server.  Prior to FY20 this program was aligned to LI 4630.\n\nMARFORCYBER:\nFY20 Base Appropriation Request: $14.289M procures hardware and software for Deployable Mission Support Systems (DMSS).  DMSS kits are required in order for MARFORCYBER to provide Marine Corps units all across the globe with cyberspace activity support. Procures tools, platforms, infrastructure, and sustainment for various Offensive Cyberspace Operations (OCO) requirements to encourage an appropriate Service-Level analysis for the Joint Mission Operations Center (JMOC) Meade requirement in support of United States Cyberspace Command (USCC) and Joint Forces Headquarters Cyber (JFHQ-c) mission, and procures a Defensive Cyberspace Operations War room, Commercial Solutions for Classified (CSfC), engineering, tools, platforms, OCO, DCO infrastructure, and sustainment requirements.  Prior to FY20 this program was aligned to LI 4630.\n\nPUBLIC KEY INFRASTRUCTURE (PKI):\nFY20 Appropriation Request:  $0.502M funding supports the continuation of PKI hardware and software implementation across the (NIPRNet and SIPRNet) for both garrison and deployed networks in order to meet DOD CIO requirement. The CVI is required in order for end users to authenticate themselves when signing onto Marine Corps Enterprise Network (MCEN) accounts. These services are required for user access to all information system components on the MCEN including network accounts, applications and web sites. PKI must be operable in garrison and tactical\/deployed environments.  Prior to FY20 this program was aligned to LI 4635.\n\nUSMC MAGTF DCO-IDM Suite:\n$5.000M procures MAGTF DCO-IDM Suites for fielding to I, II, & III MEF DCO-IDM Companies and Marine Corps Communications-Electronics School.  Previously the Operating Forces utilized the DMSS kits for Defensive Cyberspace Operations.  This is a new start in FY20.\n\nFY 2021 Base Appropriation:  $53.896M Active; $0.0M Reserve\n\nROBUST INFRASTRUCTURE (FORMERLY TITLED MARFORCYBER) ($38.110 million): Supports Commander, U.S. Cyber Command Executive Order 19-0035: Cyber Capability to Support the Cyber Mission Forces.  Specifically, the increase of $23.821M from FY20 to FY21 will procure a cyber attack platform that will improve cyberspace operations by increasing the capacity for offensive cyber missions; increasing resiliency of the offensive cyber platform; increasing the availability of the offensive cyber platform and associated weapons\/targets for the conduct of missions; increasing automation in order to decrease manpower requirements and delays in setup\/disassembly to execute operations.  \n\nThese investment will enable consolidation, convergence, and configuration of cyber infrastructure into a common firing platform to enable operations based on cyber tasking orders as well as providing operable hardware and workstations for cyber mission forces to conduct operations. Robust Infrastructure will increase the capacity for offensive cyber missions by 66% and will increase the availability of the offensive cyberspace platforms and associated weapons by 300%.\n \nSECURE, OPERATE, DEFEND AND ENABLE (FORMERLY TITLED MCCOG) ($7.994 million): The increase of $0.153M from FY20 to FY21 will cover the increased costs and inflation of hardware and software required to refresh outdated hardware and software that is vulnerable to attacks from adversaries.  These resources will procure hardware and software to refreshe outdated hardware and software that is vulnerable to attacks from adversaries.  In addition, the hardware and software increases system performance to improve network operational availability for warfighters and commanders.   \n\nDEFENSIVE CYBER OPERATIONS - INTERNAL DEFENSIVE MEASURES (DCO-IDM) ($6.324 million): The $1.324M increase from FY20 to FY21 due to requirement for additional 3 DCO-IDM's in FY21 to defend against increased sophistication from near peer adversaries.  $6.324M in FY21 will procure 13 DCO-IDM for fielding to First, Second, and Third Marine Expeditionary Forces.  Also, $0.789M funding supports procurement of Cyber Immersive Training Environment (CITE 2.0), which enables cyber mission forces to conduct training, and mission rehearsal that increase the knowledge, skills, and abilities of Marines defending the Marine Corps Cyberspace Environment (MCCE).  \n\nPUBLIC KEY INFRASTRUCTURE (PKI) ($1.468 million): Funding will support the continuation of PKI hardware and software implementation across the (NIPRNet and SIPRNet) for both garrison and deployed networks in order to meet national requirements for the use of hardware tokens for access to networks, network resources, and secure email.  Funding will also be utilized to procure necessary equipment and tokens for SIPRNet Token issuance across the MCEN as well as implementation of the DOD PKI NIPRNet Enterprise Alternate Token Management System. The increase of $0.966M from FY20 to FY21 is due to the technical refresh cycle of equipment scheduled in FY21."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Cyberspace Activities"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "1) Cyberspace Activities"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "@footnote": "The $1.324M increase from FY20 to FY21 results from requiring an additional 3 DCO-IDM suites in FY21 to defend against increased sophistication from near peer adversaries.",
                                                "val": "1.1) DEFENSIVE CYBER OPERATIONS - INTERNAL DEFENSIVE MEASURES"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "5"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "6.324"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "6.324"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "The $23.821M increase from FY20 to FY21 is due to the procurement of software and hardware that form a common cyber firing attack platform.  USCYBERCOM Executive Order (EXORD) 19-0035 directs MARFORCYBER to establish and sustain a secure and effective common firing platform for offensive cyber missions. Currently used platforms are not interoperable or efficient, limiting flexibility and effectiveness of cyber mission forces.",
                                                "val": "1.2) ROBUST INFRASTRUCTURE"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "14.289"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "38.11"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "38.11"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "1.3) SECURE, OPERATE, DEFEND AND ENABLE"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "7.841"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "7.994"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "7.994"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "@footnote": "Prior to FY20, PKI funds were requested in LI 4635, Cost Element 3.1.    The increase of $0.966M from FY20 to FY21 is due to the technical refresh cycle of equipment scheduled in FY21.",
                                                "val": "1.4) PKI"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.502"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.468"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.468"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "0"
                                        },
                                        "CurrentYear": {
                                            "val": "27.632"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "53.896"
                                        },
                                        "BudgetYearOne": {
                                            "val": "53.896"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "27.632"
                            },
                            "BudgetYearOneBase": {
                                "val": "53.896"
                            },
                            "BudgetYearOne": {
                                "val": "53.896"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}