{
    "id": "2021-DefenseThreatReductionAgency-PB-0300D-JBOOK-271b301f3ec800339ad7c56a17d465c1068d3f74025b9e23677c6b94de0d4651-2",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-DEFENSE_DTRA-U_PROCUREMENT_JustificationBook_Defense_Threat_Reduction_Agency_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Defense_Threat_Reduction_Agency_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "LineItemNumber": {
            "val": "40"
        },
        "LineItemTitle": {
            "val": "Counter Improvised Threat Technologies"
        },
        "P1LineNumber": {
            "val": "30"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "23"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, Defense Threat Reduction Agency"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "5.2"
                },
                "PriorYear": {
                    "val": "5.534"
                },
                "CurrentYear": {
                    "val": "4.59"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "2.54"
                },
                "BudgetYearOne": {
                    "val": "2.54"
                },
                "BudgetYearTwo": {
                    "val": "2.579"
                },
                "BudgetYearThree": {
                    "val": "3.503"
                },
                "BudgetYearFour": {
                    "val": "3.587"
                },
                "BudgetYearFive": {
                    "val": "3.659"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "5.2"
                },
                "PriorYear": {
                    "val": "5.534"
                },
                "CurrentYear": {
                    "val": "4.59"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "2.54"
                },
                "BudgetYearOne": {
                    "val": "2.54"
                },
                "BudgetYearTwo": {
                    "val": "2.579"
                },
                "BudgetYearThree": {
                    "val": "3.503"
                },
                "BudgetYearFour": {
                    "val": "3.587"
                },
                "BudgetYearFive": {
                    "val": "3.659"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "5.2"
                },
                "PriorYear": {
                    "val": "5.534"
                },
                "CurrentYear": {
                    "val": "4.59"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                },
                "BudgetYearOneOCO": {
                    "val": "2.54"
                },
                "BudgetYearOne": {
                    "val": "2.54"
                },
                "BudgetYearTwo": {
                    "val": "2.579"
                },
                "BudgetYearThree": {
                    "val": "3.503"
                },
                "BudgetYearFour": {
                    "val": "3.587"
                },
                "BudgetYearFive": {
                    "val": "3.659"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "FY 2019 funding totals include $5.534 million appropriated for Overseas Contingency Operations (OCO).\nFY 2020 funding totals include $4.590 million for OCO.\nFY 2021 funding totals include $2.540 million for OCO. \n\nThe Defense Threat Reduction Agency (DTRA) counter and deter threat network mission applies the tactics, tools and techniques honed in the counter terrorist fight to counter Chinese, Russian, Iranian, North Korean and their proxy threat networks while maintaining pressure on Violent Extremist Organizations (VEOs).  DTRA accomplishes this mission by procuring items to support the following:\n\n-  Sustaining an advanced information technology and fusion infrastructure that enables a threat awareness and understanding capability;\n-  Providing expeditionary, forward-deployed operations, intelligence, training, and advisory capabilities with reach back support; enabling rapid and innovative counter-improvised threat solution development and delivery;\n-  Supporting Military Departments\/Services' pre-deployment training and Combatant Commanders' priority training-exercise support requirements;\n-  Leveraging broad Communities of Action that include DoD, other U.S. Government departments and agencies, key coalition allies and partners, academia, and the private sector to employ their capabilities, expertise, access and authorities to counter threat networks and their use and facilitation of improvised weapons."
        },
        "Justification": {
            "val": "The FY 2019 Overseas Contingency Operations (OCO) funding of $5.534 million resourced the following new and continuing efforts:\n-  In support of contingency operations in Iraq and Afghanistan, provided U.S. Joint Force Combatant Commanders with an awareness and understanding of the threat as well as the resources needed to support other contingencies including those with the mission to defeat the Islamic State of Iraq and Syria (ISIS). \n-  The provision of technologies to defeat improvised threats such as: advanced wireless signals and compatible electronic countermeasures for improvised explosive device defeat\/neutralization; miniaturized and integrated sensors; handheld detectors; and the procurement of mission-critical support items and information technology capabilities in support the DoD's goal to rapidly close the gap between the enemy's innovation cycles and the preparedness and operational capabilities of deploying and deployed U.S. Joint Forces.\n \nThe FY 2020 OCO funding of $4.590 million funds the following efforts:\n-  Lifecycle replacement and additional procurement of Joint Expeditionary Kits (JEKs) used by forward-deployed troops operating in austere locations around the globe. These kits support combat operations by equipping troops with a self-contained analytical tool kit that extends DTRA's combat support and intelligence analysis capabilities into forward operating locations.  These locations have minimal or no existing communications infrastructure or tactical intelligence support. \n-  Lifecycle replacement of a high-performance computing platform (primary system and disaster recovery fail-over system) that supports warfighter capabilities for use by Combatant Commands, Theater Special Operations Commands, forward-deployed combat troops, and mission partners in the DoD, Intelligence Community, Services, Homeland Security, and Law Enforcement community.\n\nThe FY 2021 OCO budget of $2.540 million will fund the lifecycle replacement of seven (7) JEKs (one third of existing kits are replaced each year under a three-year lifecycle replacement plan) and procurement of two (2) additional JEKs to support additional requirements, for a total of nine (9) JEKs. JEKs are used by forward-deployed troops operating in austere locations around the globe. These JEKs support combat operations by equipping troops with a self-contained analytical tool kit that extends DTRA's combat support and intelligence analysis capabilities into forward operating locations. These locations have minimal or no existing communications infrastructure or tactical intelligence support. The three-year lifecycle management\/replacement plan is required because these kits operate in sub-optimal conditions in forward-deployed locations and are subject to accelerated operational wear and failure in the field.  \n\nThe decrease from FY 2020 to FY 2021 is due to revalidation of procurement requirements."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}