{
    "id": "2021-AirForce-PB-3080F-JBOOK-e27cd2de2dad0f674c2097e83311f6a5c4a2de51cf3a352a68efe26efda300ef-42",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-AIRFORCE_OTHER-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.zzz_unzipped-U_PROCUREMENT_JustificationBook_Air_Force_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-JUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "LineItemNumber": {
            "val": "835140"
        },
        "LineItemTitle": {
            "val": "USCENTCOM"
        },
        "P1LineNumber": {
            "val": "44"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Electronics and Telecommunications Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Air Force Communications"
        },
        "ResourceSummary": {
            "TotalCost": {
                "PriorYear": {
                    "val": "8.194"
                },
                "CurrentYear": {
                    "val": "20.19"
                },
                "BudgetYearOneBase": {
                    "val": "19.649"
                },
                "BudgetYearOne": {
                    "val": "19.649"
                },
                "BudgetYearTwo": {
                    "val": "18.303"
                },
                "BudgetYearThree": {
                    "val": "18.624"
                },
                "BudgetYearFour": {
                    "val": "18.959"
                },
                "BudgetYearFive": {
                    "val": "19.305"
                },
                "Total": {
                    "val": "123.224"
                }
            },
            "NetProcurementP1": {
                "PriorYear": {
                    "val": "8.194"
                },
                "CurrentYear": {
                    "val": "20.19"
                },
                "BudgetYearOneBase": {
                    "val": "19.649"
                },
                "BudgetYearOne": {
                    "val": "19.649"
                },
                "BudgetYearTwo": {
                    "val": "18.303"
                },
                "BudgetYearThree": {
                    "val": "18.624"
                },
                "BudgetYearFour": {
                    "val": "18.959"
                },
                "BudgetYearFive": {
                    "val": "19.305"
                },
                "Total": {
                    "val": "123.224"
                }
            },
            "TotalObligationAuthority": {
                "PriorYear": {
                    "val": "8.194"
                },
                "CurrentYear": {
                    "val": "20.19"
                },
                "BudgetYearOneBase": {
                    "val": "19.649"
                },
                "BudgetYearOne": {
                    "val": "19.649"
                },
                "BudgetYearTwo": {
                    "val": "18.303"
                },
                "BudgetYearThree": {
                    "val": "18.624"
                },
                "BudgetYearFour": {
                    "val": "18.959"
                },
                "BudgetYearFive": {
                    "val": "19.305"
                },
                "Total": {
                    "val": "123.224"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "PE 0201122F USCENTCOM COMMUNICATIONS \n\nHQ USCENTCOM's mission is to work with its national and international partners in promoting development and cooperation among nations, responding to crises, and deterring or defeating state and transnational aggression in order to establish regional security and stability across its entire Area of Responsibility (AOR). Since USCENTCOM's AOR, covering the Middle East, includes the challenges of regional stability and violent extremists, this Combatant Command's mission is critical in regards to the Overseas Contingency Operations (OCO). To meet its mission responsibilities across this geographical expanse, HQ USCENTCOM must rely heavily on Command, Control, Communications, and Computer (C4) systems capable of achieving full spectrum information superiority. \n\nFunding for this effort is contained in PE 0201122F USCENTCOM Communications.\n\nUSCENTCOM COMMAND AND CONTROL SYSTEMS: Effort will provide end of life replacement for, but not limited to, Command and Control (C2) systems (thin client, server, etc), Joint Information Environment (JIE), classified and unclassified voice, data and video dissemination, storage area network (SAN) infrastructure, establishment of mission partner networks such as but not limited to; CENTCOM Partner Network (CPN), CENTCOM Partner Network Extended (CPN-X), Mission Partner Environment Information System (MPE-IS),and other coalition partner networks which provide secure networks for bilateral \/ multilateral information sharing up to the SECRET RELEASABLE level. Support maximum data storage capacity requirements for HQ war records collection, Modeling & Simulation Systems (J8MS), and uninterrupted power supply (UPS) required for the command's collateral classified and unclassified data networks. This equipment provides HQ USCENTCOM with effective C4 systems to effectively conduct current and future operations throughout the AOR.\n\nPE 0201131F AIR COMBAT COMMAND (ACC) COMMUNICATIONS\n\nAir Forces United States Central Command (AFCENT) is the ACC component designated to support USCENTCOM operations in deployed theaters for the AF. Funds C4 systems throughout the area of responsibility (AOR). Procurement efforts include: communications infrastructure requirements, satellite terminal equipment, data network servers and associated information assurance tools, information transfer nodes and routers, joint radio relays, as well as deployed air traffic control and landing systems and navigational aid systems. AFCENT funds\/support our portion of CENTCOM directed mission partner initiatives such as CPN X to ensure interoperability.\n\nFunding for this effort is contained in PE 0201131F AIR COMBAT COMMAND (ACC) COMMUNICATIONS"
        },
        "Justification": {
            "val": "PE 0201122F USCENTCOM COMMUNICATIONS \n\nUSCENTCOM COMMAND AND CONTROL SYSTEMS: FY21 funding will procure C4 equipment items required for HQ USCENTCOM, MacDill AFB, FL, Disaster Recovery Site (Site X), and CENTCOM Forward HQ at Al Udeid, Qatar, to effectively conduct communications support missions impacting Command and Control (C2) and operational missions conducted by the Commander and staff. The C4\/Information Technology (IT) supporting the command must be replaced to meet the ever increasing demands of current, ongoing contingency operations, and the growth of data storage requirements. \n\nSTORAGE CAPABILITIES: HQ CENTCOM and CENTCOM Forward HQ require maximum storage capabilities to maintain a level of readiness, reduce server footprint, and continue capabilities as they are implemented. \n\n\nPE 0201131F AIR COMBAT COMMAND (ACC) COMMUNICATIONS FY21 funds will provide:\n\nBASE COMMAND, CONTROL, COMMUNICATIONS, COMPUTERS, AND INTELLIGENCE (C4I) INFRASTRUCTURE. This FY21 effort will support communications CENTCOM Theater Posture Plan (TPP)locations identified for post OEF support. This effort is required at several AFCENT locations in the AOR and will provide critical infrastructure to support the transition to the Joint Information Environment, as required by DoD CIO mandate. Mode 5 mandate requires AFCENT obtain transition devices for theater radars to ensure proper C2. Developing infrastructure must be funded to support counter Unmanned Aircraft System technologies and new technologies for air domain awareness. Replacement for aged Air Traffic Control And Landing Systems equipment is required.\n\nSouthwest Asia - THEATER ENTERPRISE REQUIREMENTS - AFCENT must procure new system to support contingency operations and base opening\/closure requirements, which average 2 base openings and closing per year regardless of new or ongoing contingencies. A new Jordanian Base (MSAB) has been added to the enduring base list and commercialization projects are underway to complete transition from tactical support to enduring infrastructure.\n\nJOINT INFORMATION ENVIRONMENT: Implementation of JIE at MacDill AFB with SAF\/AA establishing a global node at HQ USCENTCOM. HQ USCENTCOM will collaborate with the DoD stakeholder community to implement the Joint Information Environment to include cloud infrastructure and digital transformation capabilities.\n\nFY21 effort will continue to support infrastructure and services essential secure networks for bilateral and multilateral information up to the secret releasable level. Support the networks and cross domain solution necessary to securely and safely integrate coalition sensors and C2 capabilities with C2 efforts. Includes integration of Coalition operations into our Combined Air Operations Center at Al Uedied AB"
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "USCENTCOM Communications"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "USCENTCOM COMMAND AND CONTROL SYSTEM"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "2.084"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.72"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.592"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.592"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "2.084"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.72"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.592"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.592"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "2.084"
                                        },
                                        "CurrentYear": {
                                            "val": "4.72"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.592"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.592"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "USCENTCOM:  FY21 procurement funds in the amount of $4.598M will procure C4 equipment items required for HQ USCENTCOM, MacDill AFB, FL and CENTCOM Forward HQ at Al Udeid, Qatar. Funding is vital to effectively conduct communications support missions impacting Command and Control (C2) and operational missions conducted by the Commander and staff supporting the Command's CONPLAN\/OPLANs.  The C4\/Information Technology (IT) supporting the command must be replaced to meet the ever increasing demands of enduring operations and the growth of data storage requirements, as well as emergent cyber threats."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "2.084"
                            },
                            "CurrentYear": {
                                "val": "4.72"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.592"
                            },
                            "BudgetYearOne": {
                                "val": "4.592"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Service Support to USCENTCOM - Communications"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Deployable Tactical Air Navigation (DTACAN)"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "2"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "4.8"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.853"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.85"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.85"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "2.4"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4.853"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4.85"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.85"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "BASE C4I SUPPORT"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "2"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "4"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.624"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.624"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.624"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.5"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.406"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.406"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.406"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "SWA-THEATER ENTERPRISE REQUIREMENTS"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "PriorYear": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "PriorYear": {
                                                        "val": "0.31"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "8.993"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.583"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.583"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "PriorYear": {
                                                        "val": "0.31"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "8.993"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.583"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.583"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "JOINT INFORMATION ENVIRONMENT CAPABILITIES"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "AFCENT PMA Other Government Costs"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "AFCENT PMA Contract Service"
                                            },
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "PriorYear": {
                                            "val": "6.11"
                                        },
                                        "CurrentYear": {
                                            "val": "15.47"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.057"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.057"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "PriorYear": {
                                "val": "6.11"
                            },
                            "CurrentYear": {
                                "val": "15.47"
                            },
                            "BudgetYearOneBase": {
                                "val": "15.057"
                            },
                            "BudgetYearOne": {
                                "val": "15.057"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}