{
    "id": "2021-DefenseLogisticsAgency-PB-0300D-MJBOOK-0-0-4db2d031d844af46449279b217be0a9db9fa98d0b6d5b52491cf0daf71fad2f6-0",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-DEFENSE_DLA-U_PROCUREMENT_MasterJustificationBook_Defense_Logistics_Agency_PB_2021.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Defense_Logistics_Agency_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "500"
        },
        "LineItemTitle": {
            "val": "Major Equipment DLA"
        },
        "P1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "7"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, DLA"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "60.862"
                },
                "PriorYear": {
                    "val": "6.086"
                },
                "CurrentYear": {
                    "val": "5.992"
                },
                "BudgetYearOneBase": {
                    "val": "417.459"
                },
                "BudgetYearOne": {
                    "val": "417.459"
                },
                "BudgetYearTwo": {
                    "val": "555.563"
                },
                "BudgetYearThree": {
                    "val": "1.605"
                },
                "BudgetYearFour": {
                    "val": "1.641"
                },
                "BudgetYearFive": {
                    "val": "1.675"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "60.862"
                },
                "PriorYear": {
                    "val": "6.086"
                },
                "CurrentYear": {
                    "val": "5.992"
                },
                "BudgetYearOneBase": {
                    "val": "417.459"
                },
                "BudgetYearOne": {
                    "val": "417.459"
                },
                "BudgetYearTwo": {
                    "val": "555.563"
                },
                "BudgetYearThree": {
                    "val": "1.605"
                },
                "BudgetYearFour": {
                    "val": "1.641"
                },
                "BudgetYearFive": {
                    "val": "1.675"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "60.862"
                },
                "PriorYear": {
                    "val": "6.086"
                },
                "CurrentYear": {
                    "val": "5.992"
                },
                "BudgetYearOneBase": {
                    "val": "417.459"
                },
                "BudgetYearOne": {
                    "val": "417.459"
                },
                "BudgetYearTwo": {
                    "val": "555.563"
                },
                "BudgetYearThree": {
                    "val": "1.605"
                },
                "BudgetYearFour": {
                    "val": "1.641"
                },
                "BudgetYearFive": {
                    "val": "1.675"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Description": {
            "val": "FY 2021-2025, the DLA Procurement program consists of Military GPS User Equipment (MGUE), Logistics Support Activity (LSA) equipment, Warstopper equipment, and Morale, Welfare and Recreation (MWR) equipment, and Passenger Carrying Motor Vehicles (PCMV).  The FY21 request includes MGUE ($405.000 million), LSA ($11.422 million), Warstopper ($0.492 million), MWR ($0.332 million), and PCMV ($0.223 million).    \n\nMGUE program - request is for the end-of-life procurement and management of the Application Specific Integrated Circuits (ASIC).  ASIC are integrated into higher level Global Positioning System (GPS) assemblies called Military GPS User Equipment (MGUE), which are modernized receiver platforms, utilized in hundreds of critical weapon systems and military equipment items.  Recently, the trusted foundry responsible for the production of ASIC provided end-of-life notification to the Department of Defense (DoD).  DLA has been tasked by the Department to conduct the end-of-life procurement of all remaining ASIC units and provide oversight for ASIC storage and distribution.  This will provide a stable supply of these circuits to the Military Services for the next 8 years, or until the next incremental ASIC is developed and produced. The DoD also increased the Operation and Maintenance (O&M) budget to fund associated costs with this effort.\n\nLSA program - is reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report.  The DoD provided additional Procurement funds for increased requirements in FY 2021. \n\nWarstopper program - identified an emerging first-time requirement to purchase Government Furnished Equipment (GFE) for fuel bladder manufacturing.  Fuel bladder reliability has created significant readiness impacts across multiple aircraft weapons systems.  Warstopper procurement funding also supports an on-going requirement for fully automated metrology equipment for wafer test and inspection of emulated microcircuits.  An additional Warstopper procurement requirement was identified to purchase of GFE for ration manufacturers to include retort machines, vertical forms, and seal machines used for Meals Ready to Eat (MRE).  \n\nMWR program - Closed Circuit TV (CCTV) systems at the Child Development Center (CDC) require upgrades and expanded coverage of video surveillance capabilities.  These systems mitigate anti-terrorism and force protection vulnerabilities and provide enhanced security at the CDCs as well as serve as an institutional child abuse deterrent.  The enhanced remote viewing of the center is required to ensure the safety and well-being of our children as well as employees.  These systems satisfy the Unified Facilities Criteria (UFC) Design: Child Development Centers (UFC 4-740-14) CCTV requirements.\n\nPCMV program - supports DLA's overseas logistics operations.  DLA maintains field offices in Europe, Kuwait, Korea and Japan.  Replacement of Agency-owned and commercially leased PCMVs with owned PCMVs is required in cases where it makes economic sense, and PCMV ownership is usually significantly less expensive than commercial leasing at overseas locations."
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}