{
    "id": "2021-DefenseThreatReductionAgency-PB-0300D-MJBOOK-0-0-9755c051c9b44194d6b60c8d93e09c3c8fd9d8a9c61edd518c7c54f74fb342a4-1",
    "meta": {
        "filename": "2021-BASE_PROCUREMENT-2021-DEFENSE_DTRA-U_PROCUREMENT_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2021.zzz_unzipped-U_PROCUREMENT_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2021.xml",
        "doctype": "2021-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2021",
        "budget_cycle": "PB",
        "submission_date": "2020-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0300D",
        "appropriation_name": "Procurement, Defense-Wide"
    },
    "record": {
        "@quantityUnits": "Each",
        "@quantityUnitName": "Each",
        "@unitCostUnits": "Millions",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Monthly",
        "@combinedP5Flag": "false",
        "LineItemNumber": {
            "val": "30"
        },
        "LineItemTitle": {
            "val": "Other Major Equipment"
        },
        "P1LineNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2021"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2020-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationNumber": {
            "val": "0300D"
        },
        "AppropriationTitle": {
            "val": "Procurement, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Major Equipment"
        },
        "BudgetSubActivityNumber": {
            "val": "23"
        },
        "BudgetSubActivityTitle": {
            "val": "Major Equipment, Defense Threat Reduction Agency"
        },
        "ResourceSummary": {
            "TotalCost": {
                "AllPriorYears": {
                    "val": "82.413"
                },
                "PriorYear": {
                    "val": "5.592"
                },
                "CurrentYear": {
                    "val": "11.521"
                },
                "BudgetYearOneBase": {
                    "val": "9.994"
                },
                "BudgetYearOne": {
                    "val": "9.994"
                },
                "BudgetYearTwo": {
                    "val": "10.263"
                },
                "BudgetYearThree": {
                    "val": "10.437"
                },
                "BudgetYearFour": {
                    "val": "5.216"
                },
                "BudgetYearFive": {
                    "val": "5.291"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "82.413"
                },
                "PriorYear": {
                    "val": "5.592"
                },
                "CurrentYear": {
                    "val": "11.521"
                },
                "BudgetYearOneBase": {
                    "val": "9.994"
                },
                "BudgetYearOne": {
                    "val": "9.994"
                },
                "BudgetYearTwo": {
                    "val": "10.263"
                },
                "BudgetYearThree": {
                    "val": "10.437"
                },
                "BudgetYearFour": {
                    "val": "5.216"
                },
                "BudgetYearFive": {
                    "val": "5.291"
                },
                "Continuing": {
                    "val": "true"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "82.413"
                },
                "PriorYear": {
                    "val": "5.592"
                },
                "CurrentYear": {
                    "val": "11.521"
                },
                "BudgetYearOneBase": {
                    "val": "9.994"
                },
                "BudgetYearOne": {
                    "val": "9.994"
                },
                "BudgetYearTwo": {
                    "val": "10.263"
                },
                "BudgetYearThree": {
                    "val": "10.437"
                },
                "BudgetYearFour": {
                    "val": "5.216"
                },
                "BudgetYearFive": {
                    "val": "5.291"
                },
                "Continuing": {
                    "val": "true"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "The Other Major Equipment Procurement Program supports the following mission requirements:\n- Stand-alone low visibility gamma\/neutron wide-area detection system, designed to improve the concealability of the existing Multi-Platform System via miniaturization and modularization;\n- Comprehensive Nuclear-Test-Ban Treaty's International Monitoring System and replacement components to support the operations of the Nuclear Arms Control Technology;\n(NACT) program and the U.S. Government's nonproliferation objectives related to implementation, compliance, monitoring and inspections for nuclear arms control activities;\n- Virtualization of the Defense Stockpile Management System (DSMS);  \n- Materials Handling Equipment (MHE) supports missions in the United States and overseas. MHE refers to various equipment for handling supplies with greater ease and economy, to include but not limited to forklifts.  The equipment is operated on rocky and unpaved terrain, resulting in shortened life-cycles and increased maintenance; \n- The Other Major Equipment Procurement Program also supports the backend IT infrastructure supporting DTRA's systems, capabilities and security posture."
        },
        "Justification": {
            "val": "The FY 2019 funding of $5.592 million resourced the following new and continuing efforts:\n-  Purchased Information Operations Computer Network Defense system equipment, giving DTRA a greater capability to execute cyber vulnerability scanning tools for Balanced Survivability Assessments.\n-  Continued the first phase to support the one-time replacement of DTRA's cable plant infrastructure started in FY 2018.\n-  Enhanced the DTRA Experimentation Laboratory supporting Technical Reachback.\n-  Continued Defense Stockpile Management System (DSMS) lifecycle replacement of the primary Defense Integration and Management of Nuclear Data Services (DIAMONDS) enterprise server equipment.\n-  Continued support to the Nuclear Arms Control Technology (NACT) program to meet on-going operational responsibilities in support of the Comprehensive Nuclear-Test-Ban Treaty's International Monitoring System and the U.S. Government's nonproliferation objectives related to implementation, compliance, monitoring, and inspection for nuclear arms control activities.\n-   Purchased an additional three (3) Orca systems to provide Weapons of Mass Destruction (WMD) search teams a low visibility gamma\/neutron wide-area detection system, designed to improve the concealability of the existing Multi-Platform System via miniaturization and modularization. This is a life-cycle replacement of the existing Multi-Platform System.\n\nThe FY 2020 budget of $11.521 million funds the following new and continuing efforts:\n-  Purchase an additional eighteen (18) Orca systems to provide WMD search teams a low visibility gamma\/neutron wide-area detection system, designed to improve the concealability of the existing Multi-Platform System via miniaturization and modularization. This is a life-cycle replacement of the existing Multi-Platform System. \n-  One-time purchase of two (2) BLACK RHINO Next Generation deployable toolkits designed to provide a lightweight flyaway\/portable kit configured with high-end systems pre-loaded with next generation Cybersecurity technologies and software designed to conduct Balanced Survivability Assessments of Military and Federal installations.\n-  Continue DSMS lifecycle replacement of the primary DIAMONDS enterprise server equipment.\n-  Continue support to the NACT program to meet on-going operational responsibilities to operate, maintain, and recapitalize U.S. International Monitoring System stations in support of the United States and Department of Defense objectives and the Comprehensive Nuclear-Test-Ban Treaty objectives related to implementation, monitoring, and verification for nuclear arms control activities.\n-  Purchase Materials Handling Equipment (MHE) in support of missions in the U.S. and overseas. Equipment consists of mechanical devices for handling of supplies with greater ease and economy. MHE includes various equipment, including forklifts, tractors, and other specialized industrial trucks powered by electric motors or internal combustion engines.  This could be operated in rocky, unpaved terrain and warehouse environments resulting in shortened life-cycles and increased volume for maintenance.\n\nThe FY 2021 budget of $9.994 million will fund the following new and continuing efforts:\n-  Continue support to the NACT program to meet on-going operational responsibilities for the recapitalization of the U.S. International Monitoring System stations in support of the United States and Department of Defense objectives and the Comprehensive Nuclear-Test-Ban Treaty objectives related to implementation, monitoring, and verification for nuclear arms control activities.\n-  Perform technical refresh of backend Information Technology infrastructure supporting DTRA's mission critical systems and capabilities. \n-  Purchase an additional eighteen (18) Orca systems to provide WMD search teams a low visibility gamma\/neutron wide-area detection system, designed to improve the concealability of the existing Multi-Platform System via miniaturization and modularization. This is a life-cycle replacement of the existing Multi-Platform System.\n-  Replace primary DSMS core systems at DTRA Ft Belvoir and DTRA Kirtland AFB.  This replacement of core systems includes the procurement of twenty-four (24) high end components for the complete, across-the-board, virtualization of the DSMS."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Mission Management"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Mission Management"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Mission Management"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "18.857"
                                                    },
                                                    "PriorYear": {
                                                        "val": "3.734"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "8.272"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "8.337"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "8.337"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "18.857"
                                        },
                                        "PriorYear": {
                                            "val": "3.734"
                                        },
                                        "CurrentYear": {
                                            "val": "8.272"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.337"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.337"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "The FY 2021 request supports the following mission critical programs:\n-  Nuclear Arms Control Technology (NACT): Provides for recapitalization of components of the International Monitoring System stations managed by the NACT program in support of the United States and Department of Defense objectives and the Comprehensive Nuclear-Test-Ban Treaty.\n-  Stockpile Logistics: Provides lifecycle replacement of the primary Defense Integration and Management of Nuclear Data Services (DIAMONDS) enterprise server equipment.\n-  Nimble Elder: Supports the purchase of (18) Orca systems to provide the Weapons of Mass Destruction search teams a low visibility gamma\/neutron wide-area detection system to improve their concealability and life cycle replacement of the existing Multi-Platform System via miniaturization and modularization."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "18.857"
                            },
                            "PriorYear": {
                                "val": "3.734"
                            },
                            "CurrentYear": {
                                "val": "8.272"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.337"
                            },
                            "BudgetYearOne": {
                                "val": "8.337"
                            }
                        }
                    }
                },
                {
                    "Name": {
                        "val": "Infrastructure"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Infrastructure"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "Infrastructure"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "63.556"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.858"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.249"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.657"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.657"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "63.556"
                                        },
                                        "PriorYear": {
                                            "val": "1.858"
                                        },
                                        "CurrentYear": {
                                            "val": "3.249"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.657"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.657"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "The FY 2021 request supports DTRA's Information Technology Infrastructure, including technical refresh of backend mission critical systems and capabilities and enhanced security features. \n\nThe net decrease of $1.592 million from FY 2020 to FY2021 is based on the following:\n\nAn increase of $1.495 million to resource DTRA's Information Technology Infrastructure, including technical refresh and enhanced security features. \nA decrease of $3.087 million in infrastructure that included a one-time purchase in FY 2020 of two (2) BLACK RHINO Cyber Assessment tool kits."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "63.556"
                            },
                            "PriorYear": {
                                "val": "1.858"
                            },
                            "CurrentYear": {
                                "val": "3.249"
                            },
                            "BudgetYearOneBase": {
                                "val": "1.657"
                            },
                            "BudgetYearOne": {
                                "val": "1.657"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "item"
            }
        }
    }
}