{
    "@recordid": "c31a5f0d9b508c4210f8db781c7d96061f874de5",
    "@doctype": "2013-BASE_RDTE-JUSTIFICATIONBOOK",
    "@filename": "2013-BASE_RDTE-2013-TJS-JustificationBook_The_Joint_Staff_PB_2013.zzz_unzipped-JustificationBook_The_Joint_Staff_PB_2013.xml",
    "JustificationBook": {
        "@targetSchemaVersion": "1.0",
        "Title": {
            "val": "Justification Book"
        },
        "BudgetYear": {
            "val": "2013"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2012-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "CoverPage": [],
        "ExternalDocuments": {
            "UserR1Doc": {
                "Title": {
                    "val": "Comptroller Exhibit R-1"
                },
                "FileName": {
                    "val": "FY13 PB R-1C.pdf"
                }
            }
        },
        "DocumentAssemblyOptions": {
            "ForceEvenPages": {
                "val": "true"
            },
            "GenerateProgramElementTocByTitle": {
                "val": "true"
            },
            "GenerateProgramElementTocByBA": {
                "val": "true"
            },
            "GenerateLineItemTocByTitle": {
                "val": "true"
            },
            "GenerateLineItemTocByBA": {
                "val": "true"
            }
        },
        "R2ExhibitList": {
            "@targetSchemaVersion": "1.0",
            "R2Exhibit": [
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "@format": "R2Long",
                        "ProgramElementNumber": {
                            "val": "0603828J"
                        },
                        "ProgramElementTitle": {
                            "val": "Joint Experimentation"
                        },
                        "R1LineItemNumber": {
                            "val": "62"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "3"
                        },
                        "BudgetActivityTitle": {
                            "val": "Advanced Technology Development (ATD)"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "21.230"
                            },
                            "BudgetYearOneBase": {
                                "val": "21.230"
                            },
                            "BudgetYearTwo": {
                                "val": "21.667"
                            },
                            "BudgetYearThree": {
                                "val": "23.719"
                            },
                            "BudgetYearFour": {
                                "val": "24.169"
                            },
                            "BudgetYearFive": {
                                "val": "22.839"
                            },
                            "CostToComplete": {
                                "val": "Continuing"
                            },
                            "TotalCost": {
                                "val": "Continuing"
                            }
                        },
                        "ProgramElementNote": {
                            "val": "In FY 2013 funds transfer to the Joint Staff."
                        },
                        "ProgramElementMissionDescription": {
                            "val": "The JE Program Element provides funding for the Department’s Joint Experimentation (JE) effort, carried out by the JCD&E Enterprise.   The JCD&E Enterprise includes the combatant commands, the military services, the National Guard Bureau, the Joint Staff, the Office of the Secretary of Defense (OSD), and several Defense agencies.  Intra-government agencies and coalition partners often participate in JCD&E processes and projects.  The Joint Staff J7 executes the JE program and leads the JCD&E Enterprise.  \n\nTo ensure the program focuses on needs of the warfighters, joint experiments originate from an annual call for nominations from combatant commands and Services, and from assessment of combatant command identified critical warfighting capability gaps articulated in combatant command Integrated Priority Lists and Joint Urgent Needs documents submitted, to the Chairman of the Joint Chiefs of Staff (CJCS).  JE nominations undergo preliminary analysis by the JCD&E Enterprise to confirm suitability for experimentation, alignment to strategic guidance and, where feasible, to associate closely related subjects for economy of effort.  The resultant list is termed Warfighter Challenges (WFCs), and constitutes experimentation efforts eligible for design and execution.  These efforts are prioritized and approved by the combatant command and Service members of the Executive Council.  \n\nExperimentation plans are developed in consultation with JE partners, and consolidated into an annual program of joint experimentation, known as the JCD&E Campaign Plan.  The Executive Council meets regularly to review and approve the progress of the efforts in the campaign plan.  The JCD&E Campaign Plan allows the Department to synchronize experimentation efforts over multiple years to avoid duplication of effort and to create synergy among the defense experimentation entities.    \n\nJE experiments and activities examine potential solutions for combatant command operational needs through targeted Doctrine, Organizational, Training, Materiel, Leadership, Personnel, Facilities, and Policy (DOTMLPF-P) improvements.  JE tackles joint concept and capability issues demanding sophisticated analysis, innovative design and complex execution.  JE addresses topics that would prove difficult for individual combatant commands and Services to capture in the context of their immediate operational and force generation responsibilities.  Experiments and efforts produce a range of outcomes inclusive of fundamental joint doctrine, inputs to major policy documents such as the Quadrennial Defense Review and the Defense Planning and Programming Guidance (DPPG). In partnership with the combatant commands and Services, JE mitigates operational risk by establishing procedural models to conduct emergent concepts like Irregular Warfare, Integrated Financial Operations and Joint Operational Access that are not yet instantiated in conventional force generation.  The results are briefed to Functional Capability Boards who integrate solutions into their functional investment plans."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "21.230"
                                },
                                "BudgetYearOneBase": {
                                    "val": "21.230"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "21.230"
                                },
                                "BudgetYearOneBase": {
                                    "val": "21.230"
                                }
                            },
                            "AdjustmentDetails": {
                                "OtherAdjustmentDetailList": {
                                    "OtherAdjustmentDetail": [
                                        {
                                            "Title": {
                                                "val": "Funds transfer to the Joint Staff"
                                            },
                                            "Funding": {
                                                "BudgetYearOne": {
                                                    "val": "21.230"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "21.230"
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "P808"
                                    },
                                    "ProjectTitle": {
                                        "val": "Joint Experimentation"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.230"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.230"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.667"
                                        },
                                        "BudgetYearThree": {
                                            "val": "23.719"
                                        },
                                        "BudgetYearFour": {
                                            "val": "24.169"
                                        },
                                        "BudgetYearFive": {
                                            "val": "22.839"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectNote": {
                                            "val": "In FY 2013 funds transfer to the Joint Staff.  For FY 2012 and previous, refer to PE 0603828D8Z."
                                        },
                                        "ProjectMissionDescription": {
                                            "val": "Joint Experimentation (JE) funds the Joint Concept Development and Experimentation (JCD&E) Enterprise.  Led by the Joint Staff, the JCD&E Enterprise includes the combatant commands, the military services, the National Guard Bureau, the Joint Staff, the Office of the Secretary of Defense (OSD), and several Defense agencies.  Intra-government agencies and coalition partners often participate in JCD&E processes and projects.  \n\nJE projects and activities develop and examine potential solutions for combatant command operational needs through targeted Doctrine, Organizational, Training, Materiel, Leadership and Education, Personnel, Facilities, and Policy (DOTMLPF-P) improvements.  JE tackles joint capability issues demanding sophisticated analysis, innovative design and complex experimentation leading to solutions.  JE addresses topics that would prove difficult for individual combatant commands and Services to capture in the context of their immediate operational and force generation responsibilities.  Joint Concept Development & Experimentation (JCD&E) projects produce a range of outcomes including inputs to major policy documents such as the Quadrennial Defense Review and Defense Planning and Programming Guidance (DPPG) and input to the Joint Capabilities Integration and Development System (JCIDS).\n\nTo ensure the program focuses on needs of the warfighters, JCD&E projects originate from an annual call for nominations from combatant commands and Services, and from assessment of combatant command identified critical warfighting capability gaps articulated in combatant command Integrated Priority Lists and Joint Urgent Needs documents submitted to the Chairman of the Joint Chiefs of Staff (CJCS).\n\nProject plans are developed in consultation with JE partners, and consolidated into an annual program of work.  The Synchronization Board and the Joint Capabilities Board meet regularly to review and approve the progress of the efforts in the program of work.  The JCD&E Program of Work allows the Department to synchronize JCD&E efforts over multiple years to avoid duplication of effort and to create synergy among the defense experimentation entities."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Joint Experimentation Efforts"
                                                    },
                                                    "Description": {
                                                        "val": "Description:  Potential JCD&E areas include:  Building Partnerships (BP), Battlespace Awareness (BA), Command and Control (C2), Force Application (FA), Logistics (Log), Protection (P), Net Centric (NC), Cyber, Combatant Command Service Experimentation Support (CCSES), Urban Operation (UO), Irregular Warfare (IW), and Future Joint Warfighting (FJW)."
                                                    },
                                                    "PlannedProgram": {
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "21.230"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "21.230"
                                                            },
                                                            "Text": {
                                                                "val": "The FY13 Program of Work will include projects supporting the President’s “Sustaining U.S. Global Leadership Priorities for the 21st Century Defense”.  Specific projects will focus on capabilities critical to the success of the future joint force, including intelligence, surveillance, and reconnaissance; counterterrorism; countering weapons of mass destruction; operating in anti-access environments; and prevailing in all domains, including cyber."
                                                            }
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "Funding": {
                                                                "val": "0.000"
                                                            },
                                                            "Text": {
                                                                "val": "N\/A"
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "N\/A"
                                        },
                                        "PerformanceMetrics": {
                                            "val": "Performance of Joint Experimentation efforts is measured by successful development and implementation of solutions to capability gaps identified by the CJCS, Combatant Commands, and Services and include:\n(1) objective assessment and validation of enhanced capabilities enabling the joint force commander to perform joint missions,\n(2) delivery of relevant, intellectually rigorous joint concepts to enhance or change Joint Doctrine,\n(3) confirmed transition of capability\/products from experimentation to force implementation through the DOTMLPF-P Change Recommendations (DCR) process,(4) identification of innovative integrated solutions and joint interoperability standards for Service and Agency capability developers to pursue through demonstration, acquisition and\/or employment,\n(5) resolution of specific joint capability shortfalls."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "@format": "R2Long",
                        "ProgramElementNumber": {
                            "val": "0604787J"
                        },
                        "ProgramElementTitle": {
                            "val": "Joint Systems Integration"
                        },
                        "R1LineItemNumber": {
                            "val": "104"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "4"
                        },
                        "BudgetActivityTitle": {
                            "val": "Advanced Component Development & Prototypes (ACD&P)"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "3.273"
                            },
                            "BudgetYearOneBase": {
                                "val": "3.273"
                            },
                            "BudgetYearTwo": {
                                "val": "3.275"
                            },
                            "BudgetYearThree": {
                                "val": "3.297"
                            },
                            "BudgetYearFour": {
                                "val": "3.293"
                            },
                            "BudgetYearFive": {
                                "val": "3.248"
                            },
                            "CostToComplete": {
                                "val": "Continuing"
                            },
                            "TotalCost": {
                                "val": "Continuing"
                            }
                        },
                        "ProgramElementNote": {
                            "val": "In FY 2013, funds transfer to the Joint Staff"
                        },
                        "ProgramElementMissionDescription": {
                            "val": "The Joint Systems Integration program element provides mission funding for the Joint System Integration Center (JSIC) to conduct interoperability assessments, and develop solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems. Joint Staff J8 is the executive agent for the JSIC.  \n\nJSIC provides for the fielding of warfighter Command and Control (C2) systems through rapid systems integration, technical assessment, and operational evaluation using laboratory environments and field venues. \n \nJSIC provides Combatant Commands with a laboratory and assessment environment for the warfighter and capability developer to evaluate current and near-term joint and coalition capabilities at the operational and tactical levels.  JSIC's C2 Environment accurately replicates an operational C2 environment to assess system of systems interoperability, operational capability, procedural compliance and technical suitability of emerging and existing systems and programs to confirm readiness for deployment.  \n\nJSIC also serves as the technical analysis and operational assessment activity in support of the Joint Staff capability-driven requirements process, the Joint Capabilities Integration and Development System (JCIDS).  JSIC also serves as a joint interoperability compliance activity for the milestone decision authorities\/program managers in the Defense acquisition enterprise."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.273"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.273"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.273"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.273"
                                }
                            },
                            "AdjustmentDetails": {
                                "SBIRSTTRTransfer": {
                                    "PriorYear": {
                                        "val": "0.000"
                                    }
                                },
                                "OtherAdjustmentDetailList": {
                                    "OtherAdjustmentDetail": [
                                        {
                                            "Title": {
                                                "val": "Transfer to the Joint Staff"
                                            },
                                            "Funding": {
                                                "BudgetYearOne": {
                                                    "val": "3.273"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "3.273"
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "P787"
                                    },
                                    "ProjectTitle": {
                                        "val": "Joint Systems Integration Command"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.273"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.273"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.275"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.297"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.293"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.248"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectNote": {
                                            "val": "In FY 2013 funds transfer to the Joint Staff.  For FY 2012 and previous years, refer to PE 0604787D8Z."
                                        },
                                        "ProjectMissionDescription": {
                                            "val": "The Joint Systems Integration program element  provides mission funding for the Joint System Integration Center (JSIC) to conduct interoperability assessments, and develop solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems.  JSIC promotes Service\/Defense Agency C2 capability integration, and conducts technical, operational, and DOTMLPF assessments of Command and Control (C2) and Command, Control, Computer, Communication, Intelligence, Surveillance and Reconnaissance (C4ISR) capabilities.  JSIC serves as the technical analysis and operational assessment activity in support of the Joint Staff capability-driven requirements process, the Joint Capabilities Integration and Development System (JCIDS).  JSIC also serves as a joint interoperability compliance activity for the milestone decision authorities\/program managers in the Defense acquisition enterprise.\n\nJSIC provides Combatant Commands with a laboratory and assessment environment for the warfighter and capability developer.  This environment provides for assessment of current and near-term joint and coalition capabilities primarily at the operational and tactical levels. JSIC assesses system of systems interoperability, operational capability, procedural compliance and technical suitability of emerging and existing systems and programs to confirm readiness for deployment."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Interoperability Assessments(IA) and Interoperability Technology Demonstration Center(ITDC)"
                                                    },
                                                    "Description": {
                                                        "val": "IA supports the interoperability assessment of systems in five categories: operational, system of systems, technical, software, and procedural."
                                                    },
                                                    "PlannedProgram": {
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "3.273"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "3.273"
                                                            },
                                                            "Text": {
                                                                "val": "Interoperability assessments will be conducted to solve warfighter problems, including coalition challenges. Focus areas will include Joint Command and Control Capabilities, Intelligence support to C2\/ISR, Integrated Air and Missile Defense, Joint Fires Capabilities, Cyberspace, Information Sharing Capabilities, and Data Strategy Implementation."
                                                            }
                                                        },
                                                        "BudgetYearOneOCO": {
                                                            "Funding": {
                                                                "val": "0.000"
                                                            },
                                                            "Text": {
                                                                "val": "N\/A"
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "JSIC supports interoperability of systems selected for acquisition, integration and fielding.  JSIC is intended to be a forcing function to discover and provide interoperable joint solutions as a means to foster rapid, near-term insertion of command and control technology by promoting the ability to meet the DoD direction for spiral development and evolutionary acquisition.  Services and Defense Agencies are responsible for conducting acquisition activities in Programs of Record (POR)."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "FY 2013 Strategic Goals Supported:  Joint Command and Control \n\n- Drive resolution of C4 interoperability problems with actionable recommendations stemming from technical and operational demonstrations and assessments of existing and emerging C4 capabilities.\n\n- Integrate and assess technical solutions that provide gap-filling capabilities to satisfy near-term operational requirements.\n\n- Provide a persistent C4 environment replicating an operational Joint Task Force Headquarters and\/or subordinate elements to conduct interoperability, capability, and integration assessments."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "@format": "R2Long",
                        "ProgramElementNumber": {
                            "val": "0604828J"
                        },
                        "ProgramElementTitle": {
                            "val": "Joint FIRES Integration and Interoperability Team"
                        },
                        "R1LineItemNumber": {
                            "val": "106"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "4"
                        },
                        "BudgetActivityTitle": {
                            "val": "Advanced Component Development & Prototypes (ACD&P)"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "7.364"
                            },
                            "BudgetYearOneBase": {
                                "val": "7.364"
                            },
                            "BudgetYearTwo": {
                                "val": "7.506"
                            },
                            "BudgetYearThree": {
                                "val": "7.661"
                            },
                            "BudgetYearFour": {
                                "val": "7.799"
                            },
                            "BudgetYearFive": {
                                "val": "7.944"
                            },
                            "CostToComplete": {
                                "val": "Continuing"
                            },
                            "TotalCost": {
                                "val": "Continuing"
                            }
                        },
                        "ProgramElementNote": {
                            "val": "In FY 2013 funds transfer to the Joint Staff.  For FY 2012 and previous, refer to PE 0604828D8Z."
                        },
                        "ProgramElementMissionDescription": {
                            "val": "The Joint Deployable Analysis Team (JDAT) mission is to conduct field analysis in an operationally relevant environment of current and emergent Command and Control (C2) information systems and associated procedures to measure capabilities and limitations and to identify shortfalls and root causes producing decision-quality data and cogent solutions to customers and stakeholders to improve Joint C2 integration and interoperability.\n\nThe JDAT is a compact cell of unique Subject Matter Experts and analysts adding value to much larger Service investments in force elements delivering kinetic and non kinetic effects. Services, Joint, and Combatant Commanders and their Staffs proactively seek JDAT advice and assistance to improve the execution of combat fires applied in complex coalition and joint environments."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "7.364"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.364"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "7.364"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.364"
                                }
                            },
                            "AdjustmentDetails": {
                                "SBIRSTTRTransfer": {
                                    "PriorYear": {
                                        "val": "0.000"
                                    }
                                },
                                "OtherAdjustmentDetailList": {
                                    "OtherAdjustmentDetail": [
                                        {
                                            "Title": {
                                                "val": "Transfer to the Joint Staff"
                                            },
                                            "Funding": {
                                                "BudgetYearOne": {
                                                    "val": "7.364"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "7.364"
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            "SummaryExplanation": {
                                "val": "."
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "P857"
                                    },
                                    "ProjectTitle": {
                                        "val": "Joint Deployable Analysis Team"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.364"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.364"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.506"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.661"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.799"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.944"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectNote": {
                                            "val": "In FY 2013 funds transfer to the Joint Staff.  For FY 2012 and previous, refer to PE 0604828D8Z."
                                        },
                                        "ProjectMissionDescription": {
                                            "val": "Employ scientific methods to research, investigate, test, assess, and evaluate current and emergent Joint command and control (C2) information systems and associated procedures.  These activities measure capabilities and limitations, identify shortfalls and root cause, recommend and verify solutions, and validate joint capabilities.  The resultant empirical outcomes influence Joint Capability development in areas such as Joint Tactics, Techniques and Procedures; integration of capabilities; and digital interoperability.  JDAT provides decision-quality data and cogent solutions to customers and stakeholders responsible for improving Joint C2 information systems integration and interoperability to inform acquisition decisions and ensure that Services and Agencies field interdependent and interoperable systems.\n\nThe emphasis of JDAT assessment efforts is the evaluation of C2 Information Systems and procedures to provide Services and Agencies findings and recommendations based on quantifiable data in order to improve Joint C2 integration and interoperability. JDAT collects and analyzes data and provides observations, findings, conclusions, and recommendations to identify Joint doctrine, tactics, techniques, and procedures (TTP) and material solutions and products that promote capability improvement.  Evaluations range from small, single-focus events to large, multi event\/venue exercises."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Joint Deployable Analysis Team (JDAT) - Command and Control (C2) Information Systems and Procedures Capability Assessments"
                                                    },
                                                    "Description": {
                                                        "val": "JDAT conducts assessments in conjunction with Service and Combatant Command (COCOM) exercises, experiments, and test & evaluation events. \n\nThe primary outputs and efficiencies include:\n- Improvement in the Services’ ability to employ Joint C2 information systems\n- Recommendations for system integration and interoperability\n- Ability to include Joint context during new system acquisition or development\n- Development of related Universal Joint Tasks (UJT) and Additional Task Detail (ATD)\n- Updates and revisions to doctrine, TTP, and other Joint publications\n- Development and refinement of analytical tools (i.e. Data Collection Architecture for Analytical Feedback (DCAAF), Joint Windows-based Warfare Assessment Model (JWinWAM))\n- Recommended solutions integrated within the Joint Staff Joint Capabilities Integration Development System (JCIDS) and OSD Joint C2 Capability Portfolio Manager (JC2 CPM) processes\n- Identification of specific key performance parameters (KPPs) and key system attributes (KSAs) for new systems that meet Joint warfighter operational requirements to ensure Services and Agencies field interdependent and interoperable systems\n- Increased effectiveness and confidence in combat identification and a reduction in fratricide\n- Increased effectiveness and confidence in C2 information systems and procedures."
                                                    },
                                                    "PlannedProgram": {
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "7.364"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "7.364"
                                                            },
                                                            "Text": {
                                                                "val": "- Provide analytical support to a Military Utility Assessment of coalition and U.S. C2 information systems and procedures at Bold Quest 13.  Provide instrumentation, data collection, data capture, real-time mission monitoring, and feedback to participants via daily debriefings. Benefits will include improved ability to assess various participating coalition and US systems, improved joint task execution, and an effective Military Utility Assessment of US C2 information systems while greatly reducing the timeline required to provide fact-based recommendations.\n\n- Assist Commander, Operational Test and Evaluation Force (COMOPTEVFOR) with Identification Friend or Foe (IFF) Mode 5 Level 1 Joint Operational Test Approach (JOTA) analysis to validate integration and interoperability of fielded systems.  Develop data collection and analysis methodologies, design and implement data collection architectures and conduct analysis requisite to meet JOTA objectives.  Determine any gaps or shortfalls in integration and interoperability of Mode 5 systems.  Provide Service Operational Test Agencies and Program Managers with fact-based findings. \n\n- Provide analytical support to assess technology integration and interoperability during JIAMDO Joint Tactical Air Picture assessment event.  Provide data collection, analysis and display using JDAT developed tools.  Benefits will include improvements in a Joint Common Operational Picture to battlespace managers.  \n\n- Team with U.S. Army Test and Evaluation Command to conduct a DOT&E interoperability assessment for EUCOM during Austere Challenge 2013.  Provide data collection, analysis and display using JDAT developed tools.  Benefits will include improvements in a Joint Common Operational Picture to COCOM Air Operations Center.  \n\n- Provide C2 data collection and analytical support to the Joint Fires Support Executive Steering Committee.  Lead Engineering Change Implementation Group.  Conduct Digitally Aided Close Air Support (DACAS) Coordinated Implementation risk reduction assessments to validate service compliance with requisite Engineering Change Proposals.   Benefits will include recommendations for Tactics, Techniques, and Procedures in the areas of standardization and digital interoperability and development of associated Universal Joint Tasks.\n\n- Chair the Joint Close Air Support Executive Steering Committee (JCAS ESC) chartered Digitally Aided Close Air Support (DACAS) Engineering Change Implementation Group.  Plan and execute testing and validation of DACAS engineering change proposals and coordinate implementation across the Department of Defense and partner nations.\n\n- Update Joint Windows-based Warfare Assessment Model (JWinWAM), Data Collection Architecture for Analytical Feedback (DCAAF) and Multi-Interface Gateway (MIG) software development to support JDAT assessment activities and the efforts of other government agencies as directed.\n\n- Define Universal Joint Task (UJT) Additional Task Detail (ATD) for tactical task TA 3.3.2 Control Tactical Airspace and refine ATD for TA 3.2.2 Conduct Close Air Support (CAS) and TA 3.2.1 Conduct Joint Fires.\n\n- Provide subject matter expertise and tier 2 architecture products on development of the Joint Close Air Support (CAS) Joint Mission Thread (JMT) and Joint Fires JMT."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "Not applicable for this item."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "JDAT delivers Joint solutions for tactical forces deployed to Combatant Commands (COCOMs).  Deliverables may include: discrete improvements to training processes; doctrine; Tactics, Techniques, & Procedures (TTPs); and\/or technical system performance specifications and standards; validated Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities (DOTMLPF) recommendations; timely delivery of quality feedback to exercise participants; or improvements to Joint context of a training venue. JDAT works with Joint Staff, Services and COCOMs to approve the annual agenda of work and validate results."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "ProgramElementNumber": {
                            "val": "0605126J"
                        },
                        "ProgramElementTitle": {
                            "val": "Joint Integrated Air & Missle Defense Organization (JIAMDO)"
                        },
                        "R1LineItemNumber": {
                            "val": "144"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "6"
                        },
                        "BudgetActivityTitle": {
                            "val": "RDT&E Management Support"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "71.424"
                            },
                            "CurrentYear": {
                                "val": "79.514"
                            },
                            "BudgetYearOne": {
                                "val": "55.508"
                            },
                            "BudgetYearOneBase": {
                                "val": "55.508"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0.000"
                            },
                            "BudgetYearTwo": {
                                "val": "47.607"
                            },
                            "BudgetYearThree": {
                                "val": "48.321"
                            },
                            "BudgetYearFour": {
                                "val": "46.023"
                            },
                            "BudgetYearFive": {
                                "val": "45.945"
                            },
                            "CostToComplete": {
                                "val": "Continuing"
                            },
                            "TotalCost": {
                                "val": "Continuing"
                            }
                        },
                        "ProgramElementMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DOD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (COCOMs) and maintains liaison offices at all major COCOM locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team. JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "94.577"
                                },
                                "CurrentYear": {
                                    "val": "79.859"
                                },
                                "BudgetYearOne": {
                                    "val": "55.541"
                                },
                                "BudgetYearOneBase": {
                                    "val": "55.541"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "71.424"
                                },
                                "CurrentYear": {
                                    "val": "79.514"
                                },
                                "BudgetYearOne": {
                                    "val": "55.508"
                                },
                                "BudgetYearOneBase": {
                                    "val": "55.508"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "-23.153"
                                },
                                "CurrentYear": {
                                    "val": "-0.345"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.033"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.033"
                                }
                            },
                            "AdjustmentDetails": {
                                "OtherAdjustmentDetailList": {
                                    "OtherAdjustmentDetail": [
                                        {
                                            "Title": {
                                                "val": "Directed reduction in travel."
                                            },
                                            "Funding": {
                                                "CurrentYear": {
                                                    "val": "-0.345"
                                                },
                                                "BudgetYearOne": {
                                                    "val": "-0.033"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "-0.033"
                                                }
                                            }
                                        },
                                        {
                                            "Title": {
                                                "val": "Congressional Rescission in FY12 Defense Appropriation"
                                            },
                                            "Funding": {
                                                "PriorYear": {
                                                    "val": "-18.608"
                                                }
                                            }
                                        },
                                        {
                                            "Title": {
                                                "val": "Unobligated FY11"
                                            },
                                            "Funding": {
                                                "PriorYear": {
                                                    "val": "-4.545"
                                                }
                                            }
                                        }
                                    ]
                                }
                            },
                            "SummaryExplanation": {
                                "val": "JIAMDO-Homeland:  Programs will be near development completion and conducting Military Utility Assessment, which requires live assets and integration development.  \n\nJIAMDO-Core:  The Joint Staff plans to reduce dependence upon contracted advisory and assistance service efforts, and increase leverage upon organic (military and federal civilian) labor."
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "P001"
                                    },
                                    "ProjectTitle": {
                                        "val": "Core"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "24.751"
                                        },
                                        "CurrentYear": {
                                            "val": "9.030"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.508"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.508"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.767"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.481"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.967"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.627"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DOD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (COCOM) and maintains liaison offices at all major COCOM locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team. JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues and to US Joint Forces Command (USJFCOM) for capabilities development and validation in support of its Unified Command Plan (UCP) assigned missions."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Core"
                                                    },
                                                    "Description": {
                                                        "val": "Provides overall staff support for JIAMDO operations in the area of ballistic missile defense, air and cruise missile defense and homeland defense. This includes performing analyses, demonstrations, and programmatic assessments of technology, operations, requirements, and weapons systems. In coordination with Services and COCOMs, JIAMDO Core also leads the definition, assessment, development, and approval of Joint AMD Operational Concepts, Operational Architectures, and capability requirements to guide the Department's joint\/interagency\/combined fully integrated and net-centric capable air defense (including defense against cruise missiles, unmanned aerial vehicles, and ballistic missiles). JIAMDO Core also:\n•\tDevelops and integrates joint exercises, simulations, war-games, force resource allocations, and interoperability initiatives\n•\tManages relevant Congressional interaction and COCOM interface through a cadre of liaisons collocated with major headquarters\n•\tDirectly supports and sponsors homeland air surveillance related demonstration and analysis activities\n•\tRuns the AMD Working Group focusing COCOM, Joint Staff, and Service collaboration efforts in the generation of joint concepts and development of the integrated AMD architecture and roadmap\n•\tDevelops US positions for, and serves as the US representative to, the NATO Air Defense Committee\n\nJIAMDO Core also enables strategic planning development, infrastructure, security, travel, administrative and other support activities. Funding pays for: Contractor Systems Engineering and Technical Assistance (SETA) support for Air & Cruise Missile Defense (ACMD), Ballistic Missile Defense (BMD), Homeland Air Security (HAS) strategic planning, senior level briefings, and JIAMDO white papers; leased office space, including all upkeep services; all travel costs for government and contractor support personnel, including support for Combatant Commander liaison personnel travel; multiple levels of security including lease support for a Joint Worldwide Intelligence Communications System (JWICS) communications line and Special Compartmented Information (SCI) terminals (due to the classified nature and the diverse content of work in the JIAMDO portfolio); 24-hour physical security force and alarm monitoring and maintenance; daily on-site security personnel to meet DOD, National Industrial Security Program Operating Manual (NISPOM), and other security regulations; for all administrative and support functions; all associated Information Technology (IT) support, copier purchase and maintenance, as well as basic office supplies and furniture; all telephones, telephone lines, classified telephones, and classified\/unclassified data connections."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "24.751"
                                                            },
                                                            "Text": {
                                                                "val": "Performed Ballistic Missile Defense directed studies and program support activities (contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply)."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "9.030"
                                                            },
                                                            "Text": {
                                                                "val": "Perform Ballistic Missile Defense directed studies and program support activities (contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply).  Program will reduced dependence on contracted advisory and assistance services, and intends to leverage organic (military and federal civilian) labor to achieve planned mission."
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "22.508"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "22.508"
                                                            },
                                                            "Text": {
                                                                "val": "Perform Ballistic Missile Defense directed studies and program support activities (contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space and supply).  Program will reduced dependence on contracted advisory and assistance services, and intends to leverage organic (military and federal civilian) labor to achieve planned mission."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "- Conduct two Protection Functional Capability Boards per month\n- Conduct two Air and Missile Defense Working Groups per month\n- Conduct Change Control Boards per quarter\n- Support U.S. Representative to NATO Air Defense Council (NADC) to include 2 overseas NADC meetings per year\n- Develop and maintain electronic library of current Joint and Service AMD Publications\n- Develop and maintain operational architecture compliant with DoD architectural framework (DODAF) standards\n- Ensure 100% of all government employee travel is in accordance with the JFTR\/JTR\n- Maintain all unclassified\/classified LANs on a daily basis in accordance with TJS Office of the Chief Information Officer guidance\/policy\n- Ensure all computers NIPRNET\/SIPRNET are refreshed according to OCIO policy\/guidance"
                                        }
                                    }
                                },
                                {
                                    "ProjectNumber": {
                                        "val": "P002"
                                    },
                                    "ProjectTitle": {
                                        "val": "Homeland"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "14.347"
                                        },
                                        "CurrentYear": {
                                            "val": "25.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DOD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (COCOM) and maintains liaison offices at all major COCOM locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team. JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Homeland"
                                                    },
                                                    "Description": {
                                                        "val": "Develop Homeland Surveillance technologies to enable Joint Integrated Air and Missile Defense."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "14.347"
                                                            },
                                                            "Text": {
                                                                "val": "Perform technology development efforts.  Specific details of this project are classified."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "25.000"
                                                            },
                                                            "Text": {
                                                                "val": "Perform technology development efforts.  Specific details of this project are classified."
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "6.000"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "6.000"
                                                            },
                                                            "Text": {
                                                                "val": "Perform technology development efforts.  Specific details of this project are classified."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "Details of this project are classified."
                                        }
                                    }
                                },
                                {
                                    "ProjectNumber": {
                                        "val": "P003"
                                    },
                                    "ProjectTitle": {
                                        "val": "Black Dart"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "3.833"
                                        },
                                        "CurrentYear": {
                                            "val": "5.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.374"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.374"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.374"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO), is the organization within the Department of Defense (DOD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (COCOM) and maintains liaison offices at all major COCOM locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team. JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "JIAMDO Black Dart"
                                                    },
                                                    "Description": {
                                                        "val": "Provides funding to support administration and execution of Black Dart demonstrations.  Black Dart is a joint agency demonstration which focuses on rapid development and implementation of UAV technology from readily-available commercial products."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "3.833"
                                                            },
                                                            "Text": {
                                                                "val": "Detect, ID, and interdict UAV’s demonstration event and supporting analysis (includes targets).  Assess C-UAS across IAMD kill chain in littoral\/ maritime environment, quantify detection and track performance, understand C-UAS aspects of IAMD architecture, establish operational \/ technical performance, enable Allied\/Coalition participation, determine environmental impacts, increase fidelity of threat representations and emissions"
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "5.000"
                                                            },
                                                            "Text": {
                                                                "val": "Assess C-UAS across IAMD kill chain in littoral\/ maritime environment. Quantify identification performance. Understand C-UAS aspects of IAMD architecture. Establish operational \/ technical performance. Enable Allied\/Coalition participation. Determine environmental impacts. Increase fidelity of threat representations’  size & performance. Use US systems as surrogates."
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "4.000"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "4.000"
                                                            },
                                                            "Text": {
                                                                "val": "Increase fidelity of threat representations’ size & performance.  Use US systems as surrogates."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "- Complete events within schedule and budget.   Events provide useful data to improve C-UAS capability  \n- Document gaps, develop & substantiate hardware, software and employment concepts \n- Field C-UAS capability"
                                        }
                                    }
                                },
                                {
                                    "ProjectNumber": {
                                        "val": "P004"
                                    },
                                    "ProjectTitle": {
                                        "val": "Joint Distributed Engineering Plant"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "4.785"
                                        },
                                        "CurrentYear": {
                                            "val": "8.927"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.250"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.250"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.250"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.250"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.374"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DOD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (COCOM) and maintains liaison offices at all major COCOM locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team.  JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues and for capabilities development and validation in support of the Unified Command Plan (UCP) assigned missions."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Joint Distributed Engineering Plant (JDEP)"
                                                    },
                                                    "Description": {
                                                        "val": "Evaluates and improves interoperability by establishing and using a distributed, nationwide, hardware and software in-the-loop simulation capability that allows proposed combat capabilities and field combat weapon systems to operate in operationally representative, synthetic joint air and missile defense environments."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "4.785"
                                                            },
                                                            "Text": {
                                                                "val": "Fund approximately ten joint distributed test events.  Execute coalition test event with UK.  Provide users the means to create SoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Service and Joint combat system engineering and test sites via distributed communications.  Reduce costs and developmental cycle times by leveraging existing facilities and additional efforts determined by Service\/COCOM priorities."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "8.927"
                                                            },
                                                            "Text": {
                                                                "val": "Fund approximately ten joint distributed test events.  Execute coalition test event with UK, provide users the means to create SoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop.  Link existing Service and Joint combat system engineering and test sites via distributed communications.   Reduce costs and developmental cycle times by leveraging existing facilities."
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "3.250"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "3.250"
                                                            },
                                                            "Text": {
                                                                "val": "Reduce costs and developmental cycle times by leveraging existing facilities."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "- Each JDEP event develops measures of effectiveness (MOE)  & measures of performance (MOP) based on a eighteen month test planning and event process\n- Complete events within schedule and budget \n- Events provide useful data to improve AMD interoperability, with implemented corrective changes"
                                        }
                                    }
                                },
                                {
                                    "ProjectNumber": {
                                        "val": "P005"
                                    },
                                    "ProjectTitle": {
                                        "val": "Nimble Fire"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "11.692"
                                        },
                                        "CurrentYear": {
                                            "val": "13.340"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.500"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.500"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.690"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.690"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.750"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.750"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DOD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (COCOMs) and maintains liaison offices at all major COCOM locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team. JIAMDO also provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "JIAMDO Nimble Fire"
                                                    },
                                                    "Description": {
                                                        "val": "The Department's only joint air and missile defense operator-in-the-loop simulation.  Comprised of current and future land, sea, and air weapon systems representing each of the Services AMD capabilities.  Operational personnel execute full mission scenarios in a realistic joint environment.  Distributed simulation in CONUS and overseas.  Enhances air and missile defense capability through the integration of robust representations of current and emerging weapons platform models that support operator-in-the-loop exercises."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "11.692"
                                                            },
                                                            "Text": {
                                                                "val": "Purchase and upgrade Army PATRIOT\/SLAMRAAM\/MEADS and JLENS simulators.  Enhanced Electronic Attack capabilities and composite tracking on JLENS.  Add 4 F-35 Joint Strike Fighter cockpits for USMC forces.  Support impacts of Electronic Attack in PACOM AOR from Asymmetric Missile Attack.  Executing 3 operator in the loop events."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "13.340"
                                                            },
                                                            "Text": {
                                                                "val": "Continue to purchase and upgrade Army PATRIOT\/SLAMRAAM\/MEADS and JLENS simulators.  Enhance Electronic Attack capabilities and composite tracking on JLENS.  Add 4 F-35 Joint Strike Fighter cockpits for USMC forces.  Support impacts of Electronic Attack in PACOM AOR from Asymmetric Missile Attack.  Execute 3 operator in the loop events."
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "10.500"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "10.500"
                                                            },
                                                            "Text": {
                                                                "val": "Continue to purchase and upgrade Army PATRIOT\/SLAMRAAM\/MEADS and JLENS simulators.  Enhance Electronic Attack capabilities and composite tracking on JLENS.  Add 4 F-35 Joint Strike Fighter cockpits for USMC forces.  Support impacts of Electronic Attack in PACOM AOR from Asymmetric Missile Attack.  Execute 3 operator in the loop events."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "- Complete events within schedule and budget\n- Specific details are classified"
                                        }
                                    }
                                },
                                {
                                    "ProjectNumber": {
                                        "val": "P006"
                                    },
                                    "ProjectTitle": {
                                        "val": "Cruise Missle Combat Identification (CID)"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "12.016"
                                        },
                                        "CurrentYear": {
                                            "val": "18.217"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.250"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.250"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.526"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.526"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.558"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.568"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DOD) chartered to plan, coordinate, and oversee Joint Air and Missile Defense (AMD) requirements, joint operational concepts, and operational architectures.  As part of the CJCS staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to air and missile defense issues. JIAMDO serves as the operational community's proponent for characteristics, requirements, and capabilities in air and missile defense, and is the joint air and missile defense resource proponent within the DOD's resource allocation structures. JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint air and missile defense architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (COCOMs) and maintains liaison offices at all major COCOM locations to facilitate coordination of integration issues and requirements. In particular, JIAMDO maintains close coordination with US Strategic Command (USSTRATCOM) in support of ballistic missile defense of the US. It provides the Chairman, JCS and the Joint Requirements Oversight Council (JROC) the ability to meet statutory responsibilities to review the cost, schedule and performance criteria of Missile Defense Agency (MDA) missile defense programs, and assesses the validity of those criteria in relation to national and military requirements. At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the conduct of Military Utility Assessments and analysis of the Ballistic Missile Defense System (BMDS). JIAMDO supports the USSTRATCOM mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture. JIAMDO represents the Joint Staff in work on the AMD Capabilities Based Assessment Joint Service Team and provides direct support to US Northern Command (USNORTHCOM) for homeland air surveillance issues."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Cruise Missile Combat Identification (CID)"
                                                    },
                                                    "Description": {
                                                        "val": "Develops joint cruise missile CID technology, and positions it for fielding on front-line weapon systems.  Monitors, assesses, and enhances joint AMD Combat ID programs."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "12.016"
                                                            },
                                                            "Text": {
                                                                "val": "Details of this program are classified."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "18.217"
                                                            },
                                                            "Text": {
                                                                "val": "Details of this program are classified."
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "9.250"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "9.250"
                                                            },
                                                            "Text": {
                                                                "val": "Details of this program are classified."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "Details of this program are classified."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "ProgramElementNumber": {
                            "val": "0204571J"
                        },
                        "ProgramElementTitle": {
                            "val": "Joint Staff Analytical Support (JSAS)"
                        },
                        "R1LineItemNumber": {
                            "val": "170"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "6"
                        },
                        "BudgetActivityTitle": {
                            "val": "RDT&E Management Support"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "23.081"
                            },
                            "CurrentYear": {
                                "val": "0.018"
                            },
                            "BudgetYearOne": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.000"
                            },
                            "BudgetYearTwo": {
                                "val": "0.000"
                            },
                            "BudgetYearThree": {
                                "val": "0.000"
                            },
                            "BudgetYearFour": {
                                "val": "0.000"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "CostToComplete": {
                                "val": "0.0"
                            },
                            "TotalCost": {
                                "val": "23.099"
                            }
                        },
                        "ProgramElementMissionDescription": {
                            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for the CJCS and COCOMs.  JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulate the results to best assist the Chairman in fulfilling his statutory responsibilities.  Key deliverables provided by JSAS include wide-ranging force structure assessments, course of action development for the Joint Force environment, analyses and studies to aid in decision-making, and other analysis efforts to implement timely, low-cost initiatives."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "23.081"
                                },
                                "CurrentYear": {
                                    "val": "0.018"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "23.081"
                                },
                                "CurrentYear": {
                                    "val": "0.018"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "P001"
                                    },
                                    "ProjectTitle": {
                                        "val": "Concept Development Red Teaming"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "0.581"
                                        },
                                        "CurrentYear": {
                                            "val": "0.018"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.0"
                                        },
                                        "TotalCost": {
                                            "val": "0.599"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for the CJCS and COCOMs. JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulate the results to best assist the Chairman in fulfilling his statutory responsibilities. Key deliverables provided by JSAS include wide-ranging force structure assessments, course of action development for the Joint Force environment, analyses and studies to aid in decision-making, and other analysis efforts to implement timely, low-cost initiatives."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Concept Development Red Teaming"
                                                    },
                                                    "Description": {
                                                        "val": "Funds discovery experimentation activities supporting Joint Operations Concept (JOpsC) Development Process, implementation, and system integration.  Provides expert assessment of future conceptual approaches, alternate means to achieve future solutions and capabilities through Red Teaming.   Supports development and competition of ideas that provide the fundamental underpinnings for force development and design critical to assessing risk to DoD future capabilities."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "0.581"
                                                            },
                                                            "Text": {
                                                                "val": "Increase Red Team activities by three additional future concepts.  Five concepts are identified.  The remaining seven are to be determined.  \n     1) Energy Security Proposal\n     2) Military Support to Security Sector Reform Proposal\n     3) USFK\/Korea Command as a Regionally-Engaged & Globally-Deployable Force Proposal\n     4) Anti-Access\n     5) Counterterrorism"
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "0.018"
                                                            },
                                                            "Text": {
                                                                "val": "Funding provides program support for one concept."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "N\/A"
                                        },
                                        "PerformanceMetrics": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "ProjectNumber": {
                                        "val": "P002"
                                    },
                                    "ProjectTitle": {
                                        "val": "Global Force Management Data Initative (GFM DI)"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "22.500"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "22.5"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for the CJCS and COCOMs. JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulate the results to best assist the Chairman in fulfilling his statutory responsibilities. Key deliverables provided by JSAS include wide-ranging force structure assessments, course of action development for the Joint Force environment, analyses and studies to aid in decision-making, and other analysis efforts to implement timely, low-cost initiatives."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Global Force Management Data Initative (GFM DI)"
                                                    },
                                                    "Description": {
                                                        "val": "The GFM DI is the Department enterprise solution that enables comprehensive visibility, accessibility, and sharing of the entire DoD force information, which provides the Department with the capacity to integrate data across domains and systems.  Provides the Department with improved decision-making ability by enabling solutions at the strategic, operational, and tactical level."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "22.500"
                                                            },
                                                            "Text": {
                                                                "val": "- Acheive GFM DI Joint Organization Server full functionality\n - Completion of KM\/DS Capability Development Tracking and Management\n - Complete Joint Staff Analytic Suite move from TS to Secret\n - Conduct GFM DI Interoperability Testing"
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "PerformanceMetrics": {
                                            "val": "None."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "@format": "R2Long",
                        "ProgramElementNumber": {
                            "val": "0303166J"
                        },
                        "ProgramElementTitle": {
                            "val": "Support to Information Operations Capability"
                        },
                        "R1LineItemNumber": {
                            "val": "174"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "6"
                        },
                        "BudgetActivityTitle": {
                            "val": "RDT&E Management Support"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "8.238"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.238"
                            },
                            "BudgetYearTwo": {
                                "val": "8.394"
                            },
                            "BudgetYearThree": {
                                "val": "8.552"
                            },
                            "BudgetYearFour": {
                                "val": "8.713"
                            },
                            "BudgetYearFive": {
                                "val": "8.876"
                            },
                            "CostToComplete": {
                                "val": "Continuing"
                            },
                            "TotalCost": {
                                "val": "Continuing"
                            }
                        },
                        "ProgramElementNote": {
                            "val": "Program transfers to the Joint Staff from USD(I).  For FY 2012 and previous, refer to PE 0303166D8Z."
                        },
                        "ProgramElementMissionDescription": {
                            "val": "The National Military Strategy of the United States stresses the importance of integrating Information Operations (IO) capabilities for the success of Joint Operations and Decision Superiority.  The Defense-Wide IO Program Review revalidated a requirement for an integrated range supporting exercises, testing, and development of IO capabilities.  Further direction by the Office of the Secretary of Defense (OSD) identified the need for an integrated IO test and evaluation capability to assess IO technologies and tactics in a representative operational environment against realistic targets.  The 2006 National Security Strategy identifies \"Strengthen Alliances to Defeat Global Terrorism and Work to Prevent Attacks Against Us and Our Friends\", which involves significant Information Operations (IO) and Cyber operations as a goal.  Through the Defense Planning Guidance (DPG) and the Integrated Priority Lists, COCOMs repeatedly state the need to expand IO\/Cyber training and education for the developing cadre of IO\/Cyber professionals and provide an environment for analysis, testing, training, combat assessments, and measures of effectiveness for more reliable IO\/Cyber capabilities."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.238"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.238"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.238"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.238"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "001"
                                    },
                                    "ProjectTitle": {
                                        "val": "Information Operations Range"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.238"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.238"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.394"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.552"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.713"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.876"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectNote": {
                                            "val": "In FY2013 funds transfer to the Joint Staff.  For FY2012 and previous, refer to PE 0303166D8Z."
                                        },
                                        "ProjectMissionDescription": {
                                            "val": "The IO Range provides a secure, flexible, and seamless environment for the Military Services and Joint warfighters to test, train, develop tactics, and exercise selected IO\/Cyber capabilities. The basis of the functional structure of the IO Range is the integration of existing ranges, laboratories, information warfare centers, and other Government facilities that currently support IO\/Cyber test, training, exercise, and experimentation events. Capabilities at the selected sites are securely connected and integrated into the IO Range. A key feature of this concept is a persistent, secure connection that links the sites together, allowing the exchange of data and the visualization of effects as we employ capabilities. Creation of a “virtual range” based on persistent connections significantly reduces the amount of lead-time required to set up each new warfighter event. The long-term goal for the IO Range is to be a full spectrum IO\/Cyber Range supporting: operations security (OPSEC), computer network operations (CNO), electronic warfare (EW), military information support operations (MISO), and military deception (MILDEC). This environment enables the warfighters to visualize non-kinetic weapons effects, understand the intricate and interactive effects generated by kinetic and non-kinetic weapons and achieve the same level of confidence and expertise in employing IO\/Cyber capabilities as they have with kinetic capabilities."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "IO Range"
                                                    },
                                                    "PlannedProgram": {
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "8.238"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "8.238"
                                                            },
                                                            "Text": {
                                                                "val": "• Expand national DoD and Inter-Agency awareness and support regarding IO and cyber related activities\n\n• Improve the threat representation and operational relevance of the network\n\n• Improve the integration of live, virtual, and constructive (LVC) simulations with other Joint training and testing communities and infrastructures\n\n• Develop a long term JIOR infrastructure development, operation and sustainment management plan that supports the application of user resources allocated by JIOR stakeholders to support user activities, to include JIOR expansion and modernization and interoperability with National and DoD Cyber Ranges\n\n• Improve capability to rapidly reset, regenerate, and adapt events \n\n• Improve capability to provide timely assessment for evaluation\n\n• Establish cost-reimbursable funding construct"
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "The Joint IO Range, under the JS Joint and Coalition Warfighting (JCW), manages the development and expansion of Joint IO Range capabilities to an increasing number of customers.  Integration into the Joint Exercise program has allowed users to increase the use and capability of the range.  Continued development of tools for the range will be required as adversarial capabilities improve."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "Performance metrics are measured through internal management controls and external assessments.  Performance metrics include, but are not limited to time, money, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the warfighter faster access to non-kinetic capabilities than current capabilities allow?\n• Money – Will the effort enable the warfighter to reduce duplication of effort and to prepare and execute events at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the warfighter to create an environment that is closer to what he\/she will operate in during real world operations than current capabilities allow? \n• Fidelity – Will the effort ensure unity of efforts throughout the IO\/CYBER Community?"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "@format": "R2Long",
                        "ProgramElementNumber": {
                            "val": "0607828J"
                        },
                        "ProgramElementTitle": {
                            "val": "Joint Integration & Interoperability"
                        },
                        "R1LineItemNumber": {
                            "val": "190"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "7"
                        },
                        "BudgetActivityTitle": {
                            "val": "Operational Systems Development"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "5.013"
                            },
                            "BudgetYearOneBase": {
                                "val": "5.013"
                            },
                            "BudgetYearTwo": {
                                "val": "4.997"
                            },
                            "BudgetYearThree": {
                                "val": "5.040"
                            },
                            "BudgetYearFour": {
                                "val": "5.004"
                            },
                            "BudgetYearFive": {
                                "val": "4.832"
                            },
                            "CostToComplete": {
                                "val": "Continuing"
                            },
                            "TotalCost": {
                                "val": "Continuing"
                            }
                        },
                        "ProgramElementNote": {
                            "val": "In FY 2013 funds transfer to the Joint Staff.  For FY 2012 and previous, refer to PE 0607828D8Z."
                        },
                        "ProgramElementMissionDescription": {
                            "val": "The Joint Integration & Interoperability (JI&I) Program Element underwrites the Department’s core joint Command and Control (C2) efforts for military needs development and validation, for development of associated Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities (DOTMLPF), and for operational assessment of materiel solutions proposed and delivered by the Defense acquisition enterprise.  Funds from the JI&I Program are used to address joint capabilities including, but not limited to operational through tactical level joint integration of the following capabilities: Common Operational and Tactical Pictures; Combat Identification; Situational Awareness; Adaptive Mission Planning and Rehearsal; Interoperability among Service\/ Agency intelligence systems; Interoperable Joint Fires, Maneuver, and Intelligence; and Integrated Joint Battle Management Command and Control.  Activities funded by the JI&I Program aim to:\n\n- Identify, and\/or develop mission capable solutions for COCOM interoperability and integration capability shortfalls with emphasis on non-materiel elements;\n- Assess operational suitability and sufficiency of materiel solutions identified by the Defense acquisition enterprise in response to validated joint C2 needs;\n- Provide Combatant Commanders with interoperable combat identification and situational awareness capabilities among United States Interagencies, and Allied and Coalition Forces in support of Overseas Contingency Operations;\n- Develop joint requirements supporting C2-intensive joint missions such as Joint Close Air Support and Joint Fires;\n- Develop joint integrated architectures that guide service capability mapping to achieve joint interoperability; \n- Establish fundamental joint data standards and cross domain solutions to facilitate future system interoperability and integration; and,\n- Undertake other activities to resolve emergent operational and tactical needs associated with joint C2."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "5.013"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.013"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "5.013"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.013"
                                }
                            },
                            "AdjustmentDetails": {
                                "OtherAdjustmentDetailList": {
                                    "OtherAdjustmentDetail": [
                                        {
                                            "Title": {
                                                "val": "PE transfer to the Joint Staff"
                                            },
                                            "Funding": {
                                                "BudgetYearOne": {
                                                    "val": "5.013"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "5.013"
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "P818"
                                    },
                                    "ProjectTitle": {
                                        "val": "Joint Integration & Interoperability"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.013"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.013"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.997"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.040"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.004"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.832"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectNote": {
                                            "val": "In FY 2013 funds transfer to the Joint Staff.  For FY 2012 and previous, refer to PE 0607828D8Z."
                                        },
                                        "ProjectMissionDescription": {
                                            "val": "Joint Integration and Interoperability Program (JI&I) funds efforts to identify critical characteristics of joint military capabilities and synchronize Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) capability elements into a coherent package for employment by joint commanders.\n\nThe JI&I Program provide resources for a wide range of efforts to define, refine, and deploy integrated joint capabilities.  JI&I-funded endeavors aim to improve US and coalition capabilities to conduct coordinated operations.  Necessarily, JI&I-funded projects most frequently address Command & Control (C2) and Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) - the capstone capabilities for integrating disparate elements of military force for joint and coalition operations.  The JI&I Program supports tasks and projects associated with integration & interoperability of the C2 Portfolio including coordination of C2 operational architectures, standards, and policies. Likewise, JI&I partially funds integration and decision support activities associated with DOD executive level C4 management and oversight.  \n\nThe JI&I Program deliver outcomes conforming to joint integration missions:\n- In concert with the separately funded Joint Systems Integration Command (JSIC) and Joint Fires Integration Interoperability Team (JFIIT), JI&I resources investigate joint C2\/C4ISR shortfalls and ascertain characteristics of DOTMLPF remedies to meet mission requirements. The remedies are then pursued through partnerships with Component force development authorities and acquisition sponsors. \n- Consistent with the role as operational sponsor for joint C2, JI&I underwrites Joint Combat Capability Developer (JCCD) activities compiling operational requirements for C2\/C4ISR capability development and integrated testing. \n- Delivers assessment and recommendations for improvement of interoperable Combat Identification (CID) and Situational Awareness (SA) capabilities among United States forces, interagency organizations, and allied\/coalition forces;\n- Establishes joint data standards and cross domain solutions to facilitate future system interoperability and integration. Joint Integration and Interoperability Program (JI&I) funds efforts to identify critical characteristics of joint military capabilities and synchronize Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) capability elements into a coherent package for employment by joint commanders."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Joint Integration and Interoperability"
                                                    },
                                                    "PlannedProgram": {
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "5.013"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "5.013"
                                                            },
                                                            "Text": {
                                                                "val": "Effort transfers to the Joint Staff in FY 2013."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "Not applicable for this item."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "Interoperability and Integration:\n• Develop coordinated joint C4 operational assessments, tests and evaluations to identify, prioritize and document interoperability deficiencies that produce Component plans and actions to reduce or eliminate identified deficiencies\n• Provide mission capable solutions for joint interoperability and integration capability shortfalls to influence and resource joint C2 solutions in the POM\n\nJoint Fires:\n• Provide situational awareness and cooperative \/ non-cooperative identification capabilities that enable U.S., NATO \/ coalition warfighters to identify friendly, enemy and neutral forces for “shoot\/don’t shoot” decisions\n• Synchronize Service testing, acquisition and fielding of Mode 5 IFF capability, with an Initial Operating Capability (IOC) in 2014 and Full Operational Capability (FOC) in 2020\n• Complete Definition Package for Block 2 of Digitally Aided Close Air Support (DACAS) coordinated implementation in conjunction with participating Service programs of record\n• Conduct Accreditation Biennial Visits for 6 Joint Terminal Attack Controller (JTAC) and 2 Joint Fires Observer (JFO) Schoolhouses\n• Monitor compliance for Mode 5 IOC in FY14 and FOC in FY20 \n\nCombat Capability Development:\n• Develop annual JROC approved plan to identify prioritized and synchronized capabilities sufficient for near-term development and fielding to warfighters  (12-18 month delivery)\n• Develop annual assessment of POM impacts on GCCS Joint & Service Family of Systems ($350M+ annual portfolio) to determine mission impacts in the geographic AORs\n• Develop, as required, JROC requirements documentation (ICDs, CDDs, CPDs, CDPs, CONOPs, MOEs\/MOPs) sufficient for  agile\/flexible use by the acquisition community\n\nArchitectures:\n• Continue development of reusable architecture products to provide capability developers an upfront, operational\/systems view at the enterprise level to support of capability acquisition, requirements generation, development, and testing.\n\nData\n• Establish common C2 data and service standards and enables access to authoritative data assets in order to provide the warfighter timely access to critical information."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "@format": "R2Long",
                        "ProgramElementNumber": {
                            "val": "0208043J"
                        },
                        "ProgramElementTitle": {
                            "val": "Planning and Decision Aid System (PDAS)"
                        },
                        "R1LineItemNumber": {
                            "val": "191"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "7"
                        },
                        "BudgetActivityTitle": {
                            "val": "Operational Systems Development"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "2.288"
                            },
                            "CurrentYear": {
                                "val": "2.402"
                            },
                            "BudgetYearOne": {
                                "val": "3.922"
                            },
                            "BudgetYearOneBase": {
                                "val": "3.922"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0.000"
                            },
                            "BudgetYearTwo": {
                                "val": "3.648"
                            },
                            "BudgetYearThree": {
                                "val": "3.761"
                            },
                            "BudgetYearFour": {
                                "val": "3.794"
                            },
                            "BudgetYearFive": {
                                "val": "3.827"
                            },
                            "CostToComplete": {
                                "val": "Continuing"
                            },
                            "TotalCost": {
                                "val": "Continuing"
                            }
                        },
                        "ProgramElementMissionDescription": {
                            "val": "Planning and Decision Aid System (PDAS) is a classified automated information system protected program under Secretary of Defense (SecDef). PDAS supports the planning and execution of Integrated Joint Special Technical Operations."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "2.288"
                                },
                                "CurrentYear": {
                                    "val": "2.402"
                                },
                                "BudgetYearOne": {
                                    "val": "3.922"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.922"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "2.288"
                                },
                                "CurrentYear": {
                                    "val": "2.402"
                                },
                                "BudgetYearOne": {
                                    "val": "3.922"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.922"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "P001"
                                    },
                                    "ProjectTitle": {
                                        "val": "Planning and Decision Aid System OPS"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "2.288"
                                        },
                                        "CurrentYear": {
                                            "val": "2.402"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.922"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.922"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.648"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.761"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.794"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.827"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "Planning and Decision Aid System (PDAS) is a classified automated information system protected program under Secretary of Defense (SecDef).  PDAS supports the planning and execution of Integrated Joint Special Technical Operations."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Planning and Decision Aid System (PDAS)"
                                                    },
                                                    "Description": {
                                                        "val": "Planning and Decision Aid System (PDAS) is a classified automated information system protected program under Secretary of Defense (SecDef). PDAS supports the planning and execution of Integrated Joint Special Technical Operations."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "2.288"
                                                            },
                                                            "Text": {
                                                                "val": "Details of this program are classified."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "2.402"
                                                            },
                                                            "Text": {
                                                                "val": "Details of the program are classified."
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "3.922"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "3.922"
                                                            },
                                                            "Text": {
                                                                "val": "Details of the program are classified."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "Details of this program are classified."
                                        },
                                        "PerformanceMetrics": {
                                            "val": "Details of this program are classified."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "ProgramElementNumber": {
                            "val": "0303149J"
                        },
                        "ProgramElementTitle": {
                            "val": "Command, Control, Communications, Computers, and Intelligence for the Warrior (C4IFTW)"
                        },
                        "R1LineItemNumber": {
                            "val": "210"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "7"
                        },
                        "BudgetActivityTitle": {
                            "val": "Operational Systems Development"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "2.261"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.000"
                            },
                            "BudgetYearTwo": {
                                "val": "0.000"
                            },
                            "BudgetYearThree": {
                                "val": "0.000"
                            },
                            "BudgetYearFour": {
                                "val": "0.000"
                            },
                            "BudgetYearFive": {
                                "val": "0.000"
                            },
                            "CostToComplete": {
                                "val": "0"
                            },
                            "TotalCost": {
                                "val": "2.261"
                            }
                        },
                        "ProgramElementMissionDescription": {
                            "val": "The Command, Control, Communications, Computers, and Intelligence for the Warrior (C4IFTW) includes all owned and leased communications and computing systems and services, software (including applications), data, security services, and other associated services to support all DOD, National Security, and related Intelligence Community missions and functions (strategic, operational, tactical and business)."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "2.261"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "2.261"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            },
                            "SummaryExplanation": {
                                "val": "The Joint Staff's FY 2012 Command, Control, Communications, Computers, and Intelligence for the Warrior program is dis-established as a Department efficiency offset."
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "P001"
                                    },
                                    "ProjectTitle": {
                                        "val": "Communication Requirements Development Support"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "0.886"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": ".886"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Command, Control, Communications, Computers, and Intelligence for the Warrior (C4IFTW) vision evolved into the Department’s Global Information Grid (GIG) as a means to achieve Information Superiority.  The GIG is the globally interconnected, end-to-end set of information capabilities, associated processes, and personnel for collecting, processing, storing, disseminating and managing information on-demand to warfighters, policy makers, and support personnel.  The GIG includes all owned and leased communications and computing systems and services, software (including applications), data, security services, and other associated services necessary to achieve Information Superiority. It also includes National Security Systems as defined in section 5142 of the Clinger-Cohen Act of 1996.  The GIG supports all DOD, National Security, and related Intelligence Community missions and functions (strategic, operational, tactical and business), in war and in peace.  The GIG also provides capabilities from all operating locations (bases, posts, camps, stations, facilities, mobile platforms, and deployed sites).  Finally, the GIG provides interfaces to coalition, allied, and non-DOD users and systems."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Communication Requirements Development Support"
                                                    },
                                                    "Description": {
                                                        "val": "Supports Joint Command, Control, Communications, and Computers (C4) analytical tool development; Global Information Grid (GIG) transformational activities; GIG network operations and related network management and configuration management efforts, cyberspace operations, and joint C4 network and program development.  Institutionalizes knowledge management capabilities across the Joint Staff.  Ensures synchronization of systems to network capabilities, validates the Net-Ready Key Performance Parameters, and certifies interoperability and supportability.  \n\nBeginning in FY 2012, this program absorbs functions from the Communications Operations Analysis and Integration (P003) program.   Future operations will rely on seamless and fully integrated Satellite Communications and terrestrial Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems and networks - all capable of supporting network centric operations. The use of creative analytical methodologies, C4ISR assessment tools, modeling and simulation, functional analysis, architecture development and assessment tools, and other analytical techniques, as appropriate, will help the development of insights and solutions to further evolve to a fully connected, integrated, and interoperable force."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "0.886"
                                                            },
                                                            "Text": {
                                                                "val": "Develop Network Operations C2 policy.  Support Cyberspace Joint Operational Concept.  Support COCOM planning process."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "0.000"
                                                            },
                                                            "Text": {
                                                                "val": "The Joint Staff's FY 2012 Command, Control, Communications, Computers, and Intelligence for the Warrior program is dis-established, as a Department efficiency offset."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "PerformanceMetrics": {
                                            "val": "- FY11:  Complete actions required in National Military Strategy for Cyberspace Operations Implementation Plan \n- FY11:  Track of IPv6 certification criteria\n- FY11:  Identify\/develop venues to certify specific IPv6 criteria"
                                        }
                                    }
                                },
                                {
                                    "ProjectNumber": {
                                        "val": "P002"
                                    },
                                    "ProjectTitle": {
                                        "val": "Coalition Warrior Interoperability Demo"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "0.0"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectArticles": {
                                            "PriorYear": {
                                                "val": "0"
                                            },
                                            "CurrentYear": {
                                                "val": "0"
                                            },
                                            "BudgetYearOne": {
                                                "val": "0"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0"
                                            },
                                            "BudgetYearTwo": {
                                                "val": "0"
                                            },
                                            "BudgetYearThree": {
                                                "val": "0"
                                            }
                                        },
                                        "ProjectMissionDescription": {
                                            "val": "The Command, Control, Communications, Computers, and Intelligence for the Warrior (C4IFTW) vision evolved into the Department’s Global Information Grid (GIG) as a means to achieve Information Superiority.  The GIG is the globally interconnected, end-to-end set of information capabilities, associated processes, and personnel for collecting, processing, storing, disseminating and managing information on-demand to warfighters, policy makers, and support personnel.  The GIG includes all owned and leased communications and computing systems and services, software (including applications), data, security services, and other associated services necessary to achieve Information Superiority. It also includes National Security Systems as defined in section 5142 of the Clinger-Cohen Act of 1996.  The GIG supports all DOD, National Security, and related Intelligence Community missions and functions (strategic, operational, tactical and business), in war and in peace.  The GIG also provides capabilities from all operating locations (bases, posts, camps, stations, facilities, mobile platforms, and deployed sites).  Finally, the GIG provides interfaces to coalition, allied, and non-DOD users and systems."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Coalition Warrior Interoperability Demonstration"
                                                    },
                                                    "Description": {
                                                        "val": "The Command, Control, Communications, Computers, and Intelligence for the Warrior (C4IFTW) program evolved into the Department’s Global Information Grid (GIG) as a means to achieve information superiority. Coalition Warrior Interoperability Demonstration (CWID) provides focus and visibility into resolving joint, coalition, and national civil authority C4 interoperability issues and provides organizing principles, techniques, and procedures for achieving information superiority as envisioned by Joint Vision 2020. The GIG stresses interoperability and CWID leverages the rapid pace of C4 technology advancements. CWID is a Chairman’s annual event that enables the US combatant commands, national civil authorities, and international community to investigate command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) solutions that focus on relevant and timely objectives for enhancing coalition interoperability and exploring new partnerships. CWID is conducted in a simulated operational environment to provide context for warfighter and national civil authorities’ validation of those solutions. Interoperability Trials (ITs) are the activities used to address the core coalition and interagency interoperability objectives selected each year. ITs strive to address warfighter requirements and interoperability deficiencies. The selection of trials is dependent upon the annual overarching objectives, the host combatant command’s priorities, Coalition\/State\/Agency desires to partner in a proposed trial, interagency participation, and the desires of invited coalition participants. CWID is an integral component of the JV 2020 conceptual template."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "0.000"
                                                            },
                                                            "Text": {
                                                                "val": "None.  This program was transferred to USJFCOM, as directed by the Vice Chairman, in FY2011."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "0.000"
                                                            },
                                                            "Text": {
                                                                "val": "None."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "AcquisitionStrategy": {
                                            "val": "N\/A"
                                        },
                                        "PerformanceMetrics": {
                                            "val": "None.  This program was transferred to USJFCOM, as directed by the Vice Chairman, in FY11."
                                        }
                                    }
                                },
                                {
                                    "ProjectNumber": {
                                        "val": "P003"
                                    },
                                    "ProjectTitle": {
                                        "val": "Communications Operations Analysis and Integration"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "1.375"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "1.375"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "The Command, Control, Communications, Computers, and Intelligence for the Warrior (C4IFTW) vision evolved into the Department’s Global Information Grid (GIG) as a means to achieve Information Superiority.  The GIG is the globally interconnected, end-to-end set of information capabilities, associated processes, and personnel for collecting, processing, storing, disseminating and managing information on-demand to warfighters, policy makers, and support personnel.  The GIG includes all owned and leased communications and computing systems and services, software (including applications), data, security services, and other associated services necessary to achieve Information Superiority. It also includes National Security Systems as defined in section 5142 of the Clinger-Cohen Act of 1996.  The GIG supports all DOD, National Security, and related Intelligence Community missions and functions (strategic, operational, tactical and business), in war and in peace.  The GIG also provides capabilities from all operating locations (bases, posts, camps, stations, facilities, mobile platforms, and deployed sites).  Finally, the GIG provides interfaces to coalition, allied, and non-DOD users and systems."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Communications Operations Analysis & Integration"
                                                    },
                                                    "Description": {
                                                        "val": "Future operations rely on seamless and fully integrated Satellite Communications and terrestrial Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems and networks - all capable of supporting network centric operations. The use of creative analytical methodologies, C4ISR assessment tools, modeling and simulation, functional analysis, architecture development and assessment tools, and other analytical techniques, as appropriate, will help the development of insights and solutions to further evolve to a fully connected, integrated, and interoperable force."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "1.375"
                                                            },
                                                            "Text": {
                                                                "val": "Produce a process model for the JS J6 business processes. Support the implementation of the Interoperability and Supportability (I&S) processes. Support the Cyber Division in the execution of the DOD cyber missions. Continue support to the GIG 2.0 processes in the oversight and governance of the GIG."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "0.000"
                                                            },
                                                            "Text": {
                                                                "val": "The Joint Staff's FY 2012 Command, Control, Communications, Computers, and Intelligence for the Warrior program is dis-established, as a Department efficiency offset."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "PerformanceMetrics": {
                                            "val": "Produce written summaries of key Frequency Panel sub-group meetings and preparatory meetings for annual COCOM spectrum management conferences."
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "ProgramElement": {
                        "@format": "R2Long",
                        "ProgramElementNumber": {
                            "val": "0902298J"
                        },
                        "ProgramElementTitle": {
                            "val": "Management Headquarters"
                        },
                        "R1LineItemNumber": {
                            "val": "251"
                        },
                        "BudgetYear": {
                            "val": "2013"
                        },
                        "BudgetCycle": {
                            "val": "PB"
                        },
                        "SubmissionDate": {
                            "val": "2012-02"
                        },
                        "ServiceAgencyName": {
                            "val": "The Joint Staff"
                        },
                        "AppropriationCode": {
                            "val": "0400"
                        },
                        "AppropriationName": {
                            "val": "Research, Development, Test & Evaluation, Defense-Wide"
                        },
                        "BudgetActivityNumber": {
                            "val": "7"
                        },
                        "BudgetActivityTitle": {
                            "val": "Operational Systems Development"
                        },
                        "ProgramElementFunding": {
                            "PriorYear": {
                                "val": "2.807"
                            },
                            "CurrentYear": {
                                "val": "2.730"
                            },
                            "BudgetYearOne": {
                                "val": "4.100"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.100"
                            },
                            "BudgetYearTwo": {
                                "val": "4.019"
                            },
                            "BudgetYearThree": {
                                "val": "4.116"
                            },
                            "BudgetYearFour": {
                                "val": "4.171"
                            },
                            "BudgetYearFive": {
                                "val": "4.186"
                            },
                            "CostToComplete": {
                                "val": "Continuing"
                            },
                            "TotalCost": {
                                "val": "Continuing"
                            }
                        },
                        "ProgramElementMissionDescription": {
                            "val": "Management Headquarters provides the financial resources necessary to support TJS operations including: network infrastructure, civilian pay accounts, supplies, travel, training, portfolio management, business process reviews, and transformation initiatives."
                        },
                        "ChangeSummary": {
                            "PreviousPresidentBudget": {
                                "PriorYear": {
                                    "val": "2.807"
                                },
                                "CurrentYear": {
                                    "val": "2.730"
                                },
                                "BudgetYearOne": {
                                    "val": "2.747"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.747"
                                }
                            },
                            "CurrentPresidentBudget": {
                                "PriorYear": {
                                    "val": "2.807"
                                },
                                "CurrentYear": {
                                    "val": "2.730"
                                },
                                "BudgetYearOne": {
                                    "val": "4.100"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.100"
                                }
                            },
                            "TotalAdjustments": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.353"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.353"
                                }
                            },
                            "AdjustmentDetails": {
                                "OtherAdjustmentDetailList": {
                                    "OtherAdjustmentDetail": [
                                        {
                                            "Title": {
                                                "val": "Increased requirements"
                                            },
                                            "Funding": {
                                                "BudgetYearOne": {
                                                    "val": "1.353"
                                                },
                                                "BudgetYearOneBase": {
                                                    "val": "1.353"
                                                }
                                            }
                                        }
                                    ]
                                }
                            }
                        },
                        "ProjectList": {
                            "Project": [
                                {
                                    "ProjectNumber": {
                                        "val": "P001"
                                    },
                                    "ProjectTitle": {
                                        "val": "Joint Staff Information Network (JSIN)"
                                    },
                                    "ProjectFunding": {
                                        "PriorYear": {
                                            "val": "2.807"
                                        },
                                        "CurrentYear": {
                                            "val": "2.730"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.100"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.100"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.019"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.116"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.171"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.186"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    },
                                    "R2aExhibit": {
                                        "ProjectMissionDescription": {
                                            "val": "Management Headquarters provides the day-to-day financial resources necessary to support TJS operations. Across the Joint Staff, Management Headquarters supports various efforts including network infrastructure, civilian pay accounts, supplies, travel, training, portfolio management, business process reviews, and transformation initiatives."
                                        },
                                        "AccomplishmentPlannedProgramList": {
                                            "AccomplishmentPlannedProgram": [
                                                {
                                                    "Title": {
                                                        "val": "Joint Staff Information Network (JSIN)"
                                                    },
                                                    "Description": {
                                                        "val": "Provides RDT&E funds for the Joint Staff Information Network (JSIN). JSIN is the network infrastructure (for both classified and unclassified information) enabling collaboration and information-sharing among the Joint Staff, Combatant Commands (COCOMs) and the Services.  The JSIN also provides crucial business-related, decision-making information and workflow support affecting military operations in support of the JCS.  JSIN improves actions processing for faster coordination of critical issues with COCOMs, Services, and agencies, as well as within TJS."
                                                    },
                                                    "Accomplishment": {
                                                        "PriorYear": {
                                                            "Funding": {
                                                                "val": "2.807"
                                                            },
                                                            "Text": {
                                                                "val": "Develop enhanced JS automated task\/workflow management system. Modernize network architecture.  Upgrade communications hardware & software. Research JS IT strategic direction and improvements.  Complete web portal and content discovery enhancements. Provide secure, mobile electronic data\/voice capabilities.  Enhance identification\/secured network access capabilities.  Complete JTIMS implementation."
                                                            }
                                                        }
                                                    },
                                                    "PlannedProgram": {
                                                        "CurrentYear": {
                                                            "Funding": {
                                                                "val": "2.730"
                                                            },
                                                            "Text": {
                                                                "val": "Provide support for Hotel Applications, fully mobile multi-domain communications, Enterprise Services Implementation, Thin Client expansion, Content Management and Federated Search, migration to cloud computing, SharePoint services, and eJMAPS."
                                                            }
                                                        },
                                                        "BudgetYearOne": {
                                                            "Funding": {
                                                                "val": "4.100"
                                                            }
                                                        },
                                                        "BudgetYearOneBase": {
                                                            "Funding": {
                                                                "val": "4.100"
                                                            },
                                                            "Text": {
                                                                "val": "Provide support for Hotel Applications, fully mobile multi-domain communications, Enterprise Services Implementation, Thin Client expansion, Content Management and Federated Search, migration to cloud computing, SharePoint services, and eJMAPS."
                                                            }
                                                        }
                                                    }
                                                }
                                            ]
                                        },
                                        "PerformanceMetrics": {
                                            "val": "-  Prevent data breaches and respond to incidents within two hours of notification \n- 100% on-time patching in accordance with Joint Task Force-Global Network Operations (JTF-GNO) timelines \n-  Resolve normal urgency tickets within 48 hours \n- 100% accountability of IT equipment in JS property book \n-  Provide resolution for the customer's issues the first time they contact a technician for assistance"
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}