{
    "@recordid": "b87b168cd29b853e3fcbe9d62e7b6b2b0b71a91c8ae18dbddab9195ad0286b94",
    "@doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
    "@filename": "2018-BASE_RDTE-2018-DTIC-U_RDTE_JustificationBook_Defense_Technical_Information_Center_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Defense_Technical_Information_Center_PB_2018.xml",
    "JustificationBook": {
        "@targetSchemaVersion": "1.0",
        "@classification": "UNCLASSIFIED",
        "Title": {
            "val": "Justification Book"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Technical Information Center"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "CoverPage": [],
        "ExternalDocuments": {
            "UserR1Doc": {
                "Title": {
                    "val": "Comptroller Exhibit R-1"
                },
                "FileName": {
                    "val": "Revised R1 PB18_resized.pdf"
                }
            }
        },
        "DocumentAssemblyOptions": {
            "ForceEvenPages": {
                "val": "true"
            },
            "GenerateR1": {
                "val": "true"
            },
            "GenerateProgramElementTocByTitle": {
                "val": "true"
            },
            "GenerateProgramElementTocByBA": {
                "val": "true"
            },
            "IncludeTableOfVolumes": {
                "val": "true"
            }
        },
        "ProgramElementList": {
            "@targetSchemaVersion": "1.0",
            "ProgramElement": [
                {
                    "@monetaryUnit": "Millions",
                    "@classification": "UNCLASSIFIED",
                    "ProgramElementNumber": {
                        "val": "0605801KA"
                    },
                    "ProgramElementTitle": {
                        "val": "Defense Technical Information Center"
                    },
                    "R1LineNumber": {
                        "val": "163"
                    },
                    "BudgetYear": {
                        "val": "2018"
                    },
                    "BudgetCycle": {
                        "val": "PB"
                    },
                    "SubmissionDate": {
                        "val": "2017-05"
                    },
                    "ServiceAgencyName": {
                        "val": "Defense Technical Information Center"
                    },
                    "AppropriationCode": {
                        "val": "0400"
                    },
                    "AppropriationName": {
                        "val": "Research, Development, Test & Evaluation, Defense-Wide"
                    },
                    "BudgetActivityNumber": {
                        "val": "6"
                    },
                    "BudgetActivityTitle": {
                        "val": "RDT&E Management Support"
                    },
                    "ProgramElementFunding": {
                        "AllPriorYears": {
                            "val": "106.813"
                        },
                        "PriorYear": {
                            "val": "57.133"
                        },
                        "CurrentYear": {
                            "val": "43.834"
                        },
                        "BudgetYearOne": {
                            "val": "54.145"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.145"
                        },
                        "BudgetYearTwo": {
                            "val": "57.647"
                        },
                        "BudgetYearThree": {
                            "val": "59.348"
                        },
                        "BudgetYearFour": {
                            "val": "61.302"
                        },
                        "BudgetYearFive": {
                            "val": "63.454"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "ProgramElementMissionDescription": {
                        "val": "The Defense Technical Information Center’s (DTIC) unique mission is to aggregate and fuse science and technology data to provide rapid, accurate, and reliable knowledge to researchers and developers of the next generation of technologies needed to assure our national security. DTIC, a DoD Field Activity, is the DoD’s singular executive agent and designated source for DoD-funded scientific, technical, engineering, and industry-related information.  DTIC also operates DoD Information Analysis Centers (IACs) focused on Defense Systems, Cyber Security and Information Systems, and Homeland Defense and Security.\n\nEach year, DoD invests over $12.0 Billion in research, development and procurement of advanced technologies needed to defend our nation.  DTIC preserves the fruits of these costly labors for reuse across the enterprise.  As an efficient and cost-effective steward of technical information, DTIC provides nearly instantaneous answers to researchers seeking state-of-the-art data relevant to their projects.  DTIC regularly prevents duplication of experiments, tests, and prototyping activities because researchers can see what has already been done in their field of effort, even if prior research resulted in a dead end.  Their work can pick up from the point of most recent results.  Using DTIC-created forums, researchers, Warfighters, and industry partners can also rapidly collaborate and connect across the DoD research and engineering (R&E) enterprise.  Finally, DTIC provides a department-level map of R&D activity.  This map gives decision-makers insight into current and past research, highlighting where progress is being made and by whom.  Through the preservation and sharing of the results of billions of dollars of past DoD investments, DTIC increases the return on past investments and accelerates current efforts, saving the Department precious time and dollars.  Through its collaboration tools and outreach to the R&E community, DTIC connects researchers across the lab enterprise, to include researchers and engineers, Warfighters and DoD’s industry partners. \n\nDTIC’s strategic themes center on customer focus, innovation, operational excellence, and strategic partnering.  In support of these themes, DTIC’s organizational efforts are focused on the following priority areas:\n1) Search:  Develop new algorithms that enable our users to quickly discover useful information and to ensure we present the most relevant information.  Expand and enhance our data collections to improve the quality and completeness of the data. \n2) Collaboration:  Provide collaboration platforms for the DoD science and technology community to work together on investments that efficiently deliver solutions to the Warfighter.\n3) Access Identity:  Strengthen methods of user authentication through the use of public key infrastructure (PKI) tokens, biometrics and other methods to grant access to recognized, trusted and authorized users.  Protect intellectual property (IP) and industry proprietary data assets entrusted to DTIC’s stewardship (protect information access).\n4) Data Fusion\/Analysis:  Gather information from multiple data sources and provide knowledge products that fuse the disparate data sets into a single view of the life cycle of research.  Present an overarching picture of research investment that enables decision-makers to link multiple efforts with integrated capabilities (employ resources to highest priority efforts and coordinate efforts across Services).  \n5) Cyber Security:  Continue to leverage state-of-the art technologies, processes and practices designed to protect DTIC networks, computers, programs and data from attack, damage or unauthorized access.\n6) Data Center Optimization\/Cloud:  Migrate services to cloud providers to improve availability, redundancy, and mission flexibility; to reduce time to deliver new capabilities; to save costs; and to enhance cyber security.\n\nDTIC recognizes the need to accomplish its mission while increasing the value of its services and products in an environment of Department-wide budget reductions.  DTIC has reduced its headquarter staffing, physical footprint, civilian personnel and support contractors.  DTIC has restructured the IAC program, and continues to consolidate its data center.  \n\nDespite reduced budgets, DTIC has taken on additional programs, to include its new role in leading the Department in efforts to provide public access to DoD-funded journal articles and research data and increase outreach to industry through DTIC’s Defense Innovation Marketplace.  Moreover, DTIC activities promote citizen science.  Citizen science mobilizes the public to engage in the scientific process and thereby address real-world problems.  Citizen scientists identify research questions, collect and analyze data, interpret results, make new discoveries, develop technologies and applications, and solve complex problems.  DTIC continues to ensure its activities are efficient and effective, meet users’ expectations, and employ industry best practices and standards, while protecting its wealth of information from cyber threats. \n\nDTIC's restructured Information Analysis Centers (IACs) drive innovation and technological development by anticipating and responding to the information needs of the defense and broader community. The IAC Program Office provides core funding, management and oversight of three IACs, which are chartered by DoD to collect, analyze, and disseminate worldwide scientific and technical information in specialized fields. The IAC multi-award task order contracts ensure that new research, analysis, and development builds on prior investments and puts to work the best practices of government, industry, and academia. The IAC approach was identified as a \"best practice\" by the Director of Defense Procurement and Acquisition Policy in a January 2015 memo wherein he promoted maximum use of the IAC contracts across DoD.  The IACs are structured into three application areas:  Cyber Security and Information Systems, Homeland Defense and Security, and Defense Systems. As part of the Department's acquisition improvement initiatives, the IAC multi-award contracts enhance competition, increase usage of small businesses, and reduce costs. For the last several years, competition inherent in the IAC model has produced savings of 17-25 percent over projected costs, delivering vetted technical expertise to address many of the complex challenges DoD faces. An independent assessment by the Center for Strategic and International Studies reported that the IACs improve affordability, productivity, and standardization within defense acquisition programs. Providing the acquisition enterprise access to thousands of industry subject matter experts, DTIC's IACs perform over $1.0 Billion of customer-funded research and prototyping annually.  The results of the work are a rich source of new material in DTIC's information asset collections and are available to users across the Department (and other federal agencies, e.g., Department of Energy, Department of Homeland Security).\n\nThis Program Element (PE) supports DTIC mission operations. DTIC focuses on three core mission areas (Collection, Dissemination and IACs) and purchases space and shared services (e.g., human resources (HR); financial management; contracting; IT security; communications; and civilian payroll services) from expert and efficient DoD providers."
                    },
                    "ChangeSummary": {
                        "PreviousPresidentBudget": {
                            "PriorYear": {
                                "val": "56.775"
                            },
                            "CurrentYear": {
                                "val": "43.834"
                            },
                            "BudgetYearOne": {
                                "val": "45.504"
                            },
                            "BudgetYearOneBase": {
                                "val": "45.504"
                            }
                        },
                        "CurrentPresidentBudget": {
                            "PriorYear": {
                                "val": "57.133"
                            },
                            "CurrentYear": {
                                "val": "43.834"
                            },
                            "BudgetYearOne": {
                                "val": "54.145"
                            },
                            "BudgetYearOneBase": {
                                "val": "54.145"
                            }
                        },
                        "TotalAdjustments": {
                            "PriorYear": {
                                "val": "0.358"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "8.641"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.641"
                            }
                        },
                        "AdjustmentDetails": {
                            "CongressionalGeneralReductions": {
                                "PriorYear": {
                                    "val": "0.000"
                                }
                            },
                            "CongressionalDirectedReductions": {
                                "PriorYear": {
                                    "val": "0.000"
                                }
                            },
                            "OtherAdjustmentDetailList": {
                                "OtherAdjustmentDetail": [
                                    {
                                        "Title": {
                                            "val": "Program Change"
                                        },
                                        "Funding": {
                                            "PriorYear": {
                                                "val": "0.358"
                                            },
                                            "BudgetYearOne": {
                                                "val": "9.055"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "9.055"
                                            }
                                        }
                                    },
                                    {
                                        "Title": {
                                            "val": "Service Requirements Review Board  (SRRB) Reduction"
                                        },
                                        "Funding": {
                                            "BudgetYearOne": {
                                                "val": "-0.592"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "-0.592"
                                            }
                                        }
                                    },
                                    {
                                        "Title": {
                                            "val": "Program Adjustments"
                                        },
                                        "Funding": {
                                            "BudgetYearOne": {
                                                "val": "0.178"
                                            },
                                            "BudgetYearOneBase": {
                                                "val": "0.178"
                                            }
                                        }
                                    }
                                ]
                            }
                        },
                        "SummaryExplanation": {
                            "val": "Specific changes to the FY 2018 program (a net increase of $8.641 Million from the previous FY 2018 PB Base) are outlined below:\n\nFY 2018 Program Changes:  The Department added $9.055 Million to the FY 2018 DTIC program as a means of resetting the DTIC budget top-line, which had seen a general decline since FY 2011. Absent the requested increase, DTIC would be forced to cease most capability development and to limit efforts on cybersecurity.  These constraints would translate to increased risk on the cybersecurity front and reduced search and retrieval effectiveness, i.e., DoD researchers would incur increased costs and delays in solving technology challenges related to fielding needed warfighting capabilities. \n\nThe funding infusion enables DTIC to keep closer pace with the advance of the state of the art in the science and technology data collections, to refresh outdated and increasingly unsupportable infrastructure, to pursue strategic improvement in tools used by users to search and find needed information, and to begin DTIC’s migration to a cloud host.  Marketplace realities force DTIC to refresh commercial-off-the-shelf technologies supporting information search, storage, and retrieval.  These upgrades are driven by constant evolution of information technology and the reality that vendors enhance or discontinue products as a means of remaining competitive.  This dynamic is not new. The eight previous search engines DTIC deployed, over two decades, have been discontinued by the manufacturer.  In addition, user identity management continues to evolve, and DTIC must keep pace.  In recent years, DTIC has added support for multiple variants of the government Public-Key Infrastructure card (CAC) used by DoD, other Federal Agencies, industry, and other commercial entities.  In the future, we must be ready to accept other identification tokens and biometric identifiers.  Finally, DTIC must find ways to support a growing variety of platforms, devices, and interfaces.  Ten years ago, 99 percent of DTIC users were on Windows\/IE desktop platform.  Added funding will allow DTIC to deliver improved search and discovery tools, to simplify access and identity management while increasing cyber security, to provide access on our users’ platform of choice – expanding to deliver to mobile devices (tables and mobile devices), and to migrate to cloud hosting.  Cloud hosting merits special mention because of its promise to allow DTIC professionals to move their focus from infrastructure maintenance to more strategic functions.  Cloud hosting will enable DTIC to be more flexible and agile in meeting our mission objective and increase our ability to innovate.  Use of cloud technologies to support COOP capabilities were delayed by DoD security concerns requiring policy changes for the Federal Risk and Authorization Management Program (FedRAMP).  Revised FedRAMP guidance and vendor certification now allow DTIC to reconstitute this critical capability.  The requested additional funding will allow increased collaboration with our partners, and allows further outreach and increased ability to educate and bring awareness to the importance of sharing their results with the community through DTIC.  Funding also promotes increased attendance at scientific conferences and outreach to DoD laboratories, partnership with COCOM S&T staffs, etc., in DTIC’s primary mission to find, collect and ingest S&T data for the purpose of sharing with the larger community.\n\nNew funding supports key initiatives to develop and implement new technologies.  These include search and discovery infrastructure; IT COOP reconstitution; data center consolidation and transition to cloud computing; mobile technology; user access and identity management; Controlled Unclassified Information (CUI) in support of the Executive Order 13556; Public Access to scientific data and publications, in compliance with the Executive Office of the President, Office of Science and Technology Policy; as well as efforts to address a rapidly changing and more sophisticated technological environment.  While DTIC has been planning these initiatives, budget erosion and funding constraints have limited our ability to address these critical tasks.  Without the Department’s FY 2018 funding increase, DTIC will be unable to accomplish these initiatives.  The FY 2018 investment represents a small fraction of the Department’s research and development spending, and will lead to near- and long-term benefits as efficiencies in the information collection and dissemination processes are implemented.  These DTIC initiatives strengthen DoD business practices and result in taxpayer savings.  The FY 2018 funding increase supports the following DTIC programs\/initiatives:\n\n- Search and Discovery Infrastructure:  “Search” functionality is the primary way information is shared.  DTIC’s funding shortfall over the past several years has reduced the effectiveness of our search.  Given current funding levels, DTIC has maintained basic functionality, but has not been able to improve and incorporate new search technologies and user interfaces.  This shortfall directly effects users.  It makes them work harder to find the most relevant, applicable, and essential information in DTIC’s collections.  In a practical sense, with the Department spending $12.0 Billion in science and technology funding per year, limited “search” capability drives up costs in the form of duplication of “search” effort, pursuing trails of approaches that have already shown to fail, and inability to find relevant research results.  DTIC must invest in the latest “search” technologies to offer users a complete data picture of DoD-funded research results and reduce the expertise users must hold to find relevant information.\n\n- DTIC IT COOP Reconstitution:  DTIC holds and manages over 4 million records in its collection.  Funding enables DTIC to reconstitute its Continuity of Operations (COOP) systems\/servers (mission-essential functions) within the 12-hour timeframe required by Department of Defense Directive 3020.26 if a catastrophic event were to take the primary system off-line.  The investment lessens the risk associated with the extended loss of access to DoD-funded research data and the inability for DTIC to collect new research results.  Funding supports the analysis of alternatives, system architecture, cyber risk management framework documentation\/accreditation, system engineering, software development, testing, hardware procurement, software licenses, storage, and bandwidth.\n\n- Data Center Consolidation\/Cloud Computing Transition:  The Federal Data Center Consolidation Initiative (FDCCI) directs the reduction in physical servers and the consolidation of data centers.  DTIC has reduced the number of its physical servers by 60 percent and moved to a virtualized server environment.  Outsourcing to the cloud will enable DTIC to focus more resources on our core mission--delivering information through innovative applications, rather than maintaining an IT platform.  DTIC information services will become more flexible and innovative, shortening the gap between testing and implementation of DoD weapon systems.  To operate effectively in cloud environments, DTIC must reengineer much of its information pipeline.  The funding request supports the analysis of alternatives, system architecture, system engineering, cyber risk management, necessary architecture and software modifications, services costs (servers, storage, bandwidth, management, etc.), testing, and software licensing. \n\n- Mobile and Emerging Platform technology:  DTIC serves a diverse audience.  DoD users, industry partners, and academic researchers have moved from a traditional desktop Windows Internet Explorer (IE) environment to an array of devices (desktops, laptops, tablets, and mobile), operating systems, and browsers.  To remain relevant, DTIC must ensure products and interfaces support these new devices.  If new technology is not pursued, large portions of DTIC’s user community will be lost.  FY 2018 funding supports the analysis of alternatives, metrics, software development, testing, hardware, licenses, cyber security, and Risk Management Framework (RMF)\/accreditation.\n\n- Controlled Unclassified Information (CUI):  In September 2016, the National Archives and Records Administration (NARA, specifically the Information Security Oversight Office) released final guidance to execute the CUI effort throughout the Executive Branch.  This guidance supported the President‘s Executive Order 13556, issued in November 2008, Controlled Unclassified Information (CUI).  The EO directed the National Archives and Records Administration (NARA) as the CUI Executive Agent to standardize the way the Executive Branch handles information (excluding information that is classified).  Distribution of information outside of the DoD is only allowable when documents are marked to the new CUI standards, including categories that will require portion marking.  The term “Controlled Unclassified Information” (“CUI”) will start being used by the Department in 2017, phasing out the term “For Official Use Only” (“FOUO”).  As the Department’s unique central repository and distribution source for technical information, DTIC must modify their collection, storage, and distribution systems to recognize and properly handle new marking and distribution standards.  Lacking establishment of these new systems and proper CUI marking, the DoD would lose much of its ability to share material with other Federal Government agencies, industry partners, and allies.  Added funding supports the initiation of steps needed to support new CUI standards, namely:  policy development, system requirements planning, cyber security assessments, software prototyping, and development of user training.\n\n- Public Access:  The Executive Office of the President (EOP)\/Office of Science and Technology Policy (OSTP) issued a memorandum directing Federal agencies that spend more than $100 Million per year on research and development (R&D) to develop plans to support increased access to the results of research funded by the Federal government.  As the Department’s central repository of DoD-funded technical information, DTIC was tasked with implementing the infrastructure to collect and disseminate journal articles, manuscripts and digital data that are the result of DoD-funded research.  In FY 2017, DoD issued new policy to internal researchers to develop data management plans and submit authors’ manuscripts for journal articles.  Funding allows DTIC to continue work with DoD Labs; educate and train researchers of new requirements; develop policy for external researchers (contracts and grants), submission compliance measures, and user facing tools; and evaluate and prototype the handling of data sets.  Supporting data sets bring with it a range of complex issues caused by the variety of sciences and their output, and the sheer sizes that can grow to petabytes.\n\nFY 2018 Service Requirements Review Board (SRRB) Reduction:  $.592 Million reduction to the DTIC program is the result of the Department’s recent service contract downsizing effort.\n\nFY 2018 Program Adjustments:  reflects the net change of economic assumptions and\/or pricing adjustments."
                        }
                    },
                    "ProjectList": {
                        "Project": [
                            {
                                "ProjectNumber": {
                                    "val": "001"
                                },
                                "ProjectTitle": {
                                    "val": "Defense Technical Information Center"
                                },
                                "SpecialProject": {
                                    "val": "0"
                                },
                                "ProjectFunding": {
                                    "AllPriorYears": {
                                        "val": "94.012"
                                    },
                                    "PriorYear": {
                                        "val": "51.385"
                                    },
                                    "CurrentYear": {
                                        "val": "38.086"
                                    },
                                    "BudgetYearOne": {
                                        "val": "49.071"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "49.071"
                                    },
                                    "BudgetYearTwo": {
                                        "val": "52.631"
                                    },
                                    "BudgetYearThree": {
                                        "val": "54.332"
                                    },
                                    "BudgetYearFour": {
                                        "val": "56.286"
                                    },
                                    "BudgetYearFive": {
                                        "val": "58.438"
                                    },
                                    "CostToComplete": {
                                        "val": "Continuing"
                                    },
                                    "TotalCost": {
                                        "val": "Continuing"
                                    }
                                },
                                "R2aExhibit": {
                                    "ProjectMissionDescription": {
                                        "val": "DTIC is responsible for developing, coordinating and enabling a strong scientific and technical information (STINFO) program for the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) and the DoD scientific & technical (S&T) enterprise. In this role, DTIC sets policy for scientific and technical information (STI) exchanges for the research and engineering (R&E) community. DTIC’s aim is to maximize the availability and use of technical information and products resulting from Defense-funded technical activities while ensuring restrictions to safeguard national security, export control, and intellectual property rights.\n\nRecognizing the common elements across budget justification documents, progress reports, completed work reports, studies, and journal articles, DTIC is mapping relationships to enable users to access the life cycle of research projects from planning to final results. DTIC employs information technology to verify and validate information submitted and improve user confidence in DoD research documentation.\n\nDTIC is leading the Department’s efforts to implement public access to published journal articles, and digital data from research funded by taxpayers. In this role, DTIC is actively working with partners across the Services, components, other federal agencies and publishers.  These ongoing efforts directly complement and support the Department’s objectives associated with Citizen Science.  Consistent with the Administration’s (Office of Management and Budget) emphasis for open standards and machine readable formats, DTIC initiated the transition from paper and Portable Document Format (PDF) based information to Web Service Extensible Markup Language (XML) standard data submission and machine readable delivery. DTIC partnered with the OSD Comptroller to collect investment account budget justification documentation in XML and embed this XML in PDF for justification books delivered to Congress. DTIC employed this same technology in collecting S&T progress reports from the Services and Agencies, and Independent Research and Development (IR&D) data from industry. DTIC is planning the migration of its completed technical reports collection to the same open standards, i.e., machine readable formats.  \n\nThrough the use of commercial search technology, DTIC provides search capability that links its knowledge of the DoD domain and metadata to support both text searches and data mining. DTIC continually works to enable additional features within our search capabilities and from commercial partners to improve information discovery and relevance.\n\nDoD conducts science and technology research via the following means:  60+ labs, Federally Funded Research and Development Centers (FFRDCs), DTIC’s Information Analysis Centers (IACs), and other contracts and grants.  Spanning over a dozen distinct priority area communities of interest, the results of this work is available through DTIC’s web-based R&E Gateway.  To protect this information, DTIC regulates access through a database of registered users.  In addition, DTIC uses commercial software in compliance with DoD Identity Management Standards to provide instant authenticated access to users of either the Common Access Card (CAC), External Certificate Authority (ECA), or Personal Identity Verification (PIV) cards.  DTIC’s unclassified assets, tools and community interaction capabilities foster innovation, competition and identification of solutions in an access-controlled environment.\n\nFocus on User Communities and Distribution Points:  DTIC supports user communities on the network where they work, i.e., NIPRNET, SIPRNET and public internet, and uniquely provides access controls within unclassified and classified material to protect intellectual property in our search, distribution, and collaboration tools.\n\n- DoD’s RDT&E Enterprise:  As a Field Activity to ASD(R&E)\/AT&L, DTIC’s priority is the RDT&E enterprise, hosting information assets and tools on the NIPRNET (the primary network for the community).\n\n- Warfighter:  Improving coordination between the acquisition enterprise and warfighter communities, DTIC hosts a subset of information assets and tools on the SIPRNET. DTIC is working to expand the availability of science and technology (S&T) information, to include Independent Research and Development (IR&D), on the SIPRNET.  DTIC is continuing its efforts to establish parity of information and capabilities on applications hosted on both NIPRNET and SIPRNET platforms.\n\n- Industry and Academia via Public Internet:  Engaging industry outside the NIPRNET firewall to support acquisition improvement initiatives and encourage the introduction of innovation, DTIC hosts unclassified public information and tools accessible to all users on the Internet. The Public Access initiative adds importance to the public distribution point, to encourage technology transfer of basic and public research to the private sector, and to give an economic boost to small businesses that can use that data to provide new applications to consumers.\n\nSummary.  DTIC protects and preserves DoD’s multi-billion dollar investment in research, which empowers the acquisition enterprise through innovative tools, information systems, and decision support capabilities. The efficiency benefits can be enormous.  Each 1 percent increase in the reuse of S&T efforts produces over $100 Million in savings that can be redirected.  Those savings come from elimination of inefficient redundancy (and unnecessary delays), increased community interaction, and ultimately, a more capable military.  DTIC is uniquely positioned to support and to ensure the value of DoD’s R&D portfolio is fully realized."
                                    },
                                    "AccomplishmentPlannedProgramList": {
                                        "AccomplishmentPlannedProgram": [
                                            {
                                                "Title": {
                                                    "val": "Defense Technical Information Center"
                                                },
                                                "Accomplishment": {
                                                    "PriorYear": {
                                                        "Funding": {
                                                            "val": "51.385"
                                                        },
                                                        "Text": {
                                                            "val": "- Implemented and deployed a new, commercially available search, which leveraged the new Master Data Repository (MDR), to enable users to discover more relevant science and technology information faster by refining their search using Boolean, wildcards, nesting, truncation, stemming, phrases and proximity operators.\n- Implemented two-factor authentication to DTIC collections through the use of External Certificate Authority (ECA) and Personal Identity Verification (PIV) cards for 98 percent of DTIC users, increasing security to limited DoD data, while easing access for authenticated users.\n- Supported DoD's public access effort, including policy development for intramural basic research.  Continued to expand publicly-available content in support of the Department's Citizen Science objectives.  During FY 2016, the number of full-text journal articles provided by publishers through PubDefense increased by 1,267, while publicly accessible citations for embargoed articles increased by 2,445.\n-- Established DTIC public access interface to provide users with a public access search of DoD-funded publisher records.\n-- Established input template for public access journal articles.\n- Expanded Defense Innovation Marketplace search and analytic capabilities in alignment with the Department’s acquisition improvement initiatives; added small business research information.\n-- Employed the Marketplace to support four Technology Interchange Meetings with industry hosted by the U.S. Air Force:  Aero Enterprise Dialogue, Space Enterprise, Nuclear Deterrence Operations, and Sensors Communities of Interest (COI). \n-- Industry added more than 6,000 project summaries to the Independent Research and Development (IR&D) collection, providing the Department visibility into industry’s research efforts.\n-- Explored the utility of Technology Domain Awareness (TDA) activities. Developed roadmap and executed initial outreach with the National Defense University (NDU).\n- Extended capability of DTIC standard library content management system in the DoD-hosted cloud.\n- Expanded capability of the Master Data Repository (MDR) solution to consolidate DTIC data collections into one common storage infrastructure for increased analysis and visualization capabilities across the suite of collections. Over 4 million records from six datasets were consolidated into the Master Data Repository during FY 2016.\n-- Increased the number of technical reports, with over 30,000 additional documents available to DTIC users, for advanced, integrated search.\n- Collaborated with the DoD Intelligence community on policy and planning for the implementation of the new Controlled Unclassified Information (CUI) federal marking regulations.\n- Implemented Full Operating Capability (FOC) of the DoD Grant Awards System, which contains publicly-searchable descriptive abstracts of DoD grant awards from December 9, 2014 to present.\n-- The system was established in response to a statutory requirement contained in Section 8123 of the fiscal year 2015 DoD Appropriations Act (Division C of the Consolidated and Further Continuing Appropriations Act, Public Law 113-235). DoD components have submitted 6,890 records (with a total anticipated award amount\/value of approximately $4.5 Billion) into the database.\n- Deployed a new DoD Research and Engineering (R&E) Gateway home page as the primary customer access point for DTIC science and technology (S&T) reports, search capabilities, and collaboration tools; this is a cleaner, simpler interface for customers to find information and start working in DTIC tools faster.\n-- Expanded outreach to the DTIC user community and DoD science and technology (S&T) communities of interest (COIs) by offering onsite briefings, demonstrations and training for the R&E Gateway search and collaborative tools.\n-- Deployed a new DoDTechspace collaboration tool user interface; this new interface greatly simplified the users’ ability to execute collaboration functions, which resulted in a 16 percent increase in new content added to the site.\n- Aligned with DoD Joint Information Environment (JIE) initiative for the Federal Data Center Consolidation Initiatives (FDCCI) by maximizing the virtualization of DTIC systems and applications that service all of the DoD, industry partners, and academia users.\n- Planned the migration of DTIC to a DoD-CIO approved cloud service provider, based on final guidance from the Department.\n- Met DoD’s audit readiness milestones and requirements."
                                                        }
                                                    }
                                                },
                                                "PlannedProgram": {
                                                    "CurrentYear": {
                                                        "Funding": {
                                                            "val": "38.086"
                                                        },
                                                        "Text": {
                                                            "val": "- Evaluate FY 2016 progress in semantic technology; expand semantic enhancement of content to promote exploration and discovery across multiple collections to identify related search topics, concepts and associations, to the extent maturing capabilities allow.\n-- Apply semantic linking and tagging technology to new collections, such as journal articles, data set metadata and acquisition data. As of April 2017, the tagging technology has been utilized to tag new technical reports and journal articles added to the DTIC Collection with subject terms. Plan to continue expanding to include communities of interest and technical readiness levels, and report subject groupings. The tagging technology has the ability to batch process 4 million documents in under 20 days.\n-- Addition of a semantic search option to standard keyword search results.\n- Enhance DTIC identity management by implementing the capability to accept PIV-Industry (PIV-I), the federal government standard for two-factor authentication; enables authenticated industry adapters to access DTIC collections and products.  Initial companies seeking access with PIV-I are Boeing, Lockheed Martin, Northrup Grumman, Raytheon, and Symantec.\n- Support DoD’s public access effort, albeit at a reduced level. Providing public access to federally funded research not only brings the Department into compliance with the Office of Science and Technology Policy (OSTP) Memorandum, but also provides DoD with a central repository of published science and technology (S&T) information to encourage innovation.\n-- Pursue collaborative efforts with other Federal agencies to leverage existing systems and lessons learned.\n-- Establish draft guidance for data management plans (DMPs). Work with subject matter experts to develop DMP requirements relevant to specific science and technology disciplines.\n-- Continue to plan for the integration of input, public access search, and authentication capabilities to support the submission of journal articles from contractors and grantees.\n- Complement the Department’s acquisition improvement initiatives by expanding the search and analytic capabilities of the Defense Innovation Marketplace.\n-- Maintain the Marketplace capability to support all the Services’ communications with industry for Technology Interchange Meetings, across all of the Communities of Interest (COIs). \n- Continue migrating legacy standalone collection feeds to DTIC’s standard library content management system in the DoD-hosted cloud, reducing the footprint of multiple technologies and driving efficiencies and cost avoidance.\n-- Migrate the second collection, the Information Analysis Center (IAC) Total Electronic Migration System (TEMS) collection and process into the DTIC consolidated content management system.  The IACs process over 30,000 technical reports annually into the DTIC collection.\n- Implement the Master Data Repository (MDR) for the DTIC collections on SIPRNET.\n-- Deploy a new SIPR search, which leverages the new MDR, to enable users to discover more relevant science and technology information faster by refining a search using Boolean, wildcards, nesting, truncation, stemming, phrases and proximity operators.\n- Collaborate with the DoD Intelligence community and other AT&L representatives on policy and implementation of the new Controlled Unclassified Information (CUI) federal marking regulations, as DoD begins to rewrite its guidance for marking documents.\n- Complete the enhancement of the International Agreements Database (IADB) to include re-engineering the application for more efficient integration with the database and search capability.\n- Continue the initial evaluation and prototyping of Cloud Service Provider offerings to select the best provider for Infrastructure As A Service (IAAS), Platform As A Service (PAAS), and Software As A Service (SaaS).\n-- Further explore options to establish a DTIC Cloud location and vendor; begin preparations to initiate the transition from a DTIC-provided Data Center to a DoD-CIO approved Cloud Service Provider.\n-- Stand up an initial public site (unclassified, unlimited) in a commercially available cloud; move selected public web-sites static content to a Cloud Service Provider."
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Funding": {
                                                            "val": "49.071"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Funding": {
                                                            "val": "49.071"
                                                        },
                                                        "Text": {
                                                            "val": "- Deliver customers the ability to apply flexible search strategies across all DTIC collections.\n-- Continue to integrate search and analysis capabilities across all collections on SIPRNET and NIPRNET for improved analysis and discovery of information.\n-- Complete upgrade and update to the search interface to incorporate new search capabilities and improve the user experience with DTIC search products.\n-- Discontinue the DTIC Google Search Appliances (GSA); transition all search capabilities to the MDR.\n-- Leverage persistent digital identifiers to build consolidated author profiles, and links to technical documents.\n- Provide capability to automate processing of public release content to eliminate backlog, and enable rapid availability.\n-- Reduce the footprint of multiple technologies and retire the 25-year-old legacy system to drive efficiencies and reduce cost of ownership.\n- Conduct an analysis of alternatives to support the advancement of identity management capabilities.\n-- Review and investigate innovative commercial technologies and available government offerings.\n-- Develop requirements; establish Subject Matter Expert (SME) positions; and track industry technology advancements.\n- Integrate ontologies (sets of concepts and categories within a subject domain) with the Master Data Repository, providing enhanced search, highly relevant results, and real-time analysis of incoming records to promote exploration and discovery.\n-- Extend current literal search with search by the “intent” and by example, saving user time from repeated searches using different terms.\n-- Improve data quality by bridging data gaps within a single collection and\/or between collections, offering a homogenous data lake representing research project lifecycle from inception to completion.\n- Help the defense community locate the most relevant technical information by leveraging the Master Data Repository (MDR) solution. \n-- Migrate NIPR enhancements (Enterprise Content Management System (ECMS), grants, data sets, international agreements, content integration) to SIPRNET.\n-- Integrate with subject tagging service and DTIC Thesaurus.\n-- Integrate cooperative agreements, acquisition data, R1s, P1s, Congressional mark-ups into Master Data Repository.\n- Collaborate with the DoD Intelligence community and other AT&L representatives on policy and implementation of the new Controlled Unclassified Information (CUI) federal marking regulations, as DoD rewrites its guidance for marking documents.\n- Support DoD’s public access effort; conduct outreach and educate intramural and extramural researchers on the requirement to submit journal articles to DTIC.\n-- Collaborate with the DoD laboratories to design efficient integrated submission mechanism for all types of public access information.\n-- Implement contractors\/grantees input capability for journal articles, with a mechanism to authenticate the submission.\n-- Enhance public access search to include both new and legacy journal articles submitted to DTIC, combined with pointers to publisher versions.\n-- Establish pilot project to accept submissions of data management plans (DMPs) for DoD-funded research programs.\n-- Begin to accept voluntary input of metadata pointing to public or limited dissemination data sets.\n-- Create catalog\/locator of data sets using discovery and descriptive metadata; send metadata for public data sets to data.gov.\n-- Initiate an independent study and a prototype to examine options for the management of digitally formatted scientific datasets.\n-- Evaluate dataset dissemination capabilities.\n- Deliver customer-driven features based on an improved understanding of customer successes and experiences on our sites.\n-- Implement decision based metrics across primary DTIC products to improve DTIC’s ability to understand customer behavior and make business decisions on investments in products and services.\n-- Deliver capability for DTIC program managers and product owners to have full visibility and transparency on product usage, customer trends and customer tendencies in products and services. This will allow full visibility on all user actions and interactions in the search user interface and fully capture user successes by measuring downloads, bibliography builds and exports, and user paths through the interfaces.\n- Conduct initial planning to establish a functional IT Continuity of Operations (COOP) capability for DTIC.\n-- Complete an IT COOP analysis of alternatives in order to produce an approved and executable IT COOP plan.  Review commercial technologies and government offerings.\n-- Integrate effort with concurrent cloud services planning to provide required infrastructure to support and sustain the future IT COOP environment.\n-- Design cyber RMF documentation and accreditation; conduct initial system engineering to ensure the highest availability of future services.\n- Conduct an analysis of alternatives to support the migration of DTIC’s Data Center to a Cloud Service Provider.\n-- Begin the design of a cloud system architecture and the modification of code to create an optimal cloud environment which will improve customer support experience, reduce cost and labor, capture user data, and improve security posture in order to meet DoD Data Center reduction goals.\n-- Plan the transition stages for phasing DTIC’s public, NIPRNET and SIPRNET activities to a cloud environment. \n-- Develop and design the Risk Management Framework (RMF) controls for a new DTIC Cloud environment; prepare accreditation documentation and an update to the Authority to Operate (ATO).\n-- Design the integration of Single Sign-On capabilities, User Registration Systems, and public key infrastructure (PKI) authentication methods for a new DTIC Cloud environment.\n-- Explore options to establish a contract or service level agreement with an organization or company to facilitate DTIC’s transition from its Data Center to a Cloud Service Provider.\n-- Construct a flexible cost model to track true cost of ownership to share costs with DTIC customers and better track internal expenditures. \n-- Continue the successful migration of public sites to a commercial or government-provided cloud\/data center.\n- Research and investigate innovative commercial technologies needed to field mobile capabilities in support of user devices, operating systems, and browsers. \n-- Conduct an analysis of alternatives to support development of mobile capabilities.\n-- Develop initial plans for incorporating mobile technologies to include metrics, software development, testing, and cyber security."
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "PerformanceMetrics": {
                                        "val": "Figures reflect FY 2016 end-of-year data.\n\nTotal Unique DTIC NIPRNET Users:  26,404\nTotal Unique DTIC SIPRNET Users:  5,340\nTotal Unique IAC (CSIAC, DSIAC, and HDIAC) Users:  97,091\nTotal DTIC Users:  128,835\n\nTotal scientific and technical information (STI) holdings in DTIC collections:  4.16 Million\n\nSTI added and updated to DTIC Collection:  98,397\n- Total STI (NIPRNET) Added:  71,966\n- Total STI (SIPRNET) Added:  828\n- Total STI (NIPRNET) Updated:  25,603\n\nSTI records downloaded to Public:  40 Million-plus\nRecords downloaded to DoD NIPRNET:  1.1 Million\n\nIAC Customer Technical Support Requests for Analysis:  5,580"
                                    }
                                }
                            },
                            {
                                "ProjectNumber": {
                                    "val": "002"
                                },
                                "ProjectTitle": {
                                    "val": "Information Analysis Centers"
                                },
                                "SpecialProject": {
                                    "val": "0"
                                },
                                "ProjectFunding": {
                                    "AllPriorYears": {
                                        "val": "12.801"
                                    },
                                    "PriorYear": {
                                        "val": "5.748"
                                    },
                                    "CurrentYear": {
                                        "val": "5.748"
                                    },
                                    "BudgetYearOne": {
                                        "val": "5.074"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "5.074"
                                    },
                                    "BudgetYearTwo": {
                                        "val": "5.016"
                                    },
                                    "BudgetYearThree": {
                                        "val": "5.016"
                                    },
                                    "BudgetYearFour": {
                                        "val": "5.016"
                                    },
                                    "BudgetYearFive": {
                                        "val": "5.016"
                                    },
                                    "CostToComplete": {
                                        "val": "Continuing"
                                    },
                                    "TotalCost": {
                                        "val": "Continuing"
                                    }
                                },
                                "R2aExhibit": {
                                    "ProjectMissionDescription": {
                                        "val": "DoD Information Analysis Centers (IACs), established under DoD Instruction 3200.14, serve as a vital resource in providing timely, relevant information directly to users when and where it is needed. IACs serve as a bridge between the warfighter and the Acquisition\/Research community, providing essential technical analysis and data support to a diverse customer base, to include the Combatant Commands (CCMDs), the Office of the Secretary of Defense, Defense Agencies, and the Military Services. IACs actively partner and collaborate with Defense Research and Engineering (R&E) focus groups and communities of interest in areas of specialized fields or specific technologies. The IACs create and maintain comprehensive knowledge analysis centers that include historical, technical, scientific, and other data and information collected worldwide. They are staffed with scientists, engineers and information specialists to provide research and analysis to customers with diverse, complex and challenging requirements. IAC operations directly support the warfighter, and play an ongoing and critical role in solving key CCMD operational issues such as cyber security, unmanned aerial vehicle visual\/audible signature reduction, and improvements to the ballistic resistance of body armor.\n\nThe IAC Program Management Office at DTIC performs contract acquisition, management, and operational support for IAC contract operations and the technical information that is generated as a result of research and studies. In a time of shrinking budgets and increasing responsibility, IACs are a valuable resource for accessing scientific and technical information culled from efforts to solve new and historic challenges.  Direct IAC customer support activities, such as Technical Area Task (TAT) order processing, Basic Center Operations (BCO) support, Defense Finance and Accounting Service (DFAS) activities, contracting\/acquisition related activities, etc., are funded in part through partnerships with the Defense R&E community and the annual collection of customer reimbursements for shared direct costs, in accordance with the IAC Reimbursable Review Board (IRRB) recommendations, with OSD-COMPT and Office of General Counsel concurrence.  This represents the maximum cost-sharing with IAC customers allowable, per guidance from the OSD Office of General Counsel. Annual IAC efforts and accomplishments are dependent on the level of participation and collaboration by the R&E community at large."
                                    },
                                    "AccomplishmentPlannedProgramList": {
                                        "AccomplishmentPlannedProgram": [
                                            {
                                                "Title": {
                                                    "val": "Information Analysis Centers"
                                                },
                                                "Accomplishment": {
                                                    "PriorYear": {
                                                        "Funding": {
                                                            "val": "5.748"
                                                        },
                                                        "Text": {
                                                            "val": "- Supported the DTIC mission to provide technical information to DoD.\n- Provided administrative and operational oversight of basic core contract activities for DoD IACs to collect, analyze, synthesize and disseminate worldwide scientific and technical information (STI) in support of DoD's critical technologies and the warfighter.\n- Responded to 5,580 technical inquiries and provided in-depth science and technology (S&T) analysis; created and provided STI results via IAC websites; captured STI products from new\/on-going analysis tasks; and supported the exchange of information among members of the operational and technical communities.\n- Managed and supported Technical Area Tasks (TATs) ordered by the DoD and non-DoD customers; provided program strategy and ensured alignment with Department goals\/direction.\n- Planned for the replacement of the Software, Networks, Information, Modeling and Simulation (SNIM) contract. \n- Completed award of new multi-award contract for Cyber Systems TAT.\n- Awarded approximately 71 new TATs and 30 new CATs totaling approximately $2.2 Billion in new research and analysis work.  This is approximately a 9 percent increase in the typical annual work load for the IAC program.\n- Increased the ceiling limit for the Defense Systems TAT (DS TAT) multi-award contract from its current $3 Billion limit to about $7 Billion (at its previous ceiling burn rate, DS TAT would have hit its ceiling in June 2016, about 2.5 years before it ends)."
                                                        }
                                                    }
                                                },
                                                "PlannedProgram": {
                                                    "CurrentYear": {
                                                        "Funding": {
                                                            "val": "5.748"
                                                        },
                                                        "Text": {
                                                            "val": "- Support the DTIC mission to provide technical information to DoD.\n- Provide administrative and operational oversight of basic core contract activities for DoD IACs to collect, analyze, synthesize and disseminate worldwide scientific and technical information (STI) in support of DoD's critical technologies and the warfighter.\n- Respond to technical inquiries and provide in-depth science and technology (S&T) analysis; create and provide STI results via IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Manage and support Technical Area Tasks (TATs) ordered by the DoD and non-DoD customers; provide program strategy and ensure alignment with Department goals\/direction.\n- Continue to use ACC Picatinny for processing TAT awards; engage in aggressive customer outreach to initiate processing early.\n- Increase the ceiling limit for the Homeland Defense TAT (HD TAT) multi-award contract from its current $900 Million limit to about $1.3 Billion (at its present ceiling burn rate, HD TAT will hit its ceiling in Sept 2017, about 1.5 years before it ends).\n- Issue Request for Proposals (RFP) and conduct proposal evaluations for two follow-on IAC contacts: Cyber Systems IAC (CS IAC) and the IAC Multiple Award Contract (IAC MAC)"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Funding": {
                                                            "val": "5.074"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Funding": {
                                                            "val": "5.074"
                                                        },
                                                        "Text": {
                                                            "val": "- Support the DTIC mission to provide technical information to DoD.\n- Provide administrative and operational oversight of basic core contract activities for DoD IACs to collect, analyze, synthesize and disseminate worldwide scientific and technical information (STI) in support of DoD's critical technologies and the warfighter.\n- Respond to technical inquiries and provide in-depth science and technology (S&T) analysis; create and provide STI results via IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Manage and support Technical Area Tasks (TATs) ordered by the DoD and non-DoD customers; provide program strategy and ensure alignment with Department goals\/direction.\n- Continue to use ACC Picatinny for processing TAT awards; engage in aggressive customer outreach to initiate processing early.\n- Award Cyber Systems IAC contract, a $49 Million contract, to a Small Business (1st Qtr, FY 2018).\n- Award IAC Multiple Award contract, a $28 Billion contract, to teams of Large and Small Businesses (4th Qtr, FY 2018).\n- Award Homeland Defense IAC follow-on contract (value TBD) to a Small Business (4th Qtr, FY 2018)."
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "PerformanceMetrics": {
                                        "val": "Figures reflect FY 2016 end-of-year data.\n\nNumber of:\n- IAC web inquiries:  746,287\n- IAC technical inquiries:  5,580\n- STI documents added to IAC collection:  29,328\n- STI documents generated by Technical Area Task (TAT) activities:  4,380\n- Training or meeting events:  2,579\n- Number of training attendees:  12,682\n- Documents uploaded to DTIC's online repository:  18,199\n\nAmount of funding:\n- Provided by external customer requesting IAC technical analysis (TAT Funding):  $1.3 Billion\n- Provided by external customers purchasing IAC information products (Non-TAT funding):  $50,272\n\nCustomer satisfaction regarding:\n- IAC products and technical inquiry support (scale of 1 to 5, 5 being best):  4.8\n- IAC TATs and training (scale of 1 to 5, 5 being best):  4.9"
                                    }
                                }
                            }
                        ]
                    }
                },
                {
                    "@monetaryUnit": "Millions",
                    "@format": "R2Long",
                    "@classification": "UNCLASSIFIED",
                    "ProgramElementNumber": {
                        "val": "0605998KA"
                    },
                    "ProgramElementTitle": {
                        "val": "Management HQ - Defense Technical Information Center (DTIC)"
                    },
                    "R1LineNumber": {
                        "val": "167"
                    },
                    "BudgetYear": {
                        "val": "2018"
                    },
                    "BudgetCycle": {
                        "val": "PB"
                    },
                    "SubmissionDate": {
                        "val": "2017-05"
                    },
                    "ServiceAgencyName": {
                        "val": "Defense Technical Information Center"
                    },
                    "AppropriationCode": {
                        "val": "0400"
                    },
                    "AppropriationName": {
                        "val": "Research, Development, Test & Evaluation, Defense-Wide"
                    },
                    "BudgetActivityNumber": {
                        "val": "6"
                    },
                    "BudgetActivityTitle": {
                        "val": "RDT&E Management Support"
                    },
                    "ProgramElementFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.400"
                        },
                        "BudgetYearOne": {
                            "val": "4.187"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.187"
                        },
                        "BudgetYearTwo": {
                            "val": "3.987"
                        },
                        "BudgetYearThree": {
                            "val": "3.787"
                        },
                        "BudgetYearFour": {
                            "val": "3.836"
                        },
                        "BudgetYearFive": {
                            "val": "3.886"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "ChangeSummary": {
                        "PreviousPresidentBudget": {
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "4.400"
                            },
                            "BudgetYearOne": {
                                "val": "4.187"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.187"
                            }
                        },
                        "CurrentPresidentBudget": {
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "4.400"
                            },
                            "BudgetYearOne": {
                                "val": "4.187"
                            },
                            "BudgetYearOneBase": {
                                "val": "4.187"
                            }
                        },
                        "TotalAdjustments": {
                            "PriorYear": {
                                "val": "0.000"
                            },
                            "CurrentYear": {
                                "val": "0.000"
                            },
                            "BudgetYearOne": {
                                "val": "0.000"
                            },
                            "BudgetYearOneBase": {
                                "val": "0.000"
                            }
                        },
                        "SummaryExplanation": {
                            "val": "The change between FY 2017 and the FY 2018 Base (a net decrease of $0.213 Million in FY 2018) includes a decrease of $.215 Million, which reflects a reduction in the number of civilian authorizations assigned to the Management Headquarters element of DTIC."
                        }
                    },
                    "ProjectList": {
                        "Project": [
                            {
                                "ProjectNumber": {
                                    "val": "001"
                                },
                                "ProjectTitle": {
                                    "val": "Management HQ - Defense Technical Information Center (DTIC)"
                                },
                                "SpecialProject": {
                                    "val": "0"
                                },
                                "ProjectFunding": {
                                    "AllPriorYears": {
                                        "val": "0.000"
                                    },
                                    "PriorYear": {
                                        "val": "0.000"
                                    },
                                    "CurrentYear": {
                                        "val": "4.400"
                                    },
                                    "BudgetYearOne": {
                                        "val": "4.187"
                                    },
                                    "BudgetYearOneBase": {
                                        "val": "4.187"
                                    },
                                    "BudgetYearTwo": {
                                        "val": "3.987"
                                    },
                                    "BudgetYearThree": {
                                        "val": "3.787"
                                    },
                                    "BudgetYearFour": {
                                        "val": "3.836"
                                    },
                                    "BudgetYearFive": {
                                        "val": "3.886"
                                    },
                                    "CostToComplete": {
                                        "val": "Continuing"
                                    },
                                    "TotalCost": {
                                        "val": "Continuing"
                                    }
                                },
                                "R2aExhibit": {
                                    "ProjectMissionDescription": {
                                        "val": "This program element (PE) provides funding for the Management Headquarters (HQ) element of the Defense Technical Information Center (DTIC), a DoD Field Activity to the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)\/AT&L).  The PE supports personnel compensation for HQ-assigned civilians, along with related administrative support costs.  This second DTIC PE, established in FY 2017, is designed to track activities deemed as headquarters functions, with no operational efficiencies or enhancement to mission.\n\nThe PE supports the following HQ functions and mission essential activities critical to the success of DTIC’s business operations, and mandated by law or regulation: \n\n- Activity leadership, strategic planning, and Front Office support staff.\n-- The front office staff (6 authorizations) represents a small component of this PE.  Most of the specialized functions and skill-sets described below are centralized activities within the PE, yet support the larger organization and its employees.  These activities were consolidated as a means to improve efficiencies throughout DTIC, and are essential to the operation of DTIC’s primary PE 0605801KA.\n-- Reductions to DTIC’s HQ staffing levels continue, reducing civilian full time equivalents (FTEs) below FY 2017 levels. \n- Financial Management and Comptroller.  Provides integrated resource management at the Agency level to obtain, control, and execute budget and manpower authorities to support the organization's mission requirements.  Develops and prepares agency budget documents and exhibits for submission to both OSD and Congress.\n-- Accounting support to DTIC’s mission operations; partners with the Defense Finance and Accounting Service to present accurate financial reporting and Fund Balance with Treasury. \n-- Financial Improvement and Audit Readiness (FIAR) activities and oversight in compliance with the Department’s audit goals, objectives, and milestones.\n- Human Resources (HR) Liaison Support.  Provides the DTIC enterprise with payroll processing and “Hire to Retire” mission support; oversees and organizes employee training, professional development, and certification programs (e.g., Acquisition, Financial Management, and IT programs).\n-- Coordinates recruitment placement and classification action for the mission areas; liaison to the Defense Finance and Accounting Service for HR servicing and the Defense Logistics Agency (DLA) for Equal Employment Opportunity (EEO) program maintenance.\n- Mandatory Records Management compliance activities and administration programs.\n- IT Management\/Chief Information Officer (CIO).  Collects, analyzes, and reports information necessary to effectively and efficiently manage enterprise IT resources; CIO functions are performed in compliance with DoD-CIO guidance, instructions and mandates. \n- IT Help Desk\/Local Area Network (LAN).  Office automation supports desktop computing customers; resolves IT-related equipment or system incidents; provides assured system and network availability, info delivery, and secure IT solutions to support current and future business and mission requirements."
                                    },
                                    "AccomplishmentPlannedProgramList": {
                                        "AccomplishmentPlannedProgram": [
                                            {
                                                "Title": {
                                                    "val": "Management HQ - Defense Technical Information Center"
                                                },
                                                "Accomplishment": {
                                                    "PriorYear": {
                                                        "Funding": {
                                                            "val": "0.000"
                                                        },
                                                        "Text": {
                                                            "val": "- N\/A."
                                                        }
                                                    }
                                                },
                                                "PlannedProgram": {
                                                    "CurrentYear": {
                                                        "Funding": {
                                                            "val": "4.400"
                                                        },
                                                        "Text": {
                                                            "val": "- Execute the program, activities and functions as described above in Section A, Mission Description of PE 0605998KA."
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Funding": {
                                                            "val": "4.187"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Funding": {
                                                            "val": "4.187"
                                                        },
                                                        "Text": {
                                                            "val": "- Execute the program, activities and functions as described above in Section A, Mission Description of PE 0605998KA."
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    },
                                    "PerformanceMetrics": {
                                        "val": "N\/A"
                                    }
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}