{
    "id": "2018-Army-PB-2040-JBOOK-3e91339aa28ec2881f9549044dc8a7daf4e287c1ca461095f2d8b42bf2f292b8-14",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603807A"
        },
        "ProgramElementTitle": {
            "val": "Medical Systems - Adv Dev"
        },
        "R1LineNumber": {
            "val": "67"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.711"
            },
            "CurrentYear": {
                "val": "33.503"
            },
            "BudgetYearOne": {
                "val": "33.491"
            },
            "BudgetYearOneBase": {
                "val": "33.491"
            },
            "BudgetYearTwo": {
                "val": "35.572"
            },
            "BudgetYearThree": {
                "val": "40.468"
            },
            "BudgetYearFour": {
                "val": "41.482"
            },
            "BudgetYearFive": {
                "val": "44.229"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) funds development of medical materiel within the early system integration portion of the System Development and Demonstration phase of the acquisition life cycle using 6.4 (Advanced Component Development and Prototype) funding. Program efforts support transition of promising Science and Technology candidate medical technologies (drugs, vaccines, medical devices, diagnostics, and mechanisms for detection and control of disease carrying insects) to larger scale testing in humans for safety and effectiveness. Programs are aligned to meet future force requirements identified within concept documents and organizational structures. This Program Element also provides funding for Food and Drug Administration (FDA) regulated human clinical trials to gain additional information about safety and effectiveness on the path to licensure for use in humans. \n\nThe Projects supported by this PE are: \n\nProject 808 funds development of candidate medical countermeasures for infectious diseases of military relevance. Efforts include vaccines, drugs, diagnostic kits\/devices, and insect control measures. These funds support human clinical efficacy trials of the drug\/vaccine in a larger group that are designed to assess performance and to continue safety assessments in a larger group of volunteers. Products from this Project will transition to PE 0604807A\/Project 849.\n\nProject 811 funds the development of military relevant human immunodeficiency virus (HIV) medical countermeasures. It provides funding for planning and conducting of human clinical trials in a group of healthy volunteers to assess the drug\/vaccine for safety, tolerability, how the drug\/vaccine is distributed, metabolized, and excreted from the body, and investigate the appropriate dose for therapeutic use. Products from this Project will transition to PE 0604807A\/Project 812.\n\nProject 836 funds the demonstration and validation of medical products for enhanced combat casualty care and follow-on care, including rehabilitation. This project also funds the human clinical trials that test the safety and effectiveness of biologics, devices and demonstration. Clinical trials are conducted in accordance with United States (U.S.) FDA regulations. Products from this project will transition to PE 0604807A\/Project 832. \n\nProject VS7 funds program upgrades, retrofits, trains, and sustains the fleet of Medical Evacuation legacy helicopters that continue to play a major role in Iraq and Afghanistan. The approved force design increased the number of air frames in the force from 12 to 15 aircraft for 37 medical evacuation (MEDEVAC) companies. All products from this Project will transition to PE 0604807A\/Project VS8.\n\nThese Projects are managed by U.S. Army Medical Materiel Development Activity (USAMMDA) and U.S. Army Medical Materiel Agency (USAMMA) of the U.S. Army Medical Research and Materiel Command.\n\nProject FF4 funded Secretary of Defense approved counterdrug advanced development efforts used in a major re-design of the Forensic Toxicology Drug Testing Laboratory (FTDTL) information management system used to test urine samples for the presence of illegal drugs. The Drug Testing Program - Client Collection System (DTP-CSS) is comprised of several variations of a desktop application used to select service members for random drug testing, prepare labels for urine specimen bottles, and print corresponding chain-of-custody documents. This Project will standardize DTP-CSS across all services and migrate it to a Web-based system."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "31.962"
                },
                "CurrentYear": {
                    "val": "33.503"
                },
                "BudgetYearOne": {
                    "val": "28.678"
                },
                "BudgetYearOneBase": {
                    "val": "28.678"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.711"
                },
                "CurrentYear": {
                    "val": "33.503"
                },
                "BudgetYearOne": {
                    "val": "33.491"
                },
                "BudgetYearOneBase": {
                    "val": "33.491"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.749"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.813"
                },
                "BudgetYearOneBase": {
                    "val": "4.813"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.151"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "4.500"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "4.813"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.813"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "OSD Directed Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "4.400"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Two program changes account for the difference in FY16 between previous and current President's Budgets:\n\nFirst, a $4.4 million increase in Fiscal Year (FY) 16 is due to an Office of the Secretary of Defense (OSD)-directed funding of Project FF4: Counterdrug, DDR, System Development & Demonstration. These funds are to be used for development by United States Army Medical Command (USAMEDCOM) of a standard Department of Defense (DoD) tracking system of lab samples collected at military units and tested for illegal drugs.\n\nSecond, a $4.5 million adjustment in FY16 is due to a reprogramming of this amount from PE 0604807A\/Project 812 Military HIV Vaccine & Drug Development to PE 0603807A\/Project 811, Military HIV Vaccine & Drug Development.\n\nIn FY18 the budget year adjustment of $4.83M was primarily due to an adjustment of $4.42M from PE 0604807A\/Project 812 Military HIV Vaccine & Drug Development to PE 0603807A\/Project 811, Military HIV Vaccine & Drug Development and minor adjustments in the other project lines."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "808"
                    },
                    "ProjectTitle": {
                        "val": "DoD Drug & Vacc Ad"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.408"
                        },
                        "CurrentYear": {
                            "val": "14.914"
                        },
                        "BudgetYearOne": {
                            "val": "14.372"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.372"
                        },
                        "BudgetYearTwo": {
                            "val": "14.353"
                        },
                        "BudgetYearThree": {
                            "val": "16.515"
                        },
                        "BudgetYearFour": {
                            "val": "16.948"
                        },
                        "BudgetYearFive": {
                            "val": "17.457"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds development of candidate medical countermeasures for infectious diseases of military relevance.  These efforts are in: vaccines, drugs, diagnostic kits\/devices, and to determine if insects are infected with pathogenic organisms capable of infecting service members\/preventive medicine measures. These funds support human clinical effectiveness (capacity to produce a desired size of an effect under ideal or optimal conditions) trials of the drug\/vaccine in larger groups that are designed to assess how well the drug\/vaccine works, and to continue safety assessments in a larger group of volunteers. Funding supports both technical evaluations and human clinical testing to assure the safety and effectiveness of medical diagnostic kits and devices. This work, which is performed in military laboratories or civilian pharmaceutical firms, is directed toward the prevention of disease, early diagnosis, and accelerated recovery time once diagnosed; to enhance battlefield readiness. All clinical trials are conducted in accordance with United States (U.S.) Food and Drug Administration (FDA) regulations, a mandatory obligation for all military products placed into the hands of medical providers or service members. Product development priorities are determined based upon four major factors: (1) the extent and threat of the disease within the Combatant Commands theater of operations, (2) the clinical severity of the disease, (3) the technical maturity of the proposed solution, and (4) the affordability of the solution (development and production)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Drug and Vaccine Advanced Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort in the development of candidate medical countermeasures for military relevant infectious disease."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.408"
                                            },
                                            "Text": {
                                                "val": "Dengue Tetravalent Vaccine: Continue to fund Dengue Tetravalent Vaccine until Fiscal Year (FY) 18 for additional two-year volunteer follow-up and data analysis on pivotal Phase 3 safety and effectiveness clinical trials required by the Thai Ministry of Public Health. Infectious Disease Diagnostic: Transition products from science and technology (S&T) in FY16. Begin preparation for field testing and evaluation of several product candidates to include: Scrub Typhus, Rickettsiae, and Sand Fly Fever. Dengue Vaccine Block II: Transition from S&T in FY16. Transition from Military Infectious Diseases S&T funding and prepare for Phase 2 safety and efficacy trial (24 to 300 subjects) of vaccine candidate in an adult\/military population. Treatment for Resistant Wound Infections: Products will transition from S&T in FY16. Transition from Military Infectious Diseases S&T funding and begin preparation for safety and efficacy trials of drug candidate for the Treatment for Resistant Wound Infections. Next Generation Malaria Prophylaxis: Initiate a retinal safety study in FY16 and continue to prepare the protocols for any required soldier specific studies that is needed. Arthropod Control\/Surveillance: Begin preparation for field testing and evaluation of several product candidates to include: Scrub Typhus, Rickettsiae, and Sand Fly Fever."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.914"
                                            },
                                            "Text": {
                                                "val": "Dengue Tetravalent Vaccine: Will transition to Program element (PE) 0604807A Project 849 in FY17. Infectious Disease Diagnostic products: In FY17 products within this area will move to the Rapid Diagnostic and Detection Devices. Dengue Vaccine Block II: Will continue to prepare for Phase 2 safety and efficacy trial (24 to 300 subjects) of vaccine candidate in an endemic population and plan\/prepare for phase 2 studies (safety and efficacy 24 to 300 subjects) involving adult military\/traveler population. Preparation will include candidate formulation evaluation in dengue human challenge studies. Treatment for Resistant Wound Infections: Products will transition in FY17 from the Military Infectious Diseases Advanced Technology program.  Will begin preparation for safety and efficacy trials of drug candidate for the Treatment for Resistant Wound Infections. Next Generation Malaria Prophylaxis: Will continue the retinal (eye) safety study started in FY16 and will continue to prepare the protocols for any required soldier specific studies for FDA review. Arthropod Control\/Surveillance:  In FY17 products within this area will move to the Rapid Diagnostic and Detection Devices. Rapid Diagnostic and Detection Devices:  In FY17 the Infectious Disease Diagnostic and Arthropod Control\/Surveillance products have moved under this product title.  Will continue field testing and evaluation of several product candidates to include: dengue, chikungunya and leptospirosis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.372"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.372"
                                            },
                                            "Text": {
                                                "val": "Dengue Vaccine Block II: Will continue clinical development of the dengue human infection model, a tool used to evaluate and down select candidates transitioning from S&T. Treatment for Resistant Wound Infections: Conduct safety and effectiveness clinical study. Next Generation Malaria Prophylaxis: Will continue the retinal (eye) safety study (3 year study) started in FY16. Will prepare the protocols for the required soldier specific studies needed for the FDA review. Rapid Diagnostic and Detection Devices (Infectious Disease Diagnostics (Multiple)): Will continue field testing and evaluation of several diagnostic product candidates to include: dengue, chikungunya and bacterial diarrhea."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Test and evaluate in-house and commercially developed products in extensive government-managed clinical trials to gather data required for FDA licensure and Environmental Protection Agency registration."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Management Services Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.355"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.180"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.130"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.520"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.520"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Management Services Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics Information Technology,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Frederick MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.300"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.193"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.118"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.454"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.454"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.065"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "25.987"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.443"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.036"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.803"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.803"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Malaria Prophylaxis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.010"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.010"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Malaria Prophylaxis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Armed Forces Research Institute of Medical Sciences"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambodia"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.111"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.111"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Malaria Prophylaxis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Walter Reed Army Institute of Research"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Silver Spring, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Support Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.649"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.545"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.527"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development T&E Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "46.202"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.947"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.803"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.251"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.251"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Dengue Block II"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "WRAIR and AFRIMS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Silver Spring MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.900"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.144"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.144"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.044"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Malaria Prophylaxis clinical trial"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.999"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.400"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.699"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160773-9.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Topical Antileishmanial Cream Expanded Access Treatment Pgm"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Infectious Disease Diagnostics Assays Validation of  point-of-care"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Dengue Vaccine Block II Phase 2 safety trial preparation\/perform"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Arthropod Control \/ Surveillance Process Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Treatment for Resistant Wound Infections Phase 2 safety trial"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Q Fever Vaccine IND and NDA package creation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "D5P Next Generation Malaria Drug Clinical Studies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Oral Drug for Cutaneous Leishmaniasis Adult Indication Study"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "811"
                    },
                    "ProjectTitle": {
                        "val": "Mil HIV Vac&Drug Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.427"
                        },
                        "CurrentYear": {
                            "val": "0.638"
                        },
                        "BudgetYearOne": {
                            "val": "5.230"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.230"
                        },
                        "BudgetYearTwo": {
                            "val": "5.353"
                        },
                        "BudgetYearThree": {
                            "val": "5.523"
                        },
                        "BudgetYearFour": {
                            "val": "5.669"
                        },
                        "BudgetYearFive": {
                            "val": "6.044"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds development of militarily relevant human immunodeficiency virus (HIV) medical countermeasures. It provides funding for the planning and conducting of human clinical trials in a group of healthy volunteers to assess the drug\/vaccine for safety, tolerability, how the drug\/vaccine is distributed, metabolized, and excreted from the body, and to investigate the appropriate dose for therapeutic use. Development efforts are focused on militarily unique needs effecting manning, mobilization, and deployment. \n \nThe major contractor is Henry M. Jackson Foundation for the Advancement of Military Medicine, Rockville, MD. Research efforts are coordinated with the National Institutes of Health."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Military HIV Vaccine & Drug Development"
                                    },
                                    "Description": {
                                        "val": "This Project funds advanced development research to develop candidate HIV vaccines, assess their safety and effectiveness in evaluations with human subjects, and protect military personnel from risks associated with HIV infection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.427"
                                            },
                                            "Text": {
                                                "val": "In RV305 (a late boost study of RV144 vaccine recipients), coordinate final data analyses and meet with investigators as to how the data should be presented\/published. Results of RV305 resulted in a rollover study (RV305 amendment) which provides an additional boost dose to selected vaccine recipients. Continue candidate vaccine trials RV306 (evaluation of different one-year boosts) and RV328 (study of AIDSVAX B\/E alone) to produce further immunogenicity data that complement the RV305 data. Continue the RV403 in Mozambique, Uganda, and Thailand. Compare the studies of immune responses induced by the RV144 regimen using AIDSVAX B\/E mixed with LMPLA (monophosphoryl lipid A with liposomes)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Text": {
                                                "val": "Will complete the rollover RV305 study (RV305 Amendment) to provide additional open-label boost to willing volunteers. Will conduct analysis of samples from RV305A study and will coordinate to analyze and evaluate data from the study.  Will continue to seek further complementary immunogenicity (ability to provoke immune response) data from Candidate vaccine trials RV306 and RV328 and will complete the collection of samples for safety and effectiveness of the study. RV403 study will continue in Mozambique, Uganda, and Thailand with adjuvanted AIDSVAX B\/E and will continue to collect samples from volunteers. IPT will continue to review Analysis of Alternatives (AoA) and disruptive technologies that have the potential to refocus current vaccine effort to a product that has a greater utility for military relevant populations. Down selection of viable vaccine candidates will be made in anticipation of a single phase IIB efficacy trial (trials to evaluate efficacy in patients with the disease) in Fiscal Year (FY) 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.230"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.230"
                                            },
                                            "Text": {
                                                "val": "Regional Vaccine Candidate:  Will complete execution of cohort study in high risk population in Thailand in preparation for start of clinical trial to Phase IIb\/III effectiveness testing (testing to determine safety and performance) of vaccine regimen.\n\nGlobal Vaccine Candidate: Will develop human safety study test plan for new HIV vaccine components. Will initiate regulatory and scientific reviews of human safety study test plan. Will prepare clinical safety study sites in Africa to execute the study of the global vaccine. Global vaccine has moved up in priority because it meets the manufacturing capability requirement and can meet the Capability Development Document threshold in one step as opposed to incrementally."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Test and evaluate commercially developed drug\/vaccine candidates in government-managed trials."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "836"
                    },
                    "ProjectTitle": {
                        "val": "Field Medical Systems Advanced Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.476"
                        },
                        "CurrentYear": {
                            "val": "17.951"
                        },
                        "BudgetYearOne": {
                            "val": "13.604"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.604"
                        },
                        "BudgetYearTwo": {
                            "val": "15.570"
                        },
                        "BudgetYearThree": {
                            "val": "18.134"
                        },
                        "BudgetYearFour": {
                            "val": "18.560"
                        },
                        "BudgetYearFive": {
                            "val": "20.413"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the demonstration and validation of medical products for enhanced combat casualty care and follow-on care, including rehabilitation. This Project funds human clinical trials to test the safety and effectiveness of biologics (products derived from living organisms) and devices necessary to meet medical requirements. When available, commercial-off-the-shelf (COTS) medical products are also tested and evaluated for transition to engineering and manufacturing development. Consideration is also given to reducing the medical logistics footprint through smaller weight, volume, and equipment independence from supporting materials. All clinical trials are conducted in accordance with United States (U.S.) Food and Drug Administration (FDA) regulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development - Program Management (PM) Medical Devices"
                                    },
                                    "Description": {
                                        "val": "Advanced Concept Development funding is provided for the following development of medical devices in support of enhanced combat casualty care."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.236"
                                            },
                                            "Text": {
                                                "val": "Traumatic Brain Injury (TBI) Diagnostic Assay System Increment II Point of Care Device: TBI Diagnostic Assay System: Continue current Biomarker technology developed by Banyan and coordinate all known technologies to Abbott Diagnostics. Continue contracting efforts in Fiscal Year (FY) 16. Impedance Threshold Device for the Treatment of TBI:  Product has transitioned back to science and technology (S&T) to conduct research on the expanded indications for the fielded device. Compartment Syndrome Pressure Device: Compartment Syndrome Pressure Device will be delayed for transition into Advanced Development from S&T until FY17. Milestone A will be delayed until FY17. After the Milestone A, product will transition into Advanced Development. Junctional \/ Noncompressible Hemorrhage Control Agent: The plan is for the product to transition into Advanced Development after Milestone B in late FY15. If FDA requires 510-K, program will develop required paper work for submission to the FDA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.763"
                                            },
                                            "Text": {
                                                "val": "TBI Diagnostic Assay System Increment II Point of Care Device:  Will continue to focus on the current Biomarker technology developed by Banyan and platform development with Abbott Diagnostics.  Compartment Syndrome Pressure Device: Prior testing results will determine the Materiel solution pathway.  The materiel solution will transition in FY17 as previously expected. Junctional \/ Noncompressible Hemorrhage Control Agent: Will continue FY16 efforts to scope effort and requirements. Intrathoracic Pressure Regulation Therapy (IPRT) (Formally Ventilator Support Device): Will work on validation efforts and preclinical testing to achieve FDA 510(k) clearance of the device to enhance circulation with possible applications towards shock and head injury.  Will perform testing to ensure the IPRT product is compatible with existing fielded systems. PTSD Biomarkers: Pending favorable research results in FY16, will begin prototype device development.   Field Anesthesia: Pending refinement of Service and Joint requirements, will transition technology to PE 0604807A Project 832. Ocular Drug Delivery (Ocular Salvage Device): Will determine products to move forward to clinical trials based on results from bench and preclinical studies. Portable Extracorporeal Membrane Oxygen (ECMO): Will evaluate development of more compact, portable and less invasive product from existing ECMO vendors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.848"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.848"
                                            },
                                            "Text": {
                                                "val": "Compartment Syndrome Pressure Device: This Project transitioned to Defense Health Program funding in FY17. Junctional \/ Noncompressible Hemorrhage Control Agent: Developmental efforts will be completed and available for procurement. IPRT: Will perform operational and suitability testing. Achieve Milestone B. Field Anesthesia: Will be doing a pivotal clinical trial on the device and working to finalize the design for production and obtain FDA clearance\/approval. Ocular Drug Delivery (Ocular Salvage Device): Will start clinical trials. Will complete Milestone A and finalize the capability development document. Portable ECMO: Will conduct clinical validation of prototype device. Work towards Milestone B accomplishment. Non-invasive neuro assessment device (NINAD): Product will transition to Advanced Development in FY18. Prepare for FDA submission and initiate clinical trials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development - PM Medical Support Systems"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort in the development of products that support the medical mission in combat casualty care and health care operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.240"
                                            },
                                            "Text": {
                                                "val": "Medical Evacuation and Treatment Vehicles Medical Equipment Set and Mission Essential Package: Continue collaboration with Program Executive Office Combat Support\/Combat Service Support (PEO CS&CSS) and Program Executive Office Ground Combat Systems (PEO GCS) on development efforts for emerging medical vehicle evacuation\/casualty evacuation (CASEVAC) variants including Armored Multi-Purpose Vehicle (AMPV) source selection. Exploring CASEVAC kit development for Mine-Resistant Ambush Protected (MRAP) Dash and Joint Light Tactical Vehicle (JLTV) vehicles. Transition to Project 832 in FY17. Improved Vector Tent Traps: Continue prototype development of Vector Tent Traps and transition to Project 832.Next Generation Uniform Repellent: Continue development of the Next Generation Uniform Repellent\/Impregnation process in collaboration with PEO Soldier. Obtain EPA registration. Perform cut and sew testing of EPA approved uniform repellent\/impregnation process for permethrin. Investigate use of other repellents. NGIS: Continue prototype development of NGIS and begin initial developmental tests and user evaluations. Hydration Status Monitor (HSM): HSM transition will be delayed due to a more extensive feasibility study than initially determined. Initiate development of prototype devices and prepare for the Milestone B submission with required documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.188"
                                            },
                                            "Text": {
                                                "val": "Medical Evacuation and Treatment Vehicles, Medical Equipment Set and Mission Essential Package, and CASEVAC:  Will transition to project PE 0604807A Project 832.  Improved Flying Vector Trap (IFVT ) (formerly Improved Vector Test Traps).  Will transition to PE 0604807A Project 832.  Next Generation Uniform Repellent\/Impregnation: Will continue development of the Next Generation Uniform Repellent\/Impregnation process in collaboration with PEO Soldier.  Will obtain Environmental Protection Agency (EPA) registration on a different repellent and evaluate integration into the uniform manufacturing process. Litter Transport Shock\/Stressor Mitigation System (formerly NGIS). Will finalize prototype design for transition to PE 0604807A Project 832 to conduct developmental test and user evaluations.  Remote Triage Sensor System: Will transition the Remote Triage Sensor System from a Small Business\/Innovative Research (SBIR) effort to PE 0604807A Project 836. Will finalize development of a fully functional prototype in preparation for developmental and user evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.494"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.494"
                                            },
                                            "Text": {
                                                "val": "Next Generation Uniform Repellent\/Impregnation: Will transition to PE 0604807A\/Project 832. Litter Transport Shock\/Stressor Mitigation System (Formally: NGIS): Will transition to PE 0604807A\/Project 832. Remote Triage Sensor System: Will transition to PE 0604807A\/Project 832. Nett Warrior Enhanced Physiological Sensors (Wearable): Will collaborate with Program Executive Office Soldier on the development of wearable physiological sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development - PM Tissue Injury and Regenerative Medicine"
                                    },
                                    "Description": {
                                        "val": "Description: Funding for engineering and manufacturing development of tissue injury and regenerative medicine health products for enhanced medical capability and readiness"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.262"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.262"
                                            },
                                            "Text": {
                                                "val": "Fracture Putty: Will transition ‘Fracture Putty’ scaffold product from Science & Technology. Will support Fracture Putty’s scale-up development, validation, and required FDA regulatory activities to achieve a commercial product."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop in-house or industrial prototypes in government-managed programs to meet military and regulatory requirements for production and fielding."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Management Services Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "41.188"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.623"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.124"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.009"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.009"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TBI Diagnostic Assay System - Increment II (benchtop\/POC\/ Bandits)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Banyan BioMarkers, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alachua FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.208"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.208"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Impedance Threshold Device for the Treatment of Traumatic Brain Injury"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Advance Circulatory Systems, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Roseville, MN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.154"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.154"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.932"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.932"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ALL Product"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.931"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.083"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.850"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Freeze-dried plasma"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.778"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Point of Care Coagulation Profiler"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.385"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.385"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TBI Diagnostic Assay System - Increment II (benchtop\/POC\/ Bandits)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Banyan BioMarkers, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alachua FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.737"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.494"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.431"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Impedance Threshold Device for the Treatment of Traumatic Brain Injury"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Advance Circulatory Systems Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Roseville, MN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.322"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.626"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.626"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.948"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Compartment Syndrome Pressure Device"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Twinstar"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Minniapolis, MN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.871"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.871"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hydration Status Monitor"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Gaia Medical"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "LaJolla CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.841"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.841"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Noninvasive Neuromodulator TBI"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.036"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.298"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.298"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.334"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PTSD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.532"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.300"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.832"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Ocular Salvage Device"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.479"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.461"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.461"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.940"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Field Anesthesia"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.068"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.262"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.262"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.330"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Field Sterilizer"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.515"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.515"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "HemCon Medical Technologies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tigard, Oregon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.720"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Banyan BioMarkers, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alachua FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "31.514"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development of Platelet Derived Hemostatic agent"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Fast Track Drugs & Biologics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Frederick, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.800"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "No product\/contract costs greater than $1M individually."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Support Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "44.997"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.723"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.744"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.548"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.548"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "No product\/contract costs greater than $1M individually."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development T&E Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "36.993"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.721"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160773-10.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Ocular Salvage Device development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Noninvasive Neuro Assessment Device development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Intrathoracic Pressure Regulation Therapy"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Field Anesheesia"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FF4"
                    },
                    "ProjectTitle": {
                        "val": "Counterdrug, DDR, Sys Development & Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.400"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.400"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Supports the Secretary of Defense approved counterdrug advanced development efforts used in a major re-design of the Forensic Toxicology Drug Testing Laboratory (FTDTL) information management system used to test urine samples for the presence of illegal drugs. The Drug Testing Program - Client Collection System (DTP-CSS) is comprised of several variations of a desktop application used to select service members for random drug testing, prepare labels for urine specimen bottles, and print corresponding chain-of-custody documents. This Project will standardize DTP-CSS across all services and migrate it to a Web-based system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development and demonstration  of tracking laboratory urine samples used in drug testing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.400"
                                            },
                                            "Text": {
                                                "val": "Contract award pending."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS7"
                    },
                    "ProjectTitle": {
                        "val": "MEDEVAC Mission Equipment Package (MEP) - Adv Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.285"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.285"
                        },
                        "BudgetYearTwo": {
                            "val": "0.296"
                        },
                        "BudgetYearThree": {
                            "val": "0.296"
                        },
                        "BudgetYearFour": {
                            "val": "0.305"
                        },
                        "BudgetYearFive": {
                            "val": "0.315"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.497"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Medical Evacuation Enroute Care Validation Study is completed in Fiscal Year (FY) 2015. Products from this project transition to Program element (PE) 0604807A\/Project VS8 in FY 16."
                        },
                        "ProjectMissionDescription": {
                            "val": "Original models of Army Black Hawk Medical Evacuation (MEDEVAC) helicopters continue to play a major role in maintaining high United States (U.S.) troop survival rates in Iraq and Afghanistan by evacuating wounded troops in less than one-hour. In 2009 a Vice Chief of Staff, Army (VCSA)-approved force design update increased the number of air frames in the force from 12 to 15 aircraft for 37 MEDEVAC companies to better meet operational needs. In 2010, the U.S. Army Medical Department (AMEDD) accepted life-cycle management of the MEDEVAC Evacuation Package (MEP) from Program Executive Office (PEO)-Aviation. In order to achieve required operational capability and enhance commonality across the MEDEVAC fleet, the MEDEVAC MEP program upgrades, retrofits, trains, and sustains the 256 MEDEVAC legacy helicopters to achieve the medical capability provided by the HH-60M, which is factory built for the MEDEVAC mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Evacuation Development"
                                    },
                                    "Description": {
                                        "val": "This program will conduct Aeromedical Evacuation Cabin and Technology Research to determine the optimum space and configuration for performing necessary life-saving paramedic-level tasks. Program efforts will develop patient handling system components and prototypes to ensure paramedic skills and tasks are performed to standard to save Soldiers’ lives during point of injury MEDEVAC Missions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.285"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.285"
                                            },
                                            "Text": {
                                                "val": "Medical Evacuation Development: Aeromedical Evacuation Cabin and Technology Research will determine optimum space and configuration in order to perform necessary life-saving paramedic-level tasks. Will develop patient handling system components and prototypes to ensure paramedic skills and tasks are performed to standard to save Soldiers’ lives during point of injury MEDEVAC Missions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop in-house or industrial prototypes in government-managed programs to meet military MEDEVAC and regulatory requirements for production and fielding."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}