{
    "id": "2018-Army-PB-2040-JBOOK-4d642436f65ddc83c084fdb1d917f4809eff5a3f2d9cca01c78cf59a8dd3a26e-3",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602211A"
        },
        "ProgramElementTitle": {
            "val": "Aviation Technology"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "58.497"
            },
            "CurrentYear": {
                "val": "65.914"
            },
            "BudgetYearOne": {
                "val": "66.086"
            },
            "BudgetYearOneBase": {
                "val": "66.086"
            },
            "BudgetYearTwo": {
                "val": "61.846"
            },
            "BudgetYearThree": {
                "val": "63.583"
            },
            "BudgetYearFour": {
                "val": "63.915"
            },
            "BudgetYearFive": {
                "val": "65.222"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) conducts air vehicle component design, fabrication and evaluation to enable Army aviation transformation.  Emphasis is on developing aviation platform technologies to enhance manned and unmanned air vehicle combat and combat support operations for attack, reconnaissance, air assault, survivability, logistics and command and control missions.  Project 47A researches and evaluates components and subsystems for air vehicles in the areas of aviation and aircraft weapons technology.  Project 47B researches and evaluates components and subsystems for air vehicles in the areas of propulsion and structures.  Focus areas include: engines & drive trains; rotors & vehicle management systems; platform design & structures; aircraft & occupant survivability; aircraft weapons & sensors; maintainability & sustainability; and unmanned & optionally manned systems. \n\nWork in this PE contributes to the Army Science and Technology (S&T) air systems portfolio and is fully coordinated with efforts in PE 0603003A (Aviation-Advanced Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602303A (Missile Technology) and PE 0603710A (Night Vision Advanced Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy.  Work in this PE is performed by the Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC), located at Redstone Arsenal, AL; Joint Base Langley Eustis, VA; National Aeronautics and Space Administration (NASA) Ames Research Center, Moffett Field, CA; NASA Langley Research Center, Hampton, VA; and at the Army Research Laboratory (ARL), located at Adelphi, MD; Aberdeen Proving Ground, MD; Hampton, VA; and Cleveland, OH."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "56.884"
                },
                "CurrentYear": {
                    "val": "65.914"
                },
                "BudgetYearOne": {
                    "val": "65.902"
                },
                "BudgetYearOneBase": {
                    "val": "65.902"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "58.497"
                },
                "CurrentYear": {
                    "val": "65.914"
                },
                "BudgetYearOne": {
                    "val": "66.086"
                },
                "BudgetYearOneBase": {
                    "val": "66.086"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.613"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.184"
                },
                "BudgetYearOneBase": {
                    "val": "0.184"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.700"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.087"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.184"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.184"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "47A"
                    },
                    "ProjectTitle": {
                        "val": "AERON & ACFT Wpns Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "50.205"
                        },
                        "CurrentYear": {
                            "val": "56.159"
                        },
                        "BudgetYearOne": {
                            "val": "55.630"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.630"
                        },
                        "BudgetYearTwo": {
                            "val": "51.119"
                        },
                        "BudgetYearThree": {
                            "val": "52.642"
                        },
                        "BudgetYearFour": {
                            "val": "52.680"
                        },
                        "BudgetYearFive": {
                            "val": "53.756"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs and evaluates technologies for Army\/Department of Defense (DoD) vertical lift and unmanned air systems to increase strategic and tactical mobility\/deployability, improve combat effectiveness, increase aircraft and crew survivability; and improve combat sustainability. Areas of research address desired characteristics applicable to all aviation platforms, such as enhanced rotor efficiencies, improved survivability, increased structure and airframe capability, improved engine performance, improved sustainability, improved mission avionics performance, and reduced cost. This Project leverages work accomplished in collaboration with the National Aeronautics and Space Administration (NASA).  Technologies within this project transition to advanced technology development programs with application to future, as well as current, Army\/DoD aircraft systems.  \n  \nWork in this Project is fully coordinated with Program Element (PE) 0603003A (Aviation Advanced Technology) and work in this Project related to aircraft weapons integration is also fully coordinated with PE 0602624A (Weapons and Munitions Technology), PE 0602303A (Missile Technology), and PE 0603710A (Night Vision Advanced Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Aviation Development Directorate of the Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC), (located at the NASA Ames Research Center, Moffett Field, CA, NASA Langley Research Center, Hampton, VA; and Joint Base Langley Eustis, VA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "National Rotorcraft Technology Center (NRTC)"
                                    },
                                    "Description": {
                                        "val": "NRTC focuses government, United States (U.S.) rotorcraft industry, and academia resources on the development of pre-competitive, high-priority, military technology to maintain U.S. preeminence in rotorcraft capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.524"
                                            },
                                            "Text": {
                                                "val": "Conducted industry-collaborative research in rapid certification of complex aviation systems; extreme reliability; structural integrity; aeromechanics modeling, design, and analysis of complex systems; advanced vehicle management systems and controls; component design and analysis tools; and design of transmission and drives component technology for reduced rotorcraft procurement and sustainment costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.686"
                                            },
                                            "Text": {
                                                "val": "Will conduct industry-collaborative research in extreme reliability of aviation systems; structural integrity; aeromechanics modeling, design, and analysis of complex systems; advanced vehicle management systems and controls; component design and analysis tools; cargo handling and delivery; advanced aircraft mission systems; naval operations; and design of transmission and drives component technology for reduced rotorcraft procurement and sustainment costs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotors & Vehicle Management Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and investigate advanced airfoil and rotor blade technologies, including active control elements, to support goals of increased hover and cruise efficiency.  Design and evaluate advanced flight control and vehicle management component technologies to support goals of increased maneuverability, reliability, and reduced weight and cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.066"
                                            },
                                            "Text": {
                                                "val": "Developed and assessed high-fidelity computational models of complete rotorcraft for the aerodynamics and dynamics in both straight and level and maneuver flight. Completed last phase of downwash\/outwash flow field beneath a sub-scale rotor in hover parametric study to refine current physical understanding of the complex, non-linear, coupled, downwash\/outwash interactional flow field and enabled refinement of modeling and simulation tools using measured downwash\/outwash data. Developed innovative diagnostic techniques to measure and improve understanding of interactional aerodynamic phenomena. Integrated rotors and vehicle management system technologies to reduce rotor loads, reduce hub and airframe drag and improve vehicle performance. Conducted flight experiments of dual-lift flight control.  Integrated flight control and handling qualities analysis into Army preliminary design tools and NASA Design and Analysis of Rotorcraft (NDARC) for advanced rotorcraft configurations.  Conducted piloted handling qualities experiments toward new\/revised ADS-33 quantitative and qualitative criteria to address advanced rotorcraft concepts and missions supporting the Future Vertical Lift (FVL)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.795"
                                            },
                                            "Text": {
                                                "val": "Will apply and explore next generation airfoils, active flow control concepts, and advanced rotors and VMS technologies in benchtop, sub-scale and full-scale experiments to improve the current physical understanding of interactional aerodynamics to enable adverse force reduction necessary for high speed forward flight.  Will refine models and simulations relevant to advanced high speed, lift offset, and compound configurations.  Will continue development of innovative diagnostic techniques to measure and improve understanding of interactional aerodynamic phenomena.  Will continue to improve the accuracy and efficiency of high-fidelity computational fluid dynamics simulations on high-performance parallel computers; software will be optimized to efficiently scale on thousands of processors and new heterogeneous parallel computer hardware architectures; will develop new computational methods to automate the computational mesh generation and computational fluid dynamics solutions relevant to advanced aerodynamic vertical lift configurations.  Will publish validated flight control analysis, design, and optimization methods in the open literature.  Will extend Modernized Control Laws (MCLAWS) with mission adaptive autonomy (MAA).  Will refine and update flight control design methods and tools (CIFER, CONDUIT, RIPTIDE) as needed to support advanced high-speed configurations.  Will revise\/develop ADS-33 criteria for advanced high-speed configurations and missions based on Joint Multi-Role Technology Demonstrator (JMR TD) lessons learned."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.864"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.864"
                                            },
                                            "Text": {
                                                "val": "Will improve the accuracy and efficiency of high-fidelity computational fluid dynamics simulations on high-performance parallel computers including rotors and vehicles with active flaps, active flow control, and morphing surfaces; evaluate and optimize computational execution efficiency software on new heterogeneous parallel computer hardware architectures. Will conduct sub-scale testing of an advanced rotor design; will conduct benchtop and sub-scale testing of passive and active flow control concepts.  Will analyze JMR TD flight test data to assess and improve government simulation modeling methods for advanced configurations. Will apply advanced control allocation methods to a piloted simulation based on a JMR TD configuration. Will study flight control and handling-qualities issues associated with an advanced wing-compound configuration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft and Occupant Survivability Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate advanced technologies to reduce susceptibility and vulnerability of aircraft to damage from threats or accidents, as well as technologies to defeat small arms, rocket and missile threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.320"
                                            },
                                            "Text": {
                                                "val": "Developed and evaluated composite armor integrated into primary load bearing structure systems to improve conventional threat protection while reducing overall system weight. Evaluated passive and active energy attenuating devices integrated into primary structure to improve crashworthiness while reducing overall system weight. Conducted ballistic and crash experiments on lightweight composite armor components and energy attenuating devices to verify performance. Developed next generation ballistic, crash, and directed energy weapon protection and fuel containment technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.095"
                                            },
                                            "Text": {
                                                "val": "Will evaluate application of advanced systems\/subsystems and configurations that provide lightweight, high performance threat protection against non-conventional weapons to include directed energy.  Will continue to develop and evaluate active crash protection and crashworthy ballistic tolerant fuel containment systems for full spectrum crashworthiness.  Will continue to evaluate holistic survivability technology solutions through integrated survivability assessment trade studies for FVL concept aircraft.  These trades will include multi-layered survivability concepts with seeker\/guidance agnostic technologies to address operations in the emerging threat environment.  Will develop hardware, integrate, and investigate adaptive engine exhaust suppressor systems on an engine test stand to evaluate infrared (IR) signature and engine performance of the integrated system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.607"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.607"
                                            },
                                            "Text": {
                                                "val": "Will continue development of next generation advanced composite lightweight armor.  Will continue development of next generation lightweight ballistic tolerant crashworthy fuel containment systems.  Will continue development of crashworthiness subsystem devices that build on advanced crash protection concepts previously developed.  Initiate development of advanced fire management subsystems.  Will continue development of adaptive IR engine suppressor system to optimize aircraft performance and IR signature.  Will continue to develop signature management technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engine and Drives Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and evaluate advanced turboshaft engine component technologies to support goals of reduced fuel consumption, engine size, weight, and cost, as well as improved reliability and maintainability.  Design and evaluate advanced drive system component technologies to support multi-speed transmissions, lighter weight gearboxes, and reduced costs, while improving reliability and maintainability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.461"
                                            },
                                            "Text": {
                                                "val": "Performed the conceptual design and determined the benefits of advanced integrated engine controls technologies such as distributed controls and more electric controls for improved aviation system engine performance, weight, and maintainability; developed design of a smart, adaptable, and efficient sand filtration system for improved engine performance and durability; and designed drive train technologies with multi-speed (ability to vary shaft speed between 50 and 100%) to support development of next generation rotorcraft transmission and FVL objectives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.608"
                                            },
                                            "Text": {
                                                "val": "Will finalize the design of the smart, adaptable, and efficient sand filtration technology for improved engine performance and durability and begin fabrication of hardware for validation test; will investigate alternative adaptable engine architectures\/components in support of alternative concept engine and FVL objectives; will validate through experimentation drive train component technologies with multi-speed (ability to vary shaft speed between 50 and 100%) in support of next generation rotorcraft transmission and FVL objectives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.683"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.683"
                                            },
                                            "Text": {
                                                "val": "Will complete validation testing of smart, adaptable, and efficient sand filtration technology for improved engine performance and durability; complete investigation of alternative adaptable engine architectures in support of high performance alternative concept engine; investigate of alternative adaptable engine components in support of high performance alternative concept engine and FVL objectives; continue validation through experimentation drive train component technologies with multi-speed (ability to vary shaft speed between 50 and 100%) in support of next generation rotorcraft transmission and FVL objectives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Design & Structures Technologies"
                                    },
                                    "Description": {
                                        "val": "Enables new rotorcraft configurations by evaluating critical advanced aviation technologies using design and analysis methods with greater modeling fidelity with an ultimate goal of reducing the timelines associated with overall design of new aircraft.  Introduces high fidelity methodology for improved performance and design predictions earlier in the development and acquisition process. Use physics of failure modeling and coupled discipline analysis to drastically improve component and system reliability.  Work is coordinated with Aviation Component Failure Modeling efforts in PE 0602211, Project 47B at Army Research Laboratory (ARL)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.047"
                                            },
                                            "Text": {
                                                "val": "Continued enhancement of the Integrated Design Environment (IDE) for conceptual design of advanced rotary wing concepts with the addition of methodologies for airfoil design, signatures, operational impact of downwash\/outwash, stability & control, and design optimization and sensitivity analysis. Applied modeling and simulation tools to support design of FVL\/novel concepts and analysis of their operational feasibility. Enhanced probabilistic structural integrity and useful life analytical techniques through improved damage initiation and propagation models; developed and performed investigation of high-strain capable, multifunctional structures that offer improvements in structural efficiency and enable ultra-reliable, operationally durable designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.322"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop and mature robust analyses that use integrated physics and probabilistic based methods to assess and manage structural integrity; verify the performance of operationally durable airframe technologies and designs. Will begin integration of total survivability features into ultra-reliable, multifunctional structures to include multifunctional structural armor and crash protection solutions.  Will facilitate maturation of IDE."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.151"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.151"
                                            },
                                            "Text": {
                                                "val": "Will investigate and validate modeling and design tools to support development of future unmanned aerial vehicles.  Will conduct in-house and industry research in support of Next Generation Tactical Unmanned Aircaft Systems (NGTUAS) and other manned and unmanned aircraft concepts; will develop a draft Model Performance Specification (MPS) for NGTUAS. Will verify performance of multifunctional structures technologies for survivability though analysis and incremental testing; will continue to mature probabilistic based stress and service life analyses; will investigate advanced structural design and manufacturing techniques, including optimized smart structures and fastener-free joining methods.  Will initiate development of advanced damage tolerant electromechanical actuators to replace current generation hydraulic systems.  Will initiate development of energy optimized platform concepts and subsystems intended to maximize electric power availability while managing overall platform thermal loading and minimizing system level space, weight, and power burdens."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned and Optionally Manned Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and develop collaboration and cooperation algorithms to support goal of intelligent teaming for manned-unmanned operations.  Design and develop advanced unmanned aircraft system (UAS) components to support goal of improved small UAS performance.  When applicable, technologies in this area are leveraged to support mitigation of degraded visual environments (DVE)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.345"
                                            },
                                            "Text": {
                                                "val": "Investigated optimal human-machine visual, aural, and tactile interfaces for manned-unmanned teaming that support efficient mission execution and safe flight operations with high situational awareness for pilots and unmanned aerial system operators. Optimized plan-view and forward-looking synthetic and enhanced vision sensor information with symbology, aural, and haptic cueing that aids the helicopter pilot or operator in control of the helicopter in complex environments. Included close proximity flight in a simulation environment and developed technology for a simulation experiment.  Developed data fusion technologies of both on and off board sensors in a simulation environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.909"
                                            },
                                            "Text": {
                                                "val": "Will develop algorithms for increased autonomy applicable across a range of UASs including autonomous flight controls, behaviors to support tactical missions, open architectures, and contingency management to support mission execution independent of a constant data link to a ground control station.  Improvements to autonomous flight controls will support more reliable, more robust flight operations independent of a human operator or pilot, and enable improved mission capable UAS flight operations.  Will develop integration approaches between emerging multi-national open architecture frameworks and interfaces.  The open architecture approach is a key enabling technology to rapidly develop and transition new autonomous concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.446"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.446"
                                            },
                                            "Text": {
                                                "val": "Will mature autonomous flight control algorithms to support optionally manned helicopter flight operations.  Design and develop tube launched UAS components to support manned unmanned teaming (MUM-T) of UAS with both manned and unmanned ground vehicles, building towards an UASs on-demand capability.  Investigate system software and hardware architectures to make autonomous systems more resilient and adaptable to mission changes and system failures. Investigate multi modal cueing for increased situational awareness in all domains. Investigate management of aircrew workloads throughout mission execution, to include MUM-T."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Weapon & Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Design and develop innovative approaches for integrating advanced weapons and sensors on aircraft platforms, including smart dispensers, data transfer, and post-launch weapon communication."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.543"
                                            },
                                            "Text": {
                                                "val": "Developed sensor integration architecture and networking standards to enable the capability to quickly and easily integrate sensor systems on to Army aircraft, and to enable more seamless sensor and imaging data fusion.  Conducted lab based sensor networking and experimentation to verify the enhanced sensor integration and fusion capabilities.  Conducted a Common Gun study to determine the requirements and feasibility of a common gun system on FVL, Apache, and other Army aircraft systems, operating across a range of missions.  Continued to support AMRDEC Missile PE 0603313A, and Communications and Electronics Research, Development, and Engineering Center (CERDEC) Night Vision and Electronic Sensors Directorate (NVESD), PE 0603710A for the design and development of an organically launched sensor system that will be deployed from Army aircraft with a wide range of sensing capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.625"
                                            },
                                            "Text": {
                                                "val": "Will investigate image integration techniques for use in target location to reduce the sensor to shooter timeline and improve lethality.  Will investigate using current on-board sensors and advance weapons techniques to assess the potential supplement as an active protection system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.659"
                                            },
                                            "Text": {
                                                "val": "Will define, develop and evaluate concepts for acquiring, storing, preparing, exploiting and distributing sensor data to enhance situational awareness, reduce crew workload and increase mission effectiveness.  Will refine the components required for launching organic payloads off of aircraft wingstores.  Evaluate several air-to-air targeting algorithms intended to support advanced threat protection and counter UAS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintainability & Sustainability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop prognostic and system health assessment technologies to enable an enhanced Condition Based Maintenance (CBM) supportability structure and posture for application towards an ultra-reliable, low maintenance design approach that significantly reduces unscheduled maintenance, inspections and operations and sustainment costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.022"
                                            },
                                            "Text": {
                                                "val": "Investigated use of wireless communication technologies to reduce wiring weight associated with prognostics and diagnostics; Integrated health assessment technologies into Joint Common Architecture (JCA)\/avionics\/cockpit; developed fly-by-wire (FBW) with CBM monitoring capability; Developed miniaturized wireless sensors with on-component processing, history and parts tracking; Developed improved fleet management capability with autonomous logistics for parts\/production control; Investigated technologies for in-flight data transmission to ground."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.619"
                                            },
                                            "Text": {
                                                "val": "Will perform investigation of technologies and methodologies to enable more efficient designs and reduce the maintenance burden for future and current fleet of vertical lift aircraft. Will perform experiments of on-engine, adaptive engine controls to optimize performance, component life and maintenance schedule based on engine health. Will begin investigation of in-flight, real-time, automated methods to adjust rotor system track and balance to reduce aircraft vibration and loads. Will investigate improved failure detection within a planetary system, reduced size and weight impact of advanced sensor technologies, and a methodology to allow operations above maximum continuous rating for limited periods of time. Will investigate a proper level of autonomy to the condition assessment process for a composite airframe and provide decision support for repair decisions with a repair integrity assessment approach. Will continue development of a comprehensive integrated aircraft wide electrical system capability for diagnostics, fault isolation, and generate trendable health indicators.  Will continue investigation of reliability criteria for design tools, methodologies, and materials to facilitate the optimization of future rotorcraft designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.695"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.695"
                                            },
                                            "Text": {
                                                "val": "Will investigate efforts to improve component prognostics capability for aviation systems. Investigate sensor and maintainability technologies that enable improved prognostics for an improved and integrated aircraft system health monitoring and management capability. Will identify improved materials and processes that enhance system durability and reliability. Will determine fleet and logistics management data interface and transfer gained knowledge."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability For Degraded Visual Environment (DVE) Operations"
                                    },
                                    "Description": {
                                        "val": "Research advanced sensor and cockpit display technologies to provide ability to maintain terrain and obstacle situational awareness during aircraft induced (brown-out & white-out ) and environmentally induced (rain, snow, smog, fog, smoke, low light, etc.) DVE.  Work in this area is being done in coordination with efforts at Army CERDEC, PE 603710A, Night Vision Advanced Technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.177"
                                            },
                                            "Text": {
                                                "val": "Executed a second iteration of experimentation at United States Army Aeromedical Research Laboratory (USAARL) simulation facility (Fort Rucker, AL) focusing on symbology, tactile and aural technologies trades and optimization. Continued software algorithm and materiel component design and development for execution of sensor fusion involving laser detection and ranging (LADAR), radio detection and ranging (RADAR) and IR systems for two separate DVE Mitigation Program lines of effort. Executed system integration design and substantiation of two multi-modality sensor fusion packages; this includes mechanical, electrical and instrumentation packages, a \"best of breed\" symbology set for all modes of flight (landing, take-off, enroute), and appropriate advanced cueing tactile and aural elements that were identified in USAARL simulator experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "Will continue experimentation and development of MCLAWS to incorporate capability developments such as coupled flight, power management guidance, and sensor coupled optionally piloted flight. Will continue complex computing design studies to determine best open systems architecture to handle processing power requirements, data rates, and latency while retaining interface to existing and future architectures. Will complete two software algorithm and materiel component design and development lines of effort. Will develop sensor fusion efforts involving LADAR, RADAR & IR systems for Fiscal Year (FY) 2020 milestone DVE-M flight demonstration. Will refine a \"best of breed\" symbology set for all modes of flight (take-off, enroute, landing), and appropriate advanced cueing tactile and aural elements that were identified in USAARL simulator experiments; will develop intuitive cueing system that provides spherical situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.525"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.525"
                                            },
                                            "Text": {
                                                "val": "Will initiate MCLAWS Version 5 (V5) development; MCLAWS V5 will be the updated flight control laws for U.S. Army helicopters.  Begin to incorporate laboratory modeling and reconfiguring of Obstacle Field Navigation (OFN) and Safe Landing Area Determination (SLAD) into MCLAWS V5."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Congressional Add  - Flight Controls"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Text": {
                                                "val": "This is a congressional add that was moved from the Navy to the Army to fund applied research in flight controls to reduce pilot workload"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "47B"
                    },
                    "ProjectTitle": {
                        "val": "Veh Prop & Struct Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.292"
                        },
                        "CurrentYear": {
                            "val": "9.755"
                        },
                        "BudgetYearOne": {
                            "val": "10.456"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.456"
                        },
                        "BudgetYearTwo": {
                            "val": "10.727"
                        },
                        "BudgetYearThree": {
                            "val": "10.941"
                        },
                        "BudgetYearFour": {
                            "val": "11.235"
                        },
                        "BudgetYearFive": {
                            "val": "11.466"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates engine, drive train, and airframe enabling technologies such as multifunctional materials, fluid mechanics and high temperature, high strength, low cost shaft materials.  Additional areas of research include platform, aerodynamic, transmission, and control technologies for implementation in handheld autonomous Unmanned Aerial Systems (UAS) and failure analysis and prediction models and techniques to support a \"zero maintenance helicopter\" concept.  \n\nWork in this Project complements and is fully coordinated with Program Element (PE) 0603003A (Aviation Advanced Technology) and leverages basic research performed in PE 0601104\/Project H54 (Micro Autonomous Systems Technology Collaborative Technology Alliance) and PE 0601104\/Project H09 (Robotics Collaborative Technology Alliance).\n \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n \nWork in this Project is performed by the Army Research Laboratory (ARL) at the National Aeronautics and Space Administration (NASA) Glenn Research Center, Cleveland, OH, the NASA Langley Research Center, Hampton, VA, and the Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rotor and Structure Technology"
                                    },
                                    "Description": {
                                        "val": "Devise improved tools and methodologies to more accurately design for improved component reliability and durability, resulting in platforms that are lighter in weight and less costly to acquire and maintain.  Investigate rotors and structures to significantly improve rotorcraft range and speed."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.483"
                                            },
                                            "Text": {
                                                "val": "Design and develop smart materials that can self-sense, self-heal and self-reconfigure to facilitate damage\/health assessment of aviation component structures; evaluate material\/component damage sensing strategies; conduct modeling and simulation of damage detection; and investigate data fusion techniques for assessing material\/component failure in aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.589"
                                            },
                                            "Text": {
                                                "val": "Will capture material damage precursors using test coupons in a laboratory environment for aircraft structural materials; develop a computational tool to calculate the optimum flight path of multi-rotor rotorcraft in auto-rotative flight, and validate the predictions of the tool by comparing to higher-fidelity methods for steady autorotation or empirical measurements to establish fast engineering computational tools to examine and advance optimum flight paths for next generation Army rotorcraft; use established co-axial computational model(s) to assess technologies, including active flow control, structural shape morphing, and blade pitch control, for potential increase in maximum flight speed with the same safety margins; apply models to assess performance improvement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.340"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.340"
                                            },
                                            "Text": {
                                                "val": "Will develop an efficient computational, structural fatigue method to predict the growth of small cracks or even earlier material damage indicators relevant to Army aviation; will conduct experiments to verify the fatigue method and improve the accuracy predictions for remaining structural fatigue life.  Will develop a computational model of a co-axial rotor system to understand the fundamental interactions between counter-rotating rotors and their effects on transient hub loads and rotor blade defections."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Vehicle Propulsion and Power Technology (previously tittled: Engine and Drive Train Technology)"
                                    },
                                    "Description": {
                                        "val": "Applied research investigating engine and drivetrain technologies for Army manned-and-unmanned air vehicles.  Research, investigates, and conducts experiments to develop, innovate, and validate advanced models and improved methods for propulsion system components and configurations to enable improvements in power density, efficiency, reliability and life cycle cost for increasing performance and capabilities of Army aviation systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.117"
                                            },
                                            "Text": {
                                                "val": "Investigated coupled physics-based probabilistic design of ultra-lightweight hybrid gear; validated component modeling on extended design space for variable-speed turbine; and investigated novel micro injector technology for UAS engines using both analysis and modeling to mature optimization tools for efficient fuel combustion to increase UAS mission capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.678"
                                            },
                                            "Text": {
                                                "val": "Will investigate the performance of an ultra-lightweight hybrid gear under simulated load conditions and compare it with state-of-the-art metal gears to assess its potential applicability to future Army vertical lift vehicles; investigate the potential of a new class of high temperature shape memory alloys and other active and passive smart materials to enable shape changing turbine airfoils to allow blade optimization for aerodynamic performance and thermodynamic enhancements which could result in improved fuel consumption for Army vertical lift vehicles. Will also investigate injection technologies, micro nozzle and outward opening nozzles, that offer the potential to shorten liquid fuel penetration length and increase the rate of fuel injection at lower fuel pressures, to realize heavy-fuel operated small UAS and man portable generator engines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.538"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.538"
                                            },
                                            "Text": {
                                                "val": "Will investigate and conduct experiments on engine and drivetrain technologies to enable improved performance and reduced maintenance costs for Army vehicles including (a) performance of a centrifugal compressor vaneless diffuser; (b) a variable area fuel injection nozzle concept for improved control of fuel quantity and jet penetration; (c) innovative active and passive articulating turbine rotor and stator blade mechanism concepts; (d) research in ceramic matrix composite (CMC) turbine blades; (e) representation learning and model-assist diagnostic techniques for early damage detection in high-performance flight-critical powertrain gearing"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Micro\/Small Scale Unmanned Aerial Systems"
                                    },
                                    "Description": {
                                        "val": "Investigate platform, aerodynamic, actuation, transmission, and control technologies for handheld autonomous UAS. Handheld autonomous UAS will provide small units with significantly increased tactical mobility and deployability by extending soldier perception to real-time local Intelligence, Surveillance, and Reconnaissance (ISR) with handheld organic assets that help to minimize the supporting infrastructure needed for deployment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.717"
                                            },
                                            "Text": {
                                                "val": "Investigated a span-adaptive wing which yields relatively consistent performance across its span range while responding to slowly varying conditions in a wind tunnel; and validated with low degree-of-freedom surrogates, energy conservative behaviors inspired from biology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.488"
                                            },
                                            "Text": {
                                                "val": "Will incorporate span adaptation in a closed-loop responding to sensory or operational inputs; assess measures of effectiveness for three-dimensional (3D) printed Unmanned Aeriel Vehicles (UAVs) validated by analysis under controlled conditions and develop and assess a tradespace analysis methodology to enable design of scaleable UAV platforms that takes into account different size platforms and specific missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.073"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.073"
                                            },
                                            "Text": {
                                                "val": "Will incorporate span adaptive wing structure into flight body, create appropriate flight behaviors, and assess resultant contribution to energy efficient yet agile flight. Will use experimentally collected data to validate and improve mission driven analytical UAV technology trade space tools. Will develop physics-based analytical tools for assessing performance impacts of multi-material technologies for UAVs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation Component Failure Modeling"
                                    },
                                    "Description": {
                                        "val": "Develop failure analysis and prediction models and techniques to support a \"zero maintenance helicopter\" concept.  Work is coordinated with Aviation component and system reliability efforts in PE 0602211A \/ Project 47A at the United States (U.S.) Army Aviation and Missile Research, Development and Engineering Center."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.975"
                                            },
                                            "Text": {
                                                "val": "Developed the Virtual Risk-informed Agile Maneuver Sustainment (VRAMS) concept, which evaluates technologies to autonomously provide state awareness at the material level and automate stress-reduction methods; investigate a “virtual reality” concept for self-diagnostics of real-time material state and automated solutions for self-directed maneuver alternatives in real-time. This effort will enables fatigue-free and zero-maintenance aircraft components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will conduct nonlinear failure analysis; perform physics-based modeling; and determine analytical methods to utilize material damage precursors to assess remaining useful life for aviation structural components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.002"
                                            },
                                            "Text": {
                                                "val": "Will develop a more efficient probabilistic and risk assessment method that can predict aviation component failure as damage is initially detected and continues to progress."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed & Efficient Vertical Take-off and Landing"
                                    },
                                    "Description": {
                                        "val": "Perform Vertical Take-Off and Landing (VTOL) research investigations in propulsion, aeromechanics and platform technologies to explore, innovate and combine the most promising technologies to enable more efficient hover, high-speeds, and greater maneuverability at longer ranges for Army aviation.  Reconfigurable and adaptive technologies include hover rotor systems that can achieve high speed, low drag; aerodynamic lift technologies capable of higher speed and efficient cruise; and convertible propulsion technologies to deliver more efficient hover and higher speed cruise power."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.503"
                                            },
                                            "Text": {
                                                "val": "Will investigate and develop active and passive technologies for structural damping augmentation to overcome structural performance limitations by developing physics-based mathematical models to enable higher fidelity analysis for concept assessment and capability projection.  Will investigate engine cycle and powertrain configuration concepts that enable propulsors for efficient hover and high speed cruise."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}