{
    "id": "2018-Army-PB-2040-JBOOK-8aa6116a07f4d60601a05c4a1332e7f28609a7e32c0f8c7666562466c33015eb-49",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0708045A"
        },
        "ProgramElementTitle": {
            "val": "End Item Industrial Preparedness Activities"
        },
        "R1LineNumber": {
            "val": "230"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "58.503"
            },
            "CurrentYear": {
                "val": "62.287"
            },
            "BudgetYearOne": {
                "val": "60.877"
            },
            "BudgetYearOneBase": {
                "val": "60.877"
            },
            "BudgetYearTwo": {
                "val": "59.083"
            },
            "BudgetYearThree": {
                "val": "61.671"
            },
            "BudgetYearFour": {
                "val": "62.889"
            },
            "BudgetYearFive": {
                "val": "64.419"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "429.729"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) develops and demonstrates manufacturing processes that enable improvements in producibility and affordability of emerging and enabling components and subsystems of Army air, ground, Soldier, medical, and command\/control\/communications systems.  Initiatives within the PE result in cost savings and reduced risk of transitioning military-unique manufacturing processes into production.  Project E25 fosters the transfer of new\/improved manufacturing technologies to the industrial base, including manufacturing efforts that have potential for high payoff across the spectrum of Army systems. \n\nWork in this PE is related to, and fully coordinated with, PE 0603710A (Night Vision Advanced Technology), PE 0602303A (Missile Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602601A (Combat Vehicle and Automotive Technology), and PE 0603005A (Combat Vehicle and Automotive Advanced Technology) and PE 0602705A (Electronics and Electronic Devices).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM) and efforts are executed by the Army Research Laboratory (ARL) and appropriate Army Research, Development, and Engineering Centers (RDECs)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.422"
                },
                "CurrentYear": {
                    "val": "62.287"
                },
                "BudgetYearOne": {
                    "val": "61.300"
                },
                "BudgetYearOneBase": {
                    "val": "61.300"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "58.503"
                },
                "CurrentYear": {
                    "val": "62.287"
                },
                "BudgetYearOne": {
                    "val": "60.877"
                },
                "BudgetYearOneBase": {
                    "val": "60.877"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.919"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.423"
                },
                "BudgetYearOneBase": {
                    "val": "-0.423"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.919"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.441"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.441"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.018"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "E25"
                    },
                    "ProjectTitle": {
                        "val": "Mfg Science & Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "46.503"
                        },
                        "CurrentYear": {
                            "val": "62.287"
                        },
                        "BudgetYearOne": {
                            "val": "60.877"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.877"
                        },
                        "BudgetYearTwo": {
                            "val": "59.083"
                        },
                        "BudgetYearThree": {
                            "val": "61.671"
                        },
                        "BudgetYearFour": {
                            "val": "62.889"
                        },
                        "BudgetYearFive": {
                            "val": "64.419"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "417.729"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project develops and demonstrates manufacturing processes that enable improvements in producibility and affordability of emerging and enabling components and subsystems of Army air, ground, lethality, Soldier, medical and command\/control\/communications\/intelligence systems. Focus is on components and subsystems such as advanced armor, power and energy devices, rotors, sensors, displays, propellants and gun tubes. In addition, work is conducted to advance the state of the art in processing and fabrication techniques for coatings, multifunctional materials and structural elements for Army specific applications.\n\nWork supports all Army S&T portfolios. Work in this PE is related to and fully coordinated with PE 0602105A (Materials Technology), PE 0602211A (Aviation Technology, PE 0602303A (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0603003 (Aviation Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology) and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy.   \n\nWork in this Project is performed by the Army Research, Development and Engineering Command (RDECOM) and efforts are executed by the Army Research Laboratory (ARL) and appropriate Army Research, Development and Engineering Centers (RDECs)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Systems"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable manned and unmanned aircraft components and subsystems. Work focuses on addressing challenges in areas such as engine performance and life, ballistically tolerant fuel bladders and composite transmission sumps, reliable component integration\/attachment, structural durability at low weight, and reduced corrosion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.598"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and tested improved manufacturing techniques and tooling for ballistically tolerant fuel bladders; developed direct digital manufacturing processes for production of high value propulsion and power generation gas turbine engine components for improved performance and weight savings; developed AH-64 composite sump alternate design and manufacturing processes to reduce cost and improve performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.401"
                                            },
                                            "Text": {
                                                "val": "Will complete component and engine testing of additively manufactured articles resulting in increased performance and reduced weight of the T700 platform; will transition three prototype AH-64 composite sumps of reduced weight and cost to PM Apache along with associated manufacturing metrics; will complete the demonstration of manufacturing techniques and tooling for ballistically tolerant fuel bladders including fit check, drop testing , pressure test, slosh & vibe tests on full scale article."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.557"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.557"
                                            },
                                            "Text": {
                                                "val": "Will transition to UHPO for qualification testing direct digitally manufactured helicopter engine components of additively manufactured articles resulting in increased performance and reduced weight of the T700 platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Maneuver"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for tactical and combat vehicles and weapons systems. Work focuses on addressing challenges in areas such as advanced armor, gun barrel life, insensitive propellants, precision munitions and vehicle power devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.480"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and transitioned improved machining and post-processing techniques to improve the yield and decrease the cost of tungsten-based warhead penetrators; transitioned a multi-threat armor manufacturing capability to TRADOC Maneuver Centers of Excellence to inform requirements and to TARDEC to support Combat Vehicle Prototyping and Future Fighting Vehicle; developed equipment for pultrusion of 2D ceramic tile-based armors, matured automated material consolidation techniques for vehicle armor solutions; developed and demonstrated gear machining and finishing processes and optimized assembly processes to increase throughput and yield while decreasing the cost for power-take-off systems; optimized and demonstrated improved assembly processes resulting in improved quality control, reduced assembly times and re-work issues, increased throughput and reduced cost of fuel cells for ground vehicle and soldier-born applications; demonstrated mature Wide-Band Gallium Nitride MMIC (Monolithic Microwave Integrated Circuit) manufacturing process in the application of weapon system arrays; continued with manufacturing capability development using magnesium to enable more affordable lightweight weapon components; developed an economical mass production process for 7.62mm Advanced Armor Piercing (ADVAP) tungsten carbide penetrators with complex geometry systems; developed and tested a family of coating materials and application processes for low cost infrared signature management solutions; researched development of a scaled up process to produce high energy density safe 5 volt lithium-ion batteries; investigated development of a manufacturing pilot line capability for adaptive armor modules; developed lower cost material fabrication processes and superior material performance as insulation for rocket nozzles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.221"
                                            },
                                            "Text": {
                                                "val": "Will conduct pilot line fabrication of ceramic tile-based armors utilizing automated material consolidation techniques for vehicle armor solutions; will demonstrate and transition a gear machining pilot line capability at MRL 8 associated with cost-effective power-take-off systems to PM-ABCT; will demonstrate magnesium alloy manufacturing processes, to include additive manufacturing, on novel vehicle and small arms components; will demonstrate, validate and implement an instrumented bullet assembly process for producing XM1158 projectiles; will mature final formulations, confirm batch productions, and perform validations of paint products used for infrared management solutions; will mature a cathode coating process and enhance electrolyte optimization in the production of high energy density safe 5 volt lithium-ion batteries; will continue maturation of a manufacturing line and associated processes for adaptive protection modules; will demonstrate an automated, optimized and flexible process for manufacturing light weight, longer lasting aluminum Metal Matrix Composites (MMC); will demonstrate an agile manufacturing cell capable of efficiently welding thicker plate materials for improved protection for armored multi-purpose vehicle and other vehicles; will mature a lithium-ion battery assembly line leveraging multiple battery form factors leading to reduced cost and increased throughput; will complete the manufacturing process and demonstration maturity of Wide-Band Gallium Nitride MMIC’s for non-lethal weapon systems arrays."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.244"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.244"
                                            },
                                            "Text": {
                                                "val": "Will fabricate hatch and ramps for demonstration on selected vehicles, document and transition magnesium alloy ballistic specifications; will demonstrate a cathode coating process and enhanced production of high energy density safe 5 volt lithium-ion batteries for use in Army ground vehicle systems; will prove out and deliver a manufacturing line and associated processes for adaptive protection modules; will transition improved rocket nozzle insulation processes to PM Precision Fires; will construct an agile manufacturing cell and sensor suite to demonstrate efficient welding of thicker plate materials used for armored multi-purpose and other vehicles; will continue development of a lithium-ion battery pilot line leveraging multiple battery form factors leading to reduced cost and increased throughput; will research novel joining technology processes that will replace existing steel components leading to lighter heavy combat vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethality (Formerly Precision Munitions and Armament Systems)"
                                    },
                                    "Description": {
                                        "val": "The Lethality Systems focus area consists of Advanced Weapon Systems, Fire Control, Logistics, Emerging Technologies and Advanced Energetics and Warheads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.408"
                                            },
                                            "Text": {
                                                "val": "Validated the manufacturing process to reduce the cost and time associated with applying Ta-10W liners for 7.62mm and 50 caliber chromium-free gun barrels; demonstrated selected high volume, cost effective, manufacturing processes for micro-electro-mechanical systems (MEMS) scale safe-and-arms components; demonstrated and transitioned processing parameters for loading new ALIMX-101 reduced-sensitivity melt-pour and auxiliary charge explosive systems; developed an affordable manufacturing solution for complex missile seeker components that will shape the missile industry towards cost effective all weather seekers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.235"
                                            },
                                            "Text": {
                                                "val": "Will define manufacturing methods for new imaging technologies associated with the development of affordable multi-mode, all weather missile seekers; will characterize thermal and mechanical pre-impregnated material properties of rocket nozzle insulation; will mature an automated, scaled-up manufacturing process for programmable initiators addressing requirements for Family of Scatterable Munitions (FASCAM); will demonstrate a cost-effective, high throughput, Spark Plasma Sintering process to reduce cost and lead-times for large caliber cannon broaches and ordnance metal cutting tools; will demonstrate an additive manufacturing process capable of printing energetic inks for next generation hand grenades and small munitions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.100"
                                            },
                                            "Text": {
                                                "val": "Will improve manufacturing methods, conduct materials analysis and demonstrate more efficient production processes that enable multi-mode missile seekers; will build and test prototype programmable initiators of an automated, scaled-up manufacturing process addressing requirements for Family of Scatterable Munitions (FASCAM); will develop smart tooling and process models of a software based module capable of aiding production engineers across the organic industrial base and S&T community to verify and implement best value part manufacturing programs; will fabricate disk components and test components to demonstrate spark plasma sintering process to reduce costs and lead times for large caliber cannon broach cutting tools; will demonstrate processes on internal components that validate suitable energetic inks in the production of next generation hand grenades and small munitions; will mature the manufacturing processes for the fabrication of small format liquid reserve batteries which support small to medium caliber munitions and hand emplaced munitions; will mature waterjet milling to produce the rifling in large caliber cannon tubes in order to replace the expensive broaching process; will investigate advanced manufacturing techniques for small caliber lightweight cartridge cases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command, Control, Communications and Intelligence Systems"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for intelligence, surveillance, reconnaissance and targeting systems, mission command systems, electronic warfare and improved explosive device detect\/defeat systems. Work focuses on addressing challenges in areas such as large format multi-color focal plane arrays, flexible displays, night vision sensors, target detectors, advanced antennas and sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.850"
                                            },
                                            "Text": {
                                                "val": "Executed pilot line runs and refined manufacturing process to reduce cost and power of miniaturized short-wave infrared cameras; demonstrated manufacturing processes to fabricate low-defect, flexible digital radiography panels and electronics for system demonstration; investigated design revisions for cost-effective manufacturing techniques of high definition cameras for sniper weapon sights and ground vehicles; developed and improved yield of packaging processes for millimeter wave devices used in radio frequency threat warning applications in air combat platforms; optimized manufacturing processes to improve yield and capability of large format longwave, dual -band infrared focal plane arrays for vision systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.159"
                                            },
                                            "Text": {
                                                "val": "Will refine manufacturing process and conduct qualification lot runs in the fabrication of infrared sensors used in the application of low-cost, miniaturized short-wave infrared cameras; will complete yield improvement processes and production qualifications of focal plane arrays applicable to high definition cameras for sniper weapon sights and ground vehicles; will mature millimeter wave packaging improvements to include module development and antenna\/module interface advancements of devices used in radio frequency threat warning applications in air combat  platforms; will transition a production-ready, high yield manufacturing process for large format longwave, dual -band infrared focal plane arrays for vision systems; will mature a manufacturing process to produce ultra-thin, lightweight, wide-band conformal antennas; will conduct optimization for 3D, read-only integrated circuit manufacturing process resulting in sensors with improved sensitivity and dynamic range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.678"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.678"
                                            },
                                            "Text": {
                                                "val": ": Will transition improved processes for 12um focal plane arrays used in high definition cameras to PM-SSL; will deliver to PM ASE millimeter wave packaging improvements to include module development and antenna\/module interface advancements of devices used in radio frequency threat warning applications in air combat platforms; will continue optimization of a manufacturing process to produce ultra-thin, lightweight, wide-band conformal antennas; will continue refining and validating a 3D, read-only integrated circuit manufacturing process resulting in sensors with improved sensitivity and dynamic range; will improve assembly processes utilizing epoxies that resist high shocks & temperature cycling for weapon boresight systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Systems"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for combat feeding, aerial delivery of supplies, expeditionary basing, Soldier-borne sensors, clothing and protective equipment. Work focuses on addressing challenges in areas such as multifunctional fabrics for shelters, uniforms and portage equipment; affordable, non-contaminating packaging for rations; and lightweight materials for body armor."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.730"
                                            },
                                            "Text": {
                                                "val": "Developed improved processing  techniques to optimize mechanical properties of consolidated polyethylene films; demonstrated improved manufacturing processes to lower costs and achieve high volume production of the lower-cost flame retardant materials with biocidal modular insulation panels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.370"
                                            },
                                            "Text": {
                                                "val": "Will develop and demonstrate a full scale manufacturing pilot along with test articles (flat panels, helmets, and torso plate prototypes) developed from polyethylene films; will optimize and transition a high-volume pilot manufacturing process for lower-cost flame retardant materials with biocidal modular insulation panels to PM Force Sustainment Systems; will mature a scaled-up, low cost , high yield, high throughput manufacturing process of gallium arsenide based solar cells enabling light weight, portable Soldier power sources; will mature a manufacturing process for low cost augmented reality eyepieces that provide the Soldier with high resolution imagery across a wide field of view for increased situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.554"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.554"
                                            },
                                            "Text": {
                                                "val": "Will transition to Soldier protection systems programs of record a full scale manufacturing pilot line developed for polyethylene films; will build a continuous reactor to demonstrate high yield manufacturing processes for gallium arsenide based solar arrays for portable Soldier power sources; will refine manufacturing processes in the production of low cost augmented reality eyepieces that provide the Soldier with high resolution imagery across a wide field of view for increased situational awareness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovation Enablers (Formerly Advanced Manufacturing Initiatives)"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for affordable model based manufacturing, network centric manufacturing data environments, collaborative manufacturing modeling and simulation, and advanced manufacturing technologies. Work focuses on addressing challenges in areas such as 3D technical data packages for armor systems; providing digital manufacturing capabilities to depots and laboratories, processes and models for data transfer and prototype production; and advanced laser manufacturing techniques for repairing components.."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.837"
                                            },
                                            "Text": {
                                                "val": "Demonstrated digital data driven manufacturing of prototype systems, deployed the use of standard machine language and protocols to monitor machine performance to predict quality issues and optimize production rates for high-volume items, and established and demonstrated the use of a common machine tool library for cross-Army utilization; developed and applied novel additive manufacturing techniques for validated repair procedures for selected high value aviation components; developed flexible and agile grenade specific manufacturing processes utilizing 2D and 3D printing and additive manufacturing technologies as applied to energetic materials with integrated electronics; developed and demonstrated additive fabrication and reclamation processes for use on Army components; expanded existing MBE efforts in techniques to capture, standardize and reuse tech data across weapon system product life cycles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.301"
                                            },
                                            "Text": {
                                                "val": "Will mature application of dissimilar metals for repaired aviation components, integrating in-process quality assurance methods and procedures to maximize reliability of high-value aviation components; will demonstrate and deliver processes and tooling requirements of 2D and 3D additively manufactured energetics and electronics for use in 40mm grenades; will begin the transfer of a laser enhanced net shaping (LENS) repair process to Anniston Army Depot in the qualification and reclamation of Army components; will mature Model Based Enterprise tools which include legacy technical data package updating, forensic manufacturing, and integration of DoD\/Army requirements; will demonstrate a software based module capable of aiding production engineers across the organic industrial base and S&T community to verify and implement best value part manufacturing programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.643"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.643"
                                            },
                                            "Text": {
                                                "val": "Will complete delivery to PM MAS processes and tooling requirements of 2D and 3D additively manufactured energetics and electronics for use in 40mm grenades; will demonstrate a laser enhanced net shaping repair process at Anniston Army Depot for the qualification and reclamation of Army components; will perform modeling and simulation for cold spray repair processes to reduce the sustainment cost of Army weapon systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable process methods in addressing manufacturing of lighter weight multi-functional materials, biotechnology, vaccines, medical equipment power sources, and component ruggedization that directly address Soldier rehabilitation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Researched development of a modernized, scaled-up production process addressing spray drying and encapsulation methods of the Adenovirus vaccine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a modernized, scaled-up production process addressing spray drying and encapsulation methods of the Adenovirus vaccine."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.101"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.101"
                                            },
                                            "Text": {
                                                "val": "Will produce test batches in the development of a modernized, scaled-up production process addressing spray drying and encapsulation methods of the Adenovirus vaccine."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Not applicable for this item."
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.018"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.018"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.018"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "185.418"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "46.503"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "62.287"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "60.859"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "60.859"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "355.067"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160781-29.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "N\/A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EA2"
                    },
                    "ProjectTitle": {
                        "val": "MANTECH INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This effort accelerates manufacturing technology for more affordable electronic warfare, communications and sensors systems components and subsystems to include radio frequency amplifiers, antennas, and focal plane arrays.  This effort accelerates and supplements manufacturing technology for more affordable components and subsystems for tactical and combat vehicles and weapon systems. Work focuses benefit from working to develop and scale up the manufacturing process for nano-tungsten carbide powders and high-volume single-crystal tungsten rod manufacturing processes.  This effort accelerates and supplements manufacturing technology for more advanced manufacturing and enterprise solutions. Work focuses on accelerating model based manufacturing to specific organic Army facilities and novel ways of applying additive manufacturing and monitoring material powder beds and process controls during additive manufacturing part build for weapon system components."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Interest Item funding for Mantech Initiatives."
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.000"
                                        },
                                        "Text": {
                                            "val": "Developed and matured pixel design & processing capabilities for III-V dual-band midwave\/longwave infrared focal plane arrays; established an additive manufacturing technology capability\/process necessary to fabricate RF amplifiers for electronic warfare applications; accelerated techniques for metaferrite material deposition to enable earlier manufacturing maturation of ultra-thin antennas for communications systems.  Utilized nano-tungsten carbide to demonstrate processes to produce higher performance penetrators for next generation small caliber ammunition; demonstrated tungsten single crystal processes for kinetic energy ammunition.  Accelerated development of an inspection system for deposition metal laser sintering additive manufacturing process in conjunction with Army ManTech ongoing efforts; investigated and demonstrated model based engineering processes to advance Rock Island Arsenal’s design\/build\/repair capability; developed an additive manufacturing production process for the 40mm low velocity training round and M320 grenade launcher."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}