{
    "id": "2018-AirForce-PB-3600-MJBOOK-3-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-82",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "1203699F"
        },
        "ProgramElementTitle": {
            "val": "Shared Early Warning (SEW)"
        },
        "R1LineNumber": {
            "val": "314"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.845"
            },
            "CurrentYear": {
                "val": "6.366"
            },
            "BudgetYearOne": {
                "val": "1.373"
            },
            "BudgetYearOneBase": {
                "val": "1.373"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "1.251"
            },
            "BudgetYearThree": {
                "val": "1.274"
            },
            "BudgetYearFour": {
                "val": "1.296"
            },
            "BudgetYearFive": {
                "val": "1.322"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.849"
                },
                "CurrentYear": {
                    "val": "6.366"
                },
                "BudgetYearOne": {
                    "val": "1.369"
                },
                "BudgetYearOneBase": {
                    "val": "1.369"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.845"
                },
                "CurrentYear": {
                    "val": "6.366"
                },
                "BudgetYearOne": {
                    "val": "1.373"
                },
                "BudgetYearOneBase": {
                    "val": "1.373"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.004"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.004"
                },
                "BudgetYearOneBase": {
                    "val": "0.004"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.004"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.004"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674838"
                    },
                    "ProjectTitle": {
                        "val": "Shared Early Warning System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.845"
                        },
                        "CurrentYear": {
                            "val": "6.366"
                        },
                        "BudgetYearOne": {
                            "val": "1.373"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.373"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.251"
                        },
                        "BudgetYearThree": {
                            "val": "1.274"
                        },
                        "BudgetYearFour": {
                            "val": "1.296"
                        },
                        "BudgetYearFive": {
                            "val": "1.322"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "- In FY 2017, funding increased $4.951M to conduct an analysis of alternatives for potential replacement of the North Warning System (NWS); funding request resumes normal development for SEW in FY 2018.\n\n- In FY 2018, PE 0308699F, Shared Early Warning (SEW) efforts were transferred to PE 1203699F, Shared Early Warning (SEW) due to the creation of a new Major Force Program for Space.  FY 2016 and FY 2017 funding is now documented in the exhibits for PE 1203699F.  This is not a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Shared Early Warning System (SEWS) is the result of Presidential foreign policy initiatives which began in 1996.  The SEWS continues to provide Theater Combatant Commanders and foreign nation customers direct operational benefit by improving the architectural design and equipment thereby providing enhanced mission capabilities (i.e., expanded coverage, emerging capability integration, etc.).  Foreign customer arrangements are negotiated with individual countries on a bilateral basis to provide selected region-specific missile warning information.  SEWS Integration and Test facility is kept current by enhancing systems to improve analysis of real world events.  To enhance mission capability the SEWS program tests message format updates, cross domain solution updates, mandatory crypto upgrades, SEWS integration with other warning systems, and the transition to \"coalition-based\" warning.\n\nActivities also include studies and analysis to support both current program planning and execution and future program planning.  \n\nThe North Warning System (NWS) is composed of 1970s era radar systems.  The existing radar technology is quickly approaching obsolescence with regards to future threats.\n\nIn FY 2017, NWS analysis of alternatives was a new start.\n\nIn FY 2018, PE 0308699F, Shared Early Warning (SEW) efforts were transferred to PE 1203699F, Shared Early Warning (SEW) due to the creation of a new Major Force Program for Space.  FY 2016 and FY 2017 funding is now documented in the exhibits for PE 1203699F.  \n\nBA7 - This program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Shared Early Warning System (SEWS)"
                                    },
                                    "Description": {
                                        "val": "Development of SEWS common architecture and SEWS initiatives as identified by theater commanders."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.845"
                                            },
                                            "Text": {
                                                "val": "- Evaluated Combatant Command (CCMD) Joint Staff validated requirements and integrated derived requirements into plans for SEWS component enhancements like Radiant Mercury (RM) Common Message Format (CMF) rule development, new CMF data parsing capability, transition of receiver and data recording equipment to CMF formats\n- Completed the One-to-Many Force Protection Tiered Notification System (FPTNS) rule set development, accreditation and testing for Central Command (CENTCOM).  Cross Domain Solution (CDS) was fielded, accredited and first implementation with one of the CENTCOM partners completed and tested\n- Completed the development of enhanced SEW architecture to facilitate the integration and correlation of infrared\/radar missile tracks in SEW Global Command and Control System - Joint (GCCS-J) for a single integrated missile picture supporting the partner SEW sites and CCMD SA sites and Centralized Distribution Facility (CDF)\n- Integrated United States European Command (EUCOM) partner SEW-Radar (SEW-R) data into the CDF and developed recording and playback capability to test and evaluate performance of GCCS-J Kinematic Correlation capability with real Link-16 radar tracks\n- Developed CMF parser and rule set for CENTCOM partners and tested RM 5.1 performance with Common Message Format (CMF) data received from the new Common Interactive Broadcast (CIB)\n- Developed RM ruleset and tested a SEW JREAP-B data interface to a SEW partner missile defense system to eliminate current legacy formats used for this interface\n- Conducted testing and provided developer with software problem reports for Tactical Receive Suite (TRS) 4.0 CMF data filtering capability\n- Conducted testing of TRS Dashboard 5.0 beta software implementing a new CMF data record and playback capability required to test new RM 5.1 CMF rulesets and SEW GCCS-J\n- Developed infrastructure and ruleset to provide a SEW Sensitive But Unclassified (SBU) data feed for a partner country"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.415"
                                            },
                                            "Text": {
                                                "val": "- Investigate and evaluate new CCMD Joint Staff validated SEW requirements and integrate derived requirements into plans for SEW system component enhancements like RM 6.0 CMF rule development, GCCS-J 6.0 with a CMF input capability and transition of operational sites to SEW data in a CMF format\n- Continue to evaluate solutions, enhancements, and approaches for an improved infrared\/radar integrated missile picture based on SEW GCCS-J correlation of SEW-Space (SEW-S) and SEW-R data to include association of multiple tracked objects to a single event and display of the weapon track resulting is a correct missile count and improved impact prediction\n- Develop and test Phase 3 FPTNS to provide automatic data transfer from GCCS-J to FPTNS to eliminate operator entry errors and to significantly improve the delivery time of secondary missile warning to SEW partner command centers and lower tier sites\n- Implement SEW CMF rule sets for RM 6.0, conduct tests and verify proper operation, timely processing and output of SEW partner data to multiple sites, develop enhancements to provide new releasable CMF fields to partners; identify software\/hardware problems and develop fixes and enhancements to support fielding of the new RM 6.0 architecture\n- Develop and test end-to-end SEW architecture with CMF input data from the receivers to ensure proper operation\/compatibility of implemented RM 6.0 and GCCS-J 6.0 on partner and CCMD SA SEW servers\n- Test GCCS-J 3D Agile Client for use as the SEW partner display and verify all required capabilities are functioning properly including configuring communications channels, SEW data record and playback, display of infrared\/radar single integrated missile picture, TES site status window and capability to manage track database\n- Develop improved and enhanced mobile SEWS capability for use with partner deployable active missile defense systems\n- Conduct research and support tests with United States Strategic Command (USSTRATCOM) and TES Program Offices to develop enhancements to improve..."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.373"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.373"
                                            },
                                            "Text": {
                                                "val": "- Investigate and evaluate new CCMD Joint Staff validated SEW requirements and integrate derived requirements into plans for SEW system component enhancements like RM 6.0 CMF rule development, GCCS-J 6.0 with a CMF input capability and transition of operational sites to SEW data in a CMF format\n- Continue to evaluate solutions, enhancements, and approaches for an improved infrared\/radar integrated missile picture based on SEW GCCS-J correlation of SEW-S and SEW-R data to include association of multiple tracked objects to a single event and display of the weapon track resulting is a correct missile count and  improved impact prediction\n- Develop and test Phase 3 FPTNS to provide automatic data transfer from GCCS-J to FPTNS to eliminate operator entry errors and to significantly improve the delivery time of secondary missile warning to SEW  partner command centers and lower tier sites\n- Implement SEW CMF rule sets for RM 6.0, conduct tests and verify proper operation, timely processing and output of SEW partner data to multiple sites, develop enhancements to provide new releasable CMF fields to partners. Identify software\/hardware problems and develop fixes and enhancements to support fielding of the new RM 6.0 architecture\n- Develop and test end-to-end SEW architecture with CMF input data from the receivers to ensure proper operation\/compatibility of implemented RM 6.0 and GCCS-J 6.0 on partner and CCMD SA SEW servers\n- Test GCCS-J 3D Agile Client for use as the SEW partner display and verify all required capabilities are functioning properly including configuring communications channels, SEW data record and playback, display of infrared\/radar single integrated missile picture, TES site status window and capability to manage track database\n- Develop improved and enhanced mobile SEWS capability for use with partner deployable active missile defense systems\n- Conduct research and support tests with USSTRATCOM and TES Program Offices to develop enhancements to improv..."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "North Warning System (NWS)"
                                    },
                                    "Description": {
                                        "val": "Conduct an analysis of alternatives for potential replacement of the NWS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.951"
                                            },
                                            "Text": {
                                                "val": "- Conduct analysis of alternatives"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 838010"
                                    },
                                    "Title": {
                                        "val": "Comm Elect Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.220"
                                        },
                                        "CurrentYear": {
                                            "val": "0.403"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.392"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.392"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.351"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.358"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.364"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.370"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy is to build on existing capabilities using evolutionary acquisition to modernize and sustain SEWS.  The program office serves as the SEW system integrator, relying on a Prime Contractor for Logistics, Operations, and Sustainment support.  The projects described will be accomplished on the existing SEWS Single-Award Indefinite Delivery Indefinite Quantity (SA IDIQ) contract.  This contract was re-competed through full and open competition in 2012.  The current contract has a Period of Performance (PoP) through 30 Sep 2017.  Additionally, some SEWS requirements are satisfied through Military Interdepartmental Purchase Requests to external programs of record.\n\nThe analysis of alternatives for potential replacement of the NWS will be accomplished using a to be determined mix of organic, federally funded research and development center, and advisory and assistance support contractor efforts."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}