{
    "id": "2018-Army-PB-2040-JBOOK-3e91339aa28ec2881f9549044dc8a7daf4e287c1ca461095f2d8b42bf2f292b8-1",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603308A"
        },
        "ProgramElementTitle": {
            "val": "Army Space Systems Integration"
        },
        "R1LineNumber": {
            "val": "54"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "29.561"
            },
            "CurrentYear": {
                "val": "32.431"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "-Beginning in FY2018 all project 990 funds will transfer to PE 1206308A, Project FE5.\n-Beginning in FY2018 all project EB7 funds transition to PE 1206308A project FE6 and PE 1205117A project FG3."
        },
        "ProgramElementMissionDescription": {
            "val": "The program element funds space systems integration efforts performed by the US Army Space and Missile Defense Command\/ Army Forces Strategic Command (USASMDC\/ARSTRAT) and the Program Executive Office for Intelligence, Electronic Warfare (PEO IEW&S).\n\nProject EB7 - PEO IEW&S\/USASMDC\/ARSTRAT: Details of this program are reported in accordance with Title 10, United States Code, Section 119 (a)(1).\n\nProject 990 funds USASMDC\/ARSTRAT to integrate warfighting concepts and technologies, validate concepts, and identify capabilities needed to implement the validated concepts, and develop DOTMLPF solutions to realize those space and high altitude related capabilities. Provide engineering support to the Joint Friendly Force Tracking (J-FFT) Mission Management Center (MMC) through an associated test-bed for both operational and developmental injection and integration of real-time J-FFT information into the Common Operating Picture (COP) for Combatant Commanders (COCOMs), Joint Task Forces (JTFs), and Coalition Partners.  The MMC injects real-time J-FFT information into the COP for COCOMs, JTFs and Coalition partners.  USSTRATCOM, in accordance with CJCSI 3910.01 (reference V.4.) is designated one of three coordinating agencies for J-FFT within DoD.  CJCSI 3910.01 directs eight Force Modernization tasks to USSTRATCOM.  USSTRATCOM SI 534-5 (reference V.6.) and annually published USSTRATCOM operations orders have designated USASMDC\/ARSTRAT as the lead USSTRATCOM component command for Friendly Force Tracking (FFT)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.061"
                },
                "CurrentYear": {
                    "val": "32.431"
                },
                "BudgetYearOne": {
                    "val": "36.772"
                },
                "BudgetYearOneBase": {
                    "val": "36.772"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "29.561"
                },
                "CurrentYear": {
                    "val": "32.431"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.500"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-36.772"
                },
                "BudgetYearOneBase": {
                    "val": "-36.772"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.500"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-36.772"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-36.772"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "-Beginning in FY2018 all project 990 funds will transfer to PE 1206308A, Project FE5.\n-Beginning in FY2018 all project EB7 funds transition to PE 1206308A project FE6 and PE 1205117A project FG3."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "990"
                    },
                    "ProjectTitle": {
                        "val": "Space And Missile Defense Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.238"
                        },
                        "CurrentYear": {
                            "val": "12.791"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project will transition to PE 120630A Project FE5"
                        },
                        "ProjectMissionDescription": {
                            "val": "USASMDC\/ARSTRAT:  Headquarters, Department of the Army General Order 37, dated 16 October 2006, designated USASMDC\/ARSTRAT as the Army proponent for space and ground-based midcourse defense (GBMD), the Army integrator for global missile defense, and the Army Service Component Command (ASCC) of the U.S. Strategic Command (USSTRATCOM).  Army Regulation (AR) 10-87 Army Commands, Army Service Component Commands, and Direct Reporting Units, dated 4 September 2007 and AR 5-22 The Army Force Modernization Proponent System dated 19 August 2009 designate USASMDC\/ARSTRAT as the Army specified proponent for Global Missile Defense and Space\/High Altitude capabilities.  As the Army proponent for space, high altitude and GMD, USASMDC\/ARSTRAT develops warfighting concepts, conducts warfighting experiments to validate those concepts, identifies capabilities needed to implement the validated concepts, and develops Doctrine, Organizations, Training, Material, Leadership & Education, Personnel, Facilities and Policy (DOTMLPF-P) solutions to realize the GBMD capabilities.  As the Army integrator for global missile defense, USASMDC\/ARSTRAT is responsible for reviewing programs managed by the Army, other Services, Defense agencies and National agencies to ensure that they are correctly synchronized and will ultimately provide the capabilities required by USSTRATCOM to execute its global missile defense responsibilities. \n\nProject 990 funds United States Army Space and Missile Command\/Army Strategic Command (USASMDC\/ARSTRAT) efforts to develop, analyze and mature warfighting concepts, and conduct warfighting experiments for space and high altitude capabilities.  The program also funds development and integration of new data sources and data services into the Joint Friendly Force Tracking Mission Management Center.  The Mission Management Center (MMC) injects real-time Joint Friendly Force Tracking (J-FFT) information into the Common Operating Picture for Combatant Commands (COCOMs), Joint Task Forces (JTFs) and Coalition partners.  USASMDC\/ARSTRAT is the proponent for space \/ high altitude capabilities and is responsible for determining and integrating Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF-P) for the Army. \n\nUSSTRATCOM, in accordance with CJCSI 3910.01 (reference V.4.) is designated one of three coordinating agencies for J-FFT within DOD.  CJCSI 3910.01 directs eight Force Modernization tasks to USSTRATCOM.  USSTRATCOM SI 534-5 (reference V.6.) and annually published USSTRATCOM operations orders have designated USASMDC\/ARSTRAT as the lead USSTRATCOM component command for J-FFT."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Architecture Development, Wargames and Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.174"
                                            },
                                            "Text": {
                                                "val": "Planned, developed, and executed architectures and combat development solutions for Army integration of space systems, space control capabilities, missile defense and high altitude systems. Represented Army positions and defended Army equities relative in Joint\/DoD and inter-Service activities; e.g., Executive Agent for Space Program Assessments, etc. Planned and executed wargames to evaluate emerging concepts within the space and high altitude domains as well as participated and provided support to Army and Joint wargames and experiments where space and high altitude capabilities and technologies were be integrated and evaluated in the most realistic operating environment possible. This was necessary to ensure that space, high altitude and cyber capability gaps were identified and capabilities were correctly represented so that the Army's use of these capabilities was explored and where possible, exploited. Developed and maintained One Semi-Automated Force (OneSAF) simulation space updated and provided to PEO STRI to be included in OneSAF baseline. Developed space modernization strategies and sponsor exploration of future space and high altitude warfighting concepts. USASMDC\/ARSTRAT continued efforts to enhance the resiliency and effectiveness of critical space-based assets and JCIDS capability development activities for space superiority, high altitude persistent platforms, nano-satellites and tactical launch systems. Products delivered in FY16 included Army Cyberspace Analysis; Space Superiority Analysis of Alternatives and Cost-Benefit Analysis updates: Overhead Persistence Infrared (OPIR) Analysis; Assessment of Hostile use of Space Force Enhancement; and Position Navigation Timing (PNT) analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.716"
                                            },
                                            "Text": {
                                                "val": "Will plan, develop, and execute architectures and combat development solutions for Army integration of space systems, space control capabilities, missile defense and high altitude systems.  Represent Army positions and defend Army equities relative in Joint\/DoD and inter-Service activities; e.g., Executive Agent for Space Program Assessments, etc.  Will plan and execute wargames to evaluate emerging concepts within the space and high altitude domains as well as participate and provide support to Army and Joint wargames and experiments where space and high altitude capabilities and technologies can be integrated and evaluated in the most realistic operating environment possible.  This is necessary to ensure that space, high altitude and cyber capability gaps are identified and capabilities are correctly represented so that the Army's use of these capabilities is explored and where possible, exploited.  Will develop and maintain One Semi-Automated Force (OneSAF) simulation space updates and provide to PEO STRI to be included in OneSAF baseline.  Will develop space modernization strategies and sponsor exploration of future space and high altitude warfighting concepts.  USASMDC\/ARSTRAT will continue efforts to enhance the resiliency and effectiveness of critical space-based assets and JCIDS capability development activities for space superiority, high altitude persistent platforms, nano-satellites and tactical launch systems. Products scheduled to be delivered in FY17 include Army Cyberspace Analysis; Space Superiority Analysis of Alternatives and Cost -Benefit Analysis updates: Overhead Persistence Infrared (OPIR) Analysis; Assessment of Hostile use of Space Force Enhancement; and Position Navigation Timing (PNT) analysis.  TAA 20-24 (APR 2016-MAR 2017) will introduce new space capabilities into the force.  In order to bring those capabilities into the force development of new force design updates (FDUs) for FDU cycles 16-1, 16-2, 17-1 will be required.  Additionally during the TAA cycle new Rules of Allocation (ROA) will be developed to ensure SRC40 units are properly accounted for in the future POM force."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technolgy Program Support"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.516"
                                            },
                                            "Text": {
                                                "val": "Supported the efficient rugged laser program as it went into the completion phase of a 60kW laser system for installation into the HELMD mobile platform; supported efficient rugged laser reviews and technical interchange meetings; supported safety and security assessments and analysis of a potential future laser weapon system; conducted trade analysis studies on current and future high power laser concepts; supported conduct of technical assessments of advanced laser technologies and help assess the diode pumped gas laser research effort; supported power and thermal subsystems development and system engineering between the 60 kW class laser, power and thermal subsystem, and the HELMD platform\/beam control system; supported Solid state Laser Testbed (SSLT) operations at the High Energy Laser Systems Test Facility (HELSTF) to evaluate 1.06um SSL propagation and lethality experiments; supported the development of tactics, techniques, and procedures (TTPs) of future fielding of HEL weapon system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.072"
                                            },
                                            "Text": {
                                                "val": "Will support the High Energy Laser Mobile Demonstrator (HELMD) as it goes into the integration phase of the electrical power subsystem (EPS), thermal management subsystem (TMS), and 60 kW Laser Subsystem (LSS) into the HELMD mobile platform; support reviews and technical interchange meetings, Technical Review Boards (TRB), and Risk and Opportunity Management Boards (ROMB) for subsystems; support safety and security assessments and analysis of a potential future laser weapon system; conduct trade analysis studies on current and future high power laser concept; support Solid State Laser Testbed (SSLT) operations at the High Energy Laser Systems Test Facility (HELSTF) to evaluate 1.06um SSL propagation and lethality experiments; support the development of tactics, techniques, and procedures (TTPs) of future fielding of HEL weapon system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Friendly Force Tracking (J-FFT) Testbed"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.548"
                                            },
                                            "Text": {
                                                "val": "SMDC\/ARSTRAT’s J-FFT Testbed continued to execute the CJCS task to provide a development and testing capability to ensure FFT data is integrated for operational use\/display. Main efforts were dedicated to agile development, testing and delivery of Force Tracking Advanced Management System (FTAMS) capabilities, the core software suite supporting the Joint Force Tracking Mission Management Center’s 24\/7 data services to combatant commands, agencies and coalition forces. These efforts have enabled over 55 device types and 3,000 daily tracks to be supported by the MMC. A second line of effort provided sustainment and Independent Verification and Validation (IV&V) support to SOCOM and Army Tagging, Tracking and Locating (TTL) programs. This included deliveries of new capabilities and devices that are enabled by the KeyMaker architecture hosted by the MMC for use by SOF, Army and Marine forces. In support of the KeyMaker Unclassified systems the J-FFT Testbed procured, tested and deployed a Force Tracking Cloud solution using the Amazon Web Services provider that reduced costs and improved performance. The J-FFT Testbed also satisfied FFT user requirements by executing capability development and test cycles for over a dozen JIIM user projects that included support to the Bold Quest 16.1 Coalition Capability Assessment, development of a new NATO FFT message standard (STANAG 5527) for coalition interoperability, FT support to the US Pacific Fleet “Rim of the Pacific” (RIMPAC) exercise, and transition of the Simply Aware application supporting US Army Africa and a proof of concept to meet Army Movement Tracking System needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.003"
                                            },
                                            "Text": {
                                                "val": "As enhancements are made to network-enabled command and control systems, including KeyMaker, Joint Friendly Force Tracking (J-FFT) will be fully integrated into Combat Commanders' friendly force tracking requirements and the J-FFT Testbed will be used to integrate hardware and software prior to its deployment to the field. USASMDC\/ARSTRAT will continue to support development of Friently Force Tracking (FFT) capabilities for deployed and coalition forces.  The J-FFT Division coordinates and executes USSTRATCOM-directed FFT tasks in order to assure continuous 24\/7 FFT data services support to authorized users to include the Combatant Commands, the Services, agencies, allies, and coalition partners in order to improve their situational awareness (SA), enhance command and control (C2) to reduce fratricide in combat, homeland defense, civil and contingency operations.  Will complete transition Force Tracking Advanced Management System (FTAMS) to FFT-Mission Management Center (MMC)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this effort."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EB7"
                    },
                    "ProjectTitle": {
                        "val": "Army Space System Enhancement\/Integration"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.323"
                        },
                        "CurrentYear": {
                            "val": "19.640"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Note\nFunding transferred from PE 0603308A project EB7 transition to PE 1206308A project FE6 and PE 1205117A project FG3 beginning in FY 2018.\n\nThe details of this program are reported in accordance with Title 10, United States Code, Section 119(a)(1).\nFunding line is shared between USA Space and Missile Defense Command (SMDC) and Program Executive Office Intelligence, Electronic Warfare and Sensors (PEO IEW&S) starting in FY2018. Funding transferred from PE 0603308A project EB7 transition to PE 1206308A project FE6 and PE 1205117A project FG3 beginning in FY 2018."
                        }
                    }
                }
            ]
        }
    }
}