{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-11",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604641A"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL UNMANNED GROUND VEHICLE"
        },
        "R1LineNumber": {
            "val": "91"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.599"
            },
            "CurrentYear": {
                "val": "39.282"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "16.000"
            },
            "BudgetYearFive": {
                "val": "23.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2018 and out year funding has been moved to fund individual Project Numbers as follows: Common Robotic Systems - Individual (CRS(I) Program Element 655053 Project FB4; Robotics Enhanced Program (REP) Program Element 655053 Project FB7; Robotics Architecture (RA) Program Element 655053 Project FB3; Robotics Development (RD) Program Element 644017 Project FD2 and Program Element 644017 Project FD9."
        },
        "ProgramElementMissionDescription": {
            "val": "The Common Robotic System – Individual (CRS(I)) will be a man-packable, small (<25lbs), highly mobile, unmanned robotic system with advanced sensors\/mission modules for dismounted Service Members. The CRS(I) will be designed so operator can quickly re-configure for other various missions by adding or removing modules and\/or payloads.  The CRS(I) will also include the Army universal controller used by all unmanned ground and aerial vehicles within the battalion formation providing interoperability, logistics, and training efficiencies.  The CRS(I) will provide interrogation, detection, confirmation, and neutralization capabilities employed to support a wide spectrum of mobility missions for current and future forces.  This capability provides commanders the ability to persistently monitor the Operating Environment (OE) while protecting and sustaining the force. The CRS(I) complements the Joint Integrated War-fighting Force by providing standoff to the War fighter during major combat, stability, and homeland security operations.\n\nThe Robotics Enhanced Program (REP) uses a “buy, try, and inform” methodology to evaluate Commercial Off the Shelf (COTS), Government Off the Shelf (GOTS) and Non-Developmental Item (NDI) products that have the potential to enhance Soldier combat effectiveness.  Actual operational user feedback and evaluation results obtained will inform emerging capabilities and requirements documents in support of a Cost-Benefit Analysis to support future Army decision making.\n\nRobotics Architecture (RA) provides the engineering and development resources to manage the overarching architecture for robotic systems that are both modular and interoperable across the Joint Force in order to facilitate future modernization efforts.  It will manage the interoperability standards, modular payload interface, common software and universal controllers.  RA includes the construction of program specific Interoperability Profiles (IOP) (i.e. Small Multipurpose Equipment Transport (SMET), Leader\/Follower (LF), Route Clearance Interrogation System (RCIS), Common Robotics System-Vehicle (CRS(V)), CRS(I) Inc II, etc.) and new standards addressing emerging requirements (i.e. Cyber Security, Information Assurance, new payloads, etc).     \n\nRobotics Development (RD) includes efforts necessary to evaluate integrated technologies, validate material solutions and determine initial Analysis of Alternatives (AoA) in support of pre-material development decision activities for emerging requirements and programs of record. RD is designed to facilitate the transition of robotics and autonomous systems technology from Science and Technology (S&T) projects, REP initiatives and\/or Small Business Innovative Research (SBIR) into emerging programs of record through development of emerging capabilities.  This line is for robotic systems that are transported by individual Soldiers, by vehicle, maneuver under their own power, or are installed as robotic applique kits. RD supports early evaluations for operational effectiveness studies of platforms (i.e. SMET, Leader\/Follower (LF), Route Clearance Interrogation Systems (RCIS),  CRS(V), CRS(I) Inc II, Soldier Born Sensors, etc) to determine Technology Readiness Levels (TRL) and Manufacturing Readiness Levels (MRL). Studies support AoA that include Army Material Systems Analysis Activity (AMSAA), RAND Corporatin studies, and\/or modeling to increase confidence in the material solution defined in the emerging Capability Development Document (CDD)\/Capability Production Document(CPD) that support appropriate Acquisition Category (ACAT), Milestone Decision Authority (MDA) and office of primary responsibility designations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.374"
                },
                "CurrentYear": {
                    "val": "39.282"
                },
                "BudgetYearOne": {
                    "val": "60.120"
                },
                "BudgetYearOneBase": {
                    "val": "60.120"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.599"
                },
                "CurrentYear": {
                    "val": "39.282"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.775"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-60.120"
                },
                "BudgetYearOneBase": {
                    "val": "-60.120"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-1.775"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-60.120"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-60.120"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 and out year funding has been moved to fund individual Project Numbers as follows: Common Robotic Systems - Individual (CRS(I) Program Element 655053 Project FB4; Robotics Enhanced Program (REP) Program Element 655053 Project FB7; Robotics Architecture (RA) Program Element 655053 Project FB3; Robotics Development (RD) Program Element 644017 Project FD2 and Program Element 644017 Project FD9."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DV7"
                    },
                    "ProjectTitle": {
                        "val": "Small Unmanned Ground Vehicle"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.599"
                        },
                        "CurrentYear": {
                            "val": "39.282"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "16.000"
                        },
                        "BudgetYearFive": {
                            "val": "23.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 2018 and out year funding has been moved to fund individual Project Numbers as follows: Common Robotic Systems - Individual (CRS(I) Program Element 655053 Project FB4; Robotics Enhanced Program (REP) Program Element 655053 Project FB7; Robotics Architecture (RA) Program Element 655053 Project FB3; Robotics Development (RD) Program Element 644017 Project FD2 and Program Element 644017 Project FD9."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Common Robotic System – Individual (CRS(I)) will be a man-packable, small (<25lbs), highly mobile, unmanned robotic system with advanced sensors\/mission modules for dismounted Service Members. The CRS(I) will be designed so operator can quickly re-configure for other various missions by adding or removing modules and\/or payloads.  The CRS(I) will also include the Army universal controller used by all unmanned ground and aerial vehicles within the battalion formation providing interoperability, logistics, and training efficiencies. The CRS(I) will provide interrogation, detection, confirmation, and neutralization capabilities employed to support a wide spectrum of mobility missions for current and future forces.  This capability provides commanders the ability to persistently monitor the Operating Environment (OE) while protecting and sustaining the force. The CRS(I) complements the Joint Integrated Warfighting Force by providing standoff to the Warfighter during major combat, stability, and homeland security operations.\n\nThe Robotics Enhanced Program (REP) uses a “buy, try, and inform” methodology to evaluate Commercial Off the Shelf (COTS), Government Off the Shelf (GOTS) and Non-Developmental Item (NDI) products that have the potential to enhance Soldier combat effectiveness.  Actual operational user feedback and evaluation results obtained will inform emerging capabilities and requirements documents in support of a Cost-Benefit Analysis to support future Army decision making.\n\nRobotics Architecture (RA) provides the engineering and development resources to manage the overarching architecture for robotic systems that are both modular and interoperable across the Joint Force in order to facilitate future modernization efforts.  It will manage the interoperability standards, modular payload interface, common software and universal controllers.  RA includes the construction of program specific Interoperability Profiles (IOP) (i.e. Small Multipurpose Equipment Transport (SMET), Leader\/Follower (LF), Route Clearance Interrogation System (RCIS), Common Robotics System-Vehicle (CRS(V)), CRS(I) Inc II, etc.) and new standards addressing emerging requirements (i.e. Cyber Security, Information Assurance, new payloads, etc).     \n\nRobotics Development (RD) includes efforts necessary to evaluate integrated technologies, validate material solutions and determine initial Analysis of Alternatives (AoA) in support of pre-material development decision activities for emerging requirements and programs of record. RD is designed to facilitate the transition of robotics and autonomous systems technology from Science and Technology (S&T) projects, REP initiatives and\/or Small Business Innovative Research (SBIR) into emerging programs of record through development of emerging capabilities.  This line is for robotic systems that are transported by individual Soldiers, by vehicle, maneuver under their own power, or are installed as robotic applique kits. RD supports early evaluations for operational effectiveness studies of platforms (i.e. SMET, Leader\/Follower (LF), Route Clearance Interrogation Systems (RCIS), CRS(V), CRS(I) Inc II, Soldier Born Sensors, etc) to determine Technology Readiness Levels (TRL) and Manufacturing Readiness Levels (MRL). Studies support AoA that include Army Material Systems Analysis Activity (AMSAA), RAND Corporation studies, and\/or modeling to increase confidence in the material solution defined in the emerging Capability Development Document (CDD)\/Capability Production Document (CPD) that support appropriate Acquisition Category (ACAT), Milestone Decision Authority (MDA) and office of primary responsibility designations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CRS-I and emerging robotic requirements."
                                    },
                                    "Description": {
                                        "val": "The CRS-I program expects a Material Development Decision (MDD) in FY16.  In FY15, CRS-I  completed  AoA letter of sufficiency, began the program Test & Evaluation Working-Level Integrated Product Team (T&E WIPT), formed a CRS-I program IPT to support the acquisition process. An IPT was formed to support emerging robotic system requirements and REP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.599"
                                            },
                                            "Text": {
                                                "val": "The CRS(I) program received MDA delegation as ACAT III with Milestone Decision Document (MDD) and an Acquisition Decision Memorandum (ADM) to complete entrance criteria for MS B.  Systems engineering activities included drafting of the Test Evaluation Master Plan (TEMP), System Engineering Plan (SEP) and performance specification for Request For Proposals (RFP) release. The product support Integrated Product Team (IPT) drafted the (LCSP) for RFP release. CRS(I) collaborated with appropriate Program Executive Offices (PEO)for development of common radio, universal controller architecture and modeling and simulation. The procurement specialist conducted and compiled results from a Request For Information (RFI) from industry, a draft RFP with an industry day and prepared for release of the development RFP.\n\nThe REP program utilized an established website where industry and government submits initiative proposals. Per standard operating procedure (SOP) and Memorandum of Agreement (MOA) between PEO CS&CSS and TRADOC\/MCOE, a monthly stakeholders working group has proven continually effective in reviewing emerging capabilities leading towards a biannual Council of Colonels (CoC) review and selections of proposals in support of Center of Excellence (CoE) determined REP initiatives. Industry and government responses indicated proposal\nexperimentation in support of these initiatives could exceed a $10 million level of effort. REP 16.1 and 16.2 initiatives were conducted at Ft Benning and Ft Leonard Wood to inform emerging requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "39.282"
                                            },
                                            "Text": {
                                                "val": "The CRS(I) program will enter  MS B, conduct a source selection board and complete EMD contract award(s) beginning in 3QFY17.   \nREP will continue to inform emerging robotic system requirements and risk reduction initiatives per SOP and MOA, to include 16.1 and 16.2 project reviews and complete REP 17.1and 17.2 demonstrations.   REP initiatives will be completed and published for PEO review at Knowledge Point 2 for program effectiveness and efficiency.\nRA will monitor, validate, and update IOP for MTRS and CRS(I) instantiations as well as continuous revision for cyber security and information assurance. RA will also initiate development of SMET and LF instantiations.  \nRD will initiate Pre-MDD activities to support AoA and draft CDD for SMET, LF and RCIS to include follow-on S&T activities and REP to support emerging requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "G99595"
                                    },
                                    "Title": {
                                        "val": "Common Robotic System-Individual (CRS-I)"
                                    },
                                    "Funding": {
                                        "BudgetYearTwo": {
                                            "val": "3.200"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.400"
                                        },
                                        "BudgetYearFour": {
                                            "val": "28.958"
                                        },
                                        "BudgetYearFive": {
                                            "val": "45.291"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "CRS(I) will enter MS-B as an ACAT III program, and the Acquisition Strategy was completed in Jan 2017. CRS(I) strategy to include the following considerations: Full and open competition contract (i.e. cost plus fixed fee for EMD and Firm Fixed Price (FFP) for LRIP and Production)."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}