{
    "id": "2018-TheJointStaff-PB-0400-JBOOK-6ad2d2a6c9f108bf1e69ecbae97fd2d4d0e0ffadf02748e3d6fbbce6883f75fd-1",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-TJS-U_RDTE_JustificationBook_The_Joint_Staff_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_The_Joint_Staff_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605126J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integrated Air & Missile Defense Organization (JIAMDO)"
        },
        "R1LineNumber": {
            "val": "145"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "343.535"
            },
            "PriorYear": {
                "val": "34.139"
            },
            "CurrentYear": {
                "val": "38.059"
            },
            "BudgetYearOne": {
                "val": "36.581"
            },
            "BudgetYearOneBase": {
                "val": "36.581"
            },
            "BudgetYearTwo": {
                "val": "36.469"
            },
            "BudgetYearThree": {
                "val": "33.901"
            },
            "BudgetYearFour": {
                "val": "33.500"
            },
            "BudgetYearFive": {
                "val": "33.500"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Integrated Air and Missile Defense Organization(JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff (JS), JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community’s proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD’s resource allocation structures.  JIAMDO also leads IAMD mission and utility analysis, integrates IAMD within the Force Protection joint capability area, and conducts evaluations, demonstrations of joint IAMD architectures, and provides advocacy for innovative, technically mature, and affordable solutions.  \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the IAMD Prioritized Capabilities List and the Global Integrated IAMD Assessment and analysis of the Ballistic Missile Defense System.  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues and technical oversight of homeland capability solutions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.983"
                },
                "CurrentYear": {
                    "val": "32.759"
                },
                "BudgetYearOne": {
                    "val": "32.581"
                },
                "BudgetYearOneBase": {
                    "val": "32.581"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "34.139"
                },
                "CurrentYear": {
                    "val": "38.059"
                },
                "BudgetYearOne": {
                    "val": "36.581"
                },
                "BudgetYearOneBase": {
                    "val": "36.581"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.156"
                },
                "CurrentYear": {
                    "val": "5.300"
                },
                "BudgetYearOne": {
                    "val": "4.000"
                },
                "BudgetYearOneBase": {
                    "val": "4.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.156"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Additional Support to P005: Nimble Fire"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY17PB Amend: Addition funds for JRICM (JIAMDO-Core)"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "5.300"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "JIAMDO-Core:   JIAMDO moved its offices out of contracted facilities into government-owned facilities and merged its processes with those of the Joint Staff J8, avoiding the need for administrative and security support contracts, rent, and the various support costs associated with rental offices.\n\nJIAMDO-Core (FY17):  $5.3 million is required to address emergency warfighting readiness requirements. Joint Regional IAMD Capability Mix (JRICM) II is a DepSecDef and JROC directed Regional IAMD study, directing the Joint Staff, Joint Integrated Air and Missile Defense Organization (JIAMDO), in coordination with USSTRATCOM, USCYBERCOM, Intelligence Communities, Agencies and Services to assess the impact of emerging non-kinetic capabilities to supplement regional IAMD.\n\nJIAMDO-Homeland:  Program development and management were handed off to the Air Force. JIAMDO retains only requirements and integration oversight responsibilities not requiring program funding.  \n\nJIAMDO-Nimble Fire:  Increased funding for FY 2018 will be used to hold two large Nimble Fire events in support of U.S. Fleet Forces Command, USPACOM, USSTRATCOM and USEUCOM.  Additionally, funds will be used to improve Electronic Warfare, Multi-spectral Environment, Advanced Capability Model, and Space Warfare."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Core"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "119.901"
                        },
                        "PriorYear": {
                            "val": "14.339"
                        },
                        "CurrentYear": {
                            "val": "14.329"
                        },
                        "BudgetYearOne": {
                            "val": "9.343"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.343"
                        },
                        "BudgetYearTwo": {
                            "val": "10.271"
                        },
                        "BudgetYearThree": {
                            "val": "10.271"
                        },
                        "BudgetYearFour": {
                            "val": "10.476"
                        },
                        "BudgetYearFive": {
                            "val": "10.476"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads IAMD mission area and utility analyses, integrates IAMD within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with USSTRATCOM and USNORTHCOM in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated IAMD Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Core"
                                    },
                                    "Description": {
                                        "val": "Provides overall staff support for JIAMDO operations in the area of ballistic missile defense, air and cruise missile defense, homeland defense, requirements management, combat identification, modeling & simulation, all other JIAMDO analytical functions and products, senior level briefings, and all travel costs for government and contractor support personnel (including Combatant Commander liaison personnel).  This includes performing analyses, demonstrations, and programmatic assessments of technology, operations, requirements, and weapons systems.  In coordination with Services and CCMDs, JIAMDO Core also funds the definition, assessment, development, and approval of Joint IAMD Operational Concepts, Operational Architectures, and capability requirements to guide the Department's joint\/interagency\/combined fully integrated and net-centric capable IAMD (including defense against cruise missiles, unmanned aerial vehicles, and ballistic missiles).  JIAMDO Core also provides funding to:\n• Develop and integrate joint studies, simulations, wargames, force resource allocation, and interoperability initiatives\n• Manage relevant Congressional interaction and CCMD interface through a cadre of liaisons collocated with major headquarters\n• Directly support and sponsor homeland air surveillance related demonstration and analysis activities\n• Run the IAMD Working Group and co-chair the Protection Functional Capabilities Board focusing CCMD, Joint Staff, and Service collaboration efforts in generation of joint concepts and development of the IAMD architecture and roadmap\n• Develop U.S. positions for, and provide the U.S. head of delegation to, the NATO Air and Missile Defense Committee\n\nJIAMDO Core further enables strategic planning development, infrastructure, security, travel, and other support activities.  Funding pays for: contracted Systems Engineering and Technical Assistance (SETA) support for Air & Cruise Missile Defense (ACMD), Ballistic Missile Defense (BMD), Homeland Air Security (HAS) strategic planning, studies & analysis, combat ID, modeling & simulation, all other JIAMDO analytical functions and products, senior level briefings, and all travel costs for government and contractor support personnel (including Combatant Commander liaison personnel). Additionally, the JIAMDO CORE budget funds daily on-site security management personnel to meet DoD, National Industrial Security Program Operating Manual (NISPOM), and other security regulations, for all administrative and support functions related to higher security classifications, as well as basic office supplies and furniture, and classified\/unclassified data connections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.339"
                                            },
                                            "Text": {
                                                "val": "Performed Air and Cruise Missile Defense, and Ballistic Missile Defense directed studies in support of the Chairman and related program support activities including:  contracting, finance, systems engineering and technical assistance, administration, security, communications, leased space, and supply.  Provided contracted expertise in support of studies and analysis directed by Congress, Defense Planning Guidance, Resource Management Decisions, Joint Requirements Oversight Council, and other higher sources.  Additional reductions in contract advisory and assistance services are projected. Awarded new SETA contract in Aug 2016."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.329"
                                            },
                                            "Text": {
                                                "val": "Continue performing Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities.  Pursue further changes in program support activities as a result of reorganization and office move to the Pentagon.  Ancillary support functions such as administrative, security, communications, Information Technology, and finance will no longer require JIAMDO funding as they will be provided by the JS. Systems Engineering and Technical Assistance contract will still be in place to provide necessary mission support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.343"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.343"
                                            },
                                            "Text": {
                                                "val": "Continue performing Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Support two major Nimble Fire exercises during FY 2018.\n\n(2) Conduct two IAMD Working Groups and at least one Functional Capabilities Board per month.\n\n(3) Conduct the annual Black Dart Counter-Unmanned Aerial System technology demonstration.\n\n(4) Support U.S. Representative to NATO Air Defense Council and Missile Defense Committee including 2 overseas meetings per year and numerous lower-level supporting functions.\n\n(5) Develop and maintain operational architecture compliance with DoD Architectural Framework (DODAF) standards.\n\n(6) Ensure 100% of all government employee travel is in accordance with the Joint Federal Travel Regulation\/Joint Travel Regulation and all contractor travel is in accordance with applicable regulations.\n\n(7) Maintain all unclassified\/classified LANs on a daily basis in accordance with the Joint Staff's Office of the Chief Information Officer guidance\/policy.\n\n(8) Ensure all computers, NIPRNET\/SIPRNET, are refreshed according to applicable policy\/guidance."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P002"
                    },
                    "ProjectTitle": {
                        "val": "Homeland"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "67.544"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Homeland program transitioned to a USAF-led Program of Record across the Future Year Defense Program in the beginning of FY 2016.  JIAMDO will retain operational and requirements oversight."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "Black Dart"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "23.039"
                        },
                        "PriorYear": {
                            "val": "2.444"
                        },
                        "CurrentYear": {
                            "val": "3.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.300"
                        },
                        "BudgetYearThree": {
                            "val": "3.300"
                        },
                        "BudgetYearFour": {
                            "val": "3.366"
                        },
                        "BudgetYearFive": {
                            "val": "3.366"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Black Dart Counter Unmanned Aircraft Systems Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "Provides funding to support administration and execution of Black Dart demonstrations. Black Dart is a unique joint, interagency demonstration focusing on rapid development and implementation of Counter - Unmanned Aircraft Systems (CUAS) technology from readily-available commercial and governmental products.  Objectives include:\n•\tExecute live-fly, live-fire CUAS technology demonstration to assess and validate existing and emerging Integrated Air and Missile Defense  (IAMD) capabilities\n•\tPresent emerging solutions to inform requirements decision-making \n•\tIdentify and develop IAMD operational concepts, system interoperability, and operational architectures for the CUAS mission set\n•\tAdvocate for Warfighters’ desired CUAS capabilities and affordable, integrated solutions"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.444"
                                            },
                                            "Text": {
                                                "val": "Most tactically relevant BLACK DART to date:\n•\tFlew 355 sorties from 25 different UAS variants\n•\tFlew tactical ISR and Attack flight profiles from 16 geographically dispersed launch locations\n•\tDeveloped detailed threat scenarios based on direct input from Combatant Commanders to provide specific recommendations on materiel and non-materiel requirements to the warfighter\n•\tCreated a contested electromagnetic spectrum for CUAS sensors\n  Provided a venue for rapid capability delivery to the Warfighter:\n•\tDeveloped innovative materiel and non-materiel solutions that enhance all phases of the Joint Engagement Sequence versus the UAS threat\n•\tRefined non-kinetic negation system techniques and capabilities through 89 separate negation events\n  Provided a venue for innovation and collaboration:\n•\tExpanded interagency participation to demonstrate C-UAS options in both Title 10 and Title 50 operational environments\n•\tMultiple cross-governmental development programs were exercised to include DoD\/DoE and DoD\/DHS\n•\tIncreased observation from coalition partners from the Pacific operational theater"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2016 plans including: Demonstrate UAS capabilities to employ within visual range (WVR) and beyond visual range (BVR) weapons in a counter-UAS role.  Explore ‘On-the-Move’ capabilities.  Expand the breadth, complexity, and integration of cyber capabilities. Expand scenarios to include dynamic and contested electromagnetic spectrum."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2017 Plans including: Expand coalition partner participation. Develop scenarios integrating systems across land, littoral, and maritime domains."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Complete events within schedule and budget. Events provide useful data to improve C-UAS capability.\n\n(2) Document gaps, develop and substantiate hardware, software, and employment concepts.\n\n(3) Field C-UAS capability."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P004"
                    },
                    "ProjectTitle": {
                        "val": "Joint Distributed Engineering Plant"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.248"
                        },
                        "PriorYear": {
                            "val": "3.000"
                        },
                        "CurrentYear": {
                            "val": "2.500"
                        },
                        "BudgetYearOne": {
                            "val": "2.738"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.738"
                        },
                        "BudgetYearTwo": {
                            "val": "2.900"
                        },
                        "BudgetYearThree": {
                            "val": "2.475"
                        },
                        "BudgetYearFour": {
                            "val": "2.533"
                        },
                        "BudgetYearFive": {
                            "val": "2.533"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Distributed Engineering Plant (JDEP)"
                                    },
                                    "Description": {
                                        "val": "Conducted a joint test event to assess the interoperability of joint, IAMD weapon systems that leveraged commercial-off-the-shelf (COTS) Networks to perform Joint Integrated Fire Control. This effort provided users the means to create family-of-system (FoS) environments by linking existing capabilities using hardware, software, and operators in a live-fly environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint, IAMD weapons systems. Provide users the means to create FoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop. Link existing Service and Joint combat system engineering and test sites via distributed communications.  Conducted a high-fidelity weapons system hardware-in-the-loop Coalition Correlation\/Decorrelation Interoperability Test (C\/DIT) which identified and accelerated change to the Military Standard 6016 default parameter values, promoting increased IAMD interoperability across the joint and Allied link networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint\/coalition IAMD interoperability program and test event to link Service and Agency systems, providing test and evaluations to improve the Joint Common Tactical Airspace Picture (CTAP). Supervise and conduct a live, virtual and constructive test event utilizing real-world C-UAS data within a hardware-in-the-loop model to improve L16 network IAMD communications; determine IAMD capability requirements and verify architectures; improve interoperability and ensure IAMD of current weapon systems; and evaluate concepts of operations and tactics, techniques, and procedures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.738"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.738"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint, IAMD weapons systems. Provide users the means to create FoS environments by linking existing capabilities using hardware, software, and operator-in-the-loop. Link existing Service and Joint combat system engineering and test sites via distributed communications.  Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "(1)  Each JDEP event develops measures of effectiveness (MOE) & measures of performance (MOP) based on an eighteen month test planning and event process.\n(2)  Complete events within schedule and budget. \n(3)  Events provide useful data to improve Air Missile Defense interoperability, with implemented and recommended corrective changes.\n(4)  Events must be linked to the current approved IAMD Architecture, provide joint benefit, contribute to Joint Interoperability, and address IAMD ICD capability gaps."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P005"
                    },
                    "ProjectTitle": {
                        "val": "Nimble Fire"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "61.539"
                        },
                        "PriorYear": {
                            "val": "8.000"
                        },
                        "CurrentYear": {
                            "val": "12.230"
                        },
                        "BudgetYearOne": {
                            "val": "16.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.500"
                        },
                        "BudgetYearThree": {
                            "val": "13.500"
                        },
                        "BudgetYearFour": {
                            "val": "12.650"
                        },
                        "BudgetYearFive": {
                            "val": "12.650"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Nimble Fire"
                                    },
                                    "Description": {
                                        "val": "The Deputy Secretary of Defense assigned responsibility for IAMD development at the Virtual Warfare Center to JIAMDO.  Nimble Fire is the Department’s only joint IAMD operator-in-the-loop modeling and simulation capability exploring the Chairman of the Joint Chiefs of Staff’s top 5 most critical Joint IAMD capabilities: wide-area surveillance and engagement quality tracking, pre-launch interdiction, non-kinetic post-launch capabilities, ballistic missile discrimination, and increased weapons ranges and lethality.  Nimble Fire events explore joint IAMD capabilities and concepts in the FYDP (+2) timeframe combining experienced operators from the tactical communities, virtual simulations accredited by the program offices, current and future advanced capabilities, an integrated air, ballistic and cruise missile threat, and informed scenarios from the Department’s analytical agenda and CCMD operational plans.  JIAMDO brings together stakeholders across the engineering, analytical, and tactical communities to conduct multiple events to assess Joint interoperability of Service and MDA programs of record, explore concepts of employment, inform tactics, techniques and procedures and concepts of operation, provide insights that help shape CCMD integrated priorities and future operational plans, and inform senior leader acquisition and requirements decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "In response to JROC tasking, JIAMDO built upon FY 2015 accomplishments executing two Nimble Fire events in FY 2016 in support of the Services, MDA, USEUCOM, USPACOM, and USSTRATCOM and providing funding and personnel that were instrumental in successfully executing two additional events in support of the Joint Strike Fighter Joint Project Office (JSF JPO) and the Navy respectively.  Across all four events executed in FY 2016, Nimble Fire project resulted in significant cost-avoidance for the Department and Services through identifying real-world system issues, supporting live venues, and providing the backbone simulation environment for other users.  Major accomplishments include:\n•\tIdentifying real-world issues on multiple systems including E-2, E-3, Integrated Air and Missile Defense Battle Command System (IBCS), and F-15. Issues fed back to program offices to take corrective action\n•\tImpact of advanced capabilities on tactical fight (details classified)\n•\tHuman-machine and Link-16 network challenges associated with executing integrated fire control kill chains\n•\tPotential benefits of future sensors, weapons and capabilities (e.g., next generation jammer (NGJ), airborne early warning)\n•\tConcepts of employment (CONEMPS) for 4th and 5th generation fighters employing with F-35 Joint Strike Fighter to inform Service tactics, techniques and procedures (e.g., Air Force 3-1) \n•\tUSMC operator feedback on CAC2S tactical display and CTN interface identified key limitations with respect to track functionality \n•\tContinued exploration of Naval Integrated Fire Control – Counter Air (NIFC-CA) related kill chains (details classified)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.230"
                                            },
                                            "Text": {
                                                "val": "Execute two Nimble Fire events in support of U.S. Fleet Forces Command, USPACOM, USSTRATCOM and USEUCOM.  Provide material support for two additional Service and\/or program office events.  Additionally, accomplish significant upgrades to the VWC environment and IAMD systems and capabilities:\n•\tElectronic Warfare improvements in coordination with USSTRATCOM, Joint Electromagnetic Preparedness for Advanced Combat (JEPAC), the Services and MDA to better model red and blue electronic attack and electronic protection, visualize impacts, and conduct analysis of its impact on the tactical fight.  E.g., Eagle Passive-Active Warning Survivability Systems (EPAWSS) for F-15, Integrated Defensive Electronic Countermeasures (IDECM) for F\/A-18E, Surface Electronic Warfare Improvement Program (SEWIP) for Aegis, basic electromagnetic interference effects, and foundation for representing GPS modeling\n•\tMulti-spectral Environment improvements include upgrading the simulation backbone and service models to better handle capabilities such as Infrared Search and Track (IRST) sensors and kill chains, environmental effects such as rain and clouds, and higher-fidelity threat signatures \n•\tAdvanced Capability Model improvements include expanded integrated fire control concepts involving capabilities such as Naval Integrated Fire Control – Counter Air (NIFC-CA) and fighter-centric kill chains, incorporation of advanced sensor capabilities such as the new IAMD Radar (AMDR) for Aegis, Link-16 network enhancements, future threat kill chains and capabilities, and directed energy.  Additionally, integrate an Advanced Gun Weapon System model into the environment to explore tactical command and control challenges and contributions to the overall defense of critical assets\n•\tSpace Warfare – integrate higher fidelity representations of Overhead Persistent Infrared (OPIR) assets and national to tactical (N2T) contributions to the tactical fight\n•\tNon-Program of Record Experimentation of innovative uses of existing sensors and weapons across traditional IAMD assets.  E.g., ground-based sensors providing fire-control quality tracking to tactical air assets, contributions of unmanned assets to the air picture and joint engagement sequence\n•\tExplore integration of offensive and defensive capabilities (kinetic and non-kinetic) in protection of select critical assets in USEUCOM"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "Execute two large Nimble Fire events in support of U.S. Fleet Forces Command, USPACOM, USSTRATCOM and USEUCOM.  Provide material support for two additional Service and\/or program office events.  Additionally, accomplish significant upgrades to the VWC environment and IAMD systems and capabilities:\n•\tElectronic Warfare improvements in coordination with USSTRATCOM, JEPAC, the Services and MDA to better model red and blue electronic attack and electronic protection, visualize impacts, and conduct analysis of its impact on the tactical fight  E.g., Eagle Passive-Active Warning Survivability Systems (EPAWSS) for F-15, Integrated Defensive Electronic Countermeasures (IDECM) for F\/A-18E, Surface Electronic Warfare Improvement Program (SEWIP) for Aegis, basic electromagnetic interference effects, and foundation for representing GPS modeling\n•\tMulti-spectral Environment improvements include upgrading the simulation backbone and service models to better handle capabilities such as Infrared Search and Track (IRST) sensors and kill chains, environmental effects such as rain and clouds, and higher-fidelity threat signatures \n•\tAdvanced Capability Model improvements include expanded integrated fire control concepts involving capabilities such as Naval Integrated Fire Control – Counter Air (NIFC-CA) and fighter-centric kill chains, incorporation of advanced sensor capabilities such as the new IAMD Radar (AMDR) for Aegis, Link-16 network enhancements, future threat kill chains and capabilities, and directed energy.  Additionally, integrate an Advanced Gun Weapon System model into the environment to explore tactical command and control challenges and contributions to the overall defense of critical assets\n•\tSpace Warfare – integrate higher fidelity representations of Overhead Persistent Infrared (OPIR) assets and national to tactical (N2T) contributions to the tactical fight\n•\tNon-Program of Record Experimentation of innovative uses of existing sensors and weapons across traditional IAMD assets.  E.g., ground-based sensors providing fire-control quality tracking to tactical air assets, contributions of unmanned assets to the air picture and joint engagement sequence\n•\tExplore integration of offensive and defensive capabilities (kinetic and non-kinetic) in protection of select critical assets in USEUCOM"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Complete events within schedule and budget.\n\n(2) Document gaps and shortfalls.\n\n(3) Inform the Joint Capabilities Board (JCB) on results and findings.\n\n(4) Specific details are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P006"
                    },
                    "ProjectTitle": {
                        "val": "Cruise Missile Combat Identification (CID)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "57.264"
                        },
                        "PriorYear": {
                            "val": "6.356"
                        },
                        "CurrentYear": {
                            "val": "6.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.500"
                        },
                        "BudgetYearTwo": {
                            "val": "5.498"
                        },
                        "BudgetYearThree": {
                            "val": "4.355"
                        },
                        "BudgetYearFour": {
                            "val": "4.475"
                        },
                        "BudgetYearFive": {
                            "val": "4.475"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cruise Missile Combat Identification (CID)"
                                    },
                                    "Description": {
                                        "val": "Establishes joint requirements for emerging national and tactical combat identification technology and\npositions it for fielding to frontline weapon systems and the warfighter. Monitors, assesses, and enhances current joint Air and Cruise Missile Defense Combat ID programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.356"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not required for Budget Activities 1, 2, 3 and 6."
                        },
                        "PerformanceMetrics": {
                            "val": "Details of this program are classified."
                        }
                    }
                }
            ]
        }
    }
}