{
    "id": "2018-Army-PB-2040-JBOOK-4d642436f65ddc83c084fdb1d917f4809eff5a3f2d9cca01c78cf59a8dd3a26e-17",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602720A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.270"
            },
            "CurrentYear": {
                "val": "22.151"
            },
            "BudgetYearOne": {
                "val": "21.678"
            },
            "BudgetYearOneBase": {
                "val": "21.678"
            },
            "BudgetYearTwo": {
                "val": "21.818"
            },
            "BudgetYearThree": {
                "val": "22.201"
            },
            "BudgetYearFour": {
                "val": "22.665"
            },
            "BudgetYearFive": {
                "val": "24.149"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates and evaluates enabling tools and methodologies that support the long-term sustainment of Army training and testing activities. Specific focus is on maintaining regulatory compliance while limiting future Army liability to installation operations and training, and maintaining resilient and adaptive ranges. Project 048 improves the Army's ability to comply with requirements mandated by federal, state and local environmental\/health laws and to reduce the cost of this compliance. Project 835 develops enabling technologies for advanced life cycle analysis, advanced sensing, and advanced remediation of Army-unique hazardous and toxic wastes at sites containing waste ammunition, explosives, heavy metals, propellants, smokes, chemical munitions, and other organic contaminants. Project 895 focuses on reducing hazardous waste generation through process modification and control, materials recycling and substitution, and developing technologies to predict and mitigate range and maneuver constraints associated with current and emerging weapon systems, doctrine, and regulations. Project 896 investigates technologies for ecosystem vulnerability assessment, and ecosystem analysis, monitoring, modeling, and mitigation to support sustainable use of Army lands and airspace to reduce or eliminate environmental constraints to military missions.   \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nTechnologies developed in this PE are transitioned to PE 0603728A (Environmental Quality Technology Demonstrations).  \n\nWork in this PE is performed by the Army Engineer Research and Development Center, Vicksburg, MS, and the Army Research, Development, and Engineering Command, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.850"
                },
                "CurrentYear": {
                    "val": "22.151"
                },
                "BudgetYearOne": {
                    "val": "22.640"
                },
                "BudgetYearOneBase": {
                    "val": "22.640"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.270"
                },
                "CurrentYear": {
                    "val": "22.151"
                },
                "BudgetYearOne": {
                    "val": "21.678"
                },
                "BudgetYearOneBase": {
                    "val": "21.678"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.580"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.962"
                },
                "BudgetYearOneBase": {
                    "val": "-0.962"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.580"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.038"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.038"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "048"
                    },
                    "ProjectTitle": {
                        "val": "Ind Oper Poll Ctrl Tec"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.320"
                        },
                        "CurrentYear": {
                            "val": "2.718"
                        },
                        "BudgetYearOne": {
                            "val": "2.860"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.860"
                        },
                        "BudgetYearTwo": {
                            "val": "2.901"
                        },
                        "BudgetYearThree": {
                            "val": "2.967"
                        },
                        "BudgetYearFour": {
                            "val": "3.025"
                        },
                        "BudgetYearFive": {
                            "val": "3.089"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops tools and methods to enable the Army to reduce or eliminate environmental impacts both in the United States and abroad. These new and innovative technologies are essential for the effective control and reduction of military unique hazardous and non-hazardous wastes on military installations and associated with contingency operations bases worldwide. To develop the required technologies, this Project has a focus on developing sustainable environmental protection technologies that help the Army maintain environmental compliance for sources of pollution such as production facilities, facility contamination, and other waste streams; a focus on Army-unique ecosystem vulnerability assessment, and ecosystem analysis, modeling, adaptation, and mitigation technologies for installations associated with air quality and endangered species management and their impacts on training and testing missions; a focus on designing and developing technologies for deployed forces with environmentally safe, operationally enhanced, and cost effective technologies or processes to achieve maximum diversion, minimization, or volume reduction of base camp and field waste; and a focus on the impacts of new materiel that will enter the Army inventory within the next decade and beyond. The resultant technologies reduce the impact of legal and regulatory environmental restrictions on installation facilities, training and testing lands and ranges, as well as provide a means to avoid fines and facility shutdowns within the United States and reduce environmental impacts to the Warfighter abroad.\n\nThe work in this Project supports the Army Science and Technology (S&T) Innovation Enablers Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this Project is performed by the Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands"
                                    },
                                    "Description": {
                                        "val": "This effort supports management of operations on ranges and training lands with the intent to reduce constraints and restrictions resulting from environmental regulations. Technologies are targeted toward solutions for environmental compliance and associated requirements, as well as solutions that will enhance training and testing operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.388"
                                            },
                                            "Text": {
                                                "val": "Developed a training land conflict analysis framework that accounts for current and future live training requirements and Threatened and Endangered Species (TES) distributions to assess impacts of proposed species listings on training land requirements; investigated innovative techniques for assisted species movement to minimize potential training impacts to Army lands; explored the use of low-cost manufactured social cues for listed and at-risk species as a non-invasive means of moving species away from conflict with current and proposed live training land use requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.763"
                                            },
                                            "Text": {
                                                "val": "Will develop methodologies for identifying and quantifying potential impacts to training by current and future TES. Will develop novel training land conflict analysis algorithms that quantify and predict military training land use requirements to identify conflicts between TES and training on Army installations and mitigation strategies. Will develop innovative and cost-effective techniques to implement regional and installation TES conflict mitigation strategies that facilitate species movement from areas in conflict with training to areas not in conflict. Will explore biologically inspired sensing capabilities to enhance endangered species management strategies on Army lands and ranges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.893"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.893"
                                            },
                                            "Text": {
                                                "val": "Will investigate relationships and relational patterns between physical and social data in select contingency areas of concern to enable Military security planners to anticipate climate and extreme weather induced impacts to security and readiness threats. Will research relational changes in environmental variability data and changes in human behavior to assess correlation with social-environmental trends and conflict trends as seen in hazard and conflict models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive & Resilient Installations"
                                    },
                                    "Description": {
                                        "val": "This effort develops sustainable, cost efficient, and effective facilities; and provides technologies and techniques for achieving resilient and sustainable installation and base operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.932"
                                            },
                                            "Text": {
                                                "val": "Developed and evaluated the next generation of water production and distribution capabilities through the development of wastewater treatment\/reuse and water quality monitoring technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.955"
                                            },
                                            "Text": {
                                                "val": "Will investigate biologically inspired materials and concepts for fouling resistance, as well as microbes that enhance in situ performance for water sustainment technologies to minimize external net water demand at Army contingency bases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.967"
                                            },
                                            "Text": {
                                                "val": "Will investigate new coatings that promote water vapor deposition and shedding coupled with current waste vapor streams\/sources. Will investigate closed loop water treatment process technologies to determine best candidates in Army relevant conditions for contingency bases."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "835"
                    },
                    "ProjectTitle": {
                        "val": "Mil Med Environ Crit"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.759"
                        },
                        "CurrentYear": {
                            "val": "7.803"
                        },
                        "BudgetYearOne": {
                            "val": "8.005"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.005"
                        },
                        "BudgetYearTwo": {
                            "val": "8.043"
                        },
                        "BudgetYearThree": {
                            "val": "8.200"
                        },
                        "BudgetYearFour": {
                            "val": "8.364"
                        },
                        "BudgetYearFive": {
                            "val": "8.534"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates a quantitative means to determine the environmental effects resulting from exposure to Army-unique explosives, propellants, smokes, and products containing nanomaterials and new and emerging compounds and materials across Army training and operations. This research provides the basis for tools and methods to respond to regulatory constraints, and to protect the health of the Soldier and the extended Army community. Results of this research will be integrated into the life cycle analysis of all new Army materials and chemicals. The specific results of this research include: determination of acceptable contaminant concentration levels for residual Army-unique chemicals and materials of concern to minimize adverse effects on the environment and human health. This includes development of methods that guide the design of nanomaterials and other new and emerging materials such that adverse effects on the environment are minimized in their designed state and when they enter the environment where they may break down. Example areas of research include genomics analysis, cutting edge nanomaterial analysis, and computational\/molecular modeling. Interim products are used by Program Executive Office (PEO) Ammo and PEO Intelligence, Electronic Warfare & Sensors (IEW&S) for use in life cycle analysis, risk assessment, and cleanup. Interim products are also US Environmental Protection Agency approved criteria documents to be used in risk assessment procedures and in establishing regulatory limits. The Army uses these criteria during negotiations with regulatory officials to set scientifically and economically appropriate cleanup and discharge limits on Army lands.\n\nWork in this Project supports the Army Science and Technology (S&T) Innovation Enablers Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this Project is performed by the Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Life Cycle of Military Materials in the Environment"
                                    },
                                    "Description": {
                                        "val": "This effort provides a quantitative means to determine the environmental and human health effects resulting from exposure to existing and emerging compounds and materials produced in Army industrial, field, and battlefield operations or disposed of through past activities. Results of this research will be integrated into the life cycle analysis process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.198"
                                            },
                                            "Text": {
                                                "val": "Devised more extensive hazard screening tools for life cycle assessments to enable sustainable development of insensitive munitions and acquisition streamlining by providing proactive, relevant information on hazard risks; developed software tools containing methods and modules for science-based improvements with improved characterization factors for environmental impact of military unique hazardous materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.460"
                                            },
                                            "Text": {
                                                "val": "Will investigate environmental life cycle, health, and safety impacts from potential exposure to evolving insensitive military munitions, constituents, and unique materials impacting next generation weapons systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Will develop a new eco-toxicity life cycle assessment framework designed to optimize the cost-benefit of environmental data collections to address pre-Milestone B environmental assessment guidelines."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials and Nanotechnology: Environmental Effects previously called Nanotechnology-Environmental Effects"
                                    },
                                    "Description": {
                                        "val": "This effort enables the Army's ability to field advanced nano-based technologies by appropriate identification and assessment of the environmental impacts of nanomaterials. The end result of this research is the development of tools that guide and influence the design of nanomaterials based on such factors as adverse effects on human health or on the environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.561"
                                            },
                                            "Text": {
                                                "val": "Devised a tiered environment, health, and safety evaluation process with supporting test\/screening methodologies that will enable rapid fielding and sustainability of current and future Army nanotechnologies and facilitate reduced time and cost of acquisition; developed a consistent process for nanotechnology risk screening to enable sustainable development, transition, and acquisition that address liability concerns that often result in technology delays or termination."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.013"
                                            },
                                            "Text": {
                                                "val": "Will investigate the unique properties of nanomaterials utilized in munitions to determine environmental fate and impact. Will utilize understanding of nanomaterial properties to develop next generation remediation technologies for Army unique contaminants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.063"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.063"
                                            },
                                            "Text": {
                                                "val": "Will investigate and categorize technologies of military relevant advanced and additive materials, including nanotechnologies and additive manufacturing techniques, to discriminate high and low risk areas as relevant to Chemical Data Reporting under the Toxic Substances Control Act."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Risk Prediction and Decision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort enables the Army to predict and understand the fate and transport of Army-unique compounds and materials which improves the capability to detect, control, and remediate. This effort develops advanced engineering concepts utilizing advanced materials, biological processes, and nanomaterials in remediation processes."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.330"
                                            },
                                            "Text": {
                                                "val": "Will research data driven predictive frameworks and tools for assessment of on-site bioremediation technologies for contaminated soils and groundwater that facilitate adaptive installation management under the paradigm of changing Arctic\/Subarctic climates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.742"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.742"
                                            },
                                            "Text": {
                                                "val": "Will develop empirical datasets of soil structure, geochemistry, and microbial community composition and function from bench and medium-scale studies to identify on-site contaminant degradation processes and limitations in arctic and subarctic climates. Will investigate the most relevant metrics needed to characterize synthetic biology environmental impacts of military relevance and quantify their relative importance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "895"
                    },
                    "ProjectTitle": {
                        "val": "Pollution Prevention"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.337"
                        },
                        "CurrentYear": {
                            "val": "3.474"
                        },
                        "BudgetYearOne": {
                            "val": "2.473"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.473"
                        },
                        "BudgetYearTwo": {
                            "val": "2.474"
                        },
                        "BudgetYearThree": {
                            "val": "2.473"
                        },
                        "BudgetYearFour": {
                            "val": "2.542"
                        },
                        "BudgetYearFive": {
                            "val": "3.614"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Project develops pollution prevention technologies required to reduce\/eliminate the environmental footprint resulting from the manufacture, maintenance, use and surveillance of Army ordnance and other weapon systems. This Project researches and develops revolutionary technologies to eliminate or significantly reduce the environmental impacts that threaten the sustainment of production and maintenance facilities, training ranges and operational areas. The Project supports the transformation of the Army by ensuring that advanced energetic materials required for high-performance munitions (gun, rocket, missile propulsion systems, and warhead explosives) are devised to meet weapons lethality\/survivability stretch goals in parallel with, and in compliance to, foreseeable sustainment requirements. Specific technology thrusts include environmentally-benign explosives developed with computer modeling using Department of Defense high-performance computing resources; novel energetics that capitalize on the unique behavior of nano-scale structures; chemically engineered explosive and propellant formulations produced with minimal environmental waste, long-storage lifetime, rapid\/benign environmental degradation properties, and efficient extraction and reuse; and fuses, pyrotechnics, and initiators that are free from toxic chemicals. Other focus areas include toxic metal reductions from surface finishing processes, sustainable military paints and coatings to meet evolving environmental requirements and low global warming potential alternatives for refrigerants, fire suppressants and solvents. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas.\n\nTechnologies developed in this Project are fully coordinated and complementary to Program Element (PE) 0603728A, Project 025. \n\nWork in this Project is performed by the Research, Development and Engineering Command Army Research Laboratory, Aberdeen Proving Ground, MD, the Armaments Research, Development, and Engineering Center, Picatinny Arsenal, NJ, the Aviation and Missile Research, Development, and Engineering Center, Huntsville, AL, and the Tank Automotive Research, Development and Engineering Center, Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pollution Prevention Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops pollution prevention technologies to reduce\/eliminate the environmental footprint resulting from the manufacture, maintenance, use and surveillance of Army ordnance and other weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.337"
                                            },
                                            "Text": {
                                                "val": "Conventional Ammunition: Developed precision loading processes for novel lead-free primer formulations; Rocket and Missile Propellants: Conducted static motor testing of novel lead-free burn rate modifiers in minimum signature applications; Toxic Metal Reduction: Developed and refined portable hexavalent chromium-free process for generating wear resistant surface coatings."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.474"
                                            },
                                            "Text": {
                                                "val": "Will develop novel green chemistry approaches to energetic material synthesis; will reformulate metal-rich primers to reduce harmful pollutants while improving corrosion protection; will explore candidate fire suppressants with low global warming potential to determine their viability in military applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.473"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.473"
                                            },
                                            "Text": {
                                                "val": "Will optimize green synthesis methods for melt cast explosives as potential alternatives to trinitrotoluene (TNT); will explore synthesis of novel high nitrogen primary explosive compounds to replace lead used in primers and detonators; will develop sustainable coatings for magnesium protection and electromagnetic shielding of aircraft; will conduct laboratory-scale performance testing on alternative fire suppressants with low global warming potential."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "896"
                    },
                    "ProjectTitle": {
                        "val": "Base Fac Environ Qual"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.854"
                        },
                        "CurrentYear": {
                            "val": "8.156"
                        },
                        "BudgetYearOne": {
                            "val": "8.340"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.340"
                        },
                        "BudgetYearTwo": {
                            "val": "8.400"
                        },
                        "BudgetYearThree": {
                            "val": "8.561"
                        },
                        "BudgetYearFour": {
                            "val": "8.734"
                        },
                        "BudgetYearFive": {
                            "val": "8.912"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops tools as well as identification and assessment methodologies for ecosystem vulnerability assessment, analysis, monitoring, modeling, and mitigation to support sustainable use of Army facilities, training lands, firing ranges, and airspace to reduce or eliminate environmental constraints to military and how the use of those resources effect mission support and environmental compliance. The Project investigates, designs, and develops novel methods and missions, providing the Army with the technical capability to manage, protect, and improve the biophysical characteristics of training and testing areas needed for realistic and sustainable ranges and training lands. Technologies within this Project enable users to match mission events and training schedules with the resource capabilities of specific land areas and understand technologies to adapt and restore lands damaged during training activities and allow sustained use of Army resources. The Project supports readiness and full use of training lands through development of invasive, threatened, and endangered species monitoring technology, and management technologies for species at risk. The Project also designs and develops tools and technologies to avoid training restrictions and reduce constraints on training lands associated with potential impacts from climate change. \n\nWork in this Project supports the Army Science and Technology (S&T) Innovation Enablers Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this Project is performed by the Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands"
                                    },
                                    "Description": {
                                        "val": "This effort provides ecosystem vulnerability assessment, analysis, monitoring, modeling, and mitigation technologies to support sustainable use of Army facilities, training lands, firing ranges, and airspace to reduce or eliminate environmental constraints to military missions. This effort targets integrated military land-appropriate management and control technologies for selected high priority Army land management issues including Threatened and Endangered Species (TES), Species at Risk (SAR), and invasive species. This effort enables effective management of training lands by understanding the cumulative impacts of training and non-training land use activities on critical natural resources under current and potential future climate conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.848"
                                            },
                                            "Text": {
                                                "val": "Developed capabilities that incorporate direct and indirect impacts of climate change and related trending dynamic conditions into critical Army enterprise decisions; provided a tiered approach to climate change impact assessments that scale from local to national scale applications. Extended climate change assessment analyses to include maneuver area capacity, live-fire range capacity, and facility operations and maintenance costs. Developed advanced military noise assessment capabilities that rapidly characterize military noises, uncertainties, and impacts to allow installations to comprehensively characterize and adaptively manage their noise footprint, impacts, and restrictions. Developed algorithms that transform geostatistical military noise maps from installation noise monitoring systems into community impact maps."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.056"
                                            },
                                            "Text": {
                                                "val": "Will complete development of a suite of analysis tools that will provide climate-sensitive metrics using underlying models that are based on the best scientific understanding of climate-change impacts and related dynamics. These tools will integrate climate-change forecasts and data to assess impacts to installation decision metric values that affect Army enterprise planning decisions. Will develop innovative noise detection, classification, and location algorithms that translate raw discrete multi-sensor noise monitoring data into source specific event groups of known identities and locations to cost effectively automate management of installation noise monitoring systems. Will develop data driven, self-learning, adaptive military noise forecast algorithms that utilize installation site-specific noise monitoring data for improved prediction of noise levels, certainty, and community impact."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.150"
                                            },
                                            "Text": {
                                                "val": "Will investigate tools, algorithms, procedures and guidance to manage installation noise in real-time; develop integrated simulation tools that incorporate weather, terrain, and mission activity into forecasting models for probability of noise complaints; investigate alternative TES management strategies and supporting technologies to respond to emerging TES mitigation policies; develop methodologies for prioritizing regional-level TES management strategies to minimize training impacts due to listed species."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Materials in the Environment"
                                    },
                                    "Description": {
                                        "val": "This effort develops models to predict chemical behavior in simple and complex environmental media (e.g. soils, water). These models will allow for improved understanding of how compounds and materials will move, bind, and degrade when introduced into the environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.006"
                                            },
                                            "Text": {
                                                "val": "Applied a multidisciplinary approach (geochemical, geographical, soil science, and computational chemistry) to develop an understanding of soils and contaminants in austere environments; applied sophisticated genetic algorithms to develop empirical and validated functions correlating soil morphological designations to multidimensional soil geochemical properties."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Will determine soil designations among soil taxonomy systems to form the basis for developing calibrated soil process models. Will devise a robust predictive model that is capable of using inherent soil characteristics to determine the potential risks associated with environmentally relevant military activities (i.e. fate and transport of contaminants). The model design will address a large array of environmental quality problems associated with both the Continental United States (CONUS) and Outside of the Continental United States (OCONUS) military activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.190"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.190"
                                            },
                                            "Text": {
                                                "val": "Will validate a robust predictive model that is capable of using inherent soil characteristics to determine the potential risks associated with environmentally relevant military activities (i.e. fate and transport of contaminants). Will investigate computational approaches for important physical and chemical properties of insensitive munitions compounds in water, arid, and semi-arid environments to predict their fate and effects in natural water and in arid or semi-arid soils. Will generate a computational model to predict potential chemical-biological interactions at the molecular level for assessment of military compounds."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}