{
    "id": "2018-AirForce-PB-3600-MJBOOK-0-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-19",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603270F"
        },
        "ProgramElementTitle": {
            "val": "Electronic Combat Technology"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "45.359"
            },
            "CurrentYear": {
                "val": "58.250"
            },
            "BudgetYearOne": {
                "val": "60.551"
            },
            "BudgetYearOneBase": {
                "val": "60.551"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "61.945"
            },
            "BudgetYearThree": {
                "val": "62.607"
            },
            "BudgetYearFour": {
                "val": "64.800"
            },
            "BudgetYearFive": {
                "val": "62.016"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to support Air Force electronic combat warfighting capabilities.  The program focuses on developing components, subsystems, and technologies with potential aerospace combat, special operations, and airlift electronic combat applications. It develops and demonstrates technologies for integrating electronic combat sensors and systems into a fused and seamless whole. It integrates and focuses research efforts in electronic warfare (EW) and cyber warfare to rapidly demonstrate a capability for rapid fielding. It develops and demonstrates technologies for navigation and timing in radio frequency (RF) contested and denied environments. It develops and demonstrates advanced technologies for RF electronic combat suites and advanced warning and countermeasure technologies to defeat electro-optical, infrared, and laser threats to aerospace platforms. It also develops and demonstrates technologies that identify and mitigate avionics system cyber vulnerabilities as well as protects avionics and other critical technologies. This program has been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nStarting in FY 2017 to improve reporting to Congress, Project 634335, Cyber Concepts was created to capture all cyber activity that was previously performed under Project 633720, EW Quick Reaction Capabilities. \n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "46.946"
                },
                "CurrentYear": {
                    "val": "58.250"
                },
                "BudgetYearOne": {
                    "val": "60.851"
                },
                "BudgetYearOneBase": {
                    "val": "60.851"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.359"
                },
                "CurrentYear": {
                    "val": "58.250"
                },
                "BudgetYearOne": {
                    "val": "60.551"
                },
                "BudgetYearOneBase": {
                    "val": "60.551"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.587"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.300"
                },
                "BudgetYearOneBase": {
                    "val": "-0.300"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.510"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.077"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.300"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.300"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "633720"
                    },
                    "ProjectTitle": {
                        "val": "EW Quick Reaction Capabilities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.497"
                        },
                        "CurrentYear": {
                            "val": "30.912"
                        },
                        "BudgetYearOne": {
                            "val": "31.254"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.254"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "34.200"
                        },
                        "BudgetYearThree": {
                            "val": "35.531"
                        },
                        "BudgetYearFour": {
                            "val": "38.072"
                        },
                        "BudgetYearFive": {
                            "val": "34.887"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project establishes a capability to rapidly assess, develop and demonstrate new electronic warfare concepts, techniques, and capabilities as well as the required navigation technologies and capabilities in the context of systemic electronic warfare (EW) effects (EW-threat interactions) in a congested\/contested electromagnetic spectrum (EMS), system-of-systems (SoS) environment of the future. It develops disruptive EW and countermeasures concepts specifically selected for high-impact, game-changing effects; evaluates them in high fidelity virtual and hardware evaluation settings; and demonstrates them in an operationally relevant environment.\nIt establishes and maintains an all-source, physics-based, threat-to-countermeasures EW systems engineering methodology. It develops a core analytic function, supported by simulation-based wargaming and interactive engineering modeling capabilities to evaluate advanced countermeasures concepts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Disruptive EW and Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop disruptive EW and countermeasure concepts specifically selected for rapidly fieldable, high-impact effects and demonstrate them in an operational environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.792"
                                            },
                                            "Text": {
                                                "val": "Leveraged developments in directed energy and cyber techniques to effectively simulate electronic attack against a modeled integrated air defense network to determine deficiencies in the attack capability. Focused\nresearch methods to mitigate the determined deficiencies in attack methodology and developed alternative strategies for employment to enable successful suppression of threat representative integrated air defense\nsystems. Began to develop capabilities to integrated RF\/infrared (IR) sensors to improve situational awareness & self protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.790"
                                            },
                                            "Text": {
                                                "val": "Continue to develop capability to use RF electronic attack (EA) techniques to deliver cyber effects. Continue supporting the cyber efforts in Project 634335, Cyber Concepts, to model cyber effects on an integrated\nair defense system and simulate their utility. Continue to develop, integrate and demonstrate required navigation and timing technologies required for distributed EA concepts. Continue to develop and evaluate\ncountermeasures to adversary use of satellite navigation. Continue to integrate RF\/IR sensors to improve situational awareness and self protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.943"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.943"
                                            },
                                            "Text": {
                                                "val": "Conduct sense, learn, and adapt demonstrations illustrating advancements in electromagnetic spectrum awareness, reasoning, and collaborative effects. Demonstrate advanced counter satellite navigation techniques\nin an operational environment. Begin the development and demonstration efforts to prove the concepts for “full spectrum” countermeasures capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat-to-Countermeasure System of Systems (SoS) Methods"
                                    },
                                    "Description": {
                                        "val": "Establish and maintain an all-source, physics-based, design-level, red-blue, comparative, threatto-countermeasure SoS techniques methodology. This systems engineering-based EW approach will inform programmatic planning, quantify desirable research areas with realistic SoS metrics, and foster improved understanding of future concept contributions to EW warfighting capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.871"
                                            },
                                            "Text": {
                                                "val": "Demonstrated improvements in SoS analysis capability through virtual simulation mechanisms. Used metrics to show the value added proposition of multi-spectral techniques to address the threat to countermeasure system\nperformance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Continue to use system engineering analysis techniques to identify the requirements for SoS operations in anti-access\/area-denial (A2\/AD) environments. Specifically work toward showing how EW techniques and\ncapabilities can be modeled and show support of mission operations (such as Intelligence Surveillance Reconnaissance (IRS) or strike) in A2\/AD scenarios. Continue to develop, integrate and demonstrate required navigation technologies required for SoS operations in\nA2\/AD environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.089"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.089"
                                            },
                                            "Text": {
                                                "val": "Demonstrate robust distributed time transfer in a Global Positioning System (GPS) jamming environment. Demonstrate effects of a coordinated EA capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Evaluation of Advanced Countermeasure Concepts"
                                    },
                                    "Description": {
                                        "val": "Develop a core analytic function, supported by simulation-based wargaming and engineering modeling capabilities for evaluation, development, and demonstration of advanced EW, cyber, directed energy (DE) and integrated\/systemic, non-kinetic concepts to include special capability programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.834"
                                            },
                                            "Text": {
                                                "val": "Demonstrated reconfigurable closed-loop hardware-in-the-loop (HWIL) assessment capability for discovering and evaluating advanced EW techniques, including diverse distributed concepts. This development of advanced techniques will ensure aircraft survivability against future threats with highly agile and adaptable waveform structures. Demonstrated in-house analysis and assessment technologies for countering A2\/AD scenarios. Demonstrated the Proactive Mid-Infrared Situation Awareness (MISA) system in tower and field tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.122"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the navigation work in this effort was performed in Program 0603203F, Advanced Aerospace Sensors, Project 63655A, Advanced Aerospace Sensors Technology, under the effort Integrated Navigation Technologies.\nFor FY2017 and beyond, the advanced cyber technology work accomplished under this effort will be reported in Project 634335, Cyber Concepts, under the efforts, Avionics Cyber Vulnerabilities and Avionics Cyber\nProtections. Continue development, integration and demonstration of required navigation technologies required for operations in contested and denied environments. Develop adaptable threat emulation capability to simulate modern and expected threats for future conflicts. Use these simulations to assess blue force hardware against these future red force systems. Conduct flight tests of the MISA system. Analyze the data and refine the requirements for AFSOC scenarios. Begin the data collection and analysis of the advanced defeat concepts for imaging sensors. Refine requirements for lasers required to defeat this threat class."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.222"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.222"
                                            },
                                            "Text": {
                                                "val": "Continue data collection on advanced imaging sensor defeat mechanisms and conduct requirements trades for system transition architectures. Continue the development of advanced missile warning technologies for\nlong-range detection. Demonstrate adaptable threat emulation capability to simulate modern and expected future EW threats. Demonstrate trusted use of foreign satellite navigation signals through signal authentication\ntechniques, constellation signal monitoring and data dissemination, and jamming countermeasure techniques. Address size, weight and power (SWAP)requirements for application to the whole range of Air Force platforms. Begin\nthe incorporation of the proactive situational awareness (SA) and countermeasures capabilities into engagement models."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63431G"
                    },
                    "ProjectTitle": {
                        "val": "RF Warning & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.622"
                        },
                        "CurrentYear": {
                            "val": "19.671"
                        },
                        "BudgetYearOne": {
                            "val": "18.284"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.284"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "17.012"
                        },
                        "BudgetYearThree": {
                            "val": "15.106"
                        },
                        "BudgetYearFour": {
                            "val": "14.560"
                        },
                        "BudgetYearFive": {
                            "val": "14.688"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced technologies for radio-frequency electronic combat suites, including the required navigation technologies and capabilities, to enhance the survivability of aerospace vehicles and to provide crew situational awareness. The research addresses technologies for missile\/threat warning, radio-frequency receivers, electronic combat pre-processors, advanced sorting\/pre-processing algorithms, and expert software for applications on existing and future electronic combat systems. The research also focuses on the development and demonstration of subsystems and components for generating on-board\/ off-board radio-frequency countermeasure techniques. This includes the development of electronic countermeasures techniques, as well as advanced electronic countermeasures technologies such as antennas, power amplifiers, and preamplifiers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Attack"
                                    },
                                    "Description": {
                                        "val": "Develop aerospace platform jamming concepts, technologies and techniques to counter advanced RF threats associated with current and future aerospace weapon systems. Provide navigation system resilience via open architecture solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.622"
                                            },
                                            "Text": {
                                                "val": "Collected and analyzed high fidelity RF data representative of airborne high threat engagements. Leveraged advances in cognitive machine learning from DARPA and industry to perform demonstrations and assessments that measured improved abilities to autonomously identify modern adaptive programmable threats. Developed concepts\/techniques to ascertain the efficacy of advanced EA methods employed against modern threats to close the loop allowing optimization of the EA technique. Prototyped an example government reference architecture on the next generation of embedded GPS inertial (EGI) system avionics. Initiated requirements definition and systems engineering analysis for an advanced EW receiver algorithm and architecture project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.671"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the navigation work in this effort originally was performed in Program 0603203F, Advanced Aerospace Sensors, Project 63655A, Advanced Aerospace Sensors Technology, under the effort Integrated Navigation Technologies. Continue to collect and analyze high fidelity RF data representative of airborne high threat engagements. Continue to develop\nconcepts\/techniques and advanced EA methods (techniques and employment) against modern threats to close the loop allowing a more optimized EA effectiveness. Perform demonstrations and assessments in cognitive machine learning from Air Force,DARPA and industry that measure improved abilities to autonomously identify modern adaptive programmable threats. Develop algorithms for vision aiding the navigation solution in a targeting pod. Initiate an external industry-led project in advanced EW receiver algorithms and architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.284"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.284"
                                            },
                                            "Text": {
                                                "val": "Continue efforts in advanced electronic warfare (EW) receiver algorithms and architectures, as well as machine learning (“cognitive”) algorithms. Continue research into innovative EA concepts\/techniques including use of closed loop, cooperatively controlled, distributed unmanned aerial vehicles (UAVs) and their performance against integrated air defense networks and adaptable techniques for use against any threats. Fabricate and demonstrate an advanced capability EA pod against emerging,\nhigh priority threats. Develop, integrate and demonstrate distributed EA concepts and their required navigation and datalink technologies. Demonstrate integration of navigation signals of opportunity and vision aiding into an open EGI system prototype."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634335"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Concepts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.635"
                        },
                        "BudgetYearOne": {
                            "val": "6.087"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.087"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.876"
                        },
                        "BudgetYearThree": {
                            "val": "7.017"
                        },
                        "BudgetYearFour": {
                            "val": "7.116"
                        },
                        "BudgetYearFive": {
                            "val": "7.288"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates methods to discover cyber susceptibilities, assess avionics systems, formulate mitigation strategies, and investigate use of tools and technologies to automate this process. It is designed to apply developed vulnerability discovery, vulnerability mitigation, and cyber protection technology to avionics systems and components and embedded systems.\n\nProject 634335, Cyber Concepts is new for FY 2017. Work from this effort was previously performed under Project 633720, EW Quick Reaction Capabilities, in this program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Vulnerabilities"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate methods, techniques, and technical tools to enable, assist, and improve the vulnerability discovery processes.  Use developed tools and techniques to assess avionics boxes, systems, busses, and components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.464"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the work for this effort originally was performed in Project 633720, EW Quick Reaction Capabilities, under the effort Evaluation of Advanced Countermeasure Concepts.\n\nPrototype and demonstrate a series of cyber testing tools that assess vulnerabilities related to deficiencies in traditional testing (i.e. positive testing) that does not consider cyber effects.  Assess USAF platforms (manned, unmanned aircraft) and weapon systems for specific cyber vulnerabilities and develop avionics enhancements to increase security and resiliency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.382"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.382"
                                            },
                                            "Text": {
                                                "val": "Continue vulnerability investigations with the intent to provide a standardized methodology and set of tools for performing a thorough cyber vulnerability assessment of a weapon system. Transition assessment tools to DoD test communities.  Continue to develop and transition protection\/mitigation technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Protections"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced automated analysis tools and protection techniques to prevent exploitation of cyber susceptibilities in avionics systems.  This strategy would include discovery and mitigation of likely attack vectors, remediation of susceptibilities, and safeguards to assure the integrity of embedded software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.171"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the work for this effort originally was performed in Project 633720, EW Quick Reaction Capabilities, under the effort Evaluation of Advanced Countermeasure Concepts.\n\nPrototype and demonstrate a suite of protection tools composed of application, operating system kernel, hypervisor and hardware-assisted technologies to provide defense-in-depth of avionics, sensors, and weapon systems. This demonstration will focus on protections for a representative intelligence surveillance and reconnaissance (ISR) platform.  Develop a patterns database that detects and classifies benign and malicious behaviors, and validate proof-of-concept for x86 computer architectures.  Create other architecture specific translators (e.g. PowerPC) to further validate concept."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.705"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.705"
                                            },
                                            "Text": {
                                                "val": "Continue to extend 2017 work on a suite of protection tools with focus on their application to unmanned aircraft systems (UAS) platforms.  Prototype and demonstrate a platform independent malware feature selection capability. Investigate automation and optimization of malware detection and classification work using machine learning techniques."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63691X"
                    },
                    "ProjectTitle": {
                        "val": "EO\/IR Warning & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.240"
                        },
                        "CurrentYear": {
                            "val": "5.032"
                        },
                        "BudgetYearOne": {
                            "val": "4.926"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.926"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.857"
                        },
                        "BudgetYearThree": {
                            "val": "4.953"
                        },
                        "BudgetYearFour": {
                            "val": "5.052"
                        },
                        "BudgetYearFive": {
                            "val": "5.153"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates the advanced warning and countermeasure technologies required to negate electro-optical \/ infrared, (EO\/IR) and laser threats to aerospace platforms.  Develops off-board (decoys and expendables) and on-board countermeasure technologies for aircraft self-protection to provide robust, affordable solutions for protection against infrared missiles with autonomous seekers, multi-spectral threats, laser-guided weapons, and EO\/IR tracking systems used to direct EO\/IR and radar-guided missiles."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Electro-Optical (EO)\/Infrared (IR) Warning and Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "Analyze the vulnerabilities of current IR missile systems and future imaging IR sensors. Develop advanced countermeasure system technologies to exploit vulnerabilities for use against IR and EO guided missile threats. Develop advanced optical and infrared sensor systems for airborne and space situational awareness and threat warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.240"
                                            },
                                            "Text": {
                                                "val": "Characterized and exploited several advanced threat IR guided missiles and collected laboratory and field data on many EO\/IR fire-control systems and sensors including night vision goggles and thermal imagers. Continued the development of high-fidelity surrogates and associated algorithms, scene generation and modeling and simulation for testing and countermeasure development and verification\/correlation to hardware in the loop results. Defined the requirements for novel countermeasure effects against advanced IR and multispectral threats. Conducted data collection using advanced next generation missile warning sensors and hostile fire indication system. Transitioned an advanced laser warning and protection capability to the US Army."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.032"
                                            },
                                            "Text": {
                                                "val": "Develop advanced capability to defeat imaging optical sensors across the EO spectrum from ultra-violet (UV) to long-wave infrared wavelengths. Investigate low size, weight, power, and cost systems for smaller\/expendable platforms to enhance their survivability in active threat areas using the modeling and HWIL simulation capability established through this funding area.  Perform verification and validation activities utilizing the MOdeling System for Advanced Investigation of Countermeasures (MOSAIC), infrared countermeasure (IRCM) engagement model and correlate results with the Guided Weapon Evaluation Facility and the US Navy laboratories at China Lake."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.926"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.926"
                                            },
                                            "Text": {
                                                "val": "Continue characterization and exploitation of newly acquired advanced threats.  Correlate the results from the at-range testing of EO\/IR adjuncts to integrated air defense systems (IADS) and refine the requirements for the detection and countermeasure concepts and demonstration system to defeat multi-spectral threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}