{
    "id": "2018-Army-PB-2040-JBOOK-8aa6116a07f4d60601a05c4a1332e7f28609a7e32c0f8c7666562466c33015eb-37",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0303142A"
        },
        "ProgramElementTitle": {
            "val": "SATCOM Ground Environment (SPACE)"
        },
        "R1LineNumber": {
            "val": "216"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.045"
            },
            "CurrentYear": {
                "val": "18.815"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "27.860"
            }
        },
        "ProgramElementNote": {
            "val": "FY18 and out funding realigned to APE 0103142  reflect new Major Force Program 12 (MFP12) Space configuration."
        },
        "ProgramElementMissionDescription": {
            "val": "Military Satellite Communication (MILSATCOM) systems are joint program\/project efforts to satisfy ground mobile requirements for each Service, the Joint Chiefs of Staff (JCS), the National Command Authority, the combatant commanders, the Office of the Secretary of Defense, and other governmental, non-DoD users.  The worldwide MILSATCOM systems are: the Super High Frequency (SHF) Defense Satellite Communications System (DSCS); the Wideband Global SATCOM (WGS); the MILSTAR Extremely High Frequency (EHF) Low Data Rate (LDR) and Medium Data Rate (MDR); the Advanced Extremely High Frequency (AEHF); and future MILSATCOM capabilities. All of these systems are required to support legacy, interim and emerging communication space architectures and Future Force requirements. The Army is responsible for materiel development, acquisition, product improvement, testing, fielding and integrated logistics support of ground satellite terminals and SATCOM control subsystems and all associated equipment used to provide range extension of Mission Command Networks and Systems. The Army also participates in the development of MILSATCOM programs, including architectures, payloads, waveforms, antennas and terminal developments to ensure US Army equities are appropriately addressed with our sister services.  This includes technology assessment efforts associated with the integration of MILSATCOM components to US Army LandWarNet. This responsibility also includes maintaining the life cycle logistics support required to achieve end-to-end connectivity and interoperability, satisfying JCS network operations in support of the President, JCS, combatant commanders, Military Departments, Department of State, and other government Departments and Agencies. EMC supports Global Response Force (GRF) and other Army units with the requirement to conduct Airborne forcible entry operations with the ability to conduct mission command.  \n\nThis program is designated as a DoD Space Program."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.355"
                },
                "CurrentYear": {
                    "val": "18.815"
                },
                "BudgetYearOne": {
                    "val": "10.677"
                },
                "BudgetYearOneBase": {
                    "val": "10.677"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.045"
                },
                "CurrentYear": {
                    "val": "18.815"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.310"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-10.677"
                },
                "BudgetYearOneBase": {
                    "val": "-10.677"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.310"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-10.677"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.677"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 funding realigned to APE 0103142  reflect new Major Force Program 12 (MFP12) Space configuration"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "253"
                    },
                    "ProjectTitle": {
                        "val": "Dscs-Dcs (Phase II)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.573"
                        },
                        "CurrentYear": {
                            "val": "5.164"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.737"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "As result of the new Major Force Program 12 (MFP12) Space Configuration, OSD directed this funding line transition to 173142\/FE1 in FY18 and beyond."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funds to develop Satellite Communication (SATCOM) ground subsystem equipment and software in support of Joint Chiefs of Staff (JCS) validated Mission Command Network and Systems requirements for the worldwide Defense Enterprise Wideband SATCOM System (DEWSS).  DEWSS is composed of the Super High Frequency (SHF) Defense Satellite Communications System (DSCS) and Wideband Global SATCOM (WGS) programs, which are required to support legacy, interim and emerging communication space architectures and future Force requirements.  Expansion of the WGS constellation and upgrades to both DSCS and WGS are vital to support the Army's emerging power projection and rapid deployment role.  DSCS and WGS provide multiple channels of tactical end-to-end connectivity and interoperability with strategic networks and national decision-makers, satisfying JCS network operations in support of the President, JCS, combatant commanders, military departments, Department of State and other government departments and agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SATCOM Terminal Digital IF Implementation Analysis"
                                    },
                                    "Description": {
                                        "val": "SATCOM Terminal Digital IF Implementation Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.290"
                                            },
                                            "Text": {
                                                "val": "Conducted a preliminary survey of available Commercial off the shelf Digital IF network devices.  Assess interoperability certification, IA accreditation and readiness for integration into DoD Gateways."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Interference Mitigation Analysis"
                                    },
                                    "Description": {
                                        "val": "Electromagnetic Interference Mitigation Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.975"
                                            },
                                            "Text": {
                                                "val": "Completed Protected Transponded SATCOM efforts and conducted a complete system evaluation at Joint SATCOM Engineering Center (JSEC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.814"
                                            },
                                            "Text": {
                                                "val": "Build a prototype network of 6 modems and integrate with Gateway equipment at Joint SATCOM Engineering Center (JSEC).  Study Anti-Jam System behavior when subjected to real threat in a classified environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improve WSOC Situational Awareness"
                                    },
                                    "Description": {
                                        "val": "Improve WSOC Situational Awareness"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.308"
                                            },
                                            "Text": {
                                                "val": "Funded WSOMS database consolidation effort to evaluate existing database schemas (structure) for each independent Wideband Control subsystem.  The result of the analysis will be to define a structure of a consolidated database along with a transition plan.  The desired impact will be to reduce total cost of ownership for multiple subsystems in terms of recurring annual licensing costs and shorten logistics trail with associated database storage equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Continue analysis for Netcentric System Engineering"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20"
                                    },
                                    "Title": {
                                        "val": "Defense Enterprise Wideband SATCOM Systems (DEWSS) (BB8500)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "172.306"
                                        },
                                        "CurrentYear": {
                                            "val": "143.805"
                                        },
                                        "BudgetYearOne": {
                                            "val": "161.383"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "161.383"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "125.787"
                                        },
                                        "BudgetYearThree": {
                                            "val": "135.036"
                                        },
                                        "BudgetYearFour": {
                                            "val": "117.599"
                                        },
                                        "BudgetYearFive": {
                                            "val": "141.392"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "As result of the new Major Force Program 12 (MFP12) Space Configuration, OSD directed this funding line transition to 173142\/FE1 in FY18 and beyond.\n\nThis effort finances Project Manager, Defense Communications and Army Transmission Systems (PM DCATS) Netcentric systems engineering, modem risk mitigation, and DoD Information Assurance Certification Accreditation Process (DIACAP) support.  Funding provides for SATCOM terminal upgrades, enhancement of baseband throughput capabilities, technology insertion and upgrades which enhance decision support capabilities, allowing for full utilization of Wideband Global SATCOM (WGS) capabilities.  Both the Wideband SATCOM Operational Management System (WSOMS) and the Enterprise Wideband SATCOM Terminal System (EWSTS) Capability Production Documents (CPDs) contain Netcentric-Ready Key Performance Parameters (NR-KPPs) as required by CJCSI 6212.01C.  Netcentric efforts are required to facilitate the migration from the current trunk-based communications systems to Internet Protocol (IP) based systems and to engineer, test and integrate IP based capabilities into EWSTS and WSOMS systems.  Studies, risk mitigation, system integration and advanced demonstrations for Netcentric baseband and policy based control will accommodate technology insertion, data sharing, remote operations, architecture efforts and use of commercial technology, thus ensuring the life of the Defense Enterprise Wideband System (DEWSS) terminal family beyond 2025 and reducing lifecycle costs and enterprise requirements on the WGS and Defense Satellite Communication System (DSCS) satellites in the future."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "456"
                    },
                    "ProjectTitle": {
                        "val": "MILSATCOM System Engineering"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.908"
                        },
                        "CurrentYear": {
                            "val": "4.287"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.195"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY18 and out funding will be realigned to 0103142A.FE2 to reflect the new Major Force Program 12 (MFP12) Space configuration."
                        },
                        "ProjectMissionDescription": {
                            "val": "Military Satellite Communications (MILSATCOM)System Engineering (SE) assures that tactical Army Satellite Communications (SATCOM) and SATCOM On-The-Move (SOTM) systems are engineered to legally and efficiently operate worldwide. MILSATCOM SE shapes Joint SATCOM systems' design efforts, standards development and planning processes. MILSATCOM SE represents the Army's tactical interests within DoD, Commercial & International forums to ensure affordable and scalable future SATCOM capabilities for maneuver forces. These efforts, performed by MILSATCOM SE, lead to savings for the overall Army in the out years.\n\nFY 17 funds support the continued systems engineering required to support technology maturation, systems analysis, and planning associated with joint SATCOM development efforts including complying with the outcome of the Protected SATCOM communications Systems (PSCS) Analysis of Alternatives (AoA), the follow-on Wideband AoA, and other efforts that have impact on tactical Army use of military and commercial satellite constellations. These efforts have a direct impact in reducing technical and programmatic risk for the acquisition efforts for tactical Army SATCOM systems using these constellations.\n\nFY18 and out funding will be realigned to 0103142A.FE2 to reflect the new Major Force Program 12 (MFP12) Space configuration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Protected Communications System Engineering"
                                    },
                                    "Description": {
                                        "val": "Protected Communications System Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.454"
                                            },
                                            "Text": {
                                                "val": "Protected Communications System Engineering"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.354"
                                            },
                                            "Text": {
                                                "val": "Protected Communications System Engineering"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wideband Global SATCOM (WGS) Communications System Engineering"
                                    },
                                    "Description": {
                                        "val": "WGS Communications System Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.454"
                                            },
                                            "Text": {
                                                "val": "WGS Communications System Engineering to improve Ku\/Ka antenna SWAP"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.833"
                                            },
                                            "Text": {
                                                "val": "WGS Communications System Engineering to improve Ku\/Ka antenna SWAP"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation, development, testing and certification of critical SATCOM and Satellite-On-The-Move (SOTM) communication and network technologies."
                                    },
                                    "Description": {
                                        "val": "Experimentation, development, testing and certification of critical SATCOM and SOTM communication and network technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Experimentation, development, testing and certification of critical SATCOM and SOTM communication and network technologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "FY18 and out funding will be realigned to 0103142A.FE2 to reflect the new Major Force Program 12 (MFP12) Space configuration."
                        },
                        "AcquisitionStrategy": {
                            "val": "This project funds advanced systems engineering, research, development, test and evaluation of new and emerging technologies to optimize terminal performance and communications control.  Once the technologies are mature and deemed feasible, funding and management responsibility for implementation of the technology will transition to WIN-T and related PoRs."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EA3"
                    },
                    "ProjectTitle": {
                        "val": "Transportable Tactical Cmd Comms (T2C2)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.203"
                        },
                        "CurrentYear": {
                            "val": "3.652"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.855"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Transportable Tactical Command Communications (T2C2) extends the Warfighter Information Network Tactical (WIN-T) network to small company and team sized early entry units. The T2C2 system is based on combat proven capabilities and provides robust voice and data communication capabilities. The T2C2 systems will also integrate users into the higher capacity WIN-T network and extend that network to the tactical edge; T2C2 also enables warfighters in select small Command Posts (CP) (typically Company level) and select Army teams to send and receive time sensitive Situational Awareness (SA), Intelligence, and Mission Command (MC) information while At-the-Halt (ATH) in support of all Joint determined and defined operational phases.  These phases span from the initial Shaping Phase, designed to dissuade or deter adversaries and assure mission friends, to Deterrence, Initiative Seizure and Domination phases culminating with post maneuver Stabilization and Enabling of Civil Authorities enabling legitimate civil governance in safe and secure environment. FY17 funds are in support of T2C2 systems (Light and Heavy) Initial Operational Test & Evaluation (IOT&E) to inform a Full Rate Production (FRP) decision scheduled for 4Q FY17 (on track)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "T2C2 Testing"
                                    },
                                    "Description": {
                                        "val": "Testing requirements to achieve FRP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.203"
                                            },
                                            "Text": {
                                                "val": "Supports testing requirements including Electromagnetic testing, Enviornmental testing, a Network interoperability test, Joint Interoperability Testing Command (JITC) Certification, and initial planning and instrumentation for the Initial Operational Test & Evaluation event."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.652"
                                            },
                                            "Text": {
                                                "val": "Initial Operational Test & Evaluation at the Network Integration Event (NIE) 17.2 (May 2017)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B85800"
                                    },
                                    "Title": {
                                        "val": "Transportable Tactical Command Communications (T2C2)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "47.305"
                                        },
                                        "CurrentYear": {
                                            "val": "36.580"
                                        },
                                        "BudgetYearOne": {
                                            "val": "62.600"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "62.600"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "62.988"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.444"
                                        },
                                        "BudgetYearFour": {
                                            "val": "79.022"
                                        },
                                        "BudgetYearFive": {
                                            "val": "80.606"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Transportable Tactical Command Communications (T2C2) program Acquisition Strategy (AS) is based on integration of existing Commercial-Off-the-Shelf (COTS)\/Non-Developmental Items (NDI) into new integrated systems fielded in the needed configuration for small teams or small unit Command Posts (CP) to allow these units to receive and transmit data. T2C2 will provide a high bandwidth tactical network extension for small unit CPs operating beyond line-of-sight from their higher headquarters and for teams operating outside the full tactical network architecture. The acquisition strategy leverages an existing Small Business Innovation Research (SBIR) Phase III Indefinite Delivery Indefinite Quantity (IDIQ) contract supporting the commercialization of the preceding SBIR efforts. T2C2 will utilize a two-level maintenance concept, will be Soldier-maintained, and initially supported by Interim Contractor Support. An analysis will be conducted to determine the ultimate supportability path. This strategy will allow a capability to be integrated and delivered quickly to support a limited deployment of Low Rate Initial Production (LRIP) units in FY17 required for Production Verification and the Initial Operational Test and Evaluation (IOT&E), with Full-Rate Production (FRP) planned for 4Q FY17."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EK8"
                    },
                    "ProjectTitle": {
                        "val": "Enroute Mission Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.361"
                        },
                        "CurrentYear": {
                            "val": "5.712"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.073"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funds in this program element are for testing requirements.  FY16\/17 RDTE funds are on Program Element 0303142A\/EK8 SATCOM Ground Environment (SPACE).   Funds in FY18 and out have been realigned to support the establishment of the Major Force Program 12 (MFP12) Program Element 173142\/FE4; program is not a New Start."
                        },
                        "ProjectMissionDescription": {
                            "val": "Enroute Mission Command (EMC) supports the Global Response Force (GRF) and other Army units with the requirement to conduct Airborne forced entry operations with the ability to conduct mission command, to include mission planning and rehearsal, while enroute on board US Air Force Air Mobility Command (AMC) aircraft. EMC provides a modernization to enroute communications to enable broadband reach-back data capability utilizing military or commercial networks with adequate bandwidth support required by Mission Command and Intelligence applications. EMC will provide commanders with the ability to obtain and share near real-time information regarding intelligence, situational awareness and command and control information while enroute to their objective.  The ability to adjust plans and strategize utilizing the latest Intel data will give the GRF the information dominance needed to execute their mission once they arrive at their objective.  \n\nFY17 funding will support test by the Army Test and Evaluation Command (ATEC) during Operational Assessment (OA).  The OA supports the Milestone Decision Authority (MDA) Disposition Decision (FY18) to continue procurement and fielding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EMC Testing"
                                    },
                                    "Description": {
                                        "val": "EMI\/EMC, Flight Test and Operational Assessment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.361"
                                            },
                                            "Text": {
                                                "val": "Flight Test and EMI\/EMC Testing"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.712"
                                            },
                                            "Text": {
                                                "val": "Operational Asessment"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B08400"
                                    },
                                    "Title": {
                                        "val": "Enroute Mission Command"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.116"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.667"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.667"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "23.072"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.957"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "57.812"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The continued procurement of the EMC full operational capability follows DoDI 5000.02, 7 Jan 2015, Enclosure 13, Rapid Fielding of Capabilities. The Milestone Decision Authority (MDA) and project manager will tailor and streamline program strategy based on the required timelines to meet urgent need capability requirements. The Army Executive Agent signed an Acquisition Decision Memorandum (ADM) on 27 April 2015 delegating MDA to PEO C3T.  The MDA signed an ADM on 11 May 2015 selecting the KuKa Antenna and Radome for the Full Operational Capability (FOC). An ADM was signed on 20 May 2015 granting approval to enter into production and deployment phase.  \n\nDue to rephasing of FY17 OPA funding into FY18\/19, program has been restructured.  Initial Operational Capability met in May 2015 with modification of five C-17s with satellite antennae and installation kits, and roll-on\/roll-off, battalion level, Key Leader Node (KEN).   Full Operational Capability (FOC) is 35 C-17s, seven KENs and 21 company level Dependent Airborne Nodes (DAN) and an airborne command post suite (CASPAN).  FOC is currently projected for FY20.  Planning to field an interim capability and conduct an Operational Assessment in FY17.\n\nFY17 RDT&E funding supports test by the Army Test and Evaluation Command (ATEC) during Operational Assessment (OA).  The OA supports the Milestone Decision Authority (MA) Disposition Decision (FY18) to continue procurement and fielding."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}