{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c43fbf6cbb750060d4e843075183a8e999b0dddb3a2f8fae77d834880adb92d8-30",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604055D8Z"
        },
        "ProgramElementTitle": {
            "val": "Operational Energy Capability Improvement"
        },
        "R1LineNumber": {
            "val": "66"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "144.175"
            },
            "PriorYear": {
                "val": "40.387"
            },
            "CurrentYear": {
                "val": "37.329"
            },
            "BudgetYearOne": {
                "val": "38.403"
            },
            "BudgetYearOneBase": {
                "val": "38.403"
            },
            "BudgetYearTwo": {
                "val": "40.914"
            },
            "BudgetYearThree": {
                "val": "40.976"
            },
            "BudgetYearFour": {
                "val": "41.715"
            },
            "BudgetYearFive": {
                "val": "42.539"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The basic mission of this program element is to fund innovation to improve the Department of Defense’s (DoD) operational effectiveness via targeted operational energy science and technology (S&T) investments.\n\nP455, the Operational Energy Capability Improvement Fund (OECIF), incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy.  OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects.  First, to develop operational energy technologies and practices that will improve DoD military capabilities and possibly reduce costs.  Second, to establish within the military Services institutional momentum to continue those innovations.  OECIF funds serve as “seed money” to start or consolidate promising operational energy innovation to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects.\n\nP456, the Hybrid Energy Storage Module (HESM), co-sponsored by the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) and the Assistant Secretary of Defense for Energy, Installations and Environment (ASD(EIE)), develops advanced energy storage technologies to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships. The goals of HESM are to (1) demonstrate energy storage systems with high power\/energy densities, scalable to all power levels, that reduce total logistics demand, (2) increase platform ability to sustain operations during engagement, and (3) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services and will be used to extend the operational performance and safety for these applications beyond the hybrid storage module baseline design configuration. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy's (DOE) Advanced Research Projects Agency - Energy (ARPA-E)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.420"
                },
                "CurrentYear": {
                    "val": "37.329"
                },
                "BudgetYearOne": {
                    "val": "37.403"
                },
                "BudgetYearOneBase": {
                    "val": "37.403"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.387"
                },
                "CurrentYear": {
                    "val": "37.329"
                },
                "BudgetYearOne": {
                    "val": "38.403"
                },
                "BudgetYearOneBase": {
                    "val": "38.403"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.967"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.000"
                },
                "BudgetYearOneBase": {
                    "val": "1.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "4.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.033"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Operational Energy Capability Improvement"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "None"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P455"
                    },
                    "ProjectTitle": {
                        "val": "Operational Energy Capability Improvement"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "126.012"
                        },
                        "PriorYear": {
                            "val": "40.387"
                        },
                        "CurrentYear": {
                            "val": "37.329"
                        },
                        "BudgetYearOne": {
                            "val": "38.403"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.403"
                        },
                        "BudgetYearTwo": {
                            "val": "40.914"
                        },
                        "BudgetYearThree": {
                            "val": "40.976"
                        },
                        "BudgetYearFour": {
                            "val": "41.715"
                        },
                        "BudgetYearFive": {
                            "val": "42.539"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The basic mission of this program element is to fund innovation to improve the Department of Defense’s (DoD) operational effectiveness via targeted operational energy science and technology (S&T) investments.  \n\nP455, the Operational Energy Capability Improvement Fund (OECIF), incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy.  OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects.  First, to develop operational energy technologies and practices that will improve DoD military capabilities and possibly reduce costs.  Second, to establish within the military Services institutional momentum to continue those innovations.  OECIF funds serve as “seed money” to start or consolidate promising operational energy innovation to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "OECI"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "For the shorter term projects, plans for FY16 include: continue Operational Test and Evaluation of new Soldier Power equipment, and advance the Soldier Power program to Milestone-C\/Low-Rate Initial Production; investigate possible protections to cyber-security threats at defense fuel supply points and installations; implement a data collection plan to develop a set of behavior change strategies and design an experiment to verify the efficacy of those strategies; test novel membrane based dehumidification systems to reduce the air conditioning energy consumption of ground forces and ships in dock; improve analysis tools, analyze integration of a waste heat recovery system into a representative Naval platform, and begin fabrication of an exhaust gas heat exchanger for a 2017 demonstration with a gas turbine waste heat recovery system; integrate photovoltaic panels, power management and max power point tracking into the UAVs and conduct flight tests of up to five UAVs demonstrating through-the-night and multiple day endurance with zero fuel; conduct at-sea tests of promising energy-saving technologies and establish an enduring process for companies to quickly try out their technologies at sea; and prepare for a W2E industry day, develop guidance for contingency base waste management, and demonstrate a medium-sized waste disposal system."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Energy Capability Improvement Fund"
                                    },
                                    "Description": {
                                        "val": "The basic mission of the OECIF is to fund innovation that will improve DoD operational effectiveness via targeted S&T investments. As Defense-Wide funding, it incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy.  OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects.  First, to develop operational energy technologies and practices that will improve DoD military capabilities and possibly reduce costs.  Second, to establish within the military Services institutional momentum to continue those innovations.  OECIF funds serve as “seed money” to start or consolidate promising operational energy innovations to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.387"
                                            },
                                            "Text": {
                                                "val": "The Transformative Reductions in Operational Energy Consumption (TROPEC) program, which started in FY12, reached its final year of funding.  TROPEC conducted four field assessments and completed three lab assessments, partnered with two winning FY16 OECIF unmanned systems proposals, delivered two newsletters, and coordinated with countless organizations on future assessment opportunities.\n\nThe consortia programs begun in FY13 generally reached their conclusion.  The Tactical Microgrid Standards Consortium (TMSC) incorporated DoD and industry comments and finalized the draft Tactical Microgrid Standards.  The Energy Efficient Outpost Modeling Consortium (EEOMC) completed the verification and validation (V&V) plan for the Energy Resource Planning Tool, updated the Commander's Application to enhance mode prioritization and optimization of generators and demonstrated with hardware, and offered pilot courses on energy efficiency in expeditionary operations.  The Soldier and Small Unit Power consortium assisted the Marines in drafting their Dismounted Forces Energy Requirements Concept of Employment policy document; utilized the Power and Energy Test Bed to characterize Nett Warrior baseline configurations for Program Executive Office (PEO) Soldier supporting Program of Record Milestone decisions; and established a multi-agency, multi-Service consortium to coordinate Dismounted Warfighter efforts for the future.  The Engineered Surface Materials and Coatings Drag Reduction consortium conducted flight tests, and reviewed proposals and made Phase 1 technology maturation awards to selected drag reduction “Challenge” winners.\n \nThe analytical methods programs started in FY14 have continued.  The Synthetic Theater Operations Research\nModel-Energy (STORM-E) effort translated a series of tool-based, OE focused, roadmap model enhancements, and performed Expeditionary Force 21 (EF 21) scenario development activities for implementation in STORM.  The Operational Energy Analysis Task Force (OEATF) completed V&V of technical reports for the Fuel Consumption Prediction Model (FCPM) and Shelter Thermal Energy Model (STEM); conducted Soldier-level excursions using the Infantry Warrior Simulation (IWARS) to investigate the impact of system failure during combat operations; completed scenario enhancements for the second of three scenarios; continued to make enhancements to the Fully Burdened Cost Tool (FBCT) and successfully transitioned FBCT operations to the Tank Automotive Research, Development and Engineering Center (TARDEC); and completed the baseline Phase IV model using the System of Systems Analysis Toolset (SoSAT).  The Joint Deployment Energy Planning and Logistics Optimization Initiative (J-DEPLOI) program brought software developer Group W on contract, developed a plan for integration of their decision support tool into the Map-Based Planning Services (MBPS) system, began adaption of existing software code to meet new requirements for fuel planning, and completed an implementation directive for the new tool's development.  The Comprehensive Operational Energy (COE) Toolkit program completed the programming and graphical user interface to measure, model, and examine the installation OE damage and capacity reduction caused by enemy interdiction.  The Mission Engineering Analytical Method for Operational Energy program (MEAM) integrated and refined prototype tools with as much verified fuel consumption data as could be identified and developed a range of excursion assessments based upon wartime scenarios, established cost analysis methodology, and investigated the ability of the tool to support future surface combatant platform design and force structure.  The Capability Assessment & Modeling for Energy Logistics (CAMEL) program developed methods and tools to explore airlift and aerial refueling effects within anti-access\/area-denial (A2AD) environments; explored the impact of counter operational energy threats, military infrastructure investment and adaptive basing strategies; completed analysis of advanced combat engine technology impacts; and began analysis of costs incurred with flex basing.\n\nThe major program started in FY15 is called “Improving Fuel Economy for the Current Ground Tactical Fleet Program,” and consists of four separate programs.  The Thermally Efficient Cylinders program prepared and reconfigured the single-cylinder test laboratory for efficiency and heat rejection measurements, and developed a testing and modeling and simulation plan.  The Tactical Vehicle Electrification Kit (TVEK) program has completed two major System Engineering processes (TARGET GATE 1 - Ideation & Scoping  Concepts & Feasibility, and System Needs Review) to kick off the project, began procuring critical long lead inverter controllers (20kW and 75kW), procured Caterpillar (CAT) 15 engine and instrumentation for fuel map testing, signed Memoranda of Agreements (MOAs) with all internal and external Integrated Project Team (IPT) organizations, and completed market surveys for DC\/DC converters and other electrification subsystems.  The Automation\/Smart Cruise Control program completed Phase I of single vehicle simulation, upgraded hardware, and conducted vehicle tests.  The Modeling and Simulation (M&S) for Vehicle Light-Weighting program began developing the analytical framework for the baseline Finite-Element Analysis (FEA) system model and Multi Body Dynamics model to generate loading for the FEA model, examined various vehicle components to target for light-weighting, and conducted weight optimization studies on components.\n        \nThe Joint Infantry Company Prototype (JIC-P) program performed small scale user evaluations with multiple units, conducted a human factors study on the kinetic harvesters, and continued to improve M&S data.\n \nFor the shorter term projects funded using add money from FY15, accomplishments for FY16 include the following.  The Cyber program completed seven cyber-security threat assessments at defense fuel supply points and installations.  The M&S Federations program has succeeded in finalizing contracts with all performers, and secured agreements to participate throughout the life of the program with Departmental partners designated as potential transition partners for any capabilities developed.\n\nNew programs started in FY16 reflect a shift within OECIF from an emphasis on contingency bases to one on mobile platforms for the Pacific.  The new program focus will improve the operational energy performance of unmanned air, sea and ground systems that could be used in the Pacific.  The Reliable, Efficient, Tactical Unmanned Aerial System (UAS) Power System program identified the contract vehicle and worked on the contract award to build the Great Horned Owl engine.  The Hybrid Tiger team developed the major software architecture for hybrid vehicle control, completed initial vehicle (wing) sizing to include spreadsheet analysis of combined fuel cell and solar performance, and initiated a contract through the Naval Research lab Contracting Division.  The Hydrothermal Vent Exploitation for Undersea Power and Energy (HTVE-UE) program initiated the funding coordination documentation for awarding a small business performer contract, and commenced several of the studies and analyses related to HTV characteristics, potential environment impacts of this initiative, and various concepts of operations (CONOPS).  The Aluminum-Water Power for Unmanned Undersea Vehicles program began testing of the start system, and component requirements are being defined for the preferred configuration.  The Small Turboprop Engine Range\/Power Enhancement program initiated the procurement package for the engine demonstration, started the Operational Benefits Analysis (OBA), completed the baseline engine model, is working on the Improved Performance Technology Engine (IPTE) model, and is working with the Air Force and Pacific Command (PACOM) on selecting missions of interest for the MQ-9 Reaper to use to assess operational benefit.  The JP-8 Fuel Cell Power program awarded two contracts to begin JP-8 reformer based fuel cell power system development, and began concept refinement and initial instrumentation diagrams."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.329"
                                            },
                                            "Text": {
                                                "val": "The TMSC program, which began in FY13, will still be active. TMSC will test, validate, and submit the draft Tactical Microgrid Standards for DoD and Service concurrence.\n      \nThe analytical methods programs, which began in FY14, will continue.  The STORM-E effort will advance the EF 21 scenario development and analysis capabilities, identify energy-based risk to operations, examine mitigation solutions, and shape plans and programs.  OEATF will complete the FCPM V&V; complete analysis of the second of three scenarios; complete scenario enhancements for the third of three scenarios; develop an IWARS technical report addressing OE; and represent aerial resupply capability within SoSAT.  J-DEPLOI plans to continue adaptation and development of Group W's fuel planning tool, continue executing the plan for integration with MBPS, and begin verification and testing of the tool's first incremental capabilities.  MEAM plans to assess future force structure and logistics force implications, investigate incorporating Joint and Coalition operations, define warfighting operational effectiveness tactical decision aid requirements, and develop a production plan for resulting tools and methods.  CAMEL will continue analyzing concepts of operations associated with adaptive basing strategies within A2AD environments and the impact to operational energy within airlift and aerial refueling missions; explore overall costs associated with flex basing; and continue enhancements to the modeling, simulation and analysis tool set.\n\nThe FY15 vehicles program will continue.  The Thermally Efficient Cylinders program will conduct single-cylinder engine testing with the first generation coating; the coating and piston optimization will be based on feedback from testing and modeling.  The TVEK project will complete CAT 15 HEMTT A4 engine fuel map testing, test the baseline HEMTT vehicle's auxiliary systems, complete Analysis of Alternatives (AoA) of auxiliary systems for TVEK electrified component selections, develop M&S controls and software for the TVEK supervisory control system, initiate procurement of optimized TVEK components for testing in a system integration lab (SIL) at TARDEC, and conduct System Functional Review and Preliminary Design Review as part of the system engineering process.  The Automation\/Smart Cruise Control program will enter Phase II and conduct convoy vehicle simulations.  The M&S for Vehicle Light-Weighting program will repeat the weight optimization process with various other target components and compare the updated optimized system model with the baseline model.\n\nThe programs begun in FY16 will continue to ramp up during this fiscal year.  The Reliable, Efficient, Tactical UAS Power System program will build the Great Horned Owl engine, which will lead to a runnable second generation engine.  The Hybrid Tiger team will complete vehicle detailed analysis and purchase new wing tooling to build an integrated solar wing, combine software from multiple organizations, and complete end-to-end bench testing in preparation for maiden flight.  The HTVE-UE program will award a small business performer contract and initiate base tasks related to the detailed design, component fabrication and breadboard assembly, and test planning; and expand studies and analyses related to Forward Deployed Energy and Communications Outpost  (FDECO) interoperability, HTV characterization\/environmental considerations, and various CONOPS.  The Aluminum Seawater Power program will begin preliminary component fabrication of hardware and select test equipment.  The Small Turboprop Engine Range\/Power Enhancement program will complete the OBA, complete the engine requirements document and get Air Force concurrence, and will start engine preliminary design.  The JP-8 Based Fuel Cell Power Program will conduct JP-8 reformer maturation, increase the technology readiness level of the solid oxide fuel cell being used in the system, and begin the system level controls strategy and initial integration plan.  \n \nNew programs starting in FY17 may continue the shift within OECIF toward a greater emphasis on fuel consuming mobile platforms for the Pacific.  The focus of these new FY17 programs is likely to reflect input from the Services, various research Communities of Interest within DoD, such as Energy and Power, Ground and Sea Platforms, and Air Platforms, and any developing gaps or opportunities identified by ODASD(OE)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.403"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.403"
                                            },
                                            "Text": {
                                                "val": "FY 2018 Plans:\nThe TMSC program, which began in FY13, will still be active.  TMSC will incorporate DoD and Service comments and publish the final draft for DoD approval.\n\nJ-DEPLOI, which began in FY14, will still be active.  J-DEPLOI plans to complete software development and testing, MBPS integration, and plan transition of the program to MPBS management and PACOM users.\n\nThe FY15 vehicles program will continue.  The Thermally Efficient Cylinders program will test the single-cylinder engine with an optimized coating and piston and will begin laboratory preparations for multi-cylinder testing.  The TVEK program will complete the SIL testing with all sub-systems integrated into the vehicle, evaluate the sub-system fuel savings and M&S results from the Matlab Simulink and the Army Joint Operational Energy Initiative (JOEI) model to determine optimal kit architecture, start integration of kits in the HEMTT and LVSR vehicles, initiate electromagnetic interference testing of sub-systems, and develop vehicle test plans and agreements with testing facilities.  The Automation\/Smart Cruise Control program will complete Phase II by conducting convoy testing, deliver a final report, and provide the developed technology.  The M&S for Light-Weighting program will incorporate novel materials for analysis and compare with the baseline system model.\n\nThe FY16 unmanned vehicles programs will continue.  The Reliable, Efficient, Tactical UAS Power System program will test the second generation engine for power output, specific fuel consumption, altitude, and product reliability.  The Hybrid Tiger team will begin the flight testing phase validating the performance models and tuning flight controller gains, and refine software to emphasize optimal hybrid mode transitions and increased autonomy for soaring.  The HTVE-UE program will continue base tasks related to component fabrication and breadboard assembly and testing, execute at-sea test planning, and perform initial system deployment; and continue studies and analyses related to FDECO interoperability, HTV characterization\/environmental considerations, and CONOPS.  The Aluminum Seawater Power program will go through the next round of component development and testing, and begin integration testing.  The Small Turboprop Engine Range\/Power Enhancement program will begin engine detailed design and acquire long lead materials for engine fabrication.  The JP-8 Based Fuel Cell Power program will conduct physical integration of the JP-8 reformer and solid oxide fuel cell and all supporting hardware, and conduct the first two iterations of system level testing to determine weak parts of the system design.   \n\nThe programs begun in FY17 will continue to ramp up during this fiscal year. \n\nNew programs will start in FY18.  The focus of these new programs is likely to reflect input from the Services, various research Communities of Interest within DoD, such as Energy and Power, Ground and Sea Platforms, and Air Platforms, and any developing gaps or opportunities identified by ODASD(OE)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P456"
                    },
                    "ProjectTitle": {
                        "val": "Hybrid Energy Storage Module (HESM)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.163"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P456, the Hybrid Energy Storage Module (HESM), co-sponsored by the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) and the Assistant Secretary of Defense for Energy, Installations and Environment (ASD(EIE)), develops advanced energy storage technologies to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships.  The goals of HESM are to (1) demonstrate energy storage systems with high power\/energy densities, scalable to all power levels, that reduce total logistics demand, (2) increase platform ability to sustain operations during engagement, and (3) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services and will be used to extend the operational performance and safety for these applications beyond the hybrid storage module baseline design configuration. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy's (DOE) Advanced Research Projects Agency - Energy (ARPA-E)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Energy Storage Module (HESM)"
                                    },
                                    "Description": {
                                        "val": "Co-sponsored by the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) and the Assistant Secretary of Defense for Energy, Installations and Environment (ASD(EIE)), develops advanced energy storage technologies to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships. The goals of HESM are to (1) demonstrate energy storage systems with high power\/energy densities, scalable to all power levels, that reduce total logistics demand, (2) increase platform ability to sustain operations during engagement, and (3) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services and will be used to extend the operational performance and safety for these applications beyond the hybrid storage module baseline design configuration. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy's (DOE) Advanced Research Projects Agency - Energy (ARPA-E)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No longer funded"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No longer funded"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No longer funded"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                }
            ]
        }
    }
}