{
    "id": "2018-Army-PB-2040-JBOOK-8aa6116a07f4d60601a05c4a1332e7f28609a7e32c0f8c7666562466c33015eb-50",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "1203142A"
        },
        "ProgramElementTitle": {
            "val": "SATCOM Ground Environment (SPACE)"
        },
        "R1LineNumber": {
            "val": "231"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "11.959"
            },
            "BudgetYearOneBase": {
                "val": "11.959"
            },
            "BudgetYearTwo": {
                "val": "19.425"
            },
            "BudgetYearThree": {
                "val": "10.484"
            },
            "BudgetYearFour": {
                "val": "10.647"
            },
            "BudgetYearFive": {
                "val": "10.827"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This is not a new start - program realignment from 0303142 APE to reflect the new Major Force Program 12 (MFP12) Space."
        },
        "ProgramElementMissionDescription": {
            "val": "FE1: Dscs-Dcs (Phase II):\nThis project provides funds to develop Satellite Communication (SATCOM) ground subsystem equipment and software in support of Joint Chiefs of Staff (JCS) validated\nMission Command Network and Systems requirements for the worldwide Defense Enterprise Wideband SATCOM System (DEWSS). DEWSS is composed of the\nSuper High Frequency (SHF) Defense Satellite Communications System (DSCS) and Wideband Global SATCOM (WGS) programs, which are required to support\nlegacy, interim and emerging communication space architectures and future Force requirements. Expansion of the WGS constellation and upgrades to both DSCS\nand WGS are vital to support the Army's emerging power projection and rapid deployment role. DSCS and WGS provide multiple channels of tactical end-to-end\nconnectivity and interoperability with strategic networks and national decision-makers, satisfying JCS network operations\n\nFE2: Military Satellite Communications (MILSATCOM)System Engineering (SE):\nMilitary Satellite Communications (MILSATCOM)System Engineering (SE) assures that tactical Army Satellite Communications (SATCOM) and SATCOM On-The-Move (SOTM) systems are engineered to legally and efficiently operate worldwide. MILSATCOM SE shapes Joint SATCOM systems' design efforts, standards development and planning processes. MILSATCOM SE represents the Army's tactical interests within DoD, Commercial & International forums to ensure affordable and scalable future SATCOM capabilities for maneuver forces. These efforts, performed by MILSATCOM SE, lead to savings for the overall Army in the out years.\n\nFE4 \/ Enroute Mission Command:  \nMission Description and Budget Item Justification:\nEnroute Mission Command (EMC) supports the Global Response Force (GRF) and other Army units with the requirement to conduct Airborne forced entry operations\nwith the ability to conduct mission command, to include mission planning and rehearsal, while enroute on board US Air Force Air Mobility Command (AMC) aircraft. EMC\nprovides a modernization to enroute communications to enable broadband reach-back data capability utilizing military or commercial networks with adequate bandwidth\nsupport required by Mission Command and Intelligence applications. EMC will provide commanders with the ability to obtain and share near real-time information\nregarding intelligence, situational awareness and command and control information while enroute to their objective. The ability to adjust plans and strategize utilizing the\nlatest Intel data will give the GRF the information dominance needed to execute their mission once they arrive at their objective.\n\nDue to rephasing of FY17 OPA funding into FY18\/19, program was restructured in Dec 2015. MDA addressed schedule issues (Oct 2016) by authorizing to field a Ku FISA FOC (4QFY17) and complete a Modification Word Order (MWO), adding Ka FISA capability, post Ku FISA FOC.\n\nFY18 funding supports the Ka solution requirement of Wideband Global System (WGS) Terminal and Modem Certification.  The certification process will ensure that terminals conform to the minimum performance and operational control requirements as defined in the WGS Ka-Band Terminal Certification Requirements Document."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "11.959"
                },
                "BudgetYearOneBase": {
                    "val": "11.959"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "11.959"
                },
                "BudgetYearOneBase": {
                    "val": "11.959"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "11.959"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11.959"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program realignment from 0303142 APE to reflect the new Major Force Program 12 (MFP12) Space."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FE1"
                    },
                    "ProjectTitle": {
                        "val": "Dscs-Dcs (Phase II)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.756"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.756"
                        },
                        "BudgetYearTwo": {
                            "val": "5.986"
                        },
                        "BudgetYearThree": {
                            "val": "6.054"
                        },
                        "BudgetYearFour": {
                            "val": "6.207"
                        },
                        "BudgetYearFive": {
                            "val": "6.372"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "As result of the new Major Force Program 12 (MFP12) Space Configuration, OSD directed this funding line replace 0303142A 253 in FY18 and beyond."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides funds to develop Satellite Communication (SATCOM) ground subsystem equipment and software in support of Joint Chiefs of Staff (JCS) validated Mission Command Network and Systems requirements for the worldwide Defense Enterprise Wideband SATCOM System (DEWSS).  DEWSS is composed of the Super High Frequency (SHF) Defense Satellite Communications System (DSCS) and Wideband Global SATCOM (WGS) programs, which are required to support legacy, interim and emerging communication space architectures and future Force requirements.  Expansion of the WGS constellation and upgrades to both DSCS and WGS are vital to support the Army's emerging power projection and rapid deployment role.  DSCS and WGS provide multiple channels of tactical end-to-end connectivity and interoperability with strategic networks and national decision-makers, satisfying JCS network operations in support of the President, JCS, combatant commanders, military departments, Department of State and other government departments and agencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SATCOM Terminal Digital IF Implementation Analysis"
                                    },
                                    "Description": {
                                        "val": "SATCOM Terminal Digital IF Implementation Analysis"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.964"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.964"
                                            },
                                            "Text": {
                                                "val": "Develop interfaces necessary to fully integrate Digital IF technology into DoD gateway architecture.  Complete IA accreditation and finalize interoperability tests and certifications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Interference Mitigation Analysis"
                                    },
                                    "Description": {
                                        "val": "Electromagnetic Interference Mitigation Analysis"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.661"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.661"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop solutions to support satellite communications operating in a contested environment.  Perform interoperability and IA accreditation tests.  Integrate solutions into DoD gateway satellite communications architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improve WSOC Situational Awareness"
                                    },
                                    "Description": {
                                        "val": "Improve WSOC Situational Awareness"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.131"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop solutions to advance the control capability of military and commercial Wideband Satellite payloads.  Increased capability for planning, monitoring, and adapting satellite networks."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20"
                                    },
                                    "Title": {
                                        "val": "Defense Enterprise Wideband SATCOM Systems (DEWSS) (BB8500)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "172.306"
                                        },
                                        "CurrentYear": {
                                            "val": "143.805"
                                        },
                                        "BudgetYearOne": {
                                            "val": "161.383"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "161.383"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "125.787"
                                        },
                                        "BudgetYearThree": {
                                            "val": "135.036"
                                        },
                                        "BudgetYearFour": {
                                            "val": "117.599"
                                        },
                                        "BudgetYearFive": {
                                            "val": "141.392"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "As result of the new Major Force Program 12 (MFP12) Space Configuration, OSD directed this funding line replace 0303142A 253 in FY18 and beyond.\n\nThis effort finances Project Manager, Defense Communications and Army Transmission Systems (PM DCATS) netcentric systems engineering, modem risk mitigation, and Risk Management Framework (RMF) support.  Funding provides for SATCOM terminal upgrades, enhancement of baseband throughput capabilities, technology insertion and upgrades which enhance decision support capabilities, allowing for full utilization of Wideband Global SATCOM (WGS) capabilities.  Both the Wideband SATCOM Operational Management System (WSOMS) and the Enterprise Wideband SATCOM Terminal System (EWSTS) Capability Production Documents (CPDs) contain Netcentric-Ready Key Performance Parameters (NR-KPPs) as required by CJCSI 6212.01C.  Netcentric efforts are required to facilitate the migration from the current trunk-based communications systems to Internet Protocol (IP) based systems and to engineer, test and integrate IP based capabilities into EWSTS and WSOMS systems.  Studies, risk mitigation, system integration and advanced demonstrations for Netcentric baseband and policy based control will accommodate technology insertion, data sharing, remote operations, architecture efforts and use of commercial technology, thus ensuring the life of the Defense Enterprise Wideband System (DEWSS) terminal family beyond 2025 and reducing lifecycle costs and enterprise requirements on the WGS and Defense Satellite Communication System (DSCS) satellites in the future."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FE2"
                    },
                    "ProjectTitle": {
                        "val": "MILSATCOM System Engineering"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "4.203"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.203"
                        },
                        "BudgetYearTwo": {
                            "val": "4.439"
                        },
                        "BudgetYearThree": {
                            "val": "4.430"
                        },
                        "BudgetYearFour": {
                            "val": "4.440"
                        },
                        "BudgetYearFive": {
                            "val": "4.455"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.967"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "FE2: Military Satellite Communications (MILSATCOM)System Engineering (SE) assures that tactical Army Satellite Communications (SATCOM) and SATCOM On-The-Move (SOTM) systems are engineered to legally and efficiently operate worldwide. MILSATCOM SE shapes Joint SATCOM systems' design efforts, standards development and planning processes. MILSATCOM SE represents the Army's tactical interests within DoD, Commercial & International forums to ensure affordable and scalable future SATCOM capabilities for maneuver forces. These efforts, performed by MILSATCOM SE, lead to savings for the overall Army in the out years.\n\nFY17 and prior funding was aligned to 0303142A\/456. \n\nFY18 funds support the continued systems engineering required to support technology maturation, systems analysis, and planning associated with joint SATCOM development efforts including complying with the outcome of the Protected SATCOM communications Systems (PSCS). In addition, FY18 funding covers the Protected Tactical Service Field Demo Modem Testing, Narrowband (MUOS) Analysis of Alternatives (AoA), the follow-on Wideband AoA, Protected Tactical Service Field Demo, NCW Tool Development and Testing and other efforts that have impact on tactical Army use of military and commercial satellite constellations. These efforts have a direct impact in reducing technical and programmatic risk for the acquisition efforts for tactical Army SATCOM systems using these constellations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Protected Communications System Engineering and WGS Communications"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.051"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.051"
                                            },
                                            "Text": {
                                                "val": "Product development for the Protected Communications and WGS Communications System Engineering to improve Ku\/Ka antenna SWAP"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System Engineering Support"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.552"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.552"
                                            },
                                            "Text": {
                                                "val": "In house Engineering Support, Contractor Support and System Architecture & Analysis"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Testing and certification of critical SATCOM and Satellite-On-The-Move (SOTM) communication and network technologies"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Testing and certification of critical SATCOM and SOTM communication and network technologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0303142A\/456"
                                    },
                                    "Title": {
                                        "val": "MILSATCOM System Engineering"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.908"
                                        },
                                        "CurrentYear": {
                                            "val": "4.287"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "5.195"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "FY17 and prior funding was aligned to 0303142A\/456.\n       FY16 0.908M\n       FY17 4.287M"
                        },
                        "AcquisitionStrategy": {
                            "val": "This project funds advanced systems engineering, research, development, test and evaluation of new and emerging technologies to optimize terminal performance and communications control.  Once the technologies are mature and deemed feasible, funding and management responsibility for implementation of the technology will transition to WIN-T and related PoRs."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FE4"
                    },
                    "ProjectTitle": {
                        "val": "Enroute Mission Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.000"
                        },
                        "BudgetYearTwo": {
                            "val": "9.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funds in this program element are for testing requirements. FY16\/17 RDTE funds are on Program Element 0303142A\/EK8 SATCOM Ground Environment (SPACE).   Funds in FY18 and out have been realigned to support the establishment of the Major Force Program 12 (MFP12) Program Element 173142\/FE4; program is not a New Start."
                        },
                        "ProjectMissionDescription": {
                            "val": "Enroute Mission Command (EMC) supports the Global Response Force (GRF) and other Army units with the requirement to conduct Airborne forced entry operations with the ability to conduct mission command, to include mission planning and rehearsal, while enroute on board US Air Force Air Mobility Command (AMC) aircraft. EMC provides a modernization to enroute communications to enable broadband reach-back data capability utilizing military or commercial networks with adequate bandwidth support required by Mission Command and Intelligence applications. EMC will provide commanders with the ability to obtain and share near real-time information regarding intelligence, situational awareness and command and control information while enroute to their objective.  The ability to adjust plans and strategize utilizing the latest Intel data will give the GRF the information dominance needed to execute their mission once they arrive at their objective.  \n\nDue to rephasing of FY17 OPA funding into FY18\/19, program was restructured in Dec 2015. MDA addressed schedule issues (Oct 2016) by authorizing to field a Ku FISA FOC (4QFY17) and complete a Modification Word Order (MWO), adding Ka FISA capability, post Ku FISA FOC.\n\nFY 2018 funding supports the Ka solution requirement of Wideband Global System (WGS) Terminal and Modem Certification.  The certification process will ensure that terminals conform to the minimum performance and operational control requirements as defined in the WGS Ka-Band Terminal Certification Requirements Document."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EMC Testing"
                                    },
                                    "Description": {
                                        "val": "Wideband Global System (WGS) Terminal and Modem Certification"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Wideband Global System (WGS) Terminal and Modem Certification."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B08400"
                                    },
                                    "Title": {
                                        "val": "Enroute Mission Command"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.116"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.667"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.667"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "23.072"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.957"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "57.812"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The continued procurement of the EMC full operational capability follows DoDI 5000.02, 7 Jan 2015, Enclosure 13, Rapid Fielding of Capabilities. The Milestone Decision Authority (MDA) and project manager will tailor and streamline program strategy based on the required timelines to meet urgent need capability requirements. The Army Executive Agent signed an Acquisition Decision Memorandum (ADM) on 27 April 2015 delegating MDA to PEO C3T.  The MDA signed an ADM on 11 May 2015 selecting the KuKa Antenna and Radome for the Full Operational Capability (FOC). An ADM was signed on 20 May 2015 granting approval to enter into production and deployment phase.  \n\nDue to rephasing of FY17 OPA funding into FY18\/19, program was restructured in Dec 2015.  MDA addressed schedule issues (Oct 2016) by authorizing to field a Ku FISA FOC (4QFY17) and complete a Modification Word Order (MWO), adding Ka FISA capability, post Ku FISA FOC.\n\nInitial Operational Capability met in May 2015 with modification of five C-17s with satellite antennae and installation kits, and roll-on\/roll-off, battalion level, Key Leader Node (KEN).  FOC is 35 C-17s, eight Key Leader Enroute Node (KEN), and 24 company level Dependent Airborne Nodes (DAN), and a Command and Staff Palletized Airborne Node (CASPAN). \n\nFY18 funding (173142 FE4) supports the Wideband Global System (WGS) Terminal and Modem Certification."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}