{
    "id": "2018-Navy-PB-1319-MJBOOK-1-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-33",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603713N"
        },
        "ProgramElementTitle": {
            "val": "Ocean Engineering Tech Dev"
        },
        "R1LineNumber": {
            "val": "63"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "121.668"
            },
            "PriorYear": {
                "val": "5.135"
            },
            "CurrentYear": {
                "val": "4.556"
            },
            "BudgetYearOne": {
                "val": "8.212"
            },
            "BudgetYearOneBase": {
                "val": "8.212"
            },
            "BudgetYearTwo": {
                "val": "6.021"
            },
            "BudgetYearThree": {
                "val": "5.716"
            },
            "BudgetYearFour": {
                "val": "5.821"
            },
            "BudgetYearFive": {
                "val": "5.930"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Developments in this program will enable the U.S. Navy to overcome deficiencies that constrain manned diving operations in several critical areas such as submarine rescue, recovery, salvage, underwater ship husbandry, underwater construction and naval special operations.  This program develops biomedical technology, diver life support equipment, and the systems, tools, and procedures to permit manned underwater operations and enhance diver performance and safety."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.520"
                },
                "CurrentYear": {
                    "val": "4.556"
                },
                "BudgetYearOne": {
                    "val": "6.455"
                },
                "BudgetYearOneBase": {
                    "val": "6.455"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.135"
                },
                "CurrentYear": {
                    "val": "4.556"
                },
                "BudgetYearOne": {
                    "val": "8.212"
                },
                "BudgetYearOneBase": {
                    "val": "8.212"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.615"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.757"
                },
                "BudgetYearOneBase": {
                    "val": "1.757"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.700"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.085"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.785"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.785"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.028"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.028"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY16 - Added $0.7M to support development of submarine rescue diving and recompression system capability which will permit rescue and decompression from a submarine pressurized to 6 atmospheres.\n\nFY18 - Funding increase by $3.656M due to $1.785M additional funding for the Submarine Rescue program [0394] and $1.871M for Navy Diving Biomedical research and equipment [0394 and 0099]. Additional funding for 0394 was added to complete manned testing, sea trials, and obtain certification and IOC for Submarine Rescue Diving and Recompression System (SRDRS) Transfer Under Pressure (TUP). Additional funding for 0099 was added to maintain Deep Submergence Biomedical Development (DSBD) Program that supports multiple undersea capabilities that include the survivability, health and safety of submarine crews from a disabled submarine as well as Navy divers executing salvage, underwater ship husbandry, underwater construction, explosive ordnance disposal and special warfare missions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0099"
                    },
                    "ProjectTitle": {
                        "val": "Deep Submergence Bio Med Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "30.806"
                        },
                        "PriorYear": {
                            "val": "3.934"
                        },
                        "CurrentYear": {
                            "val": "3.603"
                        },
                        "BudgetYearOne": {
                            "val": "4.691"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.691"
                        },
                        "BudgetYearTwo": {
                            "val": "4.616"
                        },
                        "BudgetYearThree": {
                            "val": "4.483"
                        },
                        "BudgetYearFour": {
                            "val": "4.565"
                        },
                        "BudgetYearFive": {
                            "val": "4.652"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project:\n1) Develops advanced biomedical and bioengineering technology for medical and life support enhancement to decrease submariner deaths and permanent injury in a disabled submarine (DISSUB) and during submarine escape and rescue;\n2) Conducts research for diver health, safety, and effectiveness:\n   - to increase understanding of human performance and enhanced diver stress management and survivability in high stress environments such as in cold\/warm water and at altitude; and \n   - to validate and improve the accuracy of assumptions associated with equipment testing and certification, diving procedures, and diver biomedical physiology.\n\nDeliverables for DISSUB include:  medical guidance\/procedures increasing submariner survivability for submarine escape and rescue (including new Submarine Rescue Diving and Recompression System (SRDRS)), life support parameters, medical procedures for life support; exposure and mitigation guidance for atmospheric contaminants, high levels of oxygen and\/or carbon dioxide; prevention and treatment of decompression sickness and pulmonary oxygen toxicity; and senior survivor expert decision system.\n\nDeliverables for diver health and safety include:  decompression guidance in extreme environment diving with various breathing mixtures, temperatures, durations, and altitudes; exposure guidance for oxygen breathing; diver performance guidance based on physiological effects of diving; enhanced underwater swimming efficiency; enhanced diver thermal protection; collection of operational diving depth\/time profiles to predict decompression risk, and exposure and mitigation guidance for diver underwater continuous noise, impulse noise, and underwater blast.\n\nRequirements: \n  OPNAVINST 3150.27C, Navy Diving Policy and Joint Military Diving Technology and Training Program, 24 Jun 2016\n  Navy Salvage and Navy Diving Capabilities-Based Assessment (CBA) Report, 19 Dec 2013\n  NAPDD #587-873, Deep Submergence Biomedical Development, 23 Nov 1999."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Deep Submergence Bio Med Dev - Diver Health and Safety"
                                    },
                                    "Description": {
                                        "val": "Diver Health and Safety Research:  Novel methods for decompression safety and treatment of decompression sickness\/arterial gas embolism. Advanced decompression models for extreme environments, including thermally challenging, long duration, multi-gas, and\/or diving at altitude. Diving physiology advances in exercise, thermal exposure, oxygen\/carbon dioxide alterations, other gas mixture alterations, hydration, and sustained operations.  Develop pulmonary oxygen toxicity exposure limits. Provide pulmonary and oxygen toxicity mitigation strategies.  Develop an advanced diver thermal model. Develop advanced insulation garments for diver thermal protection. Develop guidance for optimizing thermal control during decompression.  Develop guidelines for conduct of diving operations at altitude. Develop guidance for infra- and ultra-sound diver exposure. Continue collection of operational and research dive data for inclusion in advanced probabilistic decompression models.  Investigate diver in-water maladies. Develop\/improve real-time decompression guidance and dive planning. Research procedures for assessing and mitigating risk for diving in contaminated water."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.967"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Executed studies at three Navy laboratories and three university partners in diver decompression sickness prevention, diver thermal underwater exposure mitigation, safe underwater breathing resistance limitation, and repeated underwater high oxygen breathing recommendations.  Completed products included guidelines for emergency use of breathing apparatus, guidelines for repeated oxygen exposures of interest to explosive ordnance disposal and naval special warfare, a detailed human calorimeter for evaluating heat loss\/gain, and a framework for modeling decompression sickness events of varying severity.  These studies are vital to Navy diver occupational health and safety.  The university\/military relationships have provided synergistic, cost-effective pathways to solutions for difficult operational undersea medical issues."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.802"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "As divers are expected to operate in potentially high risk extreme conditions of cold\/warm water at expanding depths and altitudes for longer durations, it is important to continue execution of critical Navy diver occupational health and safety studies to understand the biomedical effects of decompression, thermal loss\/gain, oxygen toxicity affecting both a diver's lungs and brain during repeated exposures to elevated pressures.  Three university and three Navy laboratory partnerships will continue to mitigate the health dangers associated with diving and submarine rescue with studies including physiological measures of repeated long duration dives, enhanced decompression tables using oxygen, development of a decompression planner for the rescue of disabled submarine (DISSUB) survivors, procedures for oxygen pre-breathing for pressurized DISSUB rescue, development of a toxic gas analyzer for DISSUB rescue, pulmonary oxygen testing for DISSSUB survivors, saturation dropout studies for increasing survivability from a pressurized DISSUB, decompression studies for altitude diving, and the role of hydration on diver performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.345"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.345"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform numerous mixed-gas, manned diving experiments to update surface-supplied helium-oxygen deep diving decompression tables which put divers at high risk for decompression sickness and felt to be too unsafe to use.  Develop decompression guidance\/procedures for diving at altitude using special diving apparatus.   These manned diving experiments, required to evaluate decompression protocols, are labor intensive, requiring long days to provide adequate time for test subjects to decompress under constant supervision of diving watch-standers,  investigators, medical personnel and other support staff and consequently more expensive than smaller scale and unmanned studies.  The studies also require significant amounts of helium to produce the various helium-oxygen gas mixtures needed for divers breathing gas and the cost of helium continues to rise at double-digit annual rates.\n\nContinue development of vital decompression, thermal, physiological, breathing resistance and oxygen tolerance\/toxicity recommendations including contributions by reengaged university partners.  Reengaging these university partners in FY-18 is essential to sustaining the very small research base needed to support Navy diver occupational health and safety.  The university and Navy laboratories (Navy Experimental Diving Unit, Panama City, FL; Naval Submarine Medical Research Laboratory, Groton, CT; Naval Medical Research Center, Bethesda, MD) will continue underwater physiological investigation to mitigate the risks of diving in the expanding Fleet mission areas of salvage, underwater ship husbandry, explosive ordnance disposal, underwater construction and special warfare."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deep Submergence Bio Med Dev - Submarine Rescue"
                                    },
                                    "Description": {
                                        "val": "Submarine Rescue\/Escape Research:  Provide decompression procedures for pressurized SRDRS operators. Investigate adjunctive therapies for treating DISSUB survivors. Provide updated guidance for food, water, clothing, medical supplies to enhance survival of submarine crews awaiting rescue. Develop\/provide flexible computer-generated decompression schedules for wide range of conditions in a DISSUB. Develop DISSUB medical triage procedures and support DISSUB survival trials. Develop mitigation strategies to reduce hyperoxic exposures in closed vehicles\/compartments. Develop treatment guidance for decompression sickness and arterial gas embolism in submarine escape and rescue. Investigate the use of novel pharmacologic agents to reduce decompression risk and\/or oxygen toxicity in submarine rescuees. Develop\/deploy toxic gas analyzer for use in pressurized DISSUB rescue. Investigate interventions for toxicological problems in DISSUB survivors. Develop strategies to minimize decompression sickness and arterial gas embolism with Submarine Escape and Immersion Suit (SEIS) training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.967"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Leveraged studies at three Navy laboratories and three university partners in decompression sickness prevention using decompression, oxygen, and drug intervention to improve the survivability of submariners trapped within or rescued from a disabled submarine. Initiated development of a mass casualty tracking and planning system for safely decompressing submariners from a pressurized disabled submarine. Similar to divers, submariners rescued from a pressurized, disabled submarine must undergo decompression to prevent catastrophic decompression sickness.  Therefore the decompression models developed for diving have dual purpose with some alteration. \n \nContinued development and approval of Submarine Decompression System (SDS) products in support of system certification and initial Transfer Under Pressure (TUP) operating capability. Continued development and approval of certification survey plans and testing procedures for unmanned and manned testing. Continued development and refinement of operating and emergency procedures through tabletops and on site operating procedure walkthroughs. Continued hyperbaric life support system safety survey card technical assists to identify system safety certification issues and reduce overall program risk."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.801"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue studies to develop decompression protocols for use with the Submarine Decompression System (SDS) as well as pulmonary oxygen toxicity and carbon dioxide toxicity in a disabled submarine.  Investigate decompression protocols for submariners rescued in shallow water where the Navy's submarine rescue vehicle cannot safely attach to the submarine.  Develop gas monitors for detecting and measuring toxic gasses in a disabled submarine.  Using the results of university models and studies, Navy laboratories will continue to develop plans to mitigate the health dangers associated with decompression and oxygen toxicity (affecting lungs and brains) for rescued submariners and will identify knowledge gaps of expected submariner medical conditions before, during and after rescue from a disabled submarine."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.346"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.346"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Multiple experimental manned air saturation dives will be performed to develop protocols that can be used to decrease submariner deaths during submarine escape and rescue from a pressurized disabled submarine too shallow for safe attachment of the Navy's submarine rescue vehicle.  These saturation diving experiments, required to evaluate decompression protocols, are labor intensive, requiring 24\/7 support and consequently more expensive than smaller scale studies. \n \nWe will continue development of vital decompression, thermal, and oxygen tolerance\/toxicity guidance with reengaged university partners to decrease permanent injury in submariners during submarine escape and rescue.  University partners are uniquely qualified to conduct smaller scale studies which require significant medical equipment\/intervention (e.g. x-rays, MRIs), while Navy laboratories, better suited to for larger scale studies, will provide larger groups of test subjects in unique facilities (e.g. the Navy's Ocean Simulation Facility). Reengaging these university partners in FY-18 is essential to sustaining the very small research base needed to support the survivability, health and safety of submarine crews in a disabled submarine.  Navy laboratories (Navy Experimental Diving Unit, Panama City, FL; Naval Submarine Medical Research Laboratory, Groton, CT; Naval Medical Research Center, Bethesda, MD) will continue to exploit the results of university models and outcomes to develop plans to mitigate the risks of decompression sickness, breathing gas toxicity, arterial gas embolism and other medical conditions in the submariners and rescuers aboard a pressurized, disabled submarine or in the SRDRS rescue system."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Integrated thrust area teams (e.g., decompression research) are established with university, commercial, and in-house Navy labs to jointly execute biomedical R&D. Peer review of research proposals accomplished by independent Technical Advisory Board.  Annual review of progress by Executive Review Board (CNO\/NAVSEA\/ONR\/BUMED).  Program management by 0-6 Undersea Medical Officer.  Contracting by competitive process using BAA and leveraging ONR capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews of researcher progress measured against research proposal goals and timelines."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0394"
                    },
                    "ProjectTitle": {
                        "val": "Shallow Depth Diving EQ"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "90.862"
                        },
                        "PriorYear": {
                            "val": "1.201"
                        },
                        "CurrentYear": {
                            "val": "0.953"
                        },
                        "BudgetYearOne": {
                            "val": "3.521"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.521"
                        },
                        "BudgetYearTwo": {
                            "val": "1.405"
                        },
                        "BudgetYearThree": {
                            "val": "1.233"
                        },
                        "BudgetYearFour": {
                            "val": "1.256"
                        },
                        "BudgetYearFive": {
                            "val": "1.278"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops systems to support submarine escape and rescue missions, and conventional diver operations.  Diver operations include ship husbandry, salvage\/recovery, and submarine rescue operations to support national, as well as Navy, needs around the world.  Modern certifiable diving systems that ensure diver safety and allow maximum work efficiency will replace currently antiquated systems.  R&D will be performed in the areas of diver efficiency, visual enhancement, contaminated water diving, diver thermal protection, and recompression chamber technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Shallow Depth Diving EQ - Diving"
                                    },
                                    "Description": {
                                        "val": "Continued research on contaminated water diving and research on diver thermal protection, C02 monitors and diver sound protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.501"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of technology to improve diver visual acuity in low visibility water to improve diver safety and effectiveness, thereby minimizing the environments in which divers are ineffective.  Initiated performance testing on surface supplied diving systems in cold water environments to fill gaps identified in recent diving mishaps and fatalities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.953"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of technology to improve diver visual acuity in low visibility water to improve diver safety and effectiveness, thereby minimizing the environments in which divers are ineffective.  Continue performance testing on surface supplied diving systems in cold water environments to fill gaps identified in recent diving mishaps and fatalities.  Initiate corrosion testing on diving umbilicals to identify replacement equipment for umbilical components which failed in service resulting in diving mishaps.  Initiate evaluation of diver tracking systems to improve supervisor situational awareness and diver safety."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.747"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.747"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of technology to improve diver visual acuity in low visibility water to improve diver safety and effectiveness, thereby minimizing the environments in which divers are ineffective.  Develop design specifications for a highly portable, flexible fabric recompression chamber.  This chamber will reduce logistics and improve safety by making it easier for expeditionary divers to travel with a small portable life-saving device.  The fabric technology development, there is only one manufacturing process believed to be scalable for this effort, is expected to require considerable resources."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Shallow Depth Diving EQ - Submarine Rescue"
                                    },
                                    "Description": {
                                        "val": "Submarine rescue decompression system permits decompression of submarine crew rescued from a pressurized, disabled submarine of pressures up to 6 atmospheres (ATA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development and approval of Submarine Decompression System (SDS) products in support of system certification and initial operating capability.  Continued development and approval of certification survey plans and testing procedures for unmanned and manned testing.  Continued development and refinement of operating and emergency procedures through tabletops and on site operating procedure walkthroughs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "To continue support development and conduct unmanned testing of submarine rescue diving and recompression system capability which will permit rescue and decompression from a submarine pressurized to 6 atmospheres.  Funding in 2017 will be required and addressed during  the execution year through a BTR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will complete manned testing, sea trials, certification and IOC for SRDRS TUP."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Diving Program acquisitions are executed and managed by SEA00C.  Acquisitions are made for both COTS and developmental items as required to ensure adequate operational availability and safety of the diver.  R&D projects are selected in March for a November award using a Broad Area Announcement.  This allows for a variety of projects to be submitted under the same decision process.\n\nSubmarine Rescue Systems - prime integration contract is in place and final efforts concluding in FY18."
                        },
                        "PerformanceMetrics": {
                            "val": "Diving - Semi-annual program review with NEDU.\nDiving - Annual program review for each R&D project.\nDiving & Submarine Rescue - Quarterly execution assessments."
                        }
                    }
                }
            ]
        }
    }
}