{
    "id": "2018-DefenseThreatReductionAgency-PB-0400-MJBOOK-0-0-a72d48b99bf22a11322e16e94fa7d1b2f35d71b98abd4ae9914ff32140c669d6-3",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DTRA-U_RDTE_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Threat_Reduction_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605000BR"
        },
        "ProgramElementTitle": {
            "val": "*Counter Weapons of Mass Destruction Systems Development"
        },
        "R1LineNumber": {
            "val": "123"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "77.733"
            },
            "PriorYear": {
                "val": "7.156"
            },
            "CurrentYear": {
                "val": "4.568"
            },
            "BudgetYearOne": {
                "val": "6.241"
            },
            "BudgetYearOneBase": {
                "val": "6.241"
            },
            "BudgetYearTwo": {
                "val": "6.216"
            },
            "BudgetYearThree": {
                "val": "4.864"
            },
            "BudgetYearFour": {
                "val": "5.388"
            },
            "BudgetYearFive": {
                "val": "5.652"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "*Program Element 0605000BR name changes from WMD Defeat Capabilities to Counter Weapons of Mass Destruction Systems Development beginning in FY 2018.\n**Project RF-Detection and Forensics Technologies subdivides into Projects RD-Detection Technologies and RF-Forensics Technologies in FY 2016.  This impacts these projects in PE 0602718BR and PE 0603160BR.  See C. Other Program Funding Summary below."
        },
        "ProgramElementMissionDescription": {
            "val": "The Counter Weapons of Mass Destruction (WMD) Systems Development program element supports the development and demonstration of verification and monitoring technologies and systems for the Countering Weapons of Mass Destruction (CWMD) mission. This funding specifically supports International Monitoring System technology requirements under the Nuclear Arms Control Technology (NACT) program. Through FY 2014, funding also supported the development of collaborative CWMD analysis capabilities between the Department of Defense and key interagency and international partners through a globally accessible net-centric framework in the form of the Integrated Weapons of Mass Destruction Toolset."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.156"
                },
                "CurrentYear": {
                    "val": "4.568"
                },
                "BudgetYearOne": {
                    "val": "9.092"
                },
                "BudgetYearOneBase": {
                    "val": "9.092"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.156"
                },
                "CurrentYear": {
                    "val": "4.568"
                },
                "BudgetYearOne": {
                    "val": "6.241"
                },
                "BudgetYearOneBase": {
                    "val": "6.241"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.851"
                },
                "BudgetYearOneBase": {
                    "val": "-2.851"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.851"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.851"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2018 from the previous President's Budget submission is due to realignment of RDT&E to O&M in support of station operations for NACT and a realignment of funds from DTRA to the Office of the Under Secretary of Defense for Acquisition, Technology, and Logistics (OUSD (AT&L)) for support services necessary to meet oversight responsibilities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "**RF"
                    },
                    "ProjectTitle": {
                        "val": "Forensics Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.534"
                        },
                        "PriorYear": {
                            "val": "7.156"
                        },
                        "CurrentYear": {
                            "val": "4.568"
                        },
                        "BudgetYearOne": {
                            "val": "6.241"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.241"
                        },
                        "BudgetYearTwo": {
                            "val": "6.216"
                        },
                        "BudgetYearThree": {
                            "val": "4.864"
                        },
                        "BudgetYearFour": {
                            "val": "5.388"
                        },
                        "BudgetYearFive": {
                            "val": "5.652"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*Project RF-Detection and Forensics Technologies subdivides into projects RD-Detection Technologies and RF-Forensics Technologies beginning in FY 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the development of verification and monitoring capabilities for the Defense Threat Reduction Agency (DTRA) to counter proliferation and weapons of mass destruction (WMD). DTRA’s Nuclear Arms Control Technologies (NACT) program performs Research, Development, Test, and Evaluation (RDT&E) to improve the sustainability, reliability, and effectiveness of capabilities related to its operational mission to install, operate, maintain, and sustain the waveform and radionuclide nuclear detonation detection stations comprising the U.S. portion of the International Monitoring System (IMS). This delivers data to the U.S. monitoring and verification community and enables U.S. compliance with the Comprehensive Nuclear Test Ban Treaty (CTBT) in support of U.S. and Department of Defense (DoD) nonproliferation objectives.\n  \nThe project addresses WMD monitoring, implementation of, and compliance with arms control agreement requirements validated by the Office of the Under Secretary of Defense, Acquisition, Technology, and Logistics. This project conforms to the administration’s research and development priorities related to WMD arms control and disablement. Technical assessments are made against CTBT implementation requirements and U.S. objectives to provide the basis for sound project development, evaluate existing programs, provide data required to inform compliance assessments, and support U.S. monitoring policy, decision-makers, and negotiation teams.\n \nThe primary RDT&E program emphasis is on improvements that enable the installation of treaty-specific stations, which reduce costs and increase the reliability in diverse and often harsh environments; improve efficiency, performance, reliability, and sustainability of existing stations and treaty-specified verification capabilities; and improve capabilities to detect, characterize, and enable discrimination of, nuclear weapons tests. The NACT program directly supports U.S. and allied warfighter and national technical monitoring requirements and provides vital data used by the treaty monitoring community, warfighter planners, DoD, other U.S. Government agencies, and international agencies.\n\nThe decrease from FY 2016 to FY 2017 is due to re-phasing of program activities to FY 2018 and FY 2019.  The increase from FY 2017 to FY 2018 is due to the net effect of re-phasing of program activities from FY 2017, a realignment of RDT&E to O&M in support of station operations for NACT, and a realignment of funds from DTRA to the Office of the Under Secretary of Defense for Acquisition, Technology, and Logistics (OUSD (AT&L)) for support services necessary to meet Congressional oversight responsibilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF -  Forensics Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RF supports the NACT Program, conducting RDT&E to meet IMS technology requirements in support of CTBT implementation, compliance, monitoring, inspection, and other emerging nuclear arms control activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.156"
                                            },
                                            "Text": {
                                                "val": "- Completed installation of additional infrasound elements, seismic elements, and wind noise reduction systems at the Facility for Acceptance, Calibration, and Testing at Sandia Labs (SNL). These systems support the testing and verification\/validation of nuclear-explosion monitoring equipment before integration into the U.S. IMS.\n- Developed and implemented concepts to improve the reliability of the radionuclide stations and improve radionuclide and infrasound signal to noise ratios that will enhance strategic deterrence by lowering the U.S International Monitoring System nuclear-explosion detection thresholds and data availability for forensics analyses.\n- Continued support of Office of the Secretary of Defense (OSD) Threat Reduction and Arms Control Treaty management objectives, providing regular IMS assessments, quarterly program management reviews, and supporting all OSD engagements with the Comprehensive Test Ban Treaty Organization Provisional Technical Secretariat.\n- Continued development and implementation of IMS sensor and station calibration software and in-situ calibration concepts, to standardize calibration capability using novel algorithms and automated software.\n- Developed and implemented U.S. IMS specific life-cycle management software to enable cost effective and efficient spare part replacement and long-range recapitalization.\n- Sponsored and participated in CTBT technology development exchanges in order to discover emerging technologies that have the potential to optimize performance and cost effectiveness of the IMS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.568"
                                            },
                                            "Text": {
                                                "val": "- Optimize IMS technology and operations to comply with CTBT language and evolving operational manual requirements and to increase cost efficiency.\n- Validate alternative filter media against Provisional Technical Secretariat certification standards for U.S. IMS particulate radionuclide sensor to enhance aerosol collection efficiency for the Radionuclide Aerosol Sampler\/Analyzer system. \n- Conduct Analysis of Alternatives for Hydroacoustic monitoring.\n- Annually, provide analysis of up to 800 additional International Atomic Energy Agency verification samples in support of the OSD, Nuclear, Chemical and Biological Threat Reduction Advisory Committee.\n- Complete evaluation of U.S. IMS operational options determined from life-cycle modeling and simulation to determine most cost-effective operational models.\n- Evaluate alternative backup power options for arctic to improve reliability and performance in remote locations as defined by CTBT Operations Manuals.\n- Participate in CTBT Organization Provisional Technical Secretariat sponsored technology development exchanges.\n- Finalize testing for Provisional Technical Secretariat qualification of alternative infrasound waveform sensor that improves efficiency, reliability, or cost effectiveness at equal or greater data quality objectives. \n- Run models and simulations to improve understanding of CTBT IMS network viability\/limitations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.241"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.241"
                                            },
                                            "Text": {
                                                "val": "- Continue the optimization of IMS technology and operations to comply with CTBT language and evolving operational manual requirements in order to increase efficiencies, sustainability and cost effectiveness.\n- Conduct testing of waveform station components and systems at the Facility for Acceptance, Calibration, and Testing Site as a demonstration in a relevant environment.\n- Continue development of improved state of health monitoring software for use on radionuclide stations to provide a predictive indication of pending failures and required maintenance.\n- Establish a Radionuclide Test-bed capability for rapid resolution system faults.\n- Continue to participate in CTBT Organization Provisional Technical Secretariat sponsored technology development exchanges to provide synergy for R&D activities.\n- Continue to conduct field testing on High Reliability Power Sources for arctic operational environments.\n- Conduct Entry-into-Force Readiness, Rapid Response risk assessment, and Operational Tabletop Exercises in order to quantify risks and the costs of mitigation.\n- Advance the state of health monitoring capability for waveform and radionuclide stations to increase reliability, sustainability, and cost effectiveness.\n- Evaluate self-calibrating infrasound sensors for use at IMS stations.\n- Evaluate the implementation of a standard configuration for the Central Recording Facility for use at IMS stations.\n- Continue the sustainment of the Radionuclide Lab (RL16) at Pacific Northwest National Laboratory in support of the CTBT."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.525"
                                        },
                                        "CurrentYear": {
                                            "val": "10.008"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.274"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.274"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.345"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.500"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.771"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.991"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "26\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "40.373"
                                        },
                                        "CurrentYear": {
                                            "val": "38.540"
                                        },
                                        "BudgetYearOne": {
                                            "val": "40.286"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "40.286"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "42.580"
                                        },
                                        "BudgetYearThree": {
                                            "val": "40.925"
                                        },
                                        "BudgetYearFour": {
                                            "val": "42.144"
                                        },
                                        "BudgetYearFive": {
                                            "val": "43.124"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assess government, academic, and industrial performers and make selections based upon a \"best fit for task\" criteria. Common government awardees include DoD Service Laboratories and the Department of Energy National Laboratories."
                        },
                        "PerformanceMetrics": {
                            "val": "The goal of the NACT RDT&E program is to enable full compliance of all emerging data quality requirements and other requirements as documented in CTBT treaty language, CTBT-issued Radionuclide and Waveform Operations Manuals, other CTBT Organization communications, and DoD Treaty Implementation Manager directives.  RDT&E is conducted in support of NACT’s operational mission to operate, maintain, and sustain the Provisional Technical Secretariat certified waveform and radionuclide CTBT monitoring stations and radionuclide laboratory in accordance with CTBT requirements.  CTBT IMS data availability\/timeliness performance specifications are currently 98% data availability for IMS waveform and 95% for IMS radionuclide systems.  Data quality metrics continue to evolve as the entire CTBT IMS capability is exercised and tested."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "64.199"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "64.199"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Efforts in this project were completed in FY 2014. Under Project RL, the Net-Centric Architecture program integrated legacy capabilities and facilitated data sharing through a net-centric framework. It provided near-real time collaborative analysis capabilities between the Department of Defense (DoD) and key interagency and international partners through a globally accessible net-centric framework known as the Integrated Weapons of Mass Destruction Toolset.  This toolset migrated the Defense Threat Reduction Agency's (DTRA's) chemical, biological, radiological, and nuclear (CBRN) modeling and simulation codes to provide an integrated suite of Countering Weapons of Mass Destruction (CWMD) decision support capabilities. The framework was the only operational chemical, biological, radiological, nuclear, and high-yield explosives (CBRNE) framework in the world that provided capabilities through web applications, net-centric web services, and stand-alone mobile deployments which are validated and accredited for operational use by international, national, state, and local authorities.  \n\nThe decrease in FY 2015 is due to the completion of Integrated Weapons of Mass Destruction Toolset investments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear & Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL develops and provides a real-time globally accessible net-centric framework which migrates the DTRA CBRNE modeling and simulation codes to provide an integrated suite of CWMD decision support capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.333"
                                        },
                                        "CurrentYear": {
                                            "val": "28.668"
                                        },
                                        "BudgetYearOne": {
                                            "val": "29.228"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.228"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.640"
                                        },
                                        "BudgetYearThree": {
                                            "val": "30.324"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.999"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.695"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "26\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Advanced Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "3.528"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.500"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.456"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.457"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.455"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.455"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program for Integrated Weapons of Mass Destruction Toolset was executed through a competed cost plus fixed-fee contract.  This contract was a 3-year effort for software development, test, and integration."
                        },
                        "PerformanceMetrics": {
                            "val": "Demonstrate and provide over 80% of the customer-required CBRN modeling and simulation capabilities over networks, e.g., DoD Global Information Grid.  Integrate mission-required legacy DTRA CBRNE codes into a net-centric architecture through a process-controlled verification, validation, and accreditation standards-based method necessary to promote the National Strategy for Countering Biological Threats."
                        }
                    }
                }
            ]
        }
    }
}