{
    "id": "2018-Army-PB-2040-JBOOK-4d642436f65ddc83c084fdb1d917f4809eff5a3f2d9cca01c78cf59a8dd3a26e-7",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602308A"
        },
        "ProgramElementTitle": {
            "val": "Advanced Concepts and Simulation"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "26.886"
            },
            "CurrentYear": {
                "val": "27.688"
            },
            "BudgetYearOne": {
                "val": "28.650"
            },
            "BudgetYearOneBase": {
                "val": "28.650"
            },
            "BudgetYearTwo": {
                "val": "35.100"
            },
            "BudgetYearThree": {
                "val": "35.494"
            },
            "BudgetYearFour": {
                "val": "36.177"
            },
            "BudgetYearFive": {
                "val": "36.892"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates and designs enabling technologies to create effective training capabilities for the Warfighter and  supports the underpinning technologies and understanding to establish architecture standards and interfaces necessary for realizing the Army vision of creating a realistic synthetic \"electronic battlefield\" environment for use across the spectrum of doctrine, organization, training, leader development, materiel, personnel, and facilities (DOTLM-PF).  Project C90 focuses on advancing component technologies required for real time interactive linking within and among constructive, virtual, and live simulation and training by refining technologies for advanced distributed interactive simulation.  Project D02  further develops concepts for immersive training and learning environments with the Institute for Creative Technologies (ICT) at the University of Southern California, Los Angeles, California. \n\nWork in this PE complements and is fully coordinated with PE 0601104A (University and Industry Research Centers), PE 0602785A (Manpower\/Personnel\/Training Technology), PE 0602786A (Clothing & Equipment Technology), PE 0602787A (Medical Technology), PE 0603001A (Future Warrior Technology Integration), PE 0603007A (Manpower, Personnel and Training Advance Technology), PE 0603015A (Next Generation Training & Simulation Systems) and PE 0603710A (Night Vision Advanced Technology).   \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. \n \nWork in this PE is performed by the Army Research Laboratory, Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.862"
                },
                "CurrentYear": {
                    "val": "27.688"
                },
                "BudgetYearOne": {
                    "val": "28.631"
                },
                "BudgetYearOneBase": {
                    "val": "28.631"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "26.886"
                },
                "CurrentYear": {
                    "val": "27.688"
                },
                "BudgetYearOne": {
                    "val": "28.650"
                },
                "BudgetYearOneBase": {
                    "val": "28.650"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.976"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.019"
                },
                "BudgetYearOneBase": {
                    "val": "0.019"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.976"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.004"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.023"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.023"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C90"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Distributed Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.335"
                        },
                        "CurrentYear": {
                            "val": "20.589"
                        },
                        "BudgetYearOne": {
                            "val": "23.223"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.223"
                        },
                        "BudgetYearTwo": {
                            "val": "28.577"
                        },
                        "BudgetYearThree": {
                            "val": "28.841"
                        },
                        "BudgetYearFour": {
                            "val": "29.392"
                        },
                        "BudgetYearFive": {
                            "val": "29.968"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and designs enabling technologies for advancing distributed simulation and training (live, virtual and constructive) environments. This includes networking of models representing complex human behavior, complex data interchange between simulations, synthetic natural environments, medical training simulations, ground platform training, adaptive tutoring for individuals and teams, and collaborative training. The Project researches the ability to create a virtual representation of combined arms environments, with the Warfighter-in-the-loop that constructive (event driven) simulations cannot simulate.  \n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad portfolio.\n    \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \nWork in this Project is performed by the Army Research Laboratory (ARL), Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Live, Virtual, Constructive (LVC) Simulations"
                                    },
                                    "Description": {
                                        "val": "This effort develops and investigates LVC training technologies (tools and methods) to inform an interactive, seamless training environment.  Live training refers to personnel and systems performing an exercise mission on real terrain; virtual training refers to personnel using simulators; and constructive training refers to computer based models representing real world behaviors that introduce a wider control of virtual forces.  This effort is coordinated with and complements Program Element (PE) 0603015A\/Project S29.  In Fiscal Year (FY) 18 this effort has been refocused and renamed to Synthetic Natural Environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.807"
                                            },
                                            "Text": {
                                                "val": "Investigated various component designs and developmental concepts of real world (physics-based) dynamic effects in terrain representation for use in the Army's One World Environment; researched, developed and assessed the use of the SCALE architecture in relevant use cases supporting the Army Learning Model (ALM); developed next generation simulation architectures and environments for the integration and execution of LVC simulations to be employed by joint and coalition warfare forces during collective training and mission rehearsal exercises; validated the effectiveness of select experimental tools and virtual environments on Soldier learning during joint and coalition training and mission rehearsal exercises; researched the effect of technologies such as interoperable performance assessment, mobile application use, data analytics, and social media on the capability to conduct training and education on operational systems in support of United States Army Training and Doctrine Command (TRADOC) Army Learning Concept 2020-2040 goals; and developed a technique to measure, track, and manage general learning outcomes that will feed a continuous adaptive learning model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.975"
                                            },
                                            "Text": {
                                                "val": "Will design and develop physics-based dynamic effect algorithms and synthetic terrain components to enable the Army's One World Environment for training; develop a cloud-based architecture to support adaptive training; develop prototype technologies, such as performance assessment, mobile application use, data analytics, and social media and assess impact on training and education for operational systems; validate methods to measure, track, and manage general learning outcomes that will feed a continuous adaptive learning model; and design and develop artificial intelligence algorithms to enable intelligent and believable behaviors of virtual characters that can be reused across virtual, constructive, virtual and gaming domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": ": Live and Medical Training Technologies"
                                    },
                                    "Description": {
                                        "val": "Included in this effort will be the development of new medical training simulations to train medical personnel across all levels of care and the development of live training technology that can be applied across all military levels and training environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.353"
                                            },
                                            "Text": {
                                                "val": "Designed the laser component of the next generation Multiple Integrated Laser Engagement System (MILES) for a live training program of record at home stations and combat training centers supporting Force-on-Force training for Brigade Combat Teams (BCTs); applied measured tissue properties to experimental simulations and validated its performance; applied sensors to simulated tissue to objectively measure human performance and validate tissue performance; researched and developed immersive technologies to engage learners in game-based medical training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.650"
                                            },
                                            "Text": {
                                                "val": "Will design and develop sensors and communication components to refine laser component design for next generation MILES capabilities; conduct research to characterize diseased and injured tissues to inform development of synthetic tissue; conduct research to simulate and model tissues in LVC platforms; investigate methods and technologies to assess human performance during training using high fidelity tissue\/sensor solutions; and conduct research to assess human performance during medical training using various immersive hardware and software solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.738"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.738"
                                            },
                                            "Text": {
                                                "val": "Will mature sensor and communication components of laser design for the next generation MILES in preparation to conduct experimentation. This research will improve the soldier’s live training performance for readiness at Army home station and Combat Training Centers. Will investigate accurate representation of simulation and training environments depicting the entire military medical population to include, female, pediatric, and elderly, with simulated tissues that change over time based on injury, disease and healing, as well as improving anatomical accuracy by modeling representative patient data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Tutoring"
                                    },
                                    "Description": {
                                        "val": "This effort investigates adaptive tutoring and immersive learning environments with social simulations to conduct kinetic and non-kinetic training for individuals and teams."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.015"
                                            },
                                            "Text": {
                                                "val": "Conducted initial user validation studies of usage of computer-based tutoring system (CBTS) authoring tools to supplement traditional classroom training with computer-guided tutoring per ALM; conducted research to expand intelligent tutoring system (ITS) domain models to represent Army training domains ; researched, developed, and evaluated instructional models for unit-level team tutoring."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.764"
                                            },
                                            "Text": {
                                                "val": "Will investigate the effectiveness of using realistic human driven avatars (puppeteering) in training applications on improving human performance; investigate effectiveness of current Army applied virtual distributed learning training; identify capability gaps in small team training as it relates to the Army’s Synthetic Training Environment; develop automated authoring tools to supplement traditional classroom training with computer-guided tutoring per ALM; and mature intelligent tutoring system domain models to represent Army training domains; assess effectiveness of instructional models for unit-level team tutoring."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.495"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.495"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to identify opportunities to enhance the capabilities of authoring tools and assess their effectiveness with the goal of reducing authoring times and allowing non-computer programmers the capability to generate sophisticated ITSs; will begin to mature and operationalize team tutoring concepts for the Synthetic Training Environments with respect to assessment and interaction between the team and the computer-based tutor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Architecture"
                                    },
                                    "Description": {
                                        "val": "Research and develop simulation architecture to represent the Soldier as a System considering physiological effects, cognitive load, and Soldier culture in the context of Soldier-materiel interactions supporting training effectiveness, experimentation, and materiel development.  The architecture will advance computational strategies to enable the integration and interaction of new and existing Soldier models into a seamless Soldier as a System simulation.  This effort is coordinated with and complements PE 0602785\/Project 790, PE 0602786\/Project H98, PE 0602787\/Project 869, PE 0603001\/J50, and PE 0603710\/Project K70."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Text": {
                                                "val": "Investigated the design of a simulation architecture that supports the development of a Soldier as a System simulation; investigated novel simulation solutions developed to link and synchronize models of human and system\/equipment components; and developed metrics to analyze design tradeoffs between factors such as individual and team performance, system effectiveness, training requirements and cost."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Will develop simulation components that link and synchronize models of human and system\/equipment components to enable analysis within Soldier Systems Engineering Architecture; and investigate modeling & simulation framework limitations and propose remediation activities to enable cross-community\/domain\/user accessibility and re-use of modeling and simulation architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.301"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.301"
                                            },
                                            "Text": {
                                                "val": "Will develop and mature enhanced simulation representations leveraging emerging Soldier Resilience and Effects of Stress on Shooter Performance study data supporting Soldier Systems Engineering Architecture (SSEA) use case analysis; will conduct experiments using developed simulation components in a relevant SSEA operational scenario; and will develop additional modeling and simulation (M&S) tools\/technologies and Systems Engineering Processes as recommended in the SSEA (MS&T) Implementation Plan."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Effectiveness Research"
                                    },
                                    "Description": {
                                        "val": "This effort will research and develop simulation architectures, tools, and models that can represent current and future semi and fully autonomous systems.  The architecture, tools and models will enable the evaluation of the training impacts (i.e., cognitive, physiological, and team coordination) of future autonomous systems and technologies on individual, crew, and unit tasks.  The training demands of systems that are increasingly complex, intelligent, and self-adaptive far exceed those of legacy systems that require training of primarily procedural tasks.  This is compounded by parallel increases in autonomy and responsibility at lower echelons. This effort is coordinated with and complements PE 0603015A\/Project S29 and 0602716A\/Project H70."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Text": {
                                                "val": "Research, develop and evaluate models, methods and tools to identify best practices for training with autonomous systems\/technology to assess the effectiveness of various training strategies consistent with Army doctrine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to assess effectiveness of best practice training strategies for autonomous systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.301"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.301"
                                            },
                                            "Text": {
                                                "val": "Will mature concepts to optimize training strategies for autonomous systems; and develop recommender system to reinforce experiential learning of autonomous systems via machine learning techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Soldier Capability Enhancement - Training"
                                    },
                                    "Description": {
                                        "val": "Research the relationship of augmentation agents and Soldier performance & behavior.  Investigate the effects of augmentation agents (perceptual, cognitive, and\/or physical), used either individually or coupled as a system of agents, on Soldier performance, resilience, and training during operationally relevant tasks. Development of guidelines and models for designing and employing augmentation agents. Implementation of guidelines will enhance augmented Soldier performance. This research is coordinated with PE 0602716A\/Project H70."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.184"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.184"
                                            },
                                            "Text": {
                                                "val": "Will investigate augmentation application, including timing, amplitude, and duration relative to biological and environmental signals, to understand functionality in varied and complex environments.  Model performance and adaptation to augmentation agents in order to predict capability enhancement; investigate individual variability and short and long term adaptation to augmentation agents. Explore the extension of methods and metrics developed for single augmentation agent to the quantification of Soldier performance while using a system of augmentation agents."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synthetic Natural Environments"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops tools and methods to improve the speed, fidelity and delivery of synthetic terrain and environmental data to support Training Aid Devices (TADs), simulation and mission rehearsal systems. This effort is coordinated with and complements PE 0603015A\/Project S28."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.204"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.204"
                                            },
                                            "Text": {
                                                "val": "Will investigate physics-based dynamic algorithms and terrain components in a cloud based computing environment for the Army’s One World Terrain representation. This research will provide environment representation in order to deliver training in mission rehearsal for soldiers at the point of need."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D02"
                    },
                    "ProjectTitle": {
                        "val": "Modeling & Simulation For Training And Design"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.551"
                        },
                        "CurrentYear": {
                            "val": "7.099"
                        },
                        "BudgetYearOne": {
                            "val": "5.427"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.427"
                        },
                        "BudgetYearTwo": {
                            "val": "6.523"
                        },
                        "BudgetYearThree": {
                            "val": "6.653"
                        },
                        "BudgetYearFour": {
                            "val": "6.785"
                        },
                        "BudgetYearFive": {
                            "val": "6.924"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project transitions basic research into applied research.  This Project investigates and designs training applications to enable the Army to train any time and any place.  Efforts include designing virtual humans that embody natural language, speech recognition in noisy environments, gesture, gaze, and conversational speech. Techniques and methods are assessed for integrating different sensory cues into virtual environments that result in enhanced training and leader development. The project leverages the capabilities of industry and the research and development community through the synthesis of creativity and technology, including work at the Army Research Institute and the Army Research Laboratory. \n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad portfolio.\n\nDeveloped technologies and techniques are transitioned for maturation and demonstration to Program Element (PE) 0603015A\/Project S28 (Immersive Learning Environments).     \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy. \n \nWork in this Project is performed by the Army Research Laboratory, Human Research and Engineering Directorate, Simulation and Training Technology Center (STTC), Orlando, FL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Technology Environments"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research that enables responsive and reconfigurable environments that immerse human senses such as sight, sound, and touch in mixed reality environments to include physical elements providing touch and feel to simulate objects such as obstacles and walls."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.276"
                                            },
                                            "Text": {
                                                "val": "Investigated the effect on trainee learning and emersion experience within a virtual environment when low-cost scanning sensors and data capture techniques are used to rapidly capture and insert avatars representing the appearance and behaviors of actual trainees; experimented with adding mobile communication devices to the virtual human architecture to examine long-term interactions with virtual coaches and mentors; and determined the effectiveness of using virtual humans for interviewing patients in support of assessing Post Traumatic Stress Disorder."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.550"
                                            },
                                            "Text": {
                                                "val": "Will investigate the use of reinforcement learning to adapt, modify and improve engagement strategies for virtual learning environments; improve and extend capabilities of online virtual support agents so that they can respond appropriately even when user inputs are only partially understood and can be used via mobile phone applications; and develop tools for simulated crowd generation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.714"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.714"
                                            },
                                            "Text": {
                                                "val": "Will develop technologies that enable the study of learning and engagement on mobile devices (e.g., smartphones) which are a key platform for future learning technology; develop cloud-based toolkit for recording, analyzing, and adapting to learner engagement and other emotions for both web-based and mobile platforms; and develop tools and processes to ease the authoring and deployment of conversational virtual coaches across multiple computing platforms to include import\/export, integration, and debugging features."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Immersive Technology Techniques"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools, techniques and technologies for improving the immersion of human senses within simulation environments and therefore creating enhanced realism."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.275"
                                            },
                                            "Text": {
                                                "val": "Conducted research to develop learner models for adaptive training environments focusing on strategies to increase learner attention and engagement; and investigated natural language computer processing techniques to translate real-world narratives into authorable interactive narratives for immersive environments.."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.549"
                                            },
                                            "Text": {
                                                "val": "Will advance research on autonomous agents for capturing training performance of users in indoor environments, and investigate the capture of three-dimensional (3D) geometry from the robotic platform; investigate how real-world data can be acquired and incorporated into simulated environments to increase the degree of user immersion; investigate the use of reinforcement learning to adapt, modify and improve engagement strategies for virtual learning environments; and develop authoring tools to allow virtual humans to be created and maintained by collaborators and other external sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.713"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.713"
                                            },
                                            "Text": {
                                                "val": "Will conduct empirical studies to better understand perceptual mechanisms and design parameters that are important for multi-user virtual reality environments; and develop, integrate, and demonstrate enhanced automated language computer processing techniques for translating real-world narratives into authorable interactive narratives for immersive simulations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}