{
    "id": "2018-AirForce-PB-3600-MJBOOK-1-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-3",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603790F"
        },
        "ProgramElementTitle": {
            "val": "NATO Research and Development"
        },
        "R1LineNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.566"
            },
            "CurrentYear": {
                "val": "4.333"
            },
            "BudgetYearOne": {
                "val": "3.851"
            },
            "BudgetYearOneBase": {
                "val": "3.851"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "3.934"
            },
            "BudgetYearThree": {
                "val": "4.025"
            },
            "BudgetYearFour": {
                "val": "4.092"
            },
            "BudgetYearFive": {
                "val": "4.177"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.736"
                },
                "CurrentYear": {
                    "val": "4.333"
                },
                "BudgetYearOne": {
                    "val": "3.840"
                },
                "BudgetYearOneBase": {
                    "val": "3.840"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.566"
                },
                "CurrentYear": {
                    "val": "4.333"
                },
                "BudgetYearOne": {
                    "val": "3.851"
                },
                "BudgetYearOneBase": {
                    "val": "3.851"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.170"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.011"
                },
                "BudgetYearOneBase": {
                    "val": "0.011"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.170"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.011"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.011"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "64NATO"
                    },
                    "ProjectTitle": {
                        "val": "Nato Coop R&D"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.566"
                        },
                        "CurrentYear": {
                            "val": "4.333"
                        },
                        "BudgetYearOne": {
                            "val": "3.851"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.851"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.934"
                        },
                        "BudgetYearThree": {
                            "val": "4.025"
                        },
                        "BudgetYearFour": {
                            "val": "4.092"
                        },
                        "BudgetYearFive": {
                            "val": "4.177"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2016, PE 0603791F, International Space Cooperative Research & Development, Project 645035, International Space Coop R&D, efforts were transferred to PE 0603790F, NATO Research and Development, Project 64NATO, NATO Coop R&D, in order to consolidate international cooperative research and development activities."
                        },
                        "ProjectMissionDescription": {
                            "val": "These funds will be used to initiate air, space, and cyber international cooperative research, and development (ICR&D) agreements with North Atlantic Treaty Organization (NATO) member states, major non-NATO allies and friendly foreign countries.  Each of the selected activities and projects are required to have a concluded international agreement (IA), prior to funds being released, that implements the provisions of Title 10 U.S. Code, Section 2350a.  This legislation (Title 10 U.S. Code, Section 2350) authorizes funds to significantly improve U.S. and allied conventional defense capabilities by leveraging the best defense technologies, eliminating costly duplication of R&D efforts, accelerating the availability of defense systems, and promoting US and allied interoperability or commonality.  These funds will not be used for government civilian salaries, permanent construction, or spent overseas.  This program element funds the implementation of Air Force ICR&D agreements in (1) Basic Research (2) Applied Research (3) Advanced Technology Development (4) Advanced Component Development and Prototypes (5) System Development and Demonstration and (6) RDT&E Management Support.\n\nThis program is in Budget Activity 4, Advanced Component Development and Prototypes (ACD&P) because efforts are necessary to evaluate integrated technologies, representative modes or prototype systems in a high fidelity and realistic operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Cooperative Research and Development"
                                    },
                                    "Description": {
                                        "val": "Supports bi- and multi-lateral international agreements that meet USAF RDT&E objectives and goals.  Each of the cooperative projects that receive funding must meet one or more of the following requirements:  enhance warfighter capabilities and coalition interoperability; accelerate the availability of defense systems; strengthen and reinforce strategic partnerships; gain access to the best defense technologies, capabilities and techniques; build relationships and influence with allies; and\/or eliminate duplication of R&D efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.566"
                                            },
                                            "Text": {
                                                "val": "FY16 cooperative projects will include, but are not limited to, RDT&E efforts in human performance, directed energy, information systems, aerospace systems, munitions, materials and manufacturing, sensors, and space vehicles.  Representative projects include but are not limited to Unmanned Aerial Systems Crew Training Research, Modeling Fatigue from Prolonged Driving, Quantification Standards to Assess the Loss of Thermal Barrier Coating due to Calcium-Magnesia-Alumina-Silicate Exposure, Advanced Rotary Engine Design for Tactical Unmanned Aerial Vehicles, Time Critical Targeting in Urban Environments, Environmental Health and Safety of Advanced Nanomaterials, Panchromatic Materials for Optical Sensor Protection, Resolving High Temperature\/Pressure and Unsteady Flow Measurements for Advanced Cycle Diagnostics, Flight Information Exchange Model for Air Force Mission Planning, Tessellated Nanosatellite-enhanced Communications Feasibility, Coalition Performance Evaluation Tracking System, Real-time Coalition Performance Assessment; and others"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.333"
                                            },
                                            "Text": {
                                                "val": "FY17 cooperative projects involve RDT&E efforts in human performance, information systems, aerospace systems, munitions, materials and manufacturing, sensors, space situational awareness, missile warning, military satellite communications, global positioning systems, responsive space capabilities, cyber network defense and information assurance, and space vehicles. These projects include but are not limited to Pre-cooler Heat Exchanger for High Mach Air-Breathing Propulsion (HEX), Space-Based Surveillance by Hypertemporal Imaging (HTI) Sensors, Small Scalable Kinetic Weapon (SSKW) Phase 2, Life Management of Notch Locations in Aeroengine Components, Additive manufacturing and modeling of thermosetting polymer composites, Selective Amplification of Low Power mmW Signals (SALSA), Sensing and Integrated Navigation with GNSS and Augmentations (SINGA), Aircraft Damage Effects Assessment (ADEA), Protected Tactical Service Field Demo (PTSFD, Advanced Methods for Space Object Understanding, Mid-Latitude Plasma Density Irregularities, Biosignatures for Automated Human Detection and Characterization, Nano-Thermite Reactive Liner Composite, and others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.851"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.851"
                                            },
                                            "Text": {
                                                "val": "FY18 cooperative projects involve RDT&E efforts in human performance, information systems, aerospace systems, munitions, materials and manufacturing, sensors, space situational awareness, missile warning, military satellite communications, global positioning systems, responsive space capabilities, cyber network defense and information assurance, and space vehicles. These projects include but are not limited to Monitoring For Advanced Geolocation Processing And Interference Exploitation (MAGPIE), Next Generation Case Technology, Machine Translation for Coalition Forces, Low Pressure Turbine (LPT) Performance  Improvement,Performance in Extreme Loading and Impact Conditions for Affordable Next-generation Steels, Enabling Novel Human Assessment and Neurophysiological Characterization of Effectiveness (ENHANCE), Graphene on 3C-SiC on Si for low-loss nanophotonics, SATNAV Augmentation to Improve Navigation Technology (SAINT), Warfighter Benefits of UK Prototype Laser Eye Protection (LEP) Devices, Ceramic Matrix Composites (CMCs) for Hypersonic Hot Structures, Minimal Invasive Repair of Composite Structures, Computational Multi-Scale Modeling of Explosives, Space Environment Impacts, Medium Earth Orbit (MEO) Hosted Energetic Charged Particle (ECP) Constellation, and Mission Execution Tracking and Re-Planning Assistant"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A principal goal of the NATO Cooperative R&D program is to effectively utilize the aggregate resources invested by the US and our allies in air, space, and cyber R&D.  This program element provides the critical funding incentive needed to pursue air, space and cyber related International Cooperative Research Development and Acquisition (ICRD&A) agreements and helps to (a) leverage USAF and allied resources through cost sharing and economies of scale; (b) exploit the best US and allied technologies for equipping coalition forces; (c) demonstrate areas of commonality or interoperability with our allies; and (d) accelerate the availability of defense technology and systems. Candidate projects are reviewed against USAF goals, DoD objectives, and warfighter needs prior to being approved.  An international agreement defining project objectives, responsibilities and costs is required prior to release of funds.  To obtain these funds and ensure service commitment, projects are selected from existing or new RDT&E programs funded in the Future Years Defense Plan (FYDP).  Project offices must show matching funds and contributions from associated program elements and equitable allied funding.  As appropriate, funding responsibility for out-year requirements and follow-on efforts are transferred to the project office and associated program elements.  Any new contracts are awarded after full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}