{
    "id": "2018-Army-PB-2040-JBOOK-6496f983e90d3a98760d6d2aa09bce01c6733fe7e60bc4ee6b3adbaad3baa8ce-10",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603125A"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism - Technology Development"
        },
        "R1LineNumber": {
            "val": "39"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "32.430"
            },
            "CurrentYear": {
                "val": "27.686"
            },
            "BudgetYearOne": {
                "val": "26.903"
            },
            "BudgetYearOneBase": {
                "val": "26.903"
            },
            "BudgetYearTwo": {
                "val": "21.268"
            },
            "BudgetYearThree": {
                "val": "20.593"
            },
            "BudgetYearFour": {
                "val": "21.004"
            },
            "BudgetYearFive": {
                "val": "21.433"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps. Efforts include: hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the United States (U.S.) Department of Energy to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; and field demonstrations and red teaming to stress and assess emerging systems in key areas for gaining or maintaining overmatch earlier in the life-cycle, thus improving systems by reducing vulnerabilities and providing a more holistic understanding of employment risks in operationally-representative environments and against potential threats.\n\nWork in this PE is complementary to and is fully coordinated with PE 0602105A (Materials Technology), PE 0602270A (Electronic Warfare Technology), PE 0602303A (Missile Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603270A (Electronic Warfare Technology), and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM) and the Army Engineer Research and Development Center (ERDC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.520"
                },
                "CurrentYear": {
                    "val": "27.686"
                },
                "BudgetYearOne": {
                    "val": "24.906"
                },
                "BudgetYearOneBase": {
                    "val": "24.906"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.430"
                },
                "CurrentYear": {
                    "val": "27.686"
                },
                "BudgetYearOne": {
                    "val": "26.903"
                },
                "BudgetYearOneBase": {
                    "val": "26.903"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.090"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.997"
                },
                "BudgetYearOneBase": {
                    "val": "1.997"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.090"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "1.997"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.997"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DF5"
                    },
                    "ProjectTitle": {
                        "val": "Agile Integration & Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.430"
                        },
                        "CurrentYear": {
                            "val": "27.686"
                        },
                        "BudgetYearOne": {
                            "val": "26.903"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.903"
                        },
                        "BudgetYearTwo": {
                            "val": "21.268"
                        },
                        "BudgetYearThree": {
                            "val": "20.593"
                        },
                        "BudgetYearFour": {
                            "val": "21.004"
                        },
                        "BudgetYearFive": {
                            "val": "21.433"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps. Efforts include hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the United States (U.S.) Department of Energy (DOE) to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; and red teaming to stress and assess emerging systems in key areas for gaining or maintaining overmatch earlier in the life-cycle, thus improving systems by reducing vulnerabilities and providing a more holistic understanding of employment risks in operationally-representative environments and against potential threats.\n\nWork in this Project is complementary to and is fully coordinated with Program Element (PE) 0602105A (Materials Technology), PE 0602270A (Electronic Warfare Technology), PE 0602303A (Missile Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603270A (Electronic Warfare Technology), and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Research, Development, and Engineering Command (RDECOM) and the Army Engineer Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapidly Deployable Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts live, virtual, and hybrid scenario-based experiments to stress and assess emerging technology systems that are targeted to support expeditionary units, improving technology design, development, and ultimate employment. These technologies must be readily transportable; require minimal set up, take down, and operational effort; and must be easily adaptable across a variety of missions, environments, and threats. This effort is coordinated with PE 0602618A (Ballistics Technology)\/Project H80 (Survivability and Lethality Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.860"
                                            },
                                            "Text": {
                                                "val": "Incorporated Army G-2 and Army Training and Doctrine Command (TRADOC)-provided threat information, as well as the expertise of Special Forces Soldiers, to develop a series of operationally relevant experiments that stress the performance limits of emerging and fielded systems geared for small unit expeditionary forces. Integrated Pacific Command (PACOM), Africa Command (AFRICOM), Southern Command (SOUTHCOM) and\/or the Central Command (CENTCOM)-based scenarios into experiments and targeted specific environments of interest (e.g., wooded, marine, urban, contested and congested radio frequency (RF)). Replicated relevant threat\/overmatch capabilities (e.g., commercially available computer network, RF, and electromagnetic (EM) attack methodologies) and integrated, trained, and operated technology systems in increasingly complex blue\/red team scenarios. Expanded and refined quantitative measures of success for the Warfighter Technology Tradespace Methodology, and assessed systems’ performance across technical, user, supportability, and adaptability factors. Uncovered technology system vulnerabilities, including risks to user acceptance, and recommended mitigation options and\/or areas for additional development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology Systems Adaptive Red Teaming"
                                    },
                                    "Description": {
                                        "val": "This effort seeks to challenge conventional approaches to technology and systems development and insertion, and to increase the awareness of risks and opportunities earlier in the lifecycle in order to improve system design, development, and employment. It builds on the concepts and methodology developed under the Deployable Force Protection Adaptive Red Teaming effort and applies them to other high-priority areas for the Army. It designs and conducts live, virtual, and mixed scenarios and demonstrations to evaluate the most promising technologies. It stresses and assesses developing technology systems for both individual and system-of-system performance across a representation of operational environments, realistic scenarios, and emerging threats. Activities include identifying, integrating, and examining system performance at live demonstration venues with experienced operators; emulating emerging threats and alternative futures to challenge assumptions regarding scenarios and system employment; and identifying and informing potential vulnerabilities in systems and systems-of-systems, including but not limited to, performance degradation in congested\/contested environments, interoperability, and adaptability. This effort is coordinated with PE 0602618A (Ballistics Technology)\/Project H80 (Survivability and Lethality Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.811"
                                            },
                                            "Text": {
                                                "val": "Incorporated intelligence, requirements, acquisition, and science and technology community stakeholder input to identify developmental systems that support key Army acquisition programs, either current or planned. System areas of interest include: Positioning, Navigation and Timing; Weapons Systems Guidance and Control; Threat Detection\/Hostile Fire Detection; Counter-Rocket, Artillery and Mortar (C-RAM), Counter-Precision Guided Munitions (C-PGM), and\/or Counter-Unmanned Aerial Systems (C-UAS); Platform Common Architectures; Sensor Protection Technologies; Robotics and Autonomous\/Semi-Autonomous Systems; and Denial and Deception Technologies. Designed and conducted a series of in-depth, phased assessments that incorporate near-peer threats and field experiments with experienced Warfighters; stressed the systems under various, operationally-relevant scenarios and uncover potential risks pertaining to systems integration, interoperability, adaptability, user technology acceptance, and performance in contested environments. Recommended means to mitigate or reduce systems' vulnerabilities, with the goal of informing current or future acquisition programs early in the development lifecycle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Platform Subsystem Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort contributes to the Army's ground platform risk reduction efforts which seek to address technical and integration challenges in the areas of mobility, survivability, vehicle architecture and systems integration. Specifically, this effort focuses on maturing and demonstrating integrated vehicle power management, generation and distribution technologies to increase ground vehicle energy efficiencies and ensure ground platforms have enough power to enable future capabilities such as electromagnetic armor, active protections systems, improvised explosive device (IED) detect and defeat technologies, advanced situational awareness and future network integration technologies. This effort is coordinated with PE 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.801"
                                            },
                                            "Text": {
                                                "val": "Analyzed the next generation power and data architecture and the corresponding system design’s interface with vehicle subsystems, specifically powertrain subsystems. Demonstrated electronic control communication between powertrain system components. Matured the engine controls architecture to optimize engine power density, fuel efficiency and heat rejection. Finalized requirements for demonstrating a system design of the next generation power and data architecture integrated on a combat vehicle, in order to validate the open architecture and power and data capabilities required for the Combat Vehicle Prototyping program and future vehicle modernization efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will model and develop a powertrain controls architecture and algorithm to improve powertrain efficiencies and minimize parasitic losses. Will mature and demonstrate the feasibility of realizing a high voltage power electronics architecture to save Size, Weight, and Power (SWaP) and enhance interoperability among system of systems architecture. Will optimize thermal properties of power components leveraging the Vehicle Electronics & Architecture (VEA) Mobile Demonstrator (VMD) effort in coordination with PE 0603005A. Will continue to optimize the performance specification requirements for the next generation power architecture as it applies to combat vehicles and future tactical vehicle modernization efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Will mature the VEA Mobile Demonstrator (VMD) technology by optimizing subsystem performance during hardware integration onto vehicle platform, and beginning demonstrations of VMD capabilities to validate system performance against future power and data requirements. Will mature and validate powertrain controls architecture and algorithm to improve powertrain efficiencies and minimize parasitic losses through component modeling and simulation. Will mature and validate integrated starter generator, advanced thermal management system, and advanced modular lithium ion battery technologies to improve subsystem fuel efficiency and increase electrical power generation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced technologies that enable military ground vehicles to become significantly more energy efficient. It collaborates with the DOE to demonstrate technologies in: advanced combustion engines and transmissions; lightweight structures and materials; energy recovery and thermal management; alternative fuels and lubricants; hybrid propulsion systems; batteries and energy storage; and analytical tools (e.g., modeling and simulation). This effort is coordinated with PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.958"
                                            },
                                            "Text": {
                                                "val": "Continued to support the Advanced Vehicle Power Technology Alliance (AVPTA) with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Completed demonstration of lightweight structures and materials using advanced manufacturing techniques. Developed advanced lubricants to help mitigate frictional losses in powertrain to increase vehicle efficiency. Developed the capability to model advanced chemistry batteries and batteries in extreme temperature conditions. Investigated autonomy-enabled technologies and vehicle electrification to leverage common military and industry investments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.249"
                                            },
                                            "Text": {
                                                "val": "Will continue to support the AVPTA with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Will provide the capability to model and simulate advanced chemistry batteries and batteries in extreme temperature conditions to improve characterizing battery life cycle estimations. Will mature, and demonstrate friction and wear reduction technologies to increase powertrain and vehicle efficiencies. Will provide tire efficiency optimization to improve vehicle fuel efficiency. Will exploit autonomy-enabled technologies and vehicle electrification to leverage dual use technology maturation.Will continue to support the AVPTA with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Will provide the capability to model and simulate advanced chemistry batteries and batteries in extreme temperature conditions to improve characterizing battery life cycle estimations. Will mature, and demonstrate friction and wear reduction technologies to increase powertrain and vehicle efficiencies. Will provide tire efficiency optimization to improve vehicle fuel efficiency. Will exploit autonomy-enabled technologies and vehicle electrification to leverage dual use technology maturation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.343"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.343"
                                            },
                                            "Text": {
                                                "val": "Will continue to support the AVPTA with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Will continue to provide the capability to model and simulate advanced chemistry batteries and batteries in extreme temperature conditions to improve characterizing battery life cycle estimations. Will improve tire modeling and simulation capabilities based on dynamic property data from advanced tire testing. Will improve correction prevention capabilities through results from investigation of corrosion mechanisms and effects on dissimilar material joints which identified materials and processes to inhibit corrosion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming Field Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort conducts field demonstrations of emerging technologies using realistic environments, scenarios, warfighters, and adaptive adversaries to uncover potential vulnerabilities in systems and identify fixes and improvements earlier in the development cycle. Demonstrated technologies include candidates being developed by the Army Science and Technology Enterprise as well as those by other Services, Agencies, Academia, and Industry. Some technologies undergoing System Intensive Analysis may be selected to undergo Field Demonstration as well. This effort builds upon the work previously completed in Rapidly Deployable Technologies and Technology Systems Adaptive Red Teaming."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.718"
                                            },
                                            "Text": {
                                                "val": "Will conduct a series of live\/virtual\/hybrid, multi-day, operationally relevant field demonstrations shaped by threat-informed challenges and areas of overmatch concern (e.g., unmanned aerial systems, jamming environments); stress the performance limits of selected emerging systems integrated into increasingly complex scenarios and provide feedback to developers through structured Red, Blue, and White Cell assessments that provide options to reduce or mitigate vulnerabilities; potential technical areas of interest include human performance, advanced weapons, autonomous systems, and electronic warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.282"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.282"
                                            },
                                            "Text": {
                                                "val": "Will conduct a series of multi-day live field demonstrations where warfighters utilize technologies and systems in operationally relevant scenarios to address a set of priority, threat-informed challenges and areas of overmatch concern. Potential technical areas of interest include force protection, interoperability, internet of things, autonomous systems, and electronic warfare. Demonstrations are structured to stress the technologies\/systems and uncover vulnerabilities through (a) their employment in increasingly complex mission scenarios with friendly and adaptive opposing forces, (b) emulated threat probes for electronic warfare vulnerabilities, and (c) hierarchical task analysis; implement methodologies to factor technology evolution into assessment frameworks; and provide feedback to developers through structured Red (threat), Blue (US Forces), and White Cell (technical observer) assessments to facilitate reduction or mitigation of vulnerabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming Systems Intensive Analysis"
                                    },
                                    "Description": {
                                        "val": "This effort conducts detailed analysis (from concepts to employment to interoperability) for selected technologies with planned transitions to high-priority emerging programs of record associated with contested and congested environments. The intent is to identify and mitigate any identified vulnerabilities as early as possible. Analysis of some technologies may leverage Red Teaming Field Demonstration activities to further understand vulnerabilities. This effort builds upon the work previously completed in Rapidly Deployable Technologies and Technology Systems Adaptive Red Teaming."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.107"
                                            },
                                            "Text": {
                                                "val": "Will conduct intensive analysis for several key emerging systems and concepts based on intelligence, requirements, acquisition, and science and technology community stakeholder input for individual, intensive assessment and feedback to uncover vulnerabilities and potential risks pertaining to systems integration, interoperability, adaptability, user technology acceptance, and performance in contested environments; potential technical areas of interest include human performance, advanced weapons, autonomous systems, and electronic warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.369"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.369"
                                            },
                                            "Text": {
                                                "val": "Will conduct the first phase of intensive analysis for key emerging systems and concepts identified from intelligence, requirements, acquisition, and science and technology community stakeholder strategy events; and continue to the next phase of ongoing intensive analysis for select key emerging systems and\/or concepts to uncover vulnerabilities and potential risks pertaining to systems integration, interoperability, adaptability, user technology acceptance, and performance in contested environments. Potential technical areas of interest will include operations in subterranean and urban interior environments, indicators of military activity through social media, unmanned medivac and resupply, and electronic warfare."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming Vulnerability Exercises"
                                    },
                                    "Description": {
                                        "val": "This effort conducts tabletop exercises for in-depth assessments of emerging threats and technologies to anticipate future challenges in contested and congested environments, inform threat concepts, adapt system development practices, and maintain overmatch capability. This venue allows analysis in areas that would be too dangerous or too expensive to assess during a live demonstration, as well as supports future “what if” assessments. Outputs of these exercises influence technologies and scenarios chosen for Systems Intensive Analysis and Field Demonstrations. This effort builds upon the work previously completed in Rapidly Deployable Technologies and Technology Systems Adaptive Red Teaming."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.612"
                                            },
                                            "Text": {
                                                "val": "Will explore alternatives in plans, concepts, operations, and organizations in the context of the operational environment and from the perspective of partners and adversaries; expand hierarchical task analysis methodologies, virtual discovery experiment approach, and implement identified adaptability metrics into structured assessments; tailor or extend assessment frameworks to capture data for analysis and feedback, and provide means to mitigate findings with the goal of informing current or future acquisition programs early in the development lifecycle; potential technical areas of interest include human performance, advanced weapons, autonomous systems, and electronic warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.912"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.912"
                                            },
                                            "Text": {
                                                "val": "Will design and conduct a series of virtual scenario-based exercises, rooted in stakeholder input on emerging threats and areas of overmatch concern, with participants from government, academia, and industry who represent red (threat), blue (US forces), and green (influence base, neutrals) perspectives in order to expose assumptions, characterize needed capabilities, and identify current and future critical vulnerabilities.  Exercises will cover broader time and space conditions than are possible in live field experiments.  Will implement team challenge experiments to identify potential vulnerabilities and risks for developing concepts or systems; and, based on previous year evaluations, modify analysis methodologies, structured assessments, and frameworks to improve data captured for analysis and feedback, with the goal of providing insight and data to enable risk mitigation, informing current or future acquisition programs early in the development lifecycle. Potential technical areas of interest will include force protection, interoperability, internet of things, autonomous systems, and electronic warfare."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Teaming Technology Assessment"
                                    },
                                    "Description": {
                                        "val": "Unmanned Teaming Technology Assessment"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.997"
                                            },
                                            "Text": {
                                                "val": "Will identify components, technologies and enablers required to establish a manned unmanned teaming capability to provide enhanced combat power in complex and contested environments.  Will determine component priority by assessing unmanned capabilities in support of realistic mission scenarios.  Primary components of the assessment include: Soldiers, unmanned ground vehicles, unmanned air vehicles,  command and control, communications and lethality."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW4"
                    },
                    "ProjectTitle": {
                        "val": "Energy Technologies (Congressional Adds (CAs))"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project contains Congressional add funding."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Force Protection Radar Development"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.000"
                                        },
                                        "Text": {
                                            "val": "This is a Congressional interest item."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}