{
    "id": "2018-Army-PB-2040-JBOOK-8aa6116a07f4d60601a05c4a1332e7f28609a7e32c0f8c7666562466c33015eb-17",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0202429A"
        },
        "ProgramElementTitle": {
            "val": "Aerostat Joint Project - COCOM Exercise"
        },
        "R1LineNumber": {
            "val": "195"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.171"
            },
            "CurrentYear": {
                "val": "45.482"
            },
            "BudgetYearOne": {
                "val": "6.749"
            },
            "BudgetYearOneBase": {
                "val": "6.749"
            },
            "BudgetYearTwo": {
                "val": "0.001"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "62.403"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Joint Land Attack Cruise Missile Defense Elevated Netted Sensor System (JLENS) is a supporting program for Army and Joint Integrated Air and Missile Defense,\nproviding elevated, persistent, over the horizon surveillance and fire control quality data on Army and Joint networks, enabling protection of the U.S. and coalition forces\nas well as critical geo political assets from Cruise Missiles, Aircraft, Unmanned Aerial Vehicles, Tactical Ballistic Missiles, Large Caliber Rockets, and Surface Moving\nTargets. A JLENS Orbit consists of two systems: a fire control radar system and a wide-area surveillance radar system. Each radar system consists of a separate 74-\nmeter tethered aerostat, mobile mooring station, radar and communications payload, processing station, and associated ground support equipment. The systems are\ndesigned to work together, but can operate independently. The JLENS Orbit is transportable by road, rail, sea and air.\n\nJLENS uses advanced sensor and networking technologies to provide persistent, 360-degree, wide-area surveillance and precision tracking of Land Attack Cruise\nMissiles and other types of Air Breathing Threats. This information is distributed via joint service networks and provides fire control quality data to Surface to Air missile\nsystems, such as Army Patriot and Navy Aegis, increasing the weapons' capabilities by allowing systems to engage targets normally below, outside, or beyond surface\nbased weapons' field of view. JLENS also provides fire control quality data to fighter aircraft, allowing the aircraft to engage hostile threats from extended ranges, and\ncontributes to the development of a single integrated air picture.\n\nJLENS prepared and  participated in Operation Noble Eagle (ONE) with NORAD-USNORTHCOM National Capital Region (NCR) Integrated Air Defense System (IADS) Operational\nExercise (OPEX) from FY14-FY16 as directed by the Joint Requirements Oversight Council Memorandum (JROCM) 021-13 signed by the Vice Chairman of the\nJoint Chiefs of Staff on 31 January 2013.  The OPEX included an operational assessment to \"inform a future decision for enduring operational employment\", in accordance\nwith Joint Requirements Oversight Council Memorandum (JROCM) 021-13. The Combatant Command (CCMD) objective for the OPEX was to provide the full range of\nJLENS Orbit level capability to include: Persistent Wide Area Surveillance (WAS) through Battle Command System Fixed (BCS-F) Integration Combat Identification\n(CID) \/ Electronic Identification (EID) Precision Cue to Fighters\/Ground-Based Air Defense (GBAD) via Tactical Data Link (TDL) Integrated Fire Control to Fighters (IFC)\/\nGBAD via TDL.\n\nJLENS ended OPEX participation in October 2015 with the direction to store the system in place."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.565"
                },
                "CurrentYear": {
                    "val": "45.482"
                },
                "BudgetYearOne": {
                    "val": "6.746"
                },
                "BudgetYearOneBase": {
                    "val": "6.746"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.171"
                },
                "CurrentYear": {
                    "val": "45.482"
                },
                "BudgetYearOne": {
                    "val": "6.749"
                },
                "BudgetYearOneBase": {
                    "val": "6.749"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.394"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.003"
                },
                "BudgetYearOneBase": {
                    "val": "0.003"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.394"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.003"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.003"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY16 adjustments include .394 million dollar transfer in support of SBIR\/STTR."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EP8"
                    },
                    "ProjectTitle": {
                        "val": "COCOM Exercise"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.171"
                        },
                        "CurrentYear": {
                            "val": "45.482"
                        },
                        "BudgetYearOne": {
                            "val": "6.749"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.749"
                        },
                        "BudgetYearTwo": {
                            "val": "0.001"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "62.403"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Land Attack Cruise Missile Defense Elevated Netted Sensor System (JLENS) is a supporting program for Army and Joint Integrated Air and Missile Defense,\nproviding elevated, persistent, over the horizon surveillance and fire control quality data on Army and Joint networks, enabling protection of the U.S. and coalition forces\nas well as critical geo political assets from Cruise Missiles, Aircraft, Unmanned Aerial Vehicles, Tactical Ballistic Missiles, Large Caliber Rockets, and Surface Moving\nTargets. A JLENS Orbit consists of two systems: a fire control radar system and a wide-area surveillance radar system. Each radar system consists of a separate 74-\nmeter tethered aerostat, mobile mooring station, radar and communications payload, processing station, and associated ground support equipment. The systems are\ndesigned to work together, but can operate independently. The JLENS Orbit is transportable by road, rail, sea and air.\n\nJLENS uses advanced sensor and networking technologies to provide persistent, 360-degree, wide-area surveillance and precision tracking of Land Attack Cruise\nMissiles and other types of Air Breathing Threats. This information is distributed via joint service networks and provides fire control quality data to Surface to Air missile\nsystems, such as Army Patriot and Navy Aegis, increasing the weapons' capabilities by allowing systems to engage targets normally below, outside, or beyond surface\nbased weapons' field of view. JLENS also provides fire control quality data to fighter aircraft, allowing the aircraft to engage hostile threats from extended ranges, and\ncontributes to the development of a single integrated air picture.\n\nJLENS prepared for and participated in Operation Noble Eagle (ONE) with NORAD-USNORTHCOM National Capital Region (NCR) Integrated Air Defense System (IADS) Operational Exercise (OPEX) from FY14-FY16, as directed by the Joint Requirements Oversight Council Memorandum (JROCM) 021-13 signed by the Vice Chairman of the Joint Chiefs of Staff on 31 January 2013. JLENS participation in the OPEX was to allow for a combatant commander’s operational assessment of JLENS capabilities to \"inform a future decision for enduring operational employment\". \n\nOperational Control of JLENS for the OPEX was transferred to the NORAD\/NORTHCOM Joint Air Defense Operations Center (JADOC) on 15 October 2015.  Due to a tether break accident on 28 October 2015 and resulting loss of the Fire Control System aerostat and significant damage to the Radar and Mobile Mooring Station, the Commander NORAD\/NORTHCOM suspended JLENS participation in the OPEX pending results of accident investigations and Failure Review Board recommendations.  JLENS participation in the OPEX was terminated per an Under Secretary for Defense Policy decision memorandum dated 15 June 2016.  In accordance with Army Acquisition Executive (AAE) direction, JLENS equipment supporting the OPEX was packed and stored at the APG sites effective 21 June 2016, pending higher headquarters decision on the future of the JLENS program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JLENS Exercise"
                                    },
                                    "Description": {
                                        "val": "Plan and execute JLENS participation in the NORAD-USNORTHCOM National Capital Region Integrated Air Defense System (IADS) OPEX."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.171"
                                            },
                                            "Text": {
                                                "val": "Provided new equipment training, execution of operations of the JLENS Exercise program in support of North American Aerospace Defense Command (NORAD)\/United States Northern Command (NORTHCOM) Operation Noble Eagle, and government program management support of the JLENS Exercise.  Continued to support CCIA.  Conducted failure review board to determine root cause analysis and corrective actions in response to an aerostat breakaway accident.  Packed, stored and maintained Orbit 1 to be available if directed for re-participation for the Operational Exercise (OPEX) in FY17.  Performed technical assessments, studies, cost reduction, risk reduction, and complete required program documentation to include necessary enhancements, as required, to address NCR specific requirements for JLENS, Information Assurance, Cyber Security, and System Trouble Reports. Provided for the continued support of all Orbits, to include maintaining components of a second JLENS Orbit in storage."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.482"
                                            },
                                            "Text": {
                                                "val": "Provides new equipment training, execution of operations of the JLENS Exercise program in support of North American Aerospace Defense Command (NORAD)\/United States Northern Command (NORTHCOM) Operation Noble Eagle, and government program management support of the JLENS Exercise.  Reconstitute the equipment damaged as a result of the breakaway accident and implement corrective actions, as required, based on Failure Review Board recommendations, to allow safe return to flight.  Re-establish Orbit 1 from storage to Operational configuration to allow re-participation in the OPEC.  Continue to support CCIA.  Perform technical assessments, studies, cost reduction, risk reduction, and complete required program documentation to include necessary enhancements, as required, to address NCR specific requirements for JLENS, Information Assurance, Cyber Security, and System Trouble Reports. Provides for the continued support of all Orbits, to include maintaining components of a second JLENS Orbit in storage.  Support to the Exercise will continue through completion of FY2017 including displacement of the system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.749"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.749"
                                            },
                                            "Text": {
                                                "val": "Perform program shutdown activities to include disposition of assets and program office support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JLENS prepared for and participated in Operation Noble Eagle (ONE) with NORAD-USNORTHCOM National Capital Region (NCR) Integrated Air Defense System (IADS) Operational Exercise (OPEX) from FY14-FY16, as directed by the Joint Requirements Oversight Council Memorandum (JROCM) 021-13 signed by the Vice Chairman of the Joint Chiefs of Staff on 31 January 2013. JLENS participation in the OPEX was to allow for a combatant commander’s operational assessment of JLENS capabilities to \"inform a future decision for enduring operational employment\". \n\nOperational Control of JLENS for the OPEX was transferred to the NORAD\/NORTHCOM Joint Air Defense Operations Center (JADOC) on 15 October 2015.  Due to a tether break accident on 28 October 2015 resulting in the loss of the Fire Control System aerostat, significant damage to the Radar and Mobile Mooring Station, the Commander NORAD\/NORTHCOM suspended JLENS participation in the OPEX pending results from accident investigations and Failure Review Board recommendations.  JLENS participation in the OPEX was terminated per an Under Secretary for Defense Policy decision memorandum dated 15 June 2016.  In accordance with Army Acquisition Executive (AAE) direction, JLENS equipment supporting the OPEX was packed and stored at the APG sites effective 21 June 2016, pending higher headquarters decision on the future of the JLENS program. Courses of action under consideration are staging JLENS equipment in indefinite storage to meet potential future contingency requirements; and termination of the JLENS program with disposition\/demilitarization of JLENS equipment."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}