{
    "id": "2018-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-8c969fda2b08c8b1edabf434c4065342c0a47952a0575e86cbca2b99dbcebccc-1",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601117E"
        },
        "ProgramElementTitle": {
            "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "52.736"
            },
            "CurrentYear": {
                "val": "57.791"
            },
            "BudgetYearOne": {
                "val": "43.126"
            },
            "BudgetYearOneBase": {
                "val": "43.126"
            },
            "BudgetYearTwo": {
                "val": "47.882"
            },
            "BudgetYearThree": {
                "val": "46.456"
            },
            "BudgetYearFour": {
                "val": "46.456"
            },
            "BudgetYearFive": {
                "val": "46.456"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "56.544"
                },
                "CurrentYear": {
                    "val": "57.791"
                },
                "BudgetYearOne": {
                    "val": "65.685"
                },
                "BudgetYearOneBase": {
                    "val": "65.685"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.736"
                },
                "CurrentYear": {
                    "val": "57.791"
                },
                "BudgetYearOne": {
                    "val": "43.126"
                },
                "BudgetYearOneBase": {
                    "val": "43.126"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.808"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-22.559"
                },
                "BudgetYearOneBase": {
                    "val": "-22.559"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.007"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.801"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-22.559"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-22.559"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.  \nFY 2017:  N\/A\nFY 2018:  Decrease reflects the completion of the Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program in FY 2017."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MED-01"
                    },
                    "ProjectTitle": {
                        "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "52.736"
                        },
                        "CurrentYear": {
                            "val": "57.791"
                        },
                        "BudgetYearOne": {
                            "val": "43.126"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.126"
                        },
                        "BudgetYearTwo": {
                            "val": "47.882"
                        },
                        "BudgetYearThree": {
                            "val": "46.456"
                        },
                        "BudgetYearFour": {
                            "val": "46.456"
                        },
                        "BudgetYearFive": {
                            "val": "46.456"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Operational Medical Science Program Element will explore and develop basic research in medical-related information and technology leading to fundamental discoveries, tools, and applications critical to solving DoD challenges.  Programs in this project address the Department's identified medical gaps in warfighter care related to health monitoring and preventing the spread of infectious disease.  Efforts will draw upon the information, computational modeling, and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  To enable in-theater, continuous analysis and treatment of warfighters, this project will explore multiple diagnostic and therapeutic approaches, including the use of bacterial predators as therapeutics against infections caused by antibiotic-resistant pathogens; developing techniques to enable rapid transient immunity for emerging pathogens; and identifying fundamental biological mechanisms that enable certain species to be tolerant to various environmental insults.  Advances in this area may be used as a preventative measure to mitigate widespread disease."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Analysis and Adaptation of Human Resilience"
                                    },
                                    "Description": {
                                        "val": "The Analysis and Adaptation of Human Resilience program will explore new methods to maintain and optimize warfighter health in response to environmental insults such as new and emerging infectious diseases.  Research efforts in this area will apply recent advances in comparative biology, genetic sequencing, omics technologies, and bioinformatics to develop new tools for modulating health to ensure warfighter readiness.  One approach to achieve this goal is identifying the fundamental mechanisms that enable certain species to be tolerant to various environmental insults.  Genomic and physiological analyses of a wide array of resilient animal species may be combined with sophisticated algorithms to identify important patterns of survival.  By analyzing patterns in the underlying variability of host responses for resilient animals, one may formulate a survival blueprint to restore and maintain warfighter homeostasis in response to infection.  This approach is orthogonal to traditional infectious disease research, which primarily relies on reducing the pathogen load through drug intervention.  Research efforts within this program may enable discovery of novel methods to optimize human health against infectious diseases caused by multi-drug resistant pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.041"
                                            },
                                            "Text": {
                                                "val": "-  Developed animal testbeds to evaluate human-relevant infection across multiple resilient species.\n-  Assessed diagnostic technologies that can rapidly detect pathogen load and characterize the different stages of infection in multiple animal species.\n-  Analyzed experimental results and bioinformatics datasets to discover key markers of tolerance.\n-  Developed a bioinformatics library of acquired clinical retrospective data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.600"
                                            },
                                            "Text": {
                                                "val": "-  Explore methods for effectively screening animal susceptibility and disease tolerance to infection.\n-  Collect, curate, and integrate retrospective datasets into the analysis of tolerance mechanisms.\n-  Validate algorithms and analytical tools to facilitate the discovery of tolerance mechanisms.\n-  Identify approaches for intervention based on novel tolerance mechanisms in animals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.861"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.861"
                                            },
                                            "Text": {
                                                "val": "-  Screen susceptibility and tolerance to infection in different animal species.\n-  Complete an analysis of the host response to infection in different animal species.\n-  Apply validated algorithms and tools towards the discovery of tolerance mechanisms.\n-  Generate a preliminary set of tolerance-based interventions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Outpacing Infectious Disease"
                                    },
                                    "Description": {
                                        "val": "The Outpacing Infectious Disease thrust will investigate fundamental methods for using biology as a technology to create adaptive therapeutic response mechanisms to outpace viral diseases.  Today, protective measures such as antivirals and vaccines are often circumvented by fast-mutating viruses that evolve to develop drug resistance.  New approaches, such as enabling co-evolution and co-transmission of newly developed therapeutics to ultimately outcompete the pathogen, are needed in vaccine and antiviral design.  Key advances expected from this research include identifying methods to discover and develop new classes of dynamic therapeutics for fast-mutating viruses.  This approach represents a significant departure from conventional antiviral therapies, which typically rely on static solutions and continuous re-formulation and re-development in attempt to keep pace with emerging strains and disease variants.  Advances in this area may be applied to the mitigation of known, new, or emerging diseases."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.025"
                                            },
                                            "Text": {
                                                "val": "-  Design and build pathogen-derived therapeutic interfering particles (TIPs) that control disease by interfering with the pathogen.\n-  Develop dynamic in vitro platforms to test TIPs in vitro. \n-  Assess the safety and efficacy of TIPs in vitro. \n-  Initiate design of computational models to assess host-disease-therapeutic dynamics at the cellular and organismal levels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.476"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.476"
                                            },
                                            "Text": {
                                                "val": "-  Perform screening, optimization, and generalization of TIPs to other virus cases using dynamic in vitro platforms. \n-  Demonstrate proof of concept TIP co-evolution in vitro. \n-  Initial in vivo assessment of TIP safety and efficacy for selected viruses. \n-  Demonstrate initial proof of concept of TIP efficacy and co-evolution in silico."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Predicting Disease Transmission from Animal Carriers"
                                    },
                                    "Description": {
                                        "val": "Many emerging infectious disease outbreaks have origins in animal reservoirs. This program will investigate how animal pathogens gain the ability to be transmitted to humans. Tools such as detailed molecular analysis of animal reservoirs and bioinformatics will be leveraged. Building on discoveries in this program, researchers will develop predictive models to forecast potential environments where conditions are most favorable for disease transmission between animals and humans. Predicting such areas is a key capability to mitigating unforeseen outbreaks originating in animal reservoirs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.789"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.789"
                                            },
                                            "Text": {
                                                "val": "-  Identify conditions with a high potential to facilitate transmission of animal pathogens to humans.\n-  Initiate bioinformatics assessment of viruses known to have originated in animal reservoirs to identify key characteristics of pathogenicity.\n-  Analyze host-pathogen interaction mechanisms to determine causal relationship with animal to human transmission."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program will develop the underlying technologies to rapidly respond to a disease or threat and improve individual readiness and total force health protection by providing capabilities which are currently available only in centralized laboratories in the U.S. to non-tertiary care and individual settings.  ADEPT will develop and exploit biological tools for the in vivo creation of nucleic acid circuits that continuously and autonomously sense and respond to changes in physiologic state and for novel methods to target delivery, enhance immunogenicity, or control activity of vaccines, potentially eliminating the time to manufacture a vaccine ex vivo.  ADEPT advancements to control cellular machinery include research to optimize orthogonality and modularity of genetic control elements; identify methods to increase sensitivity and specificity; and demonstrate methods to control cellular machinery in response to changes in physiological status.  ADEPT will develop methodologies for measuring health-specific biomarkers from a collected biospecimen to enable diagnostics at the point-of-need or resource limited clinical facilities (point-of-care), in-garrison or deployed.  Additionally, ADEPT will develop techniques that will enable the rapid establishment of transient immunity through stimulation of the production of components of the immune system to impart effective but temporary protection.  This transient immunity would bridge the time gap between the delivery of a vaccine and the development of a long term protective immune response.  Applied research efforts are budgeted in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.400"
                                            },
                                            "Text": {
                                                "val": "-  Established biodistribution maps in appropriate models resulting from varied delivery methods, formulations, and devices relevant to nucleic acid constructs for antibody production.\n-  Demonstrated protection conferred by delivery of nucleic acid constructs encoding two or more antibodies in validated infectious disease animal model.\n-  Submitted Investigational New Drug (IND) application for transient nucleic acid-based formats against infectious disease.\n-  Demonstrated increased protective response and duration of antibody-encoding nucleic acid constructs against infectious disease in a large animal model.\n-  Conducted IND-enabling non-clinical studies of DNA-monoclonal antibody (mAb) candidate.\n-  Delivered high-sensitivity assay methods for protein and nucleic acid biomarkers for incorporation into deployable devices.\n-  Delivered advanced materials for incorporation into disposable assay formats.\n-  Delivered advanced methods for reagent stabilization and delivery for incorporation into deployable devices.\n-  Delivered sample preparation methods for incorporation into deployable devices.\n-  Demonstrated optimized performance of developed bacterial\/viral detection methods, assays, and materials using advanced no\/low power microfluidic methods."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.066"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate production of gene encoded antibodies in human safety trials.\n-  Demonstrate efficacy of gene encoded antibodies in a human clinical trial.\n-  Demonstrate the ability to identify antibodies against infectious diseases from patients in less than thirty days.\n-  Use current good manufacturing processes to synthesize formulations for animal challenge study."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Harnessing Biological Systems"
                                    },
                                    "Description": {
                                        "val": "The Harnessing Biological Systems program will explore fundamental approaches to applying the advantages of nature's building blocks and principles in the design of biological technologies and systems.  Rather than creating biomimetic designs that imitate naturally evolved capabilities this program seeks to transition to a biocentric design approach, developing tools and understanding mechanisms to leverage evolutionary advances from the start.  Key advances expected from this research include identifying approaches to discover and develop new classes of dynamic therapeutics for antibiotic-resistant bacteria.  One example will be to identify the underlying mechanisms by which predatory bacteria prey upon and consume other antibiotic-resistant bacteria that are pathogenic to humans.  This approach represents a significant departure from conventional antibacterial therapies that rely on small molecule antibiotics.  Advances in this area may be applied to a range of biological technologies including the autonomous control of epidemics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.295"
                                            },
                                            "Text": {
                                                "val": "-  Initiated studies to enhance understanding of biological adaptability in response to external pressures. \n-  Investigated predatory bacteria effectiveness against pathogens of interest. \n-  Initiated studies of the relevant underlying mechanisms of bacterial predation. \n-  Investigated dynamics of amoeba interactions with bacterial and fungal pathogens as a potential method for improved public health."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.100"
                                            },
                                            "Text": {
                                                "val": "-  Investigate predatory bacteria effectiveness against pathogens of interest in in vivo models. \n-  Investigate mechanisms of predation and potential resistance. \n-  Develop quantitative models to describe predator-pathogen-host interactions. \n-  Analyze biosynthetic pathways of the gut microbiota to discover and characterize disease tolerance-mediating metabolites."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}