{
    "id": "2018-Army-PB-2040-JBOOK-6496f983e90d3a98760d6d2aa09bce01c6733fe7e60bc4ee6b3adbaad3baa8ce-21",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603734A"
        },
        "ProgramElementTitle": {
            "val": "Military Engineering Advanced Technology"
        },
        "R1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "26.247"
            },
            "CurrentYear": {
                "val": "20.684"
            },
            "BudgetYearOne": {
                "val": "32.448"
            },
            "BudgetYearOneBase": {
                "val": "32.448"
            },
            "BudgetYearTwo": {
                "val": "25.864"
            },
            "BudgetYearThree": {
                "val": "26.236"
            },
            "BudgetYearFour": {
                "val": "26.701"
            },
            "BudgetYearFive": {
                "val": "27.186"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) demonstrates data and information architectures and software applications, as well as sensing systems, that can be used to provide Warfighters with timely, accurate, easily interpretable data and information for the operational and tactical mission environments, focusing on physical and human terrain and weather; methodologies, software applications and hardware for improving ground vehicle mobility and countermobility to support ground force operations, including force projection; subsystems and systems to increase the survivability of personnel, critical assets, and facilities through structures, shields, and barriers to combat highly adaptive and increasingly severe threats; and systems and interoperable systems of systems for detecting threats, assessing situations, defending against threats, and communicating information and warnings for force protection.   \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology). \n\nWork in this PE is led, managed or performed by the Army Engineer Research and Development Center, Vicksburg, MS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "26.845"
                },
                "CurrentYear": {
                    "val": "20.684"
                },
                "BudgetYearOne": {
                    "val": "22.416"
                },
                "BudgetYearOneBase": {
                    "val": "22.416"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "26.247"
                },
                "CurrentYear": {
                    "val": "20.684"
                },
                "BudgetYearOne": {
                    "val": "32.448"
                },
                "BudgetYearOneBase": {
                    "val": "32.448"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.598"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "10.032"
                },
                "BudgetYearOneBase": {
                    "val": "10.032"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.598"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "3.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "6.996"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.996"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.036"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.036"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year 2018 funds increase for Extend Map-Based Planning Services to include Joint mission planning capabilities. Human Geography demonstrations to extend the means to characterize Warfighter-relevant social, cultural, and economic geography indicators to the tactical edge."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "T08"
                    },
                    "ProjectTitle": {
                        "val": "Combat Eng Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.547"
                        },
                        "CurrentYear": {
                            "val": "20.684"
                        },
                        "BudgetYearOne": {
                            "val": "32.448"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.448"
                        },
                        "BudgetYearTwo": {
                            "val": "25.864"
                        },
                        "BudgetYearThree": {
                            "val": "26.236"
                        },
                        "BudgetYearFour": {
                            "val": "26.701"
                        },
                        "BudgetYearFive": {
                            "val": "27.186"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates software and architectures for geospatial mapping applications and decision aids for the Warfighter. Project components, systems, system of systems, and decision aids enable ground vehicle mobility (freedom of movement), including force projection, and counter-mobility to impede movement of threat forces. Additional components, systems, system of systems for survivability support protection of personnel, facilities, and assets through design and reinforcement of structures, and for force protection to detect, assess, and defend against threats for troops deployed at smaller bases and in complex and urban environments, which may include subterranean challenges. Work is in support of current and future ground force operations. Software and architectures for geospatial projects mature and validate geospatial decision tools in support of operations planning and decision making to advance utility of geospatial capability and techniques across the Army, services, and coalition, and to advance and mature the information architecture that supports the total Army's discovery and access to data, geospatial information, and analytical tool suites. Methods to characterize and visualize behavior and population dynamics mature and validate efforts to portray the operational environment including culture, demographics, terrain, climate, and infrastructure, into geospatial frameworks. \n\nForce protection activities are focused on filling critical gaps in protecting forces operating at smaller, remote bases, or in urban environments, and include maturation, integration, and demonstration of components, systems, and systems of systems for rapidly deployable threat detection in direct line-of-site and non-line-of-site environments; situation assessment to help reduce false alarms and decrease manpower required to monitor the environment; and passive protection to mitigate blasts, direct, and indirect fire effects using rapidly deployable protection systems and retrofits to existing structures. Force protection activities are also focused on protection of critical assets and infrastructure required to project forces into denied access areas. Work in survivability and force protection also includes maturing and demonstrating software to characterize blast effects generated from explosive events, such as improvised explosive device detonation in soils, and supports design and decision aids. Work in mobility and force projection includes maturing and demonstrating software and hardware to assess and improve freedom of movement for ground forces, including autonomous ground resupply. Engineered Resilient Systems (ERS) activities focus on developing capabilities for \"upfront engineering\" that will result in more operationally efficient and resilient systems that are more affordable in a more rapid fashion. This effort develops and demonstrates an end-to-end thread involving analysis to inform requirements, reduce risk, and assess lifecycle cost pre-milestone A through tradespace analytics for selected systems of interest. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. This work is being fully coordinated and is complementary to the ERS work described in the Office of the Secretary of Defense (OSD) Program Element (PE) 0603832\/Project D8Z.\n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology). Geospatial activities are coordinated with the National Geospatial Intelligence Agency (NGA). Autonomous ground resupply activities are coordinated with PEs 0603005A\/Project 515 and PE 0602601A\/Project H77 and 0602601A\/H91 in collaboration with the Tank and Automotive Research, Development and Engineering Center (TARDEC), PE 0603001A\/Project 543, PE 0603639A\/Project EC3, and PE 0605805A\/Project 297 with the Armament Research Development and Engineering Center (ARDEC).\n\nWork in this Project is led, managed or performed by the Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geo-Enabled Mission Command Enterprise"
                                    },
                                    "Description": {
                                        "val": "This effort matures methods and demonstrates data, information, and software tools and architectures to bring physical and human terrain and effects data into decision frameworks for consistent and accurate implementation in the Army Geospatial Enterprise (AGE). This provides ready-access of low-overhead, light-weight, analytic tools to other Services and the Department of Defense (DoD) and increases situational awareness of the operational environment in support of mission planning and operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.407"
                                            },
                                            "Text": {
                                                "val": "Enhanced digital plans and orders capability to drive course of action (COA) simulation and modeling; evaluated initial plan development and COA development capabilities within Map-based planning testbed environment; and evaluated and demonstrated mature geospatial research on the representative computing environment systems within the common operating environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Map-Based Planning Services (MBPS)"
                                    },
                                    "Description": {
                                        "val": "This effort matures geospatially enabled, collaborative mission planning capabilities providing services, data, and information to Army planners, staffs, and leaders. These mission planning capabilities will allow collecting, processing, storing, displaying, and sharing of authoritative data and information in a geo-temporal context. Work will leverage a Standard Shareable Geospatial Foundation provided by the AGE and incorporate Geo-Enabled Mission Command tools and analytical capabilities. This effort continues work that was part of Geo-Enabled Mission Command Enterprise and matures work in PE 0602784A\/Project 855."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.807"
                                            },
                                            "Text": {
                                                "val": "Will conduct MBPS demonstrations of geospatially enabled, collaborative mission planning capabilities (strategic and operational force deployment and employment) within the AGE Node, a node with streamlined geospatial standards that provides services, data, information, and other outputs to Army organizations and activities (e.g. Army Geospatial Center, Army Mission Command Centers of Excellence, programs of record, and others)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.637"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.637"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a globally accessible, collaborative, map-based web environment which enables simultaneous viewing, editing, and sharing of information within and between military planners enabling a digitally supported military decision making process including supporting analytics and services; mature and demonstrate capability to collect, process, store, display, and share authoritative data from Joint sources in a map-based environment; mature and demonstrate Joint mission planning capabilities that will allow concurrent and collaborative planning by operational, logistics, and intelligences staffs to crate, compile, and consolidate Operational Plans."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GeoIntelligence - Enabling Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort provides demonstration of analytic tools and algorithms that use multi-source (e.g. optical, Light detection and ranging (LiDAR)), multiplatform (e.g. satellite, light Unmanned Aerial Vehicle (UAV)), multi-temporal image sources to build urban tactical decision aids suitable for use on mobile devices to provide geospatial analysis to the Army, other Services, and DoD, in support of mission planning and operations (such as small units in an urban setting). This effort continues work that was part of Geo-Enabled Mission Command Enterprise."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate tailored geospatial tools used to develop analytical products and capabilities that enhance Warfighter movement and situational awareness at the tactical level, to include rapid processing and searching of high volume multi-modal spatiotemporal datasets, a class of datasets critical for the development of analytic tools associated with geospatial intelligence, climate change, natural hazards, and critical infrastructures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.002"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate an environmental scenario generator to provide weather and terrain effects to mobility and sensor performance models when exercising analysis of multiple courses of action within the military decision making process; develop and enhance tactical decision aid execution operating on three dimensional terrain datasets within a browser-based visualization environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Geography Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the integration of behavior and population dynamics research and analysis into geospatial frameworks to depict aspects of the operational environment including culture, demographics, terrain, climate, and infrastructure. Efforts include exploitation of existing open source text, leveraging multi-media and cartographic materials, and data collection methods from the tactical edge to characterize parameters of social, cultural, and economic geography of special interest to the Warfighter."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.001"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.001"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate high-resolution population modeling, including adaptation of urban growth models, supporting Army Component Command major consequence assessments, and generating analysis of populations affected by catastrophic events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver Support Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates improved means for achieving Force Projection in in austere and complex estuary and riverine environments and integrated sensing and simulation systems for predicting physical conditions in these operational environments. This effort matures work in PE 0602784A\/Project T40. This work also supports: PE 0603005A\/Project 515, PE 0602601A\/Project H77, and PE 0602601\/Project H91 in collaboration with the Tank and Automotive Research, Development and Engineering Center (TARDEC)); and PE 0603001A\/Project 543, PE 0603639A\/Project EC3, and PE 0605805A\/Project 297 in collaboration with the Armament Research Development and Engineering Center (ARDEC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.645"
                                            },
                                            "Text": {
                                                "val": "Validated technologies for planning and conducting Anti-Access\/Area Denial (A2\/AD) entry operations with non-existent, damaged, or destroyed infrastructure; demonstrated rapidly deployed low-logistics kits for expedient bomb damage repair of airfield runways and terrain surface enhancement for landing of helicopters and unmanned aircraft systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.319"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate operationally-optimized terrain surfacing kits for application at seaports of debarkation. Will demonstrate decision support tools that allow exploitation of multimodal (e.g. infrared, hyperspectral, radar, Light Detection and Ranging (LiDAR)) sensor data for remote\/standoff assessment of airfields and seaports. Will demonstrate optimized terrain surfacing kits for upgrade of air- and sea ports of debarkation (A\/SPOD) as well as rapid- and scalable repair kits for airfield craters. Will mature and demonstrate decision support tools for remote assessment of infrastructure. Will mature data processing and engineering assessment algorithms using data from existing aerial and marine surveillance systems to provide refined tactical-level assessments of potential A\/SPOD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.865"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.865"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate technologies for planning and conducting A2\/AD entry operations without airfields\/ports and with damaged\/destroyed airfields\/ports; optimize and provide persistent monitoring technologies and an integrated seismic-infrasound-acoustic-meteorological (SIAM) array for remote structural health monitoring to produce near-real-time awareness of critical infrastructure and connecting lines of communication; and mature and demonstrate simulation and decision support tools to ensure both manned and unmanned ground vehicle mobility in complex, urban, and constantly changing environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Protection Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort validates protection solutions for critical assets, including fixed and semi-fixed facilities. A focus will be on technologies to defeat new advanced weapons threats. Technologies include: low-logistics protective construction and facility protection, use of indigenous materials, innovative structural hardening and retrofit, and the synergistic use of camouflage, concealment, and deception to increase the effectiveness of protection to critical assets. This effort also demonstrates integrated technologies for force protection basing to include planning and expedient protective construction for combat outposts and rapidly deployable protective measures, and retrofit technologies for use in urban environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.495"
                                            },
                                            "Text": {
                                                "val": "Optimized force protection technologies to reduce manpower and logistics for combat outpost and personnel base construction and operation and demonstrated life cycle planning tools; and demonstrated advanced material composed of indigenous constituents and conduct structural hardening experiments for mitigation against a wide range of advanced weapon threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.808"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate improved standardized protective construction methods and preconfigured kits when compared to current systems. Will demonstrate developed overhead cover, revetments, and shelters for force protection basing. Will demonstrate improved methods for structural hardening with logistics and cost savings compared to current cast-in-place capability. Will demonstrate linear sensor systems for perimeter security against enemy threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.938"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.938"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate modeling & simulation tools to predict structural response\/damage to support regional tradespace analysis; provide an initial version of an urban building protection assessment tool and will mature rapidly deployable protective technologies for dismounted urban operations; demonstrate camouflage, concealment, and deception countermeasures that hinder target acquisition, thus interrupting the threat system kill-chain of advanced threat systems; optimize linear sensing systems (LSS) for perimeter security in complex geo-environments; and mature technologies to detect tunnels and subterranean activities for protection of forces and critical assets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineered Resilient Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates capabilities (tools and methodologies) to rapidly create high-fidelity environmental data to support the simulation of system performance for different Army missions in various geographic settings worldwide; provide input to and obtain output from combat simulations for different echelons pertaining to system performance; and conduct system trades that consider system performance in different operational environments and mission contexts. The Engineered Resilient Systems (ERS) initiative has been identified as a Science and Technology emphasis area by the Assistant Secretary of Defense for Research and Engineering, ASD(R&E). This effort focuses on Army systems of interest and on high-fidelity environmental data for the associated battlespace, on linkages to force-on-force combat simulations representing the systems of interest, and on tools to explore trades in order to help inform requirements, reduce risk, and assess lifecycle cost pre-milestone A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated environmental scenario generation \"tool-set one\" based on a select set of missions within a geographical area and Army systems of interest; identified and crafted initial operational scenarios and conduct functional decomposition to generate a subset of key missions for system(s) of interest in concert with Army collaborators and processes and use this to prioritize phased development; evolved and matured mission context and implementation tools and methodologies that link to combat simulations based on scenario(s) and mission(s) associated with selected Army system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a computational model builder with a simulation workflow manager to enable complex environmental simulations to assist with tradespace studies. Will demonstrate an initial tradespace analysis capability for sensors in a dense vegetation operational scenario.  Will demonstrate an initial tradespace analysis capability for Army systems of interest, ground vehicles or watercraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.005"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.005"
                                            },
                                            "Text": {
                                                "val": "Will provide a simulation workflow manager tool that facilitates the linkages between data sources and computational models during simulation; validate design and tradespace analysis implementation tools; and conduct tradespace analyses of candidate sensors to demonstrate environmental effects on sensor performance among other analyses in support of Warfighter systems development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T13"
                    },
                    "ProjectTitle": {
                        "val": "Stationary Power & Energy Tech Demonstrations (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.500"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional special interest projects to mature and demonstrate advanced military engineering and geospatial research and engineering technologies."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Natural Gas Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.500"
                                        },
                                        "Text": {
                                            "val": "Program Increase for Natural Gas Research."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T15"
                    },
                    "ProjectTitle": {
                        "val": "MILITARY ENGINEERING TECHNOLOGY DEMONSTRATION (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.200"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "These is a Congressional Interest Item for Military Engineering Technology Demonstrations."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.200"
                                        },
                                        "Text": {
                                            "val": "Program Increase."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}