{
    "id": "2018-Army-PB-2040-JBOOK-6496f983e90d3a98760d6d2aa09bce01c6733fe7e60bc4ee6b3adbaad3baa8ce-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603001A"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Advanced Technology"
        },
        "R1LineNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "54.606"
            },
            "CurrentYear": {
                "val": "38.831"
            },
            "BudgetYearOne": {
                "val": "44.863"
            },
            "BudgetYearOneBase": {
                "val": "44.863"
            },
            "BudgetYearTwo": {
                "val": "34.213"
            },
            "BudgetYearThree": {
                "val": "35.738"
            },
            "BudgetYearFour": {
                "val": "37.377"
            },
            "BudgetYearFive": {
                "val": "38.932"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides Soldiers and Small Combat Units with the most effective personal clothing, equipment, combat rations, shelters, and logistical support items with the least weight and sustainment burden. This PE supports the maturation and demonstration of technologies associated with aerial delivery of personnel and cargo (Project 242), rapid ammunition\/munitions deployability and resupply (Project 543), combat rations and combat feeding equipment (Project C07), combat clothing and personal equipment (including protective equipment such as personal armor, helmets, and eyewear) (Project J50\/Project FF6), and expeditionary base camps (Project VT5). The Projects in this PE adhere to Tri-Service Agreements on clothing, textiles, and food with coordination provided through the Cross-Service Warfighter Equipment Board, the Soldier as a System Integrated Concepts Development Team, and the Department of Defense (DoD) Combat Feeding Research and Engineering Board.\n\nBeginning in Fiscal Year (FY) 18, Project FF6 will be included under PE 0603001A. \n\nEfforts in this PE support the Army Science and Technology Soldier\/Squad, Lethality, and Ground Maneuver Portfolios.\n\nWork in this PE is related to, and fully coordinated with, PE 0602786A (Warfighter Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602787A (Medical Technology), PE 0602716A (Human Factors Engineering Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0603015A (Next Generation Training and Simulation Systems), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), PE 0603710A (Night Vision Advanced Technology), PE 0602784A (Military Engineering Technology), and PE 0603734A (Military Engineering Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n \nWork is led, performed, and\/or managed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA and the Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny, NJ."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "55.973"
                },
                "CurrentYear": {
                    "val": "38.831"
                },
                "BudgetYearOne": {
                    "val": "40.937"
                },
                "BudgetYearOneBase": {
                    "val": "40.937"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "54.606"
                },
                "CurrentYear": {
                    "val": "38.831"
                },
                "BudgetYearOne": {
                    "val": "44.863"
                },
                "BudgetYearOneBase": {
                    "val": "44.863"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.367"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.926"
                },
                "BudgetYearOneBase": {
                    "val": "3.926"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.367"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "3.926"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.926"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "242"
                    },
                    "ProjectTitle": {
                        "val": "Airdrop Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.617"
                        },
                        "CurrentYear": {
                            "val": "3.618"
                        },
                        "BudgetYearOne": {
                            "val": "5.681"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.681"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates equipment and innovative techniques for precision aerial delivery of cargo and personnel. Aerial delivery is a key capability for rapid force projection and global precision delivery. These efforts are designed to advance state of the art precision delivery technologies such as parachutes, guidance, navigation, and control (GNC) components and subsystems, tracking sensors, software algorithms, and safety rigging which integrate with currently equipped aircraft, unmanned aerial systems (UAS), and advanced rotary wing aircraft. These efforts provide the Warfighter with highly accurate, timely cargo\/payload delivery and resupply in all terrain and weather conditions. Precision delivery\/resupply reduces vulnerability of ground Soldiers, aircraft, and aircrew. Precision aerial delivery supports remote warfare with activities such as placement of battlefield sensors, reduction of Soldier load, and initial delivery of key expeditionary base camp assets. Demonstrated technologies transition to Product Manager (PM) Force Sustainment Systems (PM FSS), PM-Soldier Clothing and Individual Equipment (PM SCIE) as well as other Army PMs.\n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad Portfolio.\n\nWork in this Project is fully coordinated with Program Element (PE) 0602786A (Warfighter Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n \nWork in this Project is performed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airdrop\/Aerial Delivery"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates parachute materials and designs, precision guidance and navigation software and hardware, and tracking sensors and safety devices to increase the accuracy of delivering cargo to remote locations and\/or complex terrains. This effort also provides technologies that increase safety during personnel insertions into theaters of operation. This work further evolves breakthroughs from PE 0602786A\/Project 283 and is coordinated with PE 0602786A\/Project VT4. This effort supports capability demonstrations for the Army Top Challenge of easing overburdened Soldiers in small units through the use of tactical aerial resupply technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.617"
                                            },
                                            "Text": {
                                                "val": "Demonstrated precision airdrop functionality and reliability while intentionally interjecting faults into the system in order to gather statistical data in an operationally relevant environment; focused on accuracy and survivability improvements: guidance, navigation, and control improvements in heavy\/variable winds cost reductions, and minimization of retrograde weight\/volume; demonstrated and transitioned the high altitude low opening parachute capability for 100-500 lb. payloads utilizing main parachutes currently in the Army inventory; demonstrated auto hook up and improvement in payload stability for helicopter sling loads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.618"
                                            },
                                            "Text": {
                                                "val": "Conduct multiple airdrop demonstrations of prototype adaptive flight software and hardware component technologies for precision aerial delivery systems that overcome rigging errors and broken control lines. These demonstrations will also validate parachute actuator placement, optimized parachute designs, parachute sensor capabilities, and airdrop system stealth capabilities in order to reduce the cost, weight, and logistics burden of utilizing aerial delivery systems; mature and demonstrate passive helicopter sling load stability concepts with operational payloads; demonstrate initial static line reserve parachute automatic activation device prototype on T-11R parachute with mannequins to validate utility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.681"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.681"
                                            },
                                            "Text": {
                                                "val": "Will optimize autonomously guided system technologies to reduce system cost and to support accurate and survivable landings in urban and jungle environments. Technologies will include soft-landing systems for Joint Precision Airdrop System (JPADS) and high fidelity instrumentation for characterization of payload impact; mature advanced parachute control vent positioning to expand flight envelope of airdrop systems; demonstrate improvements to the static line reserve parachute automatic activation device prototype on T-11R parachute with mannequins to determine its ability to detect and identify various malfunctions and towed jumper scenarios."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "543"
                    },
                    "ProjectTitle": {
                        "val": "Ammunition Logistics"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.630"
                        },
                        "CurrentYear": {
                            "val": "2.284"
                        },
                        "BudgetYearOne": {
                            "val": "2.326"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.326"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for rapidly deploying and resupplying munitions while also improving the return of unused ammunition from deployment. This effort contributes to force readiness and reduction in the logistics footprint through improvements in Materials Handling Equipment (MHE), ammunition, and lethality packaging\/palletization, explosives safety, weapons re-arm, and asset throughput\/management.\n\nEfforts in this Project support the Army Science and Technology Lethality and Ground Maneuver Portfolios. Work in this Project is related to, and fully coordinated with Program Element (PE) 0603005A and PE 0602601A. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n\nWork in this Project is performed and managed by the Army Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ in collaboration with the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automated Material Handling Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates smart sensors and robotic load handling equipment as add-on kits for side loading forklifts used in ammunition storage igloos and tactical forklifts to provide quick, safe, and cost effective transfer of munitions pallets between storage areas and transportation assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.982"
                                            },
                                            "Text": {
                                                "val": "Completed development of the robotic add-on kit for rough terrain 5,000 lb forklift and conducted the final demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Safety for Automated Base Camp Planning"
                                    },
                                    "Description": {
                                        "val": "This effort integrates explosives safety site planning software with the automated base camp planning tool to reduce the time to plan base camps and improve Soldier safety."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.384"
                                            },
                                            "Text": {
                                                "val": "Completed validation testing of ammunition planning\/management software module with ammunition management system; conducted integrated demonstration with the Virtual Forward Operating Base (VFOB) planning tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Total Ammunition Logistics Knowledge (TALK)"
                                    },
                                    "Description": {
                                        "val": "This effort will develop state of the art embedded micro sensors and Automated Identification Technologies that provide the capability for ammunition to communicate key characteristics, or information about itself to various interrogators throughout the logistics life-cycle from the ammunition load plant to the weapon in the field to improve ammunition management, reliability, and performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.264"
                                            },
                                            "Text": {
                                                "val": "Conducted preliminary design of environmental monitoring and data delivery mechanisms for artillery ammunition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automated Supply Point-Scalable"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates globally responsive supply point operations capable of meeting predictive demand through automated cargo identification, handling, and movement technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.284"
                                            },
                                            "Text": {
                                                "val": "Develop software architecture for the command, control, and integration of Automated Supply Point – Scalable operational functions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.326"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.326"
                                            },
                                            "Text": {
                                                "val": "Will complete development of Automated Supply Point-Scalable software prototype technology demonstrator to support basic automation of ammunition supply point (ASP) warehouse management operations at the pallet and sub-pallet levels, with a focus on demonstrating the basic concept of automated control of operations, manned and unmanned teaming, situational monitoring, interfacing and control of robotic movement resource devices, and supply configuration tracking; demonstrate ammunition resupply technologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C07"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Combat Feeding Tech Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.153"
                        },
                        "CurrentYear": {
                            "val": "2.134"
                        },
                        "BudgetYearOne": {
                            "val": "2.177"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.177"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for military combat feeding systems and combat rations. Areas of emphasis include: enhanced nutrient composition to maximize cognitive and physical performance on the battlefield; cutting edge food stabilization and preservation techniques that increase the variety and quality of rations used by the Joint Services; novel ration packaging solutions to minimize degradation of combat rations during storage; field portable biosensors for food-borne pathogen detection and identification as well as predictive modeling tools to protect the Warfighter from food-borne illnesses. This Project demonstrates combat feeding equipment with reduced logistics (in component parts, weight, volume, fuel, and water) and labor requirements, while improving the quality of food service. The Project, a Department of Defense (DoD) program for which the Army has Executive Agent responsibility, provides technology development for Joint Service Combat Feeding. The DoD Combat Feeding Research and Engineering Board provides oversight for this project. Demonstrated field feeding equipment is transitioned to Product Manager Force Sustainment Systems (PM FSS), Product Manager Combat Support Equipment (PM CSE), Naval Sea Systems Command (NAVSEA)\/Naval Supply Systems Command (NAVSUP), and\/or United States Air Force Basic Expeditionary Airfield Resources (BEAR) Program Office. Demonstrated ration technologies are transitioned to the Combat Feeding Directorate for Advanced Component Development & Prototypes under Program Element (PE) 0603747A (Soldier Support and Survivability).\n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad Portfolio.\n\nWork in this Project complements and is fully coordinated with PE 0602787A (Medical Technology) and PE 0602786A (Warfighter Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n \nWork in this Project is performed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Combat Feeding Technical Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates novel nutritional biochemistry, food processing, and packaging technologies to enhance nutrition, improve food stabilization, and optimize ration packaging to support Warfighter physical and cognitive performance on the battlefield. This effort will demonstrate technologies in support of the Defense Health Agency Veterinary Services (DHA VS) to improve field detection and identification capabilities of chemical and biological threats in foods. This effort provides new threat detection tools and sensors for food inspectors. This effort also demonstrates equipment and energy technologies to expand the capability and reduce the logistics footprint of field feeding systems. This work further evolves breakthroughs from PE 0602786A\/Project H99 and is coordinated with PE 0602787A\/Project 869."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.153"
                                            },
                                            "Text": {
                                                "val": "Exploited and demonstrated novel field feeding technologies to promote Joint field feeding operations and reduce field feeding costs\/logistical footprint through increased commonality across Services, in support of DoD operational energy goals; demonstrated novel food pathogen extraction methods and commercial-off-the-shelf (COTS) diagnostic technologies; developed and demonstrated technologies to stabilize amino acids to improve protein quality and functionality; demonstrated novel ration processing techniques for significant cost reductions while expanding nutrient retention within shelf stable components; demonstrated technology for next generation of ration components with increased nutrient density to decrease sustainment burden, improve performance and reduce Soldier load; demonstrated novel ration packaging material technologies (e.g., bio-based hybrid materials) to reduce ration packaging waste."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.134"
                                            },
                                            "Text": {
                                                "val": "Fabricate and demonstrate modular and tailorable field feeding prototypes that reduce water demand, reduce waste generation, and are self-powered or externally powered with alternative fuel\/energy to improve sustainment maneuverability and reduce the logistical footprint and cost; validate diagnostic tools and sanitizing methodologies to detect and eliminate pathogens within ration systems; mature and demonstrate nutrient based strategies to enhance Soldier cognitive and physical performance; demonstrate alternative packaging and processing technologies to preserve nutrient retention and reduce costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.177"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.177"
                                            },
                                            "Text": {
                                                "val": "Will mature technologies that enable the use of carbon dioxide as a refrigerant in cold storage units to reduce cost, improve efficiency, and eliminate reliance on hydrofluorocarbons; demonstrate high efficiency foodservice systems that reduce generation of greywater and water demand; demonstrate technology to condition battlefield fuels for use in commercial gas-fired appliances to simplify acquisition and improve supportability; validate food safety tools to mitigate exposure to foodborne pathogens and food contaminants; demonstrate ration components with increased phytochemical content to optimize warfighter performance; mature novel food processing technologies to increase consumption of fruits and vegetables in tactical environments; demonstrate calorically dense ration components with reduced weight and cube; validate retention of required barrier properties in novel packaging prototypes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FF6"
                    },
                    "ProjectTitle": {
                        "val": "Individual Protection"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.352"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.352"
                        },
                        "BudgetYearTwo": {
                            "val": "11.364"
                        },
                        "BudgetYearThree": {
                            "val": "10.986"
                        },
                        "BudgetYearFour": {
                            "val": "10.277"
                        },
                        "BudgetYearFive": {
                            "val": "10.347"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures, integrates, and demonstrates Soldier protective clothing and individual equipment focused on enhancing Soldier survivability from combat threats (flame and thermal, blast and ballistic, multispectral sensors, and laser threats), environmental threats (e.g., cold, heat, wet, vector, antimicrobial, etc.), and power management solutions. This effort includes the demonstration and validation of technologies, novel subsystems\/systems, and test methods related to personnel armor, helmets, hearing protection, eyewear, uniforms, handwear, footwear, and other clothing and individual equipment items. \n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad Portfolio.\n\nWork in this project complements and is fully coordinated with Program Elements (PEs) 0602786A (Warfighter Technology), PE 0602716A (Human Factors Engineering Technology), and PE 0602705A (Electronics and Electronic Devices).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n \nWork in this Project is performed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier\/Small Unit Multi-Threat Protection"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturing and demonstrating multifunctional protective component materials, sub-systems, protection technologies, and test methodologies that have the potential to significantly increase protection afforded by Soldier clothing and individual protective equipment. This effort also focuses on the maturation and demonstration of ballistic, blast, and integrated protection technologies that support tradeoff optimization in component design. Work includes small arms and fragmentation protection, flame and thermal, environmental, and multispectral concealment capabilities as well as novel hydration and water purification technologies for the individual Soldier. This work is fully coordinated with PE 0602786A\/Project H98, PE 0602716A\/Project H70, and PE 0602705A\/Project H94. Demonstrated technologies transition to various Program Executive Office (PEO) Soldier Product Managers. This effort supports Force Protection capability demonstrations for Soldiers and Small Units."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.352"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.352"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate an optimized material solution and uniform architecture to address jungle environmental extremes; mature new material systems specifically designed for cold\/extreme cold environments and integrate these systems into a newly optimized cold\/extreme cold ensemble; demonstrate anthropometrically correct flame resistant hand and head test equipment and methodology; mature and demonstrate repellent capabilities to enhance insect vector protection; optimize models that support virtual camouflage testing based on realistic terrain backgrounds; demonstrate new helmet test methodology with improved behind helmet blunt trauma measurement; demonstrate the ballistic performance from the latest developments in high performance ballistic materials integrated into a suite of common helmet designs; optimize comprehensive hearing protection test methodology by collecting operational sound profiles for integration with test equipment and methods; optimize predictive tools that allow for the advancement of material system baselines for regionally specific uniform configurations with an emphasis on cold weather protection."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J50"
                    },
                    "ProjectTitle": {
                        "val": "Future Warrior Technology Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.711"
                        },
                        "CurrentYear": {
                            "val": "26.550"
                        },
                        "BudgetYearOne": {
                            "val": "24.894"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.894"
                        },
                        "BudgetYearTwo": {
                            "val": "16.813"
                        },
                        "BudgetYearThree": {
                            "val": "16.148"
                        },
                        "BudgetYearFour": {
                            "val": "18.867"
                        },
                        "BudgetYearFive": {
                            "val": "19.731"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures, demonstrates, and integrates lightweight and multifunctional materials and components to provide the Soldier and small units with the most effective personal protection, electronics connectivity, and mission specific equipment while evaluating the potential to reduce physical weight, cognitive burden, and sustainment needs within the required protection and functional capabilities for the small unit. This Project develops, matures, and maintains a Soldier Systems Engineering Architecture (SSEA) framework that corresponds with other major Army platforms. Efforts in this project focus on maturing, integrating, and demonstrating personal protection (such as armor, headgear, eyewear, and hearing protection), durable Soldier protective clothing and individual equipment focused on enhancing Soldier survivability from combat threats (flame and thermal, blast and ballistic, multispectral sensors, and laser threats) and environmental threats (e.g., cold, heat, wet, vector, antimicrobial, etc.) for all weather conditions, and power management solutions. This effort includes the demonstration and validation of technologies, novel subsystems\/systems, and test methods related to personnel armor, helmets, hearing protection, eyewear, uniforms, handwear, footwear, and other clothing and individual equipment items. In addition, special focus is on understanding and demonstrating the impacts of physical and cognitive load on Soldier mission performance and quality of life by implementing strategies to reduce load and\/or optimize loads to reduce injuries. These efforts integrate geographically dispersed laboratory environments to conduct comprehensive assessments and report the technical viability of Soldier system solutions and conducts field demonstrations to obtain relevant feedback for user acceptance and performance validation. This Project also matures and demonstrates mission command and power and energy technologies for the dismounted Soldier and small unit operating in a networked operating environment.\n\nIn Fiscal Year (FY) 18, efforts entitled Soldier\/Small Unit Ballistic and Blast Protection and Soldier\/Small Unit Multi-Threat Protection will be moved from Project J50 to Project FF6.\n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad Portfolio.\n\nWork in this Project complements and is fully coordinated with Program Element (PE) 0602786A (Warfighter Technology), PE 0602618A (Ballistics Technology), PE 0602105A (Materials Technology), PE 0602787A (Medical Technology), PE 0602716A (Human Factors Engineering Technology), PE 0602308A (Advanced Concepts and Simulation), PE 0603015A (Next Generation Training and Simulation Systems), PE 0602705A (Electronics and Electronic Devices), PE 0603710A (Night Vision Advanced Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), and PE 0603008A (Command, Control, Communications Adv Technology).\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier\/Small Unit Ballistic and Blast Protection"
                                    },
                                    "Description": {
                                        "val": "This effort utilizes a cross-disciplinary, human-focused approach to mature and demonstrate technologies that optimize tradeoffs in ballistic and blast protective component design. This effort focuses on maturing and demonstrating proven components that have the potential to significantly increase protection for individual Soldiers and\/or reduce physical load at equal or better capability. This work is fully coordinated with PE 0602786A\/Project H98, PE 0602716A\/Project H70, and PE 0602705A\/Project H94. Demonstrated technologies will transition to various Program Executive Office (PEO) Soldier Product Managers. This effort supports Force Protection capability demonstrations for Soldiers and Small Units. This effort will end in FY18. Future work will be included in Soldier\/Small Unit Multi-Threat Protection under Project FF6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.554"
                                            },
                                            "Text": {
                                                "val": "Optimized non-destructive inspection technologies for evaluation of effects of environmental aging and mechanical damage on helmet and armor system performance; integrated ballistic and blast protection capabilities into extremity protection equipment; exploited organ allometry data set to improve biofidelity of casualty reduction models and account for individual Soldier variability in design of optimized vital torso coverage area; verified and validated improved casualty reduction model with the ability to fully pose digitally scanned Soldier and equipment models in operationally relevant scenarios; demonstrated prototype of self-powering single lens protective eyewear system with sun, ballistic, and laser protective capabilities; demonstrated integration of active auditory protection with ballistic protection eyewear."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.202"
                                            },
                                            "Text": {
                                                "val": "Complete demonstration of the improved single lens multi-threat protective eyewear system prototype; mature and optimize improved low velocity impact protection components for helmets; mature test device and methodology to validate anti-fogging properties of combat eyewear; optimize radiation detection methodologies for evaluating emerging active hearing protection products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier\/Small Unit Multi-Threat Protection"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturing and demonstrating multifunctional protective component materials, sub-systems, protection technologies, and test methodologies that have the potential to significantly increase protection of individual Soldiers. This includes the maturation and demonstration of improved flame, thermal, environmental, and multispectral concealment capabilities as well as novel desalinization and purification technologies for individual Soldier hydration. This work is fully coordinated with PE 0602786A\/Project H98, PE 0602716A\/Project H70, and PE 0602705A\/Project H94. Demonstrated technologies transition to various PEO Soldier Product Managers. This effort supports Force Protection capability demonstrations for Soldiers and Small Units. This effort will be moved from Project J50 to Project FF6 in FY18."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.208"
                                            },
                                            "Text": {
                                                "val": "Exploited the multi-threat protective technologies for clothing and individual equipment for various environmental conditions (e.g. tropical, arctic\/cold weather) to identify technology gaps and inform future requirements; demonstrated prototype uniforms with thermal signature management technologies in a wide range of environmental conditions; completed trade analysis of relative effects of pattern size and color on visual signature management; demonstrated improved flame resistant fabric with enhanced durability and reduced cost."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.836"
                                            },
                                            "Text": {
                                                "val": "Mature multi-threat protective technologies for clothing and individual equipment in environmental extremes such as tropical and arctic; complete demonstration and validate performance of prototype uniforms with thermal signature management capabilities; fabricate and demonstrate improved multifunctional flame resistant fabrics with signature management capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Systems Engineering Architecture (SSEA)"
                                    },
                                    "Description": {
                                        "val": "This effort pursues a mature and maintainable architecture for a biological (human) platform that utilizes a common Soldier, Equipment, Task (SET) framework at the system level. The architecture will provide a unifying performance construct that considers human dimension and equipment capability resulting in a desired tactical outcome by applying systems engineering processes, analytical tools, and models to assess the complex Soldier as a System and conduct system level trade-offs. This capability is used to assess new and emerging Soldier clothing and equipment components as well as configurations against established baselines using Human-in-the-Loop principles. This effort also matures and integrates associated foundational efforts including human performance assessment measures and evaluation devices required at various testing locations. This effort develops standardized methodologies required for demonstrations to provide operationally relevant assessments. This effort is coordinated with PE 0602716A\/Project H70, PE 0602786A\/Project H98, 0603015A\/Project S28, PE 0603710A\/Project K70, PE 0602308A\/Project C90, PE 0602787A\/Project 869, and PE 0603004A\/Project 232."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.105"
                                            },
                                            "Text": {
                                                "val": "Continued to build the systems engineering framework by collecting, analyzing, and cataloging equipment technical data, current training and human performance measures and metrics, dismounted modeling capabilities, test methods and measures, and the technical attributes of current human systems and subsystems interfaces to determine compatibility gaps among all capability areas for integration into the SET framework; matured the framework to create design criteria to experiment, demonstrate, verify, and validate technical maturity and military utility of future technologies; integrated logical structure and shared repository for the Soldier community; demonstrated SSEA capabilities with pilot case studies by conducting analysis of human physical, cognitive, and social characteristics to predict Soldier performance outcomes for human optimization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.795"
                                            },
                                            "Text": {
                                                "val": "Optimize, refine, and streamline the system engineering tools and processes which were developed to support the Soldier as a System capability; continue integration of tools and processes against specific pilot projects to demonstrate the benefits of SSEA against cognitive, physical, and social aspects of Soldier performance; exploit performance assessment methodologies to identify personal sensing suite; mature the population-level analysis design tool for creating a human model of a Soldier's size and shape based on statistical methods; mature the repeatable standard method for obtaining accurate 3 Dimensional (3D) models of equipped Warfighters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.285"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.285"
                                            },
                                            "Text": {
                                                "val": "Will conduct analyses of the use cases developed in FY 2017 to demonstrate the benefits of SSEA against specified objectives. Analyses will include: the efficacy and benefits of systems engineering processes, the utility of SSEA tools and processes for development of the Soldier as a System, and the benefits of utilizing SSEA during early capability development; improve SSEA tools and processes by simplifying user functions and automating operations; demonstrate the application of human performance assessment methods for powered and unpowered physical human augmentation technologies; identify and validate individual Soldier cognitive metrics sensitive to equipment load and fatigue in a simulated environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier and Small Unit Mission Command\/Situational Awareness (SA) and Power and Energy Integration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates mission command and power and energy technologies for the dismounted Soldier and small unit. The goal is to fully support the situational awareness mission information tools and power needs of a dismounted mission in an electronically equipped battlefield. This effort is fully coordinated with PE 0602705A\/Project H11, PE0602705A\/Project H94, and PE 0603710A\/Project K70."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.231"
                                            },
                                            "Text": {
                                                "val": "Began to integrate situational awareness and power capabilities to include information portrayal software, display technology, data collection and analyzing devices, and augmented reality display overlays that provide terrain and structures information in addition to entities appearing from local and remote reference sources, route planning altitude, and heat into mobility planning tools; assessed cognitive load associated with all mission information systems; improved the capability of Soldier integration lab live simulation by integrating cognitive measures into operational scenarios (e.g., cordon and search); integrated and demonstrated mission performance impacts using handheld information portrayal technologies for applications such as aerial resupply and factors related to Soldier readiness; matured and demonstrated kinetic power generating capabilities integrated into existing clothing and individual equipment from Soldiers' movement (e.g., knee movement) to reduce power requirements and resupply needs for Soldiers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.359"
                                            },
                                            "Text": {
                                                "val": "Demonstrate proof of principle concepts of near term technologies such as wireless power transfer and distribution, wireless personal area network, energy harvesting, portable power management, and integrated power and data situational awareness; validate power and energy investments through analyses that consider component technologies as well as viability of integration onto the Soldier system and within the operational framework; mature and demonstrate the integration mission information technologies for situational awareness such as augmented reality and information portrayal on head-borne devices; mature and demonstrate the complex human systems integration challenges of situational understanding from tactical handheld devices used by dismounted Soldiers; demonstrate efficiency and safe levels of power transfer for small unit power."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.936"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.936"
                                            },
                                            "Text": {
                                                "val": "Will mature distributed power management concepts and technologies for efficiently transferring power on the Soldier; mature advanced kinetic energy electrical components for improved efficiency of the backpack energy harvester; mature and demonstrate Soldier data management tools and assess the transfer of wired and wireless data between Soldier borne electronic devices; mature and demonstrate advanced Global Positioning System (GPS) denied navigation and environmental sensing algorithms for Soldier borne sensor platforms; integrate and assess Soldier carried unmanned ground and aerial vehicles and physiological status monitor sensors within the Nett Warrior system architecture to understand the human systems integration challenges of interfacing Soldiers with sensors and robotics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier and Small Unit Human Systems Performance"
                                    },
                                    "Description": {
                                        "val": "This effort matures and validates human performance metrics (e.g., physiological, psychophysical, biomechanical, etc.) which have the potential to reduce or mitigate negative impacts of Soldier physical carried load and improve operationally relevant human performance. This effort develops low-cognitive workload tactical information cuing guidelines and technologies and matures a testbed for assessing cognitive load and mission performance of Soldiers using situational awareness technologies. This work is fully coordinated with PE 0602786A\/Project H98, PE 0602716A\/Project H70, and PE 0602705A\/Project H94. Technologies, metrics, and tools developed in this effort will transition to PEO Product Managers and Training and Doctrine Command (TRADOC) and be integrated into the SSEA and Systems Integration Laboratory environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.613"
                                            },
                                            "Text": {
                                                "val": "Optimized biomechanics tools and metrics to quantify performance effects of Soldier and small unit load and protective clothing on Soldier effectiveness; correlated operational field relevance with laboratory research to mimic impacts of physical fatigue, load redistribution, personal augmentation, agility, and weight sensitivity on performance and injury; demonstrated algorithms on biomechanical and cognitive performance changes as a function of time, terrain, and load, which can be input to mission planning tools and other modeling efforts; established the impact of load carriage over variable grades to inform future requirements for load carriage; identified markers of fatigue that may predict declines in cognitive performance; optimized understanding of the effects of exoskeleton designs on gait and energy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.358"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate a dynamic visualization tool that utilizes existing measures of physical, cognitive, and social performance across a spectrum of operational missions; expand ability to predict human performance outcomes through the application of metrics transitioned from applied research; compare and demonstrate human systems integration tools and simulations against operational tasks and missions to correlate lab to field data to strengthen prediction of Soldier and squad performance; demonstrate ability to measure impacts of technologies such as information portrayal to optimize Soldier and squad performance (e.g. increased resilience and readiness) for increased overmatch."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.673"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.673"
                                            },
                                            "Text": {
                                                "val": "Will mature a virtual testbed that can be used to evaluate novel situational awareness technologies for their impact on cognitive workload as it relates to mission performance; develop basic and individualized tactile, audio, and visual cueing information portrayal software standards to enable streamlining of systems from Nett Warrior to novel future situational awareness technologies; exploit human systems integration tools to baseline physical characteristics and performance requirements of enhanced Soldier equipment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J52"
                    },
                    "ProjectTitle": {
                        "val": "WARFIGHTER ADVANCED TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Warfighter Advanced Technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.000"
                                        },
                                        "Text": {
                                            "val": "Program increase for warfighter advanced technology"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VT5"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Mobile Base Camp Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.495"
                        },
                        "CurrentYear": {
                            "val": "4.245"
                        },
                        "BudgetYearOne": {
                            "val": "3.433"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.433"
                        },
                        "BudgetYearTwo": {
                            "val": "2.056"
                        },
                        "BudgetYearThree": {
                            "val": "2.276"
                        },
                        "BudgetYearFour": {
                            "val": "1.796"
                        },
                        "BudgetYearFive": {
                            "val": "1.869"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates mission-specific plug and play components, subsystems, and modules designed to optimize manpower requirements, improve situational awareness, increase Soldier readiness and survivability, improve habitation, reduce logistics footprint, enhance supportability, and reduce cost. Expeditionary Base Camp (EBC) systems (or remote command outposts) provide an operational capability for Small Combat Units (battalion and below) and Soldiers, which are rapidly deployable\/re-locatable, require no Military Construction, and need limited materiel handing support. The need for this technologically enabled capability has arisen as a result of new tactics, techniques, and procedures used in austere, remote, and challenging environments in which stability operations, counterinsurgency operations, and peace keeping missions are conducted. The Army envisions continuing to conduct this full range of operations worldwide, particularly in the Asia Pacific and Middle East regions. This project integrates mature technologies to create mission specific lab demonstrators and assesses the performance capabilities using metrics and methodologies developed under Program Element (PE) 0602786A\/Project VT4. Demonstrated EBC equipment is transitioned to Product Manager (PM) Force Sustainment Systems (PM FSS).\n\nEfforts in this Project support the Army Science and Technology Soldier\/Squad Portfolio.\n\nWork in this Project complements and is fully coordinated with PE 0602786A (Warfighter Technology), PE 0602105A (Materials Technology), PE 0602784A (Military Engineering Technology), PE 0603734A (Military Engineering Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is led, performed, and\/or managed by the Army Natick Soldier Research, Development, and Engineering Center (NSRDEC), Natick, MA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Base Camp (EBC) Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies required to plan, establish, operate, protect, sustain, and redeploy a holistic small unit base camp system and manage its power, waste, and water resources. This effort supports Basing Sustainment and Logistics capability demonstrations. This work further evolves breakthroughs from PE 0602786A\/Project VT4, PE 0602786A\/Project H99 and is coordinated with PE0603001A\/Project C07, PE0602105A\/Project H84, PE 0602784A\/Project T40, PE 0603734A\/Project T08, PE 0603004A\/Project L97, PE 0603005A\/Project 497, PE 0603125A\/Project DF5, and PE 0603772A\/Project 101."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.495"
                                            },
                                            "Text": {
                                                "val": "Validated base camp technology component performance data using a model-based systems engineering approach with approved sustainability and logistics baseline; optimized technology integration to improve small contingency base camp operations and conduct integrated demonstrations; matured and demonstrated water demand reduction technologies to reduce logistical tail to base operations; demonstrated integrated components of the black waste treatment technologies; optimized a highly mobile shelter design to enable a leaner force and a highly expeditionary force; demonstrated cooling technologies for small basing applications that will decrease logistic demands and improve Soldier readiness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.245"
                                            },
                                            "Text": {
                                                "val": "Demonstrate improved flame resistance shelter systems to ensure safe living environments for Soldiers; provide a fully integrated base camp system demonstration that reduces fuel and water demands, resupplies, and waste backhaul; demonstrate rapidly deployable compact and lightweight shelter technologies that reduce shelter set-up time and manpower requirements, increase transportability, and improve shelter protection from ballistic threats; optimize manufacturing processes for novel shelter materials to improve material performance for cost savings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.433"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.433"
                                            },
                                            "Text": {
                                                "val": "Will optimize and assess base camp life support technologies that potentially impact Warfighter cognitive and physical performance; exploit composite material repairing methodologies for tactical shelters to reduce system replacement costs; exploit self-powered waste to energy technologies to include black waste treatment for small base camps for self-sustaining base camp concept; provide and mature the design of next generation shelter to improve shelter energy efficiency and durability; demonstrate flexible photovoltaic material technology as an alternative operational energy source for forward operating bases; mature self-cooling technologies for human remains transfer without increasing the weight of the current system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XW6"
                    },
                    "ProjectTitle": {
                        "val": "Small Unit Expeditionary Maneuver"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.980"
                        },
                        "BudgetYearThree": {
                            "val": "6.328"
                        },
                        "BudgetYearFour": {
                            "val": "6.437"
                        },
                        "BudgetYearFive": {
                            "val": "6.985"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Small Unit Expeditionary Maneuver project will focus on innovative technologies which provide maneuver capabilities such as aerial delivery and advances human performance sustainment capabilities which enable units to operate for hours, days and\/or weeks while still sustaining a high maneuver tempo for sustained periods."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}