{
    "id": "2018-DefenseLogisticsAgency-PB-0400-MJBOOK-0-3-098212f3abb250f23e5fa42591c94c4328a6a93ca6a251dc354a1358630db0b8-2",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603712S"
        },
        "ProgramElementTitle": {
            "val": "Generic Logistics R&D Technology Demonstrations (Log R&D)"
        },
        "R1LineNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "15.093"
            },
            "CurrentYear": {
                "val": "11.011"
            },
            "BudgetYearOne": {
                "val": "10.611"
            },
            "BudgetYearOneBase": {
                "val": "10.611"
            },
            "BudgetYearTwo": {
                "val": "10.881"
            },
            "BudgetYearThree": {
                "val": "11.182"
            },
            "BudgetYearFour": {
                "val": "11.475"
            },
            "BudgetYearFive": {
                "val": "11.716"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency is responsible for providing to the Military Services, and other Federal Agencies, and combined and allied forces the full spectrum of logistics, acquisition and technical services. DLA sources and provides nearly 100 percent of the consumable items the military forces need to operate – including food, fuel and energy, uniforms, medical supplies as well as construction and barrier equipment. DLA supplies more than 85 percent of the military’s spare parts, provides logistics information data and products, manages the reutilization of military equipment, and offers document automation and production services. DLAs Generic Logistics R&D Technology Demonstrations (Log R&D) program helps ensure that advanced logistics concepts and business processes are available to accomplish the agency’s mission with the leanest possible infrastructure, using the best commercial and government sources and applying the most effective business processes. The Logistics R&D program develops and demonstrates high risk, high payoff technology that provides a significantly higher level of support at lower costs. The program has a proven track record of implementation and benefits.  \n\nIn December 2013, the DLA Director called for greater flexibility within the R&D program in support of the agency’s mission. As a result, the R&D program evolved from single supply chain efforts to Strategic Focus Areas (SFAs). The SFAs support DLA’s efforts to make the improvements needed to maintain mission readiness rates in a constrained budget environment. \n\nThe three Strategic Focus Areas were renamed in FY 2021 to more clearly capture their focus and scope:  \n\n1. Enhancing Analysis, Modeling, and Decision Support (formerly Analytic and Decision Support): R&D efforts to develop decision support tools, such as modeling, simulation, and other analytics to improve operational strategy decision-making, forecasting, and procurement, which support more effective and efficient responses to emerging market and customer requirements.\n2. Improving Logistics Processes (formerly Logistics Processes): R&D efforts to develop and implement advanced technology in logistics processes over and above current baseline systems.\n3. Emergent Logistics R&D Requirements (formerly Innovative Products and Services for Customers): R&D Efforts to support emergent Logistics R&D requirements arising outside the budget cycle, a frequent occurrence.  The SFA begins new projects promptly without the disruption of ongoing projects by funds reallocation.  This SFA includes all DLA supply chains and logistics processes. \n\nNOTE: The single supply chain exhibits were removed as they are now included within the SFA exhibits."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.537"
                },
                "CurrentYear": {
                    "val": "11.011"
                },
                "BudgetYearOne": {
                    "val": "10.607"
                },
                "BudgetYearOneBase": {
                    "val": "10.607"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.093"
                },
                "CurrentYear": {
                    "val": "11.011"
                },
                "BudgetYearOne": {
                    "val": "10.611"
                },
                "BudgetYearOneBase": {
                    "val": "10.611"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.444"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.004"
                },
                "BudgetYearOneBase": {
                    "val": "0.004"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.444"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Pay Raise Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.004"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "During FY 2017 – FY 2021  funds were realigned from PE LOG R&D (0603712S) to the Industrial Preparedness – Manufacturing Technology Program (PE 0708011S). This realignment was needed to accommodate high priority requirements within DLA to improve the industrial base that supports critical weapon systems. In FY17, $4.646M was realigned from LOG R&D to MANTECH for these high priority requirements.\n\nA full-year FY 2017 appropriation for this account was not enacted at the time the budget was prepared; therefore, the budget assumes this account is operating under the Continuing Appropriations Resolution, 2017 (P.L. 114-254).  The amounts included for 2017 reflect the annualized level provided by the continuing resolution. BASE: FY17PB ($11.011M) + Request for Additional Appropriations ($0.000M)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "Enhancing Analysis, Modeling, and Decision Support (formerly Analytic & Decision Support)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.471"
                        },
                        "CurrentYear": {
                            "val": "2.371"
                        },
                        "BudgetYearOne": {
                            "val": "4.062"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.062"
                        },
                        "BudgetYearTwo": {
                            "val": "4.167"
                        },
                        "BudgetYearThree": {
                            "val": "4.262"
                        },
                        "BudgetYearFour": {
                            "val": "4.361"
                        },
                        "BudgetYearFive": {
                            "val": "4.454"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "R&D efforts to develop and implement advanced analytical tools, modeling, and simulation of logistics and supply chain processes. These tools will improve DLA forecasting and procurement strategy decisions and lead to faster and more flexible responsiveness to emerging market and customer requirements. Currently, there are three major analytical thrusts: Planning Processes, Medical Supply Chain, and Distribution\/Disposition. Planning processes model simulates item and customer demand patterns to improve customer support, lower inventories, acquisition costs, and acquisition lead-times for hardware (Class IX items). Medical Supply Chain Modeling will provide DLA the capability to integrate DLA logistics data and commercial data with satellite and political maps; it will automate for DLA Medical planners the ability to identify entities such as suppliers, customers and vendor distribution centers to enhance spatial awareness of incidents such as catastrophic events and military contingencies. The Strategic Distribution and Disposition (SDD) thrust will develop and implement analytical tools, models, and simulations of logistics and supply chain processes related to distribution and disposition.\n\nThe Medical Logistics Network will expand efforts in medical informatics, a growing area of health information systems that combines information science, computer science and health care to improve health systems to manage the healthcare supply chain more efficiently.  \n\nThe mission of the SDD program is to assist DLA Distribution and Disposition Services in anticipating, assessing, and meeting current and future Warfighter requirements by leveraging R&D to infuse innovative solutions. Current R&D thrusts include finalizing a simulation study for the Eastern Distribution Center (EDC), battery desulfation and lithium battery upgrade projects in support of DLA Distribution, and a Hazardous Waste (HW) disposal feasibility study in support of DLA Disposition Services"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enhancing Analysis, Modeling, and Decision Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.471"
                                            },
                                            "Text": {
                                                "val": "Weapon System Support (WSS) initiated efforts to develop a tool for early identification of problem parts and to develop more effective techniques to manage Production Lead Time (PLT).\n\nMedical Logistics Network (MLN) Supply Chain transitioned the Fair and Reasonable Evaluation (FRE) capability.\n\nStrategic Distribution and Disposition (SDD) conducted a state simulation of DLA’s East Coast Distribution Center (EDC). The current state simulation was compared to new potential redesigns of the EDC. The most promising new designs were simulated and compared to the current state for labor savings, reduction in fulfillment time\/cycle, and reduction of Material Handling Equipment (MHE).\n\nSDD completed the Warehouse Automation and Robotics Exploratory Project (WAREP) and provided a Gap Analysis and an initial ROM BCA. Subsequently, J6 assumed responsibility for the initiative."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.371"
                                            },
                                            "Text": {
                                                "val": "Planning Process will focus on initial capabilities of Supply chain risk management, examine the potential benefits of alternative ownership strategies for inventory and address ways to improve collaboration among DLA, its suppliers and its customers for more effective inventory management. Collaborative efforts will be continued with the Planning Process Owner and his team to develop new projects for FY 2017 awards.\n\nMedical Logistics Network (MLN) will transition the Clinical Standardization application to sustainment. A new project in Medical 3D Printing could be undertaken this year.\n\nSDD will complete the East Coast Distribution Center (EDC) study and continue supporting DLA Distribution with projects focused on lead-acid and new Lithium-Ion battery technology. Additionally, SDD will finalize an Exploratory Concept project and provide Courses of Action (COAs) on deployable Hazardous Waste (HW) disposal capabilities in support of DLA Disposition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.062"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.062"
                                            },
                                            "Text": {
                                                "val": "SDD will complete the lead-acid and Lithium-Ion battery technology projects in support DLA Distribution and initiate a Hazardous Waste (HW) disposal capabilities proof of concept.\n\nThe Medical Logistics Network will expand efforts in medical informatics, a growing area of health information systems that combines information science, computer science and health care to improve health systems to manage the healthcare supply chain more efficiently."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "Improving Logistics Processes (formerly Logistics Process)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.413"
                        },
                        "CurrentYear": {
                            "val": "5.236"
                        },
                        "BudgetYearOne": {
                            "val": "3.849"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.849"
                        },
                        "BudgetYearTwo": {
                            "val": "3.938"
                        },
                        "BudgetYearThree": {
                            "val": "4.052"
                        },
                        "BudgetYearFour": {
                            "val": "4.166"
                        },
                        "BudgetYearFive": {
                            "val": "4.253"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Logistics Processes are R&D efforts within the Weapon System Sustainment Program (WSS) undertaken to develop and implement advanced technology in the internal DLA logistics processes. To qualify for R&D funding, the R&D effort must develop and apply technology and processes over and above current baseline IT systems and continuous improvements efforts. \n\nThis strategic focus area has 2 thrusts: Technical\/Quality (T\/Q) Process Improvements and Selected Process Improvements\n\nT\/Q Process Improvements to reduce material and internal costs and improve support to warfighters.  Services have engineering responsibility for most Class IX parts. Many T\/Q sub-processes involve interactions with Service engineering functions, which often are time-consuming and costly.  Other key T\/Q sub-processes are essential to the procurement function, such as analysis of parts content, source capabilities and problem resolution.\n\nSelected Process Improvements cover processes outside the scope of the Technical\/Quality (T\/Q) function. Although all DLA processes are in scope, the focus for FY 2016 is on the Procurement process, especially aspects driving internal costs and delays in awards."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Logistics Processes (LP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.413"
                                            },
                                            "Text": {
                                                "val": "Selected WSS Process initiatives for FY 16 in the T\/Q area include Cost of Quality in Procurement, Technical Data Availability, processes for Service approval of substituting Additive Manufacturing for selected parts, and Vendor Network Linkage Analysis for improved visibility into potential bad actors. Initiatives in the Procurement area include Reducing Manual Reviews to cut cost and time, Proactive No-Bid Modeling to reduce time to award and improve support to warfighters, and eCommerce to cut internal and parts costs and reduce Production Lead Time.\n\nMedical Logistics Network (MLN) transitioned the Fair and Reasonable Evaluation (FRE) capability. \n \nStrategic Distribution and Disposition (SDD) completed a feasibility study of using self-service unmanned kiosk type collection points in support of DLA Disposition. Additionally, SDD finalized the DLA Distribution Automation\/Robotics exploratory efforts and transitioned them to the Distribution Modernization Program Office and J6."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.236"
                                            },
                                            "Text": {
                                                "val": "T\/Q efforts will include transition of the Cost of Quality in Procurement project. An Agile Logistics for Acquisition and Regulated Materials Project will be initiated. Additionally, new efforts will begin to improve the acquisition of 3D technical data during provisioning and to assess the potential impact of a standards-based approach to simplify approval of substitute alloys. Additional new projects will be awarded as a result of collaborative planning efforts during FY16. Collaborative efforts will be continued with the Procurement and T\/Q Process Owners and their teams to develop new projects for FY 2017 awards.\n\nMedical Processes will continue to execute projects that support ACCM. Additionally, a new project in Medical 3D Printing could be undertaken this year.\n\nStrategic Distribution and Disposition (SDD) will support the Distribution Modernization Program as necessary to identify, evaluate, and test disruptive technologies and continue with forklift battery projects in support of DLA Distribution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.849"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.849"
                                            },
                                            "Text": {
                                                "val": "WSS will begin an initiative to work with DLA’s Center of Planning Excellence (CoPE) for co-experimentation and innovation to improve planning processes. WSS efforts initiated in FY17 will be continued or completed, and transition activities initiated where appropriate.  Potential projects under development include Improving the Solicitation Process, Commercially available Parts, and Warfighter Impact-Based Parts Support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9"
                    },
                    "ProjectTitle": {
                        "val": "Emergent Logistics R&D Requirements (formerly Innovative Products & Services for DLA Customers)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.209"
                        },
                        "CurrentYear": {
                            "val": "3.404"
                        },
                        "BudgetYearOne": {
                            "val": "2.700"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.700"
                        },
                        "BudgetYearTwo": {
                            "val": "2.776"
                        },
                        "BudgetYearThree": {
                            "val": "2.868"
                        },
                        "BudgetYearFour": {
                            "val": "2.948"
                        },
                        "BudgetYearFive": {
                            "val": "3.009"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Emergent Logistics R&D Strategic Focus Area includes R&D efforts to develop new products and services for DLA customers.  The Energy Roadmap helps to achieve the operational energy strategy goals of increasing sources of supply, developing and implementing alternative fuels under the Energy Readiness Program (ERP).  The Supply Chain Management (SCM) Roadmap addresses emerging and out of cycle requirements that always occur and new products and services developed by DLA to include investments to qualify domestic, ultra-high modulus, carbon fiber material for Defense and National Security space systems in order to mitigate the supply chain costs and risks of this strategic material."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Emergent Logistics R&D Requirements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.209"
                                            },
                                            "Text": {
                                                "val": "Supply Chain Management continued to fund the exploration of 2 areas, Additive Manufacturing and Sourcing Ultra High Modulus Carbon Fiber, to allow DLA to get a head start on the technological advantages it offers without disrupting ongoing programs. DLA Additive Manufacturing (AM) partnered with the Military Services to accelerate product realization methods for AM producing parts. For Ultra-High Modulus Carbon Fiber, DLA completed materials characterization and qualification of a domestically produced, ultra-high modulus, carbon fiber system for Defense and National Security space systems in order to mitigate the supply chain costs and risks of this strategic material. \n\n\nERP continued to focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engaging in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.404"
                                            },
                                            "Text": {
                                                "val": "Supply Chain Management addresses the emerging technology opportunities that occur out of the budget cycle.  This allows DLA to get a head start undertaking new technological advances without disrupting ongoing programs.  In the past DLA R&D has been able to cut 12 to 24 months off the project starting lead-times.  Saving the lead-time allows the Agency to begin to realize the benefits of implementing new technology sooner than would otherwise be the case and maintain continuity of funding and activity for baseline programs.\n\nDLA and the Military Services will identify lists of candidate parts for AM to be used for vendor solicitation. DLA R&D has established AM Memorandums of Agreement (MOA) with Naval Sea Systems Command (NAVSEA), Naval Air Systems Command (NAVAIR), and U.S. Army Research, Development and Engineering Command (RDECOM), and currently developing MOAS with Kansas City National Security Campus (KCNSC), Air Force Materiel Command (AFMC) and Marine Corps Systems Command (MARCORSYSCOM). These MOAs will allow the Agency to begin the transition of AM as a new alternative into its procurements activities. \n\nEnergy Readiness will continue to focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engage in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Text": {
                                                "val": "SCM will continue to address the emerging technology opportunities that occur out of the budget cycle.  This allows DLA to get a head start undertaking new technological advances without disrupting ongoing programs.  In the past DLA R&D has been able to cut 12 to 24 months off the project starting lead-times.  Saving the lead-time allows the Agency to begin to realize the benefits of implementing new technology sooner than would otherwise be the case and maintain continuity of funding and activity for baseline programs. Augmented reality is an emerging technology that has potential to advance to the forefront. Complete the Advanced Thermoelectric Technology  project to improve the current thermoelectric heater technology so it is more fuel-efficient, has an increased heating range, reduced maintenance requirements, and a longer service life. The Advanced Thermoelectric Heater will replace the existing Space Heater Convective standard heaters currently stocked at DLA, and will provide DoD a single, versatile heater that reduces the logistics footprint and satisfies the space heating requirements of expeditionary forces.\n\nIn FY18, the AM project will be funded under PE 0603680S \/ Manufacturing Technology Program (ManTech) Project 7 - Improving Industrial Base Manufacturing Processes (formerly Material Availability). This realignment will maintain continuity of funding and activity for this program.\n\nERP will continue to focus on providing additional alternatives for military unique fuels, working with the Service customers to improve specifications and standards for fuel quality, engage in modeling and simulation of the energy supply chain and identifying alternative energy sources for Military Customers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition"
                        }
                    }
                }
            ]
        }
    }
}