{
    "id": "2018-AirForce-PB-3600-MJBOOK-0-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-3",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602102F"
        },
        "ProgramElementTitle": {
            "val": "Materials"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "132.768"
            },
            "CurrentYear": {
                "val": "126.152"
            },
            "BudgetYearOne": {
                "val": "124.264"
            },
            "BudgetYearOneBase": {
                "val": "124.264"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "124.561"
            },
            "BudgetYearThree": {
                "val": "127.835"
            },
            "BudgetYearFour": {
                "val": "127.827"
            },
            "BudgetYearFive": {
                "val": "131.745"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops advanced materials, processing, and inspection technologies to reduce life cycle costs and improve performance, sustainability, availability, affordability, supportability, reliability, and survivability of current and future Air Force systems and operations.  The program has three projects that develop: structural, propulsion, and sub-systems materials and processes technologies; electronic, optical, and survivability materials and processes technologies; and sustainment materials, processes technologies, and advanced non-destructive inspection methodologies.  Efforts in the program have been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication. \n\nIn FY 2018, a portion of HQ AFRL S&T civilian manpower in PE 0602102F, Materials, was transferred to PE 0602298F, Science and Technology Management - Major Headquarters Activities (MHA), to provide increased transparency to Congress on personnel in Major Headquarters Activities (MHA).\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "133.734"
                },
                "CurrentYear": {
                    "val": "126.152"
                },
                "BudgetYearOne": {
                    "val": "129.016"
                },
                "BudgetYearOneBase": {
                    "val": "129.016"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "132.768"
                },
                "CurrentYear": {
                    "val": "126.152"
                },
                "BudgetYearOne": {
                    "val": "124.264"
                },
                "BudgetYearOneBase": {
                    "val": "124.264"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.966"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-4.752"
                },
                "BudgetYearOneBase": {
                    "val": "-4.752"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.963"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.929"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.752"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.752"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 decrease due to realignment of Autonomy and Laser weapon system priorities and transfer of some HQ AFRL civilian manpower to PE 0602298F, Science and Technology Management - Major Headquarters Activities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624347"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Structures, Propulsion, and Subsystems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "54.699"
                        },
                        "CurrentYear": {
                            "val": "46.444"
                        },
                        "BudgetYearOne": {
                            "val": "45.059"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.059"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "46.915"
                        },
                        "BudgetYearThree": {
                            "val": "48.265"
                        },
                        "BudgetYearFour": {
                            "val": "46.335"
                        },
                        "BudgetYearFive": {
                            "val": "47.806"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the materials and processing technology base for aircraft, spacecraft, launch systems, and missiles to improve affordability, maintainability, and performance of current and future Air Force systems. A family of affordable lightweight materials is being developed, including metals, polymers, ceramics, metallic and nonmetallic composites, and hybrid materials to provide upgraded capabilities for existing aircraft, missile, and propulsion systems to meet the future system requirements. The project develops high-temperature turbine engine materials that will enable engine designs to double the turbine engine thrust-to-weight ratio. Advanced high temperature protection materials are being developed that are affordable, lightweight, dimensionally stable, thermally conductive, and\/or ablation and erosion resistant to meet aerospace and missile requirements. Alternative or replacement materials are being developed to maintain the performance of aging operational systems. Materials for thermal management including coolants, adaptive thermally conductive materials, coatings, friction and wear-resistant materials, and other pervasive nonstructural materials technologies are being developed for directed energy, propulsion, and subsystems on aircraft, spacecraft, and missiles. The project concurrently develops advanced processing methods to enable adaptive processing of aerospace materials."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Air Force Educational and Outreach Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.500"
                                        },
                                        "Text": {
                                            "val": "Conducted congressionally directed effort"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ceramics and Composites"
                                    },
                                    "Description": {
                                        "val": "Develop ceramic, ceramic matrix composite, and hybrid materials technologies for performance and supportability improvement in propulsion systems and high temperature aerospace structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.316"
                                            },
                                            "Text": {
                                                "val": "Continued to demonstrate new advanced processing methods, coating technologies, and behavior and life prediction for higher temperature capable organic and ceramic matrix composites. Demonstrated enviro-mechanical damage models that have been validated via ceramic matrix composite oxidation studies for the hot section of turbine engines. Finalized vane geometry for rig test to further validate damage models in realistic environment.  Continued to advance the development and validation of new ceramic and organic matrix composite materials and processes with higher temperature capability for propulsion systems and aerospace structures. Continued to advance and integrate the computational material science infrastructure for composite materials in an effort to accelerate the development and certification of advanced composite materials. Demonstrated multi-functional materials and processes for applications requiring advanced electromagnetic and laser protection for aerospace structures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.378"
                                            },
                                            "Text": {
                                                "val": "Validate repeatability of new advanced processing methods, coating technologies, and behavioral life prediction for higher temperature capable organic and ceramic matrix composites. Continue to demonstrate severe environment durability of advanced composite systems via mechanical testing. Continue to advance the development and validate new ceramic and organic matrix composite materials and processes with higher temperature capability for propulsion systems and aerospace structures. Continue to advance and integrate the computational material science infrastructure for composite materials in an effort to accelerate the development and certification of advanced composite materials. Continue the development of composite damage progression models for application in an engineering environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.585"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.585"
                                            },
                                            "Text": {
                                                "val": "Continue the validation of repeatability of new advanced processing methods, coating technologies, and behavioral life prediction for higher temperature capable organic and ceramic matrix composites. Continue to demonstrate severe environment durability of advanced composite systems via mechanical testing. Continue exploration of new ceramic and polymer matrix composite materials and processes with higher temperature capability for next generation propulsion systems and aerospace structures. Continue to advance and integrate the computational material science infrastructure for composite materials in an effort to accelerate the development and certification of advanced composite materials.  Verify and validate damage progression models on increasingly complex polymer matrix composite structural applications.  Continue development of composite damage progression models for application in an engineering environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metals"
                                    },
                                    "Description": {
                                        "val": "Develop lightweight and high temperature metallics, life prediction, and metals processing technologies for increased affordability, durability, and reliability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.101"
                                            },
                                            "Text": {
                                                "val": "Completed testing of heat treatments of advanced nickel alloys used in high pressure turbine disks to determine best conditions to minimize crack growth. Finalized the demonstration of analysis techniques for understanding and explicitly treating residual stress in nickel-base superalloy components. Validated repeatability of advanced computation methods to support material development and characterization modeling. Continued demonstration of quantitative, predictive models for performance of metallic based thermal management systems.  Continued to analyze relationships between microstructure, processing, properties, and performance of metallic, hybrid, nanoscale, and gradient metallic materials.  Continued development of integrated material\/manufacturing and component analysis for life management and development of structural materials innovative research. Supported the industry in developing affordable metal processes and components.  Continued to advance the development of the next generation turbine engine disk."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.357"
                                            },
                                            "Text": {
                                                "val": "Implementation of advanced computation methods to support material development and characterization modeling. Continue demonstration of quantitative, predictive models for performance of metallic based thermal management systems. Continue to analyze relationships between microstructure, processing, properties, and performance of metallic, hybrid, nanoscale, and gradient metallic materials. Continue development of affordable integrated material\/manufacturing and component analysis for life management and development of structural materials innovative research. Continue to advance development of next generation turbine engine disk and reliable affordable metallic structural components through computational methods.  Initiate the integration and demonstration of advanced analytical tools to optimize design and certification of additively manufactured metallic components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.968"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.968"
                                            },
                                            "Text": {
                                                "val": "Continue implementation of advanced computation methods to support material development and characterization modeling. Continue demonstration of quantitative, predictive models for performance of metallic based thermal management systems. Continue to analyze relationships between microstructure, processing, properties, and performance of metallic, hybrid, nanoscale, and gradient metallic materials. Validate and continue development of affordable integrated material\/manufacturing and component analysis for life management and development of affordable structural materials innovative research. Continue to advance development of next generation turbine engine disk and reliable affordable metallic structural components through computational methods.  Continue demonstration of the value of integrated analytical tools in the optimization of design and certification of additively manufactured metallic components. Initiate the development of integrated spatial registration capability addressing accuracy, precision, and durability for all intended state awareness applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Thermal Protection Materials"
                                    },
                                    "Description": {
                                        "val": "Develop and evaluate lightweight, active, adaptive, multifunctional, high temperature, and durable material systems for extreme environments and hypersonic applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.782"
                                            },
                                            "Text": {
                                                "val": "Demonstrated use of ceramic matrix composites in hypersonic jet engine to simplify internal fuel cooling system. Continued to refine and improve processing methods to fabricate materials required for expendable hypersonic applications. Continued development of unique experimental techniques to assess mechanical properties and time-dependent behavior.  Assessed material properties and performance against requirements for control surfaces, leading edges and acreage. Validated computational models to assess environmental degradation of materials in a hypersonic environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.709"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and demonstrate improved processing methods for fabricating materials required for expendable hypersonic applications. Refine and continue development of unique experimental techniques to assess mechanical properties and time-dependent behavior. Continue to validate and demonstrate material properties and performance meet design needs for control surfaces, leading edges and acreage. Continue to validate computational models to assess environmental degradation of materials in a hypersonic environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.506"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.506"
                                            },
                                            "Text": {
                                                "val": "Validate and refine processing methods for fabricating materials required for expendable hypersonic applications. Continue to refine and develop unique experimental techniques to assess mechanical properties and time-dependent behavior. Continue to validate and demonstrate material properties and performance to meet design needs for control surfaces, leading edges and acreage. Continue to validate computational models to assess environmental degradation of materials in a hypersonic environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624348"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Electronics, Optics, and Survivability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.530"
                        },
                        "CurrentYear": {
                            "val": "32.866"
                        },
                        "BudgetYearOne": {
                            "val": "31.523"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.523"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "32.703"
                        },
                        "BudgetYearThree": {
                            "val": "33.732"
                        },
                        "BudgetYearFour": {
                            "val": "34.690"
                        },
                        "BudgetYearFive": {
                            "val": "35.992"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials technologies for Intelligence, Surveillance, and Reconnaissance (ISR), situational awareness, and low-observable systems and subsystems for aircraft and missile applications, including sensor, microwave, and short, mid, and long-wave infrared (SWIR, MWIR, LWIR) detection and countermeasures devices used for targeting, electronic warfare, and active aircraft protection.  Materials for protection of aircrews, sensors, and aircraft from laser, high-power microwave directed energy threats are also developed.  Electronic and optical materials are being developed to enable surveillance and situational awareness with faster operating speeds, greater tunability, higher power output, improved thermal management (including higher operating temperatures), greater sensitivity, and extended dynamic range.  New materials are being developed to counter the most prominent laser threats and to respond to emerging and agile threat wavelengths without impairing mission effectiveness. The project develops nanostructured and biological materials for aircraft structures, munitions, air vehicle subsystems, and personnel. The project develops novel materials for electromagnetic interactions with matter for electromagnetic pulse, high power microwave, and lightning strike protection."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Infrared Detector and Electromagnetic Device Materials"
                                    },
                                    "Description": {
                                        "val": "Develop infrared (IR) detector and Electro-magnetic device materials and processes technologies for performance, affordability, and operational capability of surveillance, tracking, targeting, and situational awareness systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.364"
                                            },
                                            "Text": {
                                                "val": "Demonstrated additively manufactured conformal electronic structures for communication applications. Demonstrated models of optical\/IR behavior for materials. Developed nanoscale materials for use in producing detectors. Continued to develop materials for use in high resolution MWIR. Continued to develop materials to support and provide persistent air and space ISR. Continued to utilize computational materials science to improve performance prediction models. Continued development of quantum materials for aerospace applications. Continued development of SWIR detector materials and hyper-spectral LWIR. Continued development of radio frequency and IR photonics for air vehicle applications.  Pursued development of nanostructured materials for components to enable agile radio frequency capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.846"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate materials and processes for control and detection of electromagnetic radiation for ISR technologies. Continue to develop and demonstrate materials for use in high resolution imaging by electromagnetic radiation.  Demonstrate nanoscale materials, meta materials, and models for use in producing detectors. Continue to utilize computational materials science to improve performance prediction and reliability models. Continue to demonstrate quantum materials for aerospace applications. Continue to develop and demonstrate SWIR detector materials and hyperspectral LWIR materials. Demonstrate materials and processes for the integration of radio frequency and optical signals, as well as concepts for novel optical devices and components. Continue development of radio frequency and IR photonics for air vehicle applications. Demonstrate nanostructured materials for components to enable agile radio frequency capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.403"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.403"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate materials and processes for control and detection of electromagnetic radiation for ISR technologies.  Continue to develop and demonstrate materials for use in high resolution imaging by electromagnetic radiation.  Continue to demonstrate nanoscale materials, meta materials, and models for use in producing detectors. Continue to utilize computational materials science to improve performance prediction and reliability models. Continue to demonstrate quantum materials for aerospace applications. Continue to develop and demonstrate SWIR detector materials and hyper-spectral LWIR materials. Validate materials and processes for integration of radio frequency and optical signals as well as concepts for novel optical devices and components. Validate and continue development of photonics for air vehicle applications. Continue to demonstrate nanostructured materials for components to enable agile radio frequency capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy Hardened Materials"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to enhance the safety, survivability, and mission effectiveness of aircrews, sensors, viewing systems, and related assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.017"
                                            },
                                            "Text": {
                                                "val": "Demonstrated repeatability of materials and technologies to protect against directed energy threats. Developed advanced optical limiter materials for damage protection, enhanced hybrid materials for advanced applications in airborne, space, and personnel systems. Continued to validate materials for high energy laser interactions. Developed approaches for integration of multi-modal hardening into structures and devices. Continued to utilize computational materials science to employ multi-scale modeling for design of robust, reliable integrated protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.160"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate repeatability of materials and technologies to protect against directed energy threats. Improve advanced optical limiter materials for damage protection, enhance hybrid materials for advanced applications in airborne, space, and personnel systems. Assess response of new materials for high energy laser interactions. Continue to develop approaches for integration of multi-modal hardening into structures and devices. Validate repeatability and continue to utilize computational materials science to enhance multi-scale modeling for design of robust, reliable integrated protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.979"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.979"
                                            },
                                            "Text": {
                                                "val": "Validate and demonstrate a plethora of materials and technologies to protect against directed energy threats. Demonstrate advanced optical limiter materials for damage protection, enhanced hybrid materials for advanced applications in airborne, space, and personnel systems. Continue to assess response of new materials for high-energy laser interactions. Continue to develop approaches for integration of multi-modal hardening into structures and devices. Continue to validate repeatability and continue to utilize computational materials science to enhance multi-scale modeling for design of robust, reliable integrated protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Source Materials"
                                    },
                                    "Description": {
                                        "val": "Develop materials to enable higher performance high power laser sources (quasi-Continuous Wave to Continuous Wave) with emphasis on laser output in the mid-IR spectral region (2-5 microns)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.425"
                                            },
                                            "Text": {
                                                "val": "Demonstrated materials processes for fabricating new laser beam scanning devices to enable high-speed beam steering. Demonstrated material and growth processes for fabricating phase-matched crystals. Improved design and fabrication of waveguides for higher power pump lasing. Investigated power limitations of lasing of crystal fiber waveguide structures and performance limitations. Continued investigation of quasi-phase-matched materials and developed processes to reduce absorption."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.315"
                                            },
                                            "Text": {
                                                "val": "Develop materials and processing technologies to control and generate directed electromagnetic energy for survivability and other applications. Continue to demonstrate and model materials processes for controlling laser beam direction with optical components. Demonstrate materials and models for directed energy sources. Continue development of both phase-matched crystals and crystal fiber waveguides sufficiently to demonstrate subsystem capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.261"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.261"
                                            },
                                            "Text": {
                                                "val": "Validate materials and process technologies to control and generate directed electromagnetic energy for survivability and other applications. Continue to demonstrate and model materials processes for controlling laser beam direction and focus with optical components. Continue to demonstrate materials for frequency conversion, optical coatings, mirrors and high power microwave sources for directed energy sources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nanostructured and Biological Materials"
                                    },
                                    "Description": {
                                        "val": "Develop enabling and foundational biotechnologies for guidance and control, rapid tagging, tracking, and identification of targets, and bio-integrated electronics and sensing for Air Force applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.724"
                                            },
                                            "Text": {
                                                "val": "Used advanced functional materials to develop wearable sensors to monitor biomarkers that will provide insight into human performance. Developed system to remove contamination on aircraft reducing spreading of diseases and corrosion. Validated complex hybrid materials addressing unique requirements of Air Force sensors and electronic components. Advanced the use of computational materials science to model material development and to enable rapid in-situ experimental data acquisition. Validated reliable materials and processes to optimize components for compact, flexible, multi-functional devices. Developed accurate methods to assess microbial interactions with material to establish risk for property degradation. Demonstrated materials and processes for developing robust hybrid electronic packages on varied flexible and stretchable substrates with embedded energy. Continued to focus material and process development for integration of flexible components into multi-modal platform. Developed and demonstrated methods to assess reliability of nano and bio materials and processes. Supported Flexible Hybrid Electronics Institute for Manufacturing Innovation and the NanoBio Manufacturing Consortium."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.545"
                                            },
                                            "Text": {
                                                "val": "Continue to validate engineering, scientific, and processing methods for nano and biological materials to address unique requirements for Air Force man-machine integration, and electronic components. Explore biotechnology to assess the impact of microbes and fungi on Air Force systems. Continue to validate reliable materials and processes to optimize components for compact, flexible, stretchable multi-functional devices. Demonstrate materials and process for functional additive manufacturing of electronic components. Continue to develop methods to assess reliability of nano and bio materials and processes for Air Force applications. Continue to support Flexible Hybrid Electronics Institute for Manufacturing Innovation and the NanoBio Manufacturing Consortium."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.880"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.880"
                                            },
                                            "Text": {
                                                "val": "Continue to validate engineering, scientific and processing methods for nano and biological materials to address unique requirements for Air Force man-machine integration, and electronic components. Continue to explore biotechnology to assess the impact of microbes and fungi on Air Force systems. Continue to study reliable materials and processes to optimize components for compact, flexible, stretchable multi-functional devices. Validate materials and process for functional additive manufacturing of electronic components. Demonstrate methods to assess reliability of nano and bio materials and processes. Continue to support Flexible Hybrid Electronics Institute for Manufacturing Innovation and the NanoBio Manufacturing Consortium."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624349"
                    },
                    "ProjectTitle": {
                        "val": "Materials Technology for Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.539"
                        },
                        "CurrentYear": {
                            "val": "46.842"
                        },
                        "BudgetYearOne": {
                            "val": "47.682"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.682"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "44.943"
                        },
                        "BudgetYearThree": {
                            "val": "45.838"
                        },
                        "BudgetYearFour": {
                            "val": "46.802"
                        },
                        "BudgetYearFive": {
                            "val": "47.947"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials and processing technologies to support operational Air Force mission areas by providing the ability to inspect the quality of delivered systems, transitioning more reliable and maintainable materials, establishing a capability to detect and characterize performance threatening defects, characterizing materials processes and properties necessary for materials transition, and providing quick reaction support and failure analysis to the operational commands and repair centers.  Repair techniques and nondestructive inspection\/evaluation (NDI\/E) methods are developed that are needed for metallic and non-metallic structures, coatings, corrosion control processes, and to support integration of composite structures for aerospace systems.  Various NDI\/E methods are essential to ensure optimum quality in the design and production of aircraft, propulsion, and missile systems.  These NDI\/E methods are also essential to monitor and detect the onset of any service-initiated damage and\/or deterioration due to aging of operational systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop sensing and life prediction technologies to identify damage and characterize the health of aging structures, propulsion systems, and low-observable materials and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.503"
                                            },
                                            "Text": {
                                                "val": "Developed the remote access non-destructive evaluation tool for ease of inspection to limited access areas. Demonstrated non-destructive evaluation modeling capabilities and used these competencies to drive improvements in capability to detect and characterize damage in realistic aerospace structures and engine components.  Continued to develop approaches to address the variability inherent in aerospace systems and materials and began to quantify the impact of that variability on non-destructive inspection capabilities and reliability. Demonstrated advanced sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Continued development and validation of damage state awareness approaches and methodologies for use on aerospace structures and engine components. Fully automated a laboratory test system with robotic hardware and machine learning software to optimize coating inspection. Continued development of advanced methods to monitor and evaluate material state awareness. Continued to demonstrate enhanced metals performance in aerospace systems. Continued to develop risk-based life management approaches for turbine engine structural materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.255"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate non-destructive evaluation modeling capabilities and use these competences to drive improvements in capability to detect and characterize damage in realistic aerospace structures and engine components. Continue to develop approaches to address the variability inherent in aerospace systems and materials and begin to quantify the impact of that variability on non-destructive inspection capability and reliability. Continue to demonstrate advanced sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Continue development and validation of damage state awareness approaches and methodologies for use on aerospace structures and engine components. Continue development of advanced methods to monitor and evaluate low-observable material state awareness.  Continue to demonstrate enhanced metals performance in aerospace systems. Continue to develop risk-based life management approaches for turbine engine structural materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.689"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.689"
                                            },
                                            "Text": {
                                                "val": "Validate and continue to demonstrate non-destructive evaluation modeling capabilities and use these competencies to drive improvements in capability to detect and characterize damage in realistic aerospace structures and engine components. Continue to develop approaches to address the variability inherent in aerospace systems and materials and begin to quantify the impact of that variability on non-destructive inspection capability and reliability. Continue to demonstrate advanced sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Continue development and validation of damage state awareness approaches and methodologies for use on aerospace structures and engine components.  Validate and continue development of advanced methods to monitor and evaluate material state awareness. Continue to demonstrate enhanced metals performance in aerospace systems. Validate and continue to develop risk-based life management approaches for turbine engine structural materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Production and Repair Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve problems with materials in the production and repair of systems components and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.862"
                                            },
                                            "Text": {
                                                "val": "Developed a non-destructive inspection tool to confirm visual crack findings with unskilled\/certified operators. Demonstrated non-destructive evaluation modeling capabilities and used these competencies to drive improvements in capability to detect and characterize damage in realistic aerospace structures and engine components. Continued to develop approaches to address the variability inherent in aerospace systems and materials and initiated efforts to quantify the impact of that variability on non-destructive inspection capability and reliability. Demonstrated advanced sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Continued development and validation of damage state awareness approaches and methodologies for use on aerospace structures and engine components. Continued to demonstrate enhanced metals performance in aerospace systems and to develop risk-based life management approaches for turbine engine structural materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.261"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate non-destructive evaluation modeling capabilities and use these competences to drive improvements in capability to detect and characterize damage in realistic aerospace structures and engine components. Continue to develop approaches to address the variability inherent in aerospace systems and materials and begin to quantify the impact of that variability on non-destructive inspection capability and reliability. Continue to demonstrate advanced sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Continue development and validation of damage-state awareness approaches and methodologies for use on aerospace structures and engine components. Continue development of advanced methods to monitor and evaluate low-observable material-state awareness.  Continue to demonstrate enhanced metals performance in aerospace systems. Continue to develop risk-based life management approaches for turbine engine structural materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.397"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.397"
                                            },
                                            "Text": {
                                                "val": "Substantiate repeatability and demonstrate advanced materials and processes technology to repair and extend the life of Air Force legacy systems. Further refine through demonstration the understanding of failure limits for emerging Air Force systems. Advance the analysis and development of improved lifecycle prediction test methods and techniques to understand effects of service environments, corrosion, residual stresses, and material processes on structural and functional materials. Improve the continued assessment of advanced materials, processes and designs for improved repair and maintainability and life cycle cost of outer-moldline coatings, access panel treatments, and multifunctional systems. Further advance low observable affordability technologies and processes to reduce maintenance costs of these materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Failure Analysis Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve materials problems and provide electronic and structural failure analysis of components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.174"
                                            },
                                            "Text": {
                                                "val": "Performed quick response failure analyses and materials investigations. Improved analysis techniques to determine root cause materials failure\/degradation. Provided advanced materials solutions to ensure critical warfighter system availability and safety of flight. Enhanced development of functional materials failure analysis capabilities. Validated advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Discovered environmentally safe materials and processes for extending the life of aluminum aircraft components. Transitioned advanced test methods for analyzing electrical and structural failures of emerging materials. Developed and transitioned materials with high durability and protection for high power wiring technologies for Air Force weapons systems. Provided advanced materials solutions to improve systems sustainment in field and Air Force Program Offices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.326"
                                            },
                                            "Text": {
                                                "val": "Continue to perform quick response failure analysis and materials investigations. Continue to develop and investigate improved analysis techniques to determine root cause materials failure\/degradation. Continue to develop and provide advanced materials solutions to ensure critical warfighter system availability and safety of flight. Continue development of functional materials failure analysis capabilities. Continue to analyze and validate advanced electrostatic discharge protection technologies and procedures for emerging avionics sub-systems. Continue to transition advanced test methods for analyzing electrical and structural failures of emerging materials. Continue development and demonstration of new, more durable materials and protection for high power wiring technologies for Air Force weapons systems. Continue research and development to provide advanced materials to improve systems sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.596"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.596"
                                            },
                                            "Text": {
                                                "val": "Perform and increase efficiency of quick response failure analyses and materials investigations. Continue to develop and investigate improved analysis techniques to determine root cause materials failure\/degradation. Continue to develop and provide advanced materials solutions to ensure warfighter system availability and safety of flight. Continue development of functional materials failure analysis capabilities. Continue to analyze and validate advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Continue to transition advanced test methods for analyzing electrical and structural failures of emerging materials. Continue development and demonstrate new, more durable materials and protection for high power wiring technologies for Air Force weapon systems. Continue research and development to provide advanced materials to improve systems sustainment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}