{
    "id": "2018-AirForce-PB-3600-MJBOOK-3-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-38",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3A-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305600F"
        },
        "ProgramElementTitle": {
            "val": "International Intelligence Technology and Architectures"
        },
        "R1LineNumber": {
            "val": "269"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "2.298"
            },
            "CurrentYear": {
                "val": "2.360"
            },
            "BudgetYearOne": {
                "val": "3.491"
            },
            "BudgetYearOneBase": {
                "val": "3.491"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "3.527"
            },
            "BudgetYearThree": {
                "val": "3.579"
            },
            "BudgetYearFour": {
                "val": "3.725"
            },
            "BudgetYearFive": {
                "val": "3.774"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.298"
                },
                "CurrentYear": {
                    "val": "2.360"
                },
                "BudgetYearOne": {
                    "val": "2.491"
                },
                "BudgetYearOneBase": {
                    "val": "2.491"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.298"
                },
                "CurrentYear": {
                    "val": "2.360"
                },
                "BudgetYearOne": {
                    "val": "3.491"
                },
                "BudgetYearOneBase": {
                    "val": "3.491"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.000"
                },
                "BudgetYearOneBase": {
                    "val": "1.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY2018 increase supports additional design, development, testing, and technical refresh for cross-domain capabilities (such as the Trusted Network Environment (TNE)), new BICES-enabled ISR capabilities, and new Geospatial Intelligence and biometric tools for the U.S. BICES Enterprise. This will enable the BICES Program Office (BPO) to: a) modernize and transform the US BICES\/US BICES-X worldwide enterprise; b) align US BICES\/US BICES-X with the Joint Information environment (JIE) and the Defense Intelligence Information Environment (DI2E) standards, process, and framework; c) develop a cybersecurity roadmap and implement improved cybersecurity assessment tools; and d) smartly enhance capability, capacity, and scalability across the US BICES\/US BICES-X enterprise seeking improved integration with the Distributed Common Ground\/Surface System (DCGS) family of Systems."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675898"
                    },
                    "ProjectTitle": {
                        "val": "International Intelligence Technology and Arc"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.298"
                        },
                        "CurrentYear": {
                            "val": "2.360"
                        },
                        "BudgetYearOne": {
                            "val": "3.491"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.491"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.527"
                        },
                        "BudgetYearThree": {
                            "val": "3.579"
                        },
                        "BudgetYearFour": {
                            "val": "3.725"
                        },
                        "BudgetYearFive": {
                            "val": "3.774"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "International Intelligence Technology and Architectures oversees, manages, and provides the United States (US) component of the multi-national Battlefield Information Collection and Exploitation System (US BICES) with a collaborative environment and intelligence sharing enterprise required for processing and disseminating critical intelligence information between and among US, North Atlantic Treaty Organization (NATO), allied and coalition forces. The US BICES program procures and maintains a standing intelligence information sharing capability across Department of Defense (DoD), Combat Support Agencies, and multiple Combatant Commands (CCMD) for the Under Secretary of Defense, Intelligence (USD (I)). At the request of USD (I), US BICES is extended beyond U.S. European Command (USEUCOM) into all CCMDs and is known as US BICES Extended (US BICES-X).  US BICES provides an \"enduring\" US and Coalition interoperable intelligence sharing multi-level secure technical architecture utilizing releasable elements of the Defense Intelligence Information Enterprise (DI2E) framework and functions to support the full spectrum of intelligence operations and dissemination throughout the DoD community. Also, it enables instantiation of US BICES\/BICES-X as the intelligence contribution to the Mission Partner Environment (MPE).\n\nResearch and Development funding will:  \n  - Provide increased intelligence information sharing capabilities in support of US and coalition forces utilizing the US BICES and NATO virtual networks within the Afghanistan theater and provide increased database information via Distributed Common Ground System – Army. \n  - Provide an increase in intelligence disciplines (Imagery Intelligence, Signal Intelligence, and potential Human Intelligence) in support of US and Allied\/Coalition forces that currently is very limited to the warfighter. Increased intelligence advanced analytics tools will be migrated from Joint Intelligence Operation Center-IT and DI2E developments and will significantly increase the timeliness of intelligence and bring US BICES\/NATO Special Operations Forces Headquarters\/NATO Intelligence Fusion Center capabilities into the current technology baselines. \n  - Develop and provide a federated Trusted Network Environment (TNE) that incorporates the Asian Pacific intelligence Information Network being developed to support the National Defense Strategy as we transition out of Afghanistan and into the Pacific. \n  - Provide multi-level security intelligence bi-laterals and multi-laterals to meet Combatant Commander Integrated Priority Lists. \n  - Develop the Coalition Partner Network for CENTCOM, the Coalition Information Exchange Network for SOUTHCOM, and the Coalition Partner Network for EUCOM and AFRICOM. \n  - Develop the US BICES connections with these bi-lateral and multi-lateral federated TNEs that make up the US BICES-X Enterprise Network in support of Commander SOCOM requirements for conventional and coalition operations as the US migrates into other Combatant Command regions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Intelligence Technology and Architectures"
                                    },
                                    "Description": {
                                        "val": "Continue the research and development in emerging and maturing technologies and capabilities for modernizing and transforming US BICES\/BICES-X for improved agility, scalability, access, cybersecurity, and data and information sharing tools and infrastructure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.298"
                                            },
                                            "Text": {
                                                "val": "Continued the Certification Test and Evaluation (CT&E) of the next release of the Trusted Network Environment (TNE), providing improvements to existing capabilities, and new services supporting telephony, cross-domain virtual desktop, and data replication capabilities.  Research began for the implementation of new services and capabilities, which include advanced search capabilities within the TNE, metadata handling, and restricted user communities for isolating authoritative data sources, integration of multi-domain relational database operations, and an application programming interface that will enhance information sharing through the use of existing applications like Share Point with the TNE."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.360"
                                            },
                                            "Text": {
                                                "val": "Complete a separate Certification Test and Evaluation (CT&E) for an interim accelerated release of the Trusted Network Environment (TNE) to support the fielding of telephony and cross-domain virtual desktop services more quickly than currently scheduled.  Fielding the interim release of the TNE, v2.2."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.491"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.491"
                                            },
                                            "Text": {
                                                "val": "Continue the research and development for future releases of the Trusted Network Environment (TNE), to include Identity and Access Management (IdAM), peer-federated chat services, and adding video to the telephony services. Begin the Certification Test and Evaluation (CT&E) of new capabilities, to include the implementation and certification of new services such as video teleconferencing (VTC), metadata handling, restricted user communities for isolating authoritative data sources, integration of multi-domain relational database operations, and an application programming interface that will enhance information sharing through the use of existing applications like Share Point with the TNE."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Other Procurement, Air Force"
                                    },
                                    "Title": {
                                        "val": "Classified"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.250"
                                        },
                                        "CurrentYear": {
                                            "val": "18.358"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "832050 Other Procurement, Air Force"
                                    },
                                    "Title": {
                                        "val": "International Intelligence Technology and Architecture"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "31.208"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.335"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "8.873"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.139"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.398"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.680"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.967"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "FY2017 and prior procurement funding was appropriated under a classified Other Procurement, Air Force P-1 line item."
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize existing competitively awarded General Dynamics Mission Systems (GDMS) contract number FA8240-14-D-2751. The contract is structured as a fixed price incentive fee with one base year and four option years and a period of performance beginning 1 June 2014 through 31 May 2019."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}