{
    "id": "2018-OperationalTestandEvaluationDefense-PB-0460-JBOOK-3823431a26cf1eb864d85d740cbc22697620619c9a450dbbb78799eaa58e1691-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OTANDE-U_RDTE_JustificationBook_Operational_Test_and_Evaluation,_Defense_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Operational_Test_and_Evaluation,_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Operational Test and Evaluation, Defense",
        "appropriation_code": "0460",
        "appropriation_name": "Operational Test and Evaluation, Defense"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605118OTE"
        },
        "ProgramElementTitle": {
            "val": "Operational Test and Evaluation (OT&E)"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "AppropriationCode": {
            "val": "0460"
        },
        "AppropriationName": {
            "val": "Operational Test and Evaluation, Defense"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "90.673"
            },
            "PriorYear": {
                "val": "76.838"
            },
            "CurrentYear": {
                "val": "80.772"
            },
            "BudgetYearOne": {
                "val": "83.503"
            },
            "BudgetYearOneBase": {
                "val": "83.503"
            },
            "BudgetYearTwo": {
                "val": "85.397"
            },
            "BudgetYearThree": {
                "val": "86.803"
            },
            "BudgetYearFour": {
                "val": "88.620"
            },
            "BudgetYearFive": {
                "val": "90.499"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Director of Operational Test and Evaluation (DOT&E) was created by Congress in 1983.  The Director is responsible under Title 10 for policy and procedures for all aspects of Operational Test and Evaluation (OT&E) within the Department of Defense (DoD).  Particular focus is given to OT&E that supports major weapon system production decisions for acquisition programs included on the Office of Secretary of Defense Test and Evaluation Oversight List that is prepared and approved annually.  Generally, there are about 300 programs on the oversight list including all Major Defense Acquisition Programs (MDAP) and Major Automated Information Systems (MAIS).  MDAPs may not proceed beyond low-rate initial production (BLRIP) until OT&E of the program is complete.  DOT&E is involved early in the planning phase of each program to ensure adequate testing is planned and executed.  Key elements of DOT&E's oversight authority include: \n\n-     Approve component Test and Evaluation Master Plans (TEMPS).\n-     Approve component OT&E Test Plans (TPs).\n-     Oversee Military Department preparation and conduct of field operational tests; analysis and evaluation of the resultant test data; the assessment of the adequacy of the executed test and evaluation programs; and assessment of the operational effectiveness and suitability of the weapon systems.\n-     Report results of OT&E that supports BLRIP decisions to the Secretary of Defense and Congress, as well as providing an annual report summarizing all OT&E activities and the adequacy of test resources within DoD during the previous fiscal year.\n-     Review and make recommendations to the Secretary of Defense on all budgetary and financial matters related to OT&E, including operational test facilities, resources and ranges.\n\nDOT&E also oversees and resources OT&E community efforts to plan and execute joint operational evaluations of information assurance and interoperability\n (IA and IOP) of fielded systems and networks during major Combatant Command (CCMD) and Service exercises, and reports the trends and findings in the annual report. \n\nDOT&E is also involved in increasing the capacity to access realistically advanced cyber warfare capabilities to keep pace with heightened demand for their capabilities, advancing technologies and the growing cyber threat.\n\nThis Program Element includes funds to obtain Federally Funded Research and Development Center (FFRDC) support in performing the described tasks, travel funds to carry out oversight of the OT&E and IA and IOP programs, funds for Service teams performing information assurance and interoperability assessments during exercises, administrative support services, DFAS support, and engineering and technical support services related to the conduct of operational test and evaluation and exercise assessments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "76.838"
                },
                "CurrentYear": {
                    "val": "78.047"
                },
                "BudgetYearOne": {
                    "val": "80.129"
                },
                "BudgetYearOneBase": {
                    "val": "80.129"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "76.838"
                },
                "CurrentYear": {
                    "val": "80.772"
                },
                "BudgetYearOne": {
                    "val": "83.503"
                },
                "BudgetYearOneBase": {
                    "val": "83.503"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "2.725"
                },
                "BudgetYearOne": {
                    "val": "3.374"
                },
                "BudgetYearOneBase": {
                    "val": "3.374"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program increases for Cyber Testing"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.374"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.374"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Cybersecurity Assessments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "2.725"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "AMENDED BUDGET REQUEST JUSTIFICATION: $2.725 million is required to address emergency warfighting readiness requirements\nThis increase is for Cybersecurity Assessments including funding three commercially available exploits to help DoD Red Teams portray Tier 3 cyber adversaries;\nfunding and configuring three Cross Domain Solutions (CDS) for cybersecurity testing to identify vulnerabilities in fielded systems and acquisition programs,\nidentify mitigation strategies, and promulgate efficient test guidance; deploying a new platform to improve situational awareness and control of five DoD Red\nTeams.\n\n$3.374 million in FY 2018 is to develop testing standards, policies, and practices for cyber payloads."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0605118OTE"
                    },
                    "ProjectTitle": {
                        "val": "OT&E"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "90.673"
                        },
                        "PriorYear": {
                            "val": "76.838"
                        },
                        "CurrentYear": {
                            "val": "80.772"
                        },
                        "BudgetYearOne": {
                            "val": "83.503"
                        },
                        "BudgetYearOneBase": {
                            "val": "83.503"
                        },
                        "BudgetYearTwo": {
                            "val": "85.397"
                        },
                        "BudgetYearThree": {
                            "val": "86.803"
                        },
                        "BudgetYearFour": {
                            "val": "88.620"
                        },
                        "BudgetYearFive": {
                            "val": "90.499"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Director of Operational Test and Evaluation (DOT&E) was created by Congress in 1983.  The Director is responsible under Title 10 for policy and procedures for all aspects of Operational Test and Evaluation (OT&E) within the Department of Defense (DoD).  Particular focus is given to OT&E that supports major weapon system production decisions for acquisition programs included on the Office of Secretary of Defense Test and Evaluation Oversight List that is prepared and approved annually.  Generally, there are about 300 programs on the oversight list including all Major Defense Acquisition Programs (MDAP) and Major Automated Information Systems (MAIS).  MDAPs may not proceed beyond low-rate initial production (BLRIP) until OT&E of the program is complete.  DOT&E is involved early in the planning phase of each program to ensure adequate testing is planned and executed.  Key elements of DOT&E's oversight authority include: \n\n-     The approval of component Test and Evaluation Master Plans (TEMPS).\n-     The approval of component OT&E Test Plans (TPs).\n-     Oversight of Military Department preparation and conduct of field operational tests; analysis and evaluation of the resultant test data; the assessment of the adequacy of the executed test and evaluation programs; and assessment of the operational effectiveness and suitability of the weapon systems.\n-     Reporting results of OT&E that support BLRIP decisions to the Secretary of Defense and Congress, as well as providing an annual report summarizing all OT&E activities and the adequacy of test resources within DoD during the previous fiscal year.\n-     The review and make recommendations to the Secretary of Defense on all budgetary and financial matters related to OT&E, including operational test facilities, resources and ranges.\n\nDOT&E also oversees and resources OT&E community efforts to plan and execute joint operational evaluations of information assurance and interoperability\n( IA and IOP) of fielded systems and networks during major Combatant Command (CCMD) and Service exercises, and reports the trends and findings in the annual report. \n\nDOT&E is also involved in increasing the capacity to access realistically advanced cyber warfighting capabilities to keep pace with heightened demand for those capabilities, advancing technologies and the growing cyber threat.\n\nThis Program Element includes funds to obtain Federally Funded Research and Development Center (FFRDC) support in performing the described tasks, travel funds to carry out oversight of the OT&E and IA and IOP programs, funds for Service teams performing information assurance and interoperability assessments during exercises,  administrative support services, DFAS support, and engineering and technical support services related to the conduct of operational test and evaluation and exercise assessments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "76.838"
                                            },
                                            "Text": {
                                                "val": "Operational Test and Evaluation Oversight\n\nThis effort is in direct support of the Director’s Title 10 responsibilities and is a continuing effort.  Funding for FY 2016 provides Operational Test and Evaluation inputs for Test and Evaluation Master Plans, Test Plans, System Acquisition Reports, Defense Acquisition Executive Summary Reports for those programs designated for oversight by DOT&E and OUSD(AT&L).  Key elements of DOT&E oversight authority are identified in Calendar Year 2016 Office of the Secretary of Defense Test and Evaluation Oversight List.  \n\nCybersecurity Evaluations\n\nDOT&E sponsored seven Combatant Command (CCMD) and two Service cybersecurity exercise assessments in FY 2016.  In addition to the nine exercise assessments, DOT&E performed two assessments during visits to operational sites not involved in an exercise.  All DOT&E-sponsored assessments included a “fix” phase during which DOT&E-funded cybersecurity experts helped CCMD and Service personnel address critical cybersecurity vulnerabilities.  As part of our new Cyber Readiness Campaigns (CRCs), DOT&E worked with U.S. Pacific Command, U.S. Northern Command, U.S. Strategic Command, U.S. European Command, and U.S. Southern Command to evaluate a larger spectrum of cybersecurity related issues than is possible during a short exercise.  The CRCs included more frequent and focused assessment events, and they helped commands address persistent, mission-critical cybersecurity vulnerabilities.  To enable more threat-representative and longer-duration adversary portrayal, DOT&E initiated a Persistent Cyber Opposing Force (PCO) capability as part of U.S. Pacific Command’s CRC as well as at U.S. Northern Command.  DOT&E worked with U.S. Cyber Command to expand the use of PCOs to better understand and address our network vulnerabilities, to be more threat representative, and to allow more efficient use of limited cyber red team assets.  To support cybersecurity assessments of live DoD networks, DOT&E conducted lab-based cyber testing of cross-domain solutions (CDSs) and programmable logic controllers (PLCs).  These are critical components in many DoD systems and networks, and DOT&E’s testing resulted in recommendations to improve CDS and PLC security and test procedures.   Using personnel with advanced cybersecurity expertise, DOT&E conducted evaluations of a small number of offensive cyber capabilities in direct support of the capabilities’ sponsor.  DOT&E transmitted critical findings to DoD leadership along with recommended actions to improve DoD’s cybersecurity posture. DOT&E’s FY 2016 cybersecurity evaluations included trend analyses across prior year results, both within and across CCMDs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "80.772"
                                            },
                                            "Text": {
                                                "val": "Operational Test and Evaluation Oversight\n\nThis effort is in direct support of the Director’s Title 10 responsibilities and is a continuing effort.  Funding for FY 2017 provides Operational Test and Evaluation inputs for Test and Evaluation Master Plans, Test Plans, System Acquisition Reports, Defense Acquisition Executive Summary Reports for those programs designated for oversight by DOT&E and OUSD(AT&L).  Key elements of DOT&E oversight authority are identified in Calendar Year 2017 Office of the Secretary of Defense Test and Evaluation Oversight List. \n\nCybersecurity Evaluations \n\nDOT&E plans to sponsor approximately 10 CCMD and Service cybersecurity assessments and CRCs in FY 2017, each including a “fix” phase as described above.  DOT&E plans to continue working with the CCMDs and Services to develop multi-year plans for exercise cyber assessments and CRC events.  These plans will focus on assessing the CCMD or Service’s ability to complete missions in a contested cyber environment.  To support threat-representative assessments, and to enable continuous improvement of DoD’s cybersecurity posture, DOT&E will continue to work with U.S. Cyber Command to establish a PCO capability for all CCMDs and Services.  Primary objectives for DOT&E’s assessments in FY 2017 include the portrayal of advanced nation-state cyber threats and the assessment of operational missions during realistic cyber attacks.  DOT&E will assess Cyber Protection Teams when they participate during PCO, CRC or exercise events.  DOT&E will continue to develop techniques to efficiently and effectively assess offensive cyber capabilities, and conduct timely evaluations of these capabilities. DOT&E will use the DoD Enterprise Cyber Range Environment (DECRE) and other lab and cyber range assets to support events, for added threat realism. DOT&E will transmit critical findings to DoD leadership along with recommended actions to improve DoD’s cybersecurity posture.   FY 2017 evaluations will include trend analyses across prior year results, both within and across CCMDs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "83.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "83.503"
                                            },
                                            "Text": {
                                                "val": "Operational Test and Evaluation Oversight\n\nThis effort is in direct support of the Director’s Title 10 responsibilities and is a continuing effort.  Funding for FY 2018 provides Operational Test and Evaluation inputs for Test and Evaluation Master Plans, Test Plans, System Acquisition Reports, Defense Acquisition Executive Summary Reports for those programs designated for oversight by DOT&E and OUSD(AT&L).  Key elements of DOT&E oversight authority are identified in Calendar Year 2018 Office of the Secretary of Defense Test and Evaluation Oversight List. \n\nCybersecurity Evaluations\n\nDOT&E will oversee and resource approximately 10 CCMD and Service assessments in FY 2018, each including a “fix” phase.  Pending CCMD and Service agreement, DOT&E plans to conduct CRC events with all of the CCMDs and Services.  Each CRC will include frequent assessments focused on new cybersecurity technologies or procedures to address problems identified in prior assessments. CRCs will culminate in a capstone event during a major exercise that evaluates the cybersecurity of critical missions, as improved by the new technologies and procedures.  Using the PCO, DOT&E will continue to work with the CCMDs and cyber red teams to increase the portrayal of advanced nation-state cyber threats.  The goal is to have the majority of assessments in FY 2018 include advanced threats that stress critical missions.  DOT&E will assess Cyber Protection Teams when they participate during PCO, CRC or exercise events.  DOT&E will continue to develop techniques to efficiently and effectively assess offensive cyber capabilities, and conduct timely evaluations of these capabilities. DOT&E will use the DoD Enterprise Cyber Range Environment (DECRE) and other lab and cyber range assets to support events, for added threat realism.  DOT&E will transmit critical findings to DoD leadership along with recommended actions to improve DoD’s cybersecurity posture.   FY 2018 evaluations will include trend analyses across prior year results, both within and across CCMDs and Services.  In FY 2018 DOT&E will develop testing standards, policies, and practices for cyber payloads."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance Measure:  Percentage of required operational test planning documents, assessments, and reports applicable to acquisition programs on the OSD Test and Evaluation Oversight List and other special interest programs\/legacy systems that are completed and delivered to the appropriate decision makers on time.\nThe on-time completion rate was computed on the basis of the number of required products that were submitted within established time standards relative to the total number of such products that fell due during the fiscal year.  Products included in the measure include beyond low-rate initial production reports, Test Plans, and Test and Evaluation Master Plans for operational test and evaluation oversight as well as assessment plans, “quick look” reports, and final reports for the information assurance and interoperability testing associated with scheduled test events."
                        }
                    }
                }
            ]
        }
    }
}