{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-12",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603225D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint DOD\/DOE Munitions Technology Development"
        },
        "R1LineNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "73.850"
            },
            "PriorYear": {
                "val": "18.129"
            },
            "CurrentYear": {
                "val": "17.256"
            },
            "BudgetYearOne": {
                "val": "18.662"
            },
            "BudgetYearOneBase": {
                "val": "18.662"
            },
            "BudgetYearTwo": {
                "val": "18.775"
            },
            "BudgetYearThree": {
                "val": "18.935"
            },
            "BudgetYearFour": {
                "val": "19.241"
            },
            "BudgetYearFive": {
                "val": "19.645"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The JMP funds budgeted in this justification are matched dollar for dollar by DOE funds.  Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP seeks to develop technological advances in several munitions subject areas.  These include:  1) improved modeling and simulation tools for munitions design and evaluation, including evaluation of vulnerability and the design of insensitive munitions (IM), 2) novel experimental techniques and material property databases to support modeling and simulation, 3) higher power and safer explosives and propellants, 4) miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors, 5) design tools to enable development of higher performance warheads and weapons, such as penetrators, that are hardened against high impact loads, and 6) tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.  The supporting experimental research requires the development of new technologies related to the synthesis, processing, and characterization of advanced munition materials, components, and systems.  This involves energetic material research, new fuzing concepts, dynamic testing of munition materials, and advanced characterization including high-rate in-situ diagnostics.\n\nThe JMP is aligned with the Department's strategic plans and policies such as:\n\n•  Munitions for contingency operations, particularly for the reduction of unintended collateral effects.\n•  Reducing time and cost for acquisition of munitions.\n•  Rapidly transitioning science and technology (S&T) to support the warfighter in today’s conflicts.\n•  Establishing future core capabilities and maintaining our national S&T capabilities through joint investment and interagency cooperation and teaming.\n•  Aiding in recruiting and retaining high-caliber scientists and engineers at DoD S&T organizations.\n•  Developing advanced munitions technologies to support the increased role of conventional weapons to deter and respond to non-nuclear attack, as described in the Nuclear Posture Review report.\n•  Developing safer munitions that are compliant with IM standards to meet statutory and Department policy requirements.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers.  This community develops technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Munitions Technical Advisory Committee (TAC), which is comprised of over 25 senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCGs conduct semi-annual technical peer reviews of JMP projects and plans.  DoD Service laboratory technical experts lead each of the TCGs to ensure that the technologies under development address high-priority DoD needs.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP has a long history of successful transitions and significant Return on Investment (ROI).\n\n•  The JMP is the primary developer of high-performance structural mechanics computer codes used by DoD, and the primary source for transitioning these codes to the DoD.  JMP computational tools are critical to the development and support of DoD programs; a recent tabulation shows that well over 70 DoD programs have been supported by these DOE codes.  In FY 2014 it was projected by the High Performance Computing Modernization Program (HPCMP) that JMP-supported codes accounted for 82 percent of all HPCMP Central Processing Unit (CPU) hours, including virtually all HPCMP classified computing.  The Department expects this heavy reliance on DOE codes to continue for several reasons, including: preference for using DOE codes because they are export-controlled; DOE codes are scalable, incorporate multiphysics, and run on massively parallel computer systems; and the Department can obtain source codes to modify for individual Service needs.  A significant number of defense industrial contractors also use the DOE structural mechanics computer codes.\n     - The Army Armament Research, Development & Engineering Center (ARDEC) has stated that the DOE computer codes are now routinely used to design all new warheads.  The use of these tools has reduced the number of validation tests required for each new warhead from about five to one with concomitant cost and time savings.\n     - The Army Research Laboratory has used DOE computer codes to develop and deploy new armor solutions to Iraq and Afghanistan with unprecedented speed.\n     - CHEETAH, a standalone thermochemical computer code, is the most widely used code by DoD and defense contractors for predicting performance of energetic materials.\n     - The JMP-supported Arbitrary Lagrangian-Eulerian Three-Dimensional (ALE3D) code was used in a high-explosive press accident investigation which helped determine the root cause. The code was also utilized successfully in the M433E1 mortar bomb design, and has been used to assess blast effects on Unmanned Aerial Vehicles. \n     - The JMP-supported CTH and Sierra codes were used for the Air Force Massive Ordnance Penetrator (MOP) Quick Reaction Effort (QRC), and the Air Force Research Laboratory Conventional Survivable Ordnance Package (CSOP).\n•  New munitions’ case material and explosive fill technologies provide the warfighter with a lethal and low collateral damage capability.  These technologies have been transitioned to the Focused Lethality Munition variant of the Small Diameter Bomb, which is currently fielded.  The technologies were also the basis for a new GBU 129 weapon that has been developed to meet a Joint Urgent Operational Need requirement for a low-collateral MK-82 class weapon.  The GBU-129\/B received the 2014 William J. Perry Award from the Precision Strike Association, recognizing significant contributions to the development, introduction, or support of precision strike systems.\n•  The Joint Improvised Explosive Device Defeat Organization (JIEDDO) has supported applications of JMP technologies, including:  compact synthetic aperture radar (SAR) systems for counter-Improvised Explosive Device (IED) efforts; pre-deployment training of military personnel by DOE explosive experts on how to recognize feed stocks and processes for homemade explosives; and use of massively parallel, multiphysics computer codes to understand how explosive blast waves cause brain injury and how to mitigate these injuries.\n•  An erosive initiator technology developed under the JMP has been transitioned to the Services for use in selectable output weapons and self-destruct capabilities.\n•  A novel approach to controlling the sensitivity and therefore the initiability of explosives using microwave energy, as well two new, insensitive energetic materials have transitioned to development projects in the Joint IM Technology and Joint Fuze Technology Programs.\n•  Reliability analysis tools were used by Army Missile Command to assess Rolling Airframe Missile (RAM), Advanced Medium Range Air to Air Missile (AMRAAM), and Tube-launched, Optically-tracked, Wire command data-linked guided Missile (TOW).\n•  Robotic demilitarization processing systems were installed at several locations, including a system at Hawthorne Army Depot to recover copper shape charge liners, Comp A5, and grenade bodies. \n•  Characterization and analysis of the Army’s Excalibur fusible plug resulted in a savings of at least $2.000 million.\n•  The Mortar, Anti-Personnel, Anti-Materiel (MAPAM) projectile used the ViscoSCRAM (Statistical CRAck Mechanics)model for PBXN-110 to determine if flaws in production could safely be fired, potentially saving millions of dollars.  \n•  Provided Photonic Doppler Velocimetry (PDV) adaption technology to a number of DoD laboratories, including ARDEC and ARL.\n•  Materials and modeling technologies developed and demonstrated in the JMP are being transitioned to a variety of DoD Army programs including the Scalable Technology for Adaptive Response (STAR) Army Technology Objective (ATO), the Future Requirements of Enhanced Energetics for Decisive Munitions (FREEDM) program, and Advanced Warheads for Scalable Effects Munitions (AWSEM).  \n\nThe JMP also works with the Defense Ordnance Technology Consortium (DOTC) and the National Armaments Consortium (NAC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors.  In addition to the computer codes mentioned earlier, the JMP has transitioned case technology for low-collateral weapons, low-temperature co-fired ceramic technology for smaller, less expensive fuze electronic components, and erosive initiator technology for selectable effects weapons to defense industrial suppliers.\n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process.  The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the 31 current and two planned JMP projects require multi-year efforts and sustained, long-term investments to achieve success.\n\nThe JMP projects are divided into five technical focus areas:  1) Computational Mechanics and Material Modeling, 2) Energetic Materials, 3) Initiators, Fuzes, and Sensors, 4) Warhead and Penetration Technology, and 5) Munitions Lifecycle Technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.765"
                },
                "CurrentYear": {
                    "val": "17.256"
                },
                "BudgetYearOne": {
                    "val": "18.679"
                },
                "BudgetYearOneBase": {
                    "val": "18.679"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.129"
                },
                "CurrentYear": {
                    "val": "17.256"
                },
                "BudgetYearOne": {
                    "val": "18.662"
                },
                "BudgetYearOneBase": {
                    "val": "18.662"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.636"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.017"
                },
                "BudgetYearOneBase": {
                    "val": "-0.017"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.636"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.017"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.017"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 internal realignment reflects funding for higher Departmental priorities and requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P225"
                    },
                    "ProjectTitle": {
                        "val": "Joint DOD\/DOE Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "73.850"
                        },
                        "PriorYear": {
                            "val": "18.129"
                        },
                        "CurrentYear": {
                            "val": "17.256"
                        },
                        "BudgetYearOne": {
                            "val": "18.662"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.662"
                        },
                        "BudgetYearTwo": {
                            "val": "18.775"
                        },
                        "BudgetYearThree": {
                            "val": "18.935"
                        },
                        "BudgetYearFour": {
                            "val": "19.241"
                        },
                        "BudgetYearFive": {
                            "val": "19.645"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The JMP funds budgeted in this justification are matched dollar for dollar by DOE funds.  Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP seeks to develop technological advances in several munitions subject areas.  These include:  1) improved modeling and simulation tools for munitions design and evaluation, including evaluation of vulnerability and the design of insensitive munitions (IM), 2) novel experimental techniques and material property databases to support modeling and simulation, 3) higher power and safer explosives and propellants, 4) miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors, 5) design tools to enable development of higher performance warheads and weapons, such as penetrators, that are hardened against high impact loads, and 6) tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.  The supporting experimental research requires the development of new technologies related to the synthesis, processing, and characterization of advanced munition materials, components, and systems.  This involves energetic material research, new fuzing concepts, dynamic testing of munition materials, and advanced characterization including high-rate in-situ diagnostics.\n\nThe JMP is aligned with the Department's strategic plans and policies such as:\n\n•  Munitions for contingency operations, particularly for the reduction of unintended collateral effects.\n•  Reducing time and cost for acquisition of munitions.\n•  Rapidly transitioning science and technology (S&T) to support the warfighter in today’s conflicts.\n•  Establishing future core capabilities and maintaining our national S&T capabilities through joint investment and interagency cooperation and teaming.\n•  Aiding in recruiting and retaining high-caliber scientists and engineers at DoD S&T organizations.\n•  Developing advanced munitions technologies to support the increased role of conventional weapons to deter and respond to non-nuclear attack, as described in the Nuclear Posture Review report.\n•  Developing safer munitions that are compliant with IM standards to meet statutory and Department policy requirements.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers.  This community develops technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Munitions Technical Advisory Committee (TAC), which is comprised of over 25 senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCGs conduct semi-annual technical peer reviews of JMP projects and plans.  DoD Service laboratory technical experts lead each of the TCGs to ensure that the technologies under development address high-priority DoD needs.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP has a long history of successful transitions and significant Return on Investment (ROI).\n\n•  The JMP is the primary developer of high-performance structural mechanics computer codes used by DoD, and the primary source for transitioning these codes to the DoD.  JMP computational tools are critical to the development and support of DoD programs; a recent tabulation shows that well over 50 DoD programs have been supported by these DOE codes.  For FY 2014 it is projected by the High Performance Computing Modernization Program (HPCMP) that JMP-supported codes will have accounted for 82 percent of all HPCMP Central Processing Unit (CPU) hours, including virtually all HPCMP classified computing.  The total CPU hours represents an eight-fold increase from FY 2012.  The Department expects this heavy reliance on DOE codes to continue for several reasons, including: preference for using DOE codes because they are export-controlled; DOE codes are scalable, incorporate multiphysics, and run on massively parallel computer systems; and the Department can obtain source codes to modify for individual Service needs.\n     -  A significant number of defense industrial contractors also use the DOE structural mechanics computer codes.\n     -  Cheetah, a standalone thermochemical computer code, is the most widely used code by DoD and defense contractors for predicting performance of energetic materials.\n     -  The Army Armament Research, Development & Engineering Center (ARDEC) has stated that the DOE computer codes are now routinely used to design all new warheads.  The use of these tools has reduced the number of validation tests required for each new warhead from about five to one with concomitant cost and time savings.\n     -  The Army Research Laboratory has used DOE computer codes to develop and deploy new armor solutions to Iraq and Afghanistan with unprecedented speed.\n•  New munitions’ case material and explosive fill technologies provide the warfighter with a lethal and low collateral damage capability.  These technologies have been transitioned to the Focused Lethality Munition variant of the Small Diameter Bomb, which is currently fielded.  The technologies were also the basis for a new GBU 129 weapon that has been developed to meet a Joint Urgent Operational Need requirement for a low-collateral MK-82 class weapon.  The GBU-129\/B received the 2014 William J. Perry Award from the Precision Strike Association, recognizing significant contributions to the development, introduction, or support of precision strike systems.\n•  The Joint Improvised Explosive Device Defeat Organization (JIEDDO) has supported applications of JMP technologies, including:  compact synthetic aperture radar (SAR) systems for counter-Improvised Explosive Device (IED) efforts; pre-deployment training of military personnel by DOE explosive experts on how to recognize feed stocks and processes for homemade explosives; and use of massively parallel, multiphysics computer codes to understand how explosive blast waves cause brain injury and how to mitigate these injuries.\n•  The JMP-supported CTH and Sierra codes were used for the Air Force Massive Ordnance Penetrator (MOP) Quick Reaction Effort (QRC), and the Air Force Research Laboratory Conventional Survivable Ordnance Package (CSOP).\n•  An erosive initiator technology developed under the JMP has been transitioned to the Services for use in selectable output weapons and self-destruct capabilities.\n•  A novel approach to controlling the sensitivity and therefore the initiability of explosives using microwave energy, as well two new, insensitive energetic materials have transitioned to development projects in the Joint IM Technology and Joint Fuze Technology Programs.\n•  Reliability analysis tools were used by Army Missile Command to assess Rolling Airframe Missile (RAM), Advanced Medium Range Air to Air Missile (AMRAAM), and Tube-launched, Optically-tracked, Wire command data-linked guided Missile (TOW).\n•  Robotic demilitarization processing systems were installed at several locations, including a system at Hawthorne Army Depot to recover copper shape charge liners, Comp A5, and grenade bodies. \n•  Characterization and analysis of the Army’s Excalibur fusible plug resulted in a savings of at least $2.000 million.\n\nThe JMP also works with the Defense Ordnance Technology Consortium (DOTC) and the National Armaments Consortium (NAC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors.  In addition to the computer codes mentioned earlier, the JMP has transitioned case technology for low-collateral weapons, low-temperature co-fired ceramic technology for smaller, less expensive fuze electronic components, and erosive initiator technology for selectable effects weapons to defense industrial suppliers.\n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process.  The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the 33 current JMP projects require multi-year efforts and sustained, long-term investments to achieve success.\n\nThe JMP projects are divided into five technical focus areas:  1) Computational Mechanics and Material Modeling, 2) Energetic Materials, 3) Initiators, Fuzes, and Sensors, 4) Warhead and Penetration Technology, and 5) Munitions Lifecycle Technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Computational Mechanics and Material Modeling"
                                    },
                                    "Description": {
                                        "val": "Projects in this technical focus area develop physics-based computational tools, material models, and calibration and validation databases that support the design and development of weapon systems.  These capabilities are intended to predict the complex phenomena across significant length, meso to continuum, and time, microsecond to minute, scales.  The tools will provide coupled, multi-physics and chemistry modeling capabilities that are scalable to massively parallel architectures for solving very diverse problems across the weapons systems’ research and development and acquisition communities.  Numeric tools are the foundation that makes possible the integration of mechanics, materials science, physics, and chemistry.  This focus area also includes an extensive experimental component consisting of either:  1) phenomenological or “discovery” experiments that provide the physics basis for model development, 2) experiments directly coupled to model development and application, such as characterization, calibration, and validation experiments, or 3) the development of advanced test methods or device development.\n\nThe specific projects in computational mechanics and material modeling are:\n-  CTH shock physics and Sierra\/Solid Mechanics (SM) codes & model development and supporting experiments.\n-  Arbitrary Lagrangian-Eulerian Three-Dimensional (ALE3D) code and model development.\n-  Composite case technology and modeling\n-  Dynamic properties of materials, modeling and validation\n-  Energetic materials and polymers under dynamic and thermal loading\n-  Fragment impact and response experiments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.453"
                                            },
                                            "Text": {
                                                "val": "-  Produced and distributed the Final Report on experimental quantification of microstructure, interfaces, and damage in relation to mechanical behavior for energetic materials.\n-  Transitioned Glassy Amorphous Polymer (GAP) Damage model to DOE code teams.\n-  Coupled Fast Fourier Transform (FFT) and\/or ViscoPlasticSelfConsistent (VPSC) models with Damage Evolution implemented in ALE3D for use by DoD community in calculations requiring efficient treatment of plasticity.\n-  Completed meso-scale study of stress conditions and statistics of loading in the vicinity of grain boundaries for DoD tantalum (Ta).\n-  Enhanced High-Energy Diffraction Microscopy (HEDM) capability to larger plastic deformation.\n-  Incorporated Thermal\/Equation of State (EOS) data in material model parameter database.\n-  Enabled 2D corner turning in Detonation Shock Dynamics (DSD) code.\n-  Tested and modeled damping response in composite specimens.\n-  Minimum Signature Propellant-1 (MSP-1) characterized for Reactive Flow Model(s) and analysis of Army Burn-to-Violent-Reaction (ABVR) test and integrated experiments were conducted.\n-  Over-driven EOS and sound speed experiments conducted on relevant energetic materials using two-stage or three-stage gun.\n-  Demonstration of Uncertainty Quantification (UQ) Capabilities in Sierra coupled codes through integration with the Sierra User Interface were conducted.\n-  CTH versions 11.3 and 12.0 were released.  Incorporated exascale improvements in version 12.0.\n-  Characterization and modeling of shock propagation in existing composite models for ALE3D, fit to Sandia National Laboratories (SNL) data were performed.\n-  Tested and modeled the damping response of composite specimens.\n-  Developed a 6-axis winder capable of changing angle at mid-length and printing with filament.\n-  Demonstrated Multiple-Impact fragment impact capability.\n-  Impact heated Plastic Bonded eXplosive (PBX) 9502 targets using a 0.5 inch flat projectile were tested.\n-  Developed the capability to launch concave fragments.\n-  Tested targets of interest using multiple impact points.\n-  Applied existing robust hydrodynamic flow modeling capability to find the spectrum of impact definitions that are expected to lead to Mach stem initiation.\n-  Designed and conducted new experiments to further validate or refine the Generalized Initiation Criterion.\n-  Characterize Minimum Signature Propellant (MSP) for Reactive Flow model and analysis of Army Burn-to-Violent Reaction (ABVR) tests were performed.\n-  Assessed performance of 2D embedded zone performance against 316L Stainless Steel (SS) test data and proposed next technology steps.\n-  Completed Fast Fourier Transfer-based non-local plasticity models and micro-inertia effects tests.\n-  Completed meso-scale study of stress conditions and statistics of loading in the vicinity of grain boundaries for DoD Tantalum.\n-  Selected appropriate pathways for introducing CartaBlanca to the DoD user community.\n-  Released ALE3D v4.26, with numerous capability enhancements and improvements to usability.\n-  Performed experiments utilizing HEDM+tomography to characterize incipient void nucleation and growth in Ti; validated results against crystal-scale damage mechanics model.\n-  Reported strain rate dependent strength data in compression and shear collected on specimens representative of system response.\n-  Characterized and modeled shock propagation using existing composite models in ALE3D (ysmodel 140), with fit to SNL-provided data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.197"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate concave projectile fragment capability by firing into heated and ambient PBX 9502.\n-  Decision gate whether to continue to pursue a Generalized Initiation Criterion.\n-  Perform over-driven EOS and sound speed experiments on relevant energetic materials using two-stage or three stage gun.\n-  Demonstrate three-dimensional solid extended finite element (XFEM) fracture capabilities\n-  Release CTH Version 11.3 with next-generation platform improvements.\n-  Provide equation of state data on glass fiber reinforced polymer material.\n-  Simulate a projectile penetration event that can exhibit multiple modes of failure, such as plugging and shear bands.\n-  Develop three-dimensional formulation of the two-component localization model for use in 3D fragmentation problems where adiabatic shear banding is dominant.\n-  Complete experimental suite to quantify nucleation and growth behavior of adiabatic shear bands in 316L SS, transition to targeted light source experiments.\n-  Complete grain boundary model for use in both meso-scale theory as well as to motivate macro-scale porosity based damage model.\n-  Continue development of CartaBlanca code for failure and fragmentation problems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.542"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.542"
                                            },
                                            "Text": {
                                                "val": "-  Continue development of CartaBlanca code for failure and fragmentation problems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetic Materials (EM)"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new Energetic Materials (EMs) and supporting technologies to satisfy the competing requirements for smaller, more lethal, and safer munitions.  Work is primarily focused on explosives, gun and rocket propellants, and, to a lesser extent, pyrotechnics.  The projects include development of: 1) new EMs, including new molecules in a range of particle sizes and morphologies, 2) new EM formulations, 3) a fundamental understanding of energetic properties and performance, and 4) computational tools for analysis of performance and sensitivity.  New materials and formulations are developed with the recognition that costs must be reasonable, chemical feed stocks reliable, and manufacturing processes suitable for scale-up to production levels.\n\nBoth Federal statute and Department policy direct the development of safer, less sensitive munitions.  Making munitions less sensitive while maintaining explosive or propellant performance is a difficult challenge.  This goal is best attained through a combination of new EM development, EM characterization, and more sophisticated modeling and simulation tools.  It is cost prohibitive to qualify weapons for compliance with insensitive munitions requirements through testing alone.  A better, and in many cases the only means, to qualify these weapons is with the combination of analysis based on validated computational tools and a few well-designed tests.\n\nThe Department also needs munitions that provide selectable effects.  To achieve these effects, weapons designers need to thoroughly understand the performance of EMs used in both the main weapon fill and the initiation systems.  Distributed fuzing systems can provide selectable effects as well as safer munitions, but such complex, small-scale systems require more complete knowledge of EM detonation physics and in some cases, new EMs designed for this application.\n\nThe desire for smaller and lighter munitions is driven in part by the increasing dependence on unmanned weapons platforms and to some extent by the need to reduce logistical burden, especially energy consumption.  New EMs are needed to meet the munitions weight and size requirements while maintaining lethality, effects, and safety.\n\nThe Department is working to increase the range and velocity of weapons and to develop weapons against hardened targets.  These applications subject EMs to high accelerations and shock loads.  To support the development of these new systems, we need to improve our ability to model EM under higher impact loads and to characterize relevant properties to determine their ability to survive in these aggressive environments.  DoD may also need to develop new, more robust EMs that survive impact loads while maintaining lethality and initiability.\nTCG-III is also a forum for the exchange of information on new energetic materials, their performance and sensitivity characteristics, and physical models that can be used to predict the behavior of energetics under adverse and unplanned conditions.  It is a venue in which collaboration opportunities can be identified to facilitate the transition of technology developed in the DOE to the DoD.\n\nThe specific projects in the energetic materials technical focus area for FY16 are:\n-  Synthesis, properties, and scale-up of new energetic compounds.\n-  Insensitive munitions and surety.\n-  Cheetah thermochemical code development and experiments.\n-  Micro- and nano-energetics synthesis and initiation.\n-  Hazards analysis of energetic materials.\n-  Reactive processes in energetic materials.\n-  Development of tools for energetic material performance characterization.\n-  Explosives chemistry and properties, and new energetic materials formulation.\n-  Thermal response of energetic materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.815"
                                            },
                                            "Text": {
                                                "val": "-  Scaled-up the synthesis of Landau Level Mixing, (LLM): LLM-227 and LLM-228 to the 10-gram scale.\n-  Synthesized and characterized new tri-, quadri-, and pentacyclic oxadiazoles as both high-power and insensitive target molecules.\n-  Published best available models and Sandia Instrumented Thermal Ignition (SITI) data for pressure dependence and gas generation rates of thermal decomposition of a representative MSP and PBX 9501.\n-  Performed heat of formation measurements on LLM-200, 223, and 215.\n-  Published results of characterization of damage evolution of PBX 9502 and AP propellant, including permeability as a function of temperature history.\n-  Experimentally correlated burn rates to thermal damage state and published results.\n-  Completed MSP1 characterization for unknown-to-detonation transition (XDT) model parameterization.\n-  Benchmarked cook-off violence model of HMX-based PBX using thermal-damage burn-rate with sub-scale experiments.\n-  Completed mesoscale sensitivity study to determine key factors for shock initiation response in HMX-based explosive.\n-  Completed Technology Handbook design, installed on server, and loaded database with new LLNL molecules that have been tested.\n-  Delivered first kinetics tool for non-ideal EMs front curvature.\n-  Systematically evaluated and improved code predictions at low Pressure\/high Temperature for specific impulse and impetus predictions by expanding library of gaseous and condensed products available for such calculations.\n-  Developed and implemented a consistent ionic thermodynamics capability to improve equation of state (EOS) and speciation predictions for all energetic materials.\n-  Developed post-detonation carbon kinetics models for conventional and insensitive high explosives. Tested and validated against small scale experiments.\n-  Developed Cheetah thermochemistry for major metallic additives, and other relevant elements and compounds, (e.g., oxides, fluorides, nitrides, carbides, and borides) to enable thermochemical predictions for elementally rich formulations.\n-  Reported on deposition, microstructure and initiation properties deposited HNS.\n-  Demonstrated small-scale flash radiography of research detonators. \n-  Full dynamic radiographic comparison of Composition B (CompB) and IMX 104 explosives was conducted."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.478"
                                            },
                                            "Text": {
                                                "val": "-  Synthesis of new cyclic, planar structures consisting of imidazole or pyazole arrays.\n-  Publish results of characterization of damage evolution of gun propellants.\n-  Benchmark Spiral 1 MSP1 HERMES\/XDT with cylindrical ABVR experiments.  Perform pre-test predictions for analog rocket motor fragment impact tests.\n-  Perform X-ray measurements of burn-rates and DDT.\n-  Deliver second kinetics tool for non-ideal EM’s, possibly initiation behavior.\n-  Integrate CHEETAH code capabilities to facilitate exploratory calculations (e.g., constant volume explosions at user specified conditions, EOS tables for hydro simulations, and multiple constraints on formulation performance).\n-  Perform experiments on milling technique for nanomaterial production.\n-  Report on aging of PBXN-103 underwater explosive formulation.\n-  Report on first use of Lattice Boltzmann and\/or Kinetic Monte Carlo Methods to model multiscale reaction processes.\n-  Perform sensitivity testing of energetic binder candidates.\n-  Mechanistic determination of the insensitivity of TATB-based formulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.837"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.837"
                                            },
                                            "Text": {
                                                "val": "-  Mechanistic determination of the insensitivity of TATB-based formulations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Initiators, Fuzes, and Sensors"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new materials, components, diagnostic techniques, and modeling and simulation tools for fuzing systems.  Initiators, fuzes, and sensors must work reliably together to prevent unintended detonation, to correctly detect intended targets, and to initiate detonation when required.  Projects in this focus area support the Department’s needs to miniaturize fuzing systems.  Smaller systems are required for several reasons including: 1) compatibility with smaller and lighter weapons systems, 2) trading volume in munitions for other components such as additional explosives, higher energy and power density power sources, or enhanced guidance systems, 3) increasing reliability through redundancy, for example, using of two or more smaller initiating systems, and 4) upgrading existing sub-munitions with smarter and more reliable fuzing systems. \n\nThe miniaturization of fuzing systems requires new material and components, new power systems, new diagnostic techniques, and improved modeling tools for microdetonics.  The Department also needs weapons systems with selectable effects, and these effects may be achieved with multi-point initiation systems.  Such systems are inherently more complex and require improved characterization of initiator materials and components, as well as more sophisticated modeling and simulation tools.  To attain greater precision and to avoid unintended collateral effects when weapons are used in the complex environment of counter-insurgency or counter-terrorist operations, target sensors must be reliable and provide high-fidelity discrimination.  Projects in this focus area are developing technologies to achieve this level of performance in compact packages.\n\nThe specific projects in the initiators, fuzes, and sensors technical focus area are:\n-  Firing Systems Technology, comprising FireMod firing set code model development and validation, 1.6 hazard classification detonator development, and initiation and detonation physics on the millimeter scale.\n-  Safe, Arm, Fuze and Fire Technology, comprising Initiation and Detonation, and Advanced Firing System Components.\n-  Advanced Initiation Systems, comprising diagnostics development, microdetonics, miniature initiation systems, and detonators for enhanced safety.\n-  Thermal Battery Performance Modeling to develop a multi-physics modeling capability for thermal batteries.\n-  Thin Film Thermal Batteries (new start in FY 2015) to develop, mature, and transition a method to produce a thin, conformal, low-cost thermal battery.\n-  Vertical-Cavity Surface-Emitting Laser (VCSEL) sensors for proximity fuzing of munitions.\n-  Enabling Robust, Mode-Agile GPS-Denied Weapon Guidance through High-Efficiency Data Processing (new start in FY 2015)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.510"
                                            },
                                            "Text": {
                                                "val": "-  Designed Probabilistic Shock Threshold Criterion (PSTC) Validation Experiments to demonstrate validity in arbitrary shock analysis, (e.g., Taylor wave and fragment impact).\n-  Analysis and theoretical model of wave divergence using PSTC was conducted.\n-  Performed low-fidelity ignition characterization in small array configuration to verify feasibility.\n-  Completed ignition characterization of one DoD, and one DOE EM using medium array (36 samples) combinatorial design.\n-  Collected validation data for reactive burn and equation of state models via small-scale shock experiments.\n-  Demonstrated 500mA\/cm2 with <0.5V polarization in thin-film thermal battery against pellet anode and cathode at 525C.\n-  Demonstrated 1.8V operation at 100mA\/cm2 in thin-film thermal battery against coated separator and cathode at 525C.\n-  Transitioned the next version of the TABS software (TABS-SC v4) that will include the capability to perform coupled thermo-poro-mechanical and thermo-electrochemical simulations in a single-cell axisymmetric configuration.  \n-  Planned for experiments required to validate coupled models at the battery scale.\n-  Performed Floret experiments on LX-21 explosive.\n-  Assessed efficacy of laser initiation of HMX explosive.\n-  Collected spot-size data to extend James Model to account for area effect in LX-16 explosive.\n-  Collected data for assessment of bridge material equations of state and conductivity tables.\n-  Characterized the performance of nano-TATB (triaminotrinitrobenzene).\n-  Report on ALEGRA Lagrangian code simulations of Exploding Foil Initiator (EFI) validation data published and distributed to the Air Force Research Laboratory.\n-  Built prototype 200nF (nanofarad) multilayer glass capacitors that can withstand 2000 Vdc (Volts Direct Current).\n-  PIV (Particle Imaging Velocimetry) diagnostic capability was completed.\n-  Fabricated custom Si Avalanche PhotoDetectors (APDs) optimized for low-voltage performance and integration for the Photonic Proximity Fuze (PPF) sensor.\n-  Prepared report summarizing GPS-denied sensor parameter space coupled with customer weapons guidance requirements.  \n-  Outline of proposed GPS-denied processor architectures with reduced size, weight, and power (SWaP) was completed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.699"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate 1.2V operation of thin-film thermal battery at 500mA\/cm2 in coated configuration.\n-  Complete implementation of insulation mechanical model and parameter fitting based on experimental data.\n-  Expand Thermally Activated Battery Simulator (TABS) thermal material database with properties for thin film thermal battery materials, add active insulation capability to the TABS interface, and publish instructions to build and run a 3D thermal model.\n-  Demonstrate validated fully-coupled thermo-poro-mechano-electrochemical single cell battery model.\n-  Demonstrate model of full magneto hydrodynamic (MHD) slapper-initiating explosive train with predicted reliability, incorporating ALE3D.\n-  Perform output characterization, large array (>80 samples).\n-  Demonstrate an integrated modeling tool for detonator explosive performance. \n-  Determine breakdown mechanisms in multilayer glass capacitors (MLGCs) and eliminate defect formers identified during prototype capacitor construction.\n-  Demonstrate MLGC integration into micro fireset.\n-  Micro-optic development, including new designs for detector collector lenses in addition to new VCSEL emitters.\n-  Deliver initial GPS-denied sensor hardware prototype and associated radar guidance software to DoD customer for evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.830"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.830"
                                            },
                                            "Text": {
                                                "val": "-  Deliver initial GPS-denied sensor hardware prototype and associated radar guidance software to DoD customer for evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warhead and Penetration Technology"
                                    },
                                    "Description": {
                                        "val": "This focus area supports the development of new warheads and penetrator weapons through advances in materials processing and characterization, instrumentation, and computational codes.  Significant increases in warhead performance are directly attributed to our ability to understand and accurately model the physics and fine details of new warhead designs, and to advances in increasingly sophisticated material processing.  The Department’s requirement to achieve more precise weapon effects with minimum collateral damage is supported by work on controlled fragmentation, non-fragmenting warhead cases, and multiphase blast explosives (MBX).  More recently, increases in performance and reductions in vulnerability are being achieved through improved warhead integration into munitions using a systems-oriented approach. \n\nThe goals for penetrator weapons are to investigate, develop, and transition advanced technologies for the design, development, and performance assessment of the next generation of high performance, precision strike weapons.  This effort directly supports national initiatives to defeat hard and deeply buried targets, which are proliferating worldwide, and to deny\/defeat weapons of mass destruction.  The work addresses high-velocity penetration into granular materials (sand and soil), penetration into advanced high-strength and ultra-high-performance concretes, new penetrator materials and designs, and non-inertial onboard instrumentation.\n\nThe specific projects in the warhead and penetration technology focus area for FY16 are:\n-  Multiphase blast munitions (MBX) technology.\n-  Dynamic behavior of concrete. (New start in FY16)\n-  Integrated munitions modeling & experimentation.\n-  Modeling of strategic structures subject to ballistic impact or blast.\n-  Concrete perforation and penetration modeling and experiments.\n-  Explosive\/metal interactions.\n-  Structure, mechanical & shock-loading response, and modeling of materials.\n-  Controlled effects warhead materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.214"
                                            },
                                            "Text": {
                                                "val": "-  Developed ALE3D version of multiphase model with improved and validated detonics capability informed by Meso-scale simulations.\n-  Microstructural and constitutive property comparison of wrought vs. Additive Manufacturing-fabricated candidate metals and alloys was conducted.\n-  Investigated powder bed printing parameters and identified suitable infiltration candidates for preformed frags, skin lattices, and structural energetics.\n-  Completed oblique HE-driven shock hardening & damage microstructural quantification on Tantalum on flat and curved plate samples to quantify the joint effects of obliquity and curvature.\n-  Conducted plate penetration experiments using Taylor-Anvil Facility.\n-  Conducted sphere extrusion testing on “Nano-crystalline” Copper-Alloys and Copper-Tantalum alloys.\n-  Verified Tensile Plasticity (TEPLA) implementation into CartaBlanca and compare improved representation of plate impact response to Lagrange code representation.\n-  Evaluated debris-free fragmentation modeling.\n-  Issued report on technology gaps for interface models.\n-  Completed validation tests of gyro sensor.\n-  Implemented improvements into CTH-MPM-Multi-field model for penetration.\n-  Completed probabilistic studies of projectile penetration\/perforation.\n-  Completed transition of Peridynamics technology to Sierra\/SM code."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.063"
                                            },
                                            "Text": {
                                                "val": "-  ALE3D version of MBX model with validated key particulate plume transport physics, drag model and surface instabilities, through use of experiments.\n-  Exercise ALE3D MBX capability to interact with complex (failing) targets.\n-  Quasi-static and dynamic characterization of lattice structures.\n-  Direct numerical simulations of architected structures under dynamic loading.\n-  Development of constitutive models for Additive Manufactured (AM) microstructures and homogenization for lattice structures.\n-  Design, print, and infill suitable architectures for dynamic compression.\n-  Complete oblique HE driven shock hardening and damage microstructural characterization on Zirconium\/Titanium and Copper\/Lead alloys.\n-  Transition updated materials databases and materials models.\n-  Utilize Dynamic Tensile-Extrusion experimental facility, diagnostics, and modeling to support warhead material validation and complete shear localization studies of relevant warhead materials.\n-  Calculate the flat-plate oblique shock experiment performed on Tantalum and compare results with experimental data and recovered sample metallography.  Make observations about improvement needed to the material model and computational code.\n-  Calculate the curved-plate oblique shock experiment performed on Tantalum and account for improvements made vice the flat-plate configuration.  \n-  Issue report on impact energy transfer across threaded interfaces.\n-  Implement material failure models into CTH-Multipoint Method-Multi-field code.\n-  Implement improved user interface into the Peridynamics-Multiscale (PDMS) code."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.261"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.261"
                                            },
                                            "Text": {
                                                "val": "-  Implement improved user interface into the Peridynamics-Multiscale (PDMS) code."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Lifecycle Technologies"
                                    },
                                    "Description": {
                                        "val": "This focus area supports improving the Department’s ability to understand measure, predict, and mitigate safety and reliability problems caused by materials aging and degradation in weapons systems.  Current stockpile assessment methods typically focus on addressing materials aging and reliability problems after they occur, rather than anticipating and avoiding future problems or failure mechanisms.  The overall objective of this work is to develop a toolset of computational models that are able to quantitatively predict materials aging processes and ultimately improve the long-term reliability of weapons systems, subassemblies, and\/or components.  These objectives are achieved by identifying aging mechanisms, quantifying the rates at which those aging mechanisms occur, developing predictive models, and using these models to predict the munitions stockpile reliability.  An additional objective of this work is to develop technologies and methodologies to enable munitions health management and condition-based maintenance.\n\nThe specific projects in the munitions lifecycle technologies focus area are:\n-  Predictive Materials Aging, including solder interconnect reliability, corrosion of electronics, and adhesive degradation.\n-  Microelectromechanical systems (MEMS) reliability.\n-  Military use of commercial off-the-shelf (COTS) electronics.\n-  Complex system health assessment.\n-  Physical\/chemical reactive transport modeling of material\/system aging and reliability.  (New start in FY16)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.137"
                                            },
                                            "Text": {
                                                "val": "-  Completed Package-on-Package-on-Package (PoPoP) experiments (data collection and analysis).\n-  Expanded the Package-on-Package PoP model to include PoPoP.\n-  Assessed flash layer approach to tin whisker mitigation.\n-  Generalized success model for use in other circuits.\n-  Validated the most promising tin whisker mitigation methods in actual operating environments.\n-  Refined predictions of adhesive failure: napkin ring tests to identify additional parameters necessary for predictive model (e.g., cure, thermal, and\/or dynamic loadings).\n-  Performed and reported results on principle component analysis (PCA) of data generated from MEMS Gyroscope testing.\n-  Released to the DoD early prototype of physics-based lifetime predictive model based on physics-of-failure (PoF) approach.\n-  Developed methodology to compare sub-population characteristics and reliability\n-  Created software tools for integration Prognostics and Health Monitoring (PHM) and System Assessment (SA) methodologies and strategies, software and documentation.\n-  Simulated 3D multi-material aging experiments and executed 3D validation experiments, on DOE-relevant materials.\n-  Down selected DoD-relevant materials and worked through logistics to obtain samples for subsequent testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.819"
                                            },
                                            "Text": {
                                                "val": "-  Transition tin whisker mitigation to commercial plating houses.\n-  Transition first principles (Dynamic recrystallinzation) tin whisker mitigation methods to industry.\n-  Demonstrate roll-up of bondpad & connector corrosion models to predict system performance \/ reliability.\n-  Validate predictions of adhesive degradation in humid environments in a unique geometry: smooth stainless steel surfaces.\n-  Develop Accelerated Aging MEMS protocol\/statistically-based model.\n-  Experimentally characterize and model the physical-chemical aging response of one to three DoD material(s), dependent on complexity of mechanism.\n-  Intermediate delivery of compact lifetime predictive models to the DoD customer. \n-  Validate the most promising tin whisker mitigation methods in actual operating environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.192"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.192"
                                            },
                                            "Text": {
                                                "val": "-  Validate predictions of adhesive degradation in humid environments in a unique geometry: smooth stainless steel surfaces."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1.  Transition of technologies developed by the Joint DoD\/DOE Munitions Technology Program are tracked and documented.  In FY 2015 there were over 50 transitions to DoD weapons programs and personnel.\n2.  Attendance and technical interactions at the semiannual meetings of the eight Technology Coordinating Groups (TCGs) are tracked and documented.\n3.  Laboratory Five-Year Plans are prepared, evaluated, and analyzed by management and technical staff.\n4.  TCG Chairmen's Annual Assessments for each TCG are critically reviewed by the Technical Advisory Committee (TAC) to determine progress, validate transition plans, and verify relevance of each project.\n5.  Project progress toward goals and milestones is assessed at each biannual TCG meeting and critically reviewed annually by the TAC.\n6.  Annual technical reports, papers, and presentations are tracked and documented."
                        }
                    }
                }
            ]
        }
    }
}