{
    "id": "2018-Navy-PB-1319-JBOOK-a90deec0cc3550b6cbaca862df579377c9c386cf1392b0eedba7fcb7f4474588-1",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604258N"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineNumber": {
            "val": "172"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "58.730"
            },
            "CurrentYear": {
                "val": "36.662"
            },
            "BudgetYearOne": {
                "val": "23.053"
            },
            "BudgetYearOneBase": {
                "val": "23.053"
            },
            "BudgetYearTwo": {
                "val": "26.504"
            },
            "BudgetYearThree": {
                "val": "24.731"
            },
            "BudgetYearFour": {
                "val": "23.160"
            },
            "BudgetYearFive": {
                "val": "23.186"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds the development of Aerial Target Systems, Unmanned Aerial Vehicle targets, Sea Surface Target Systems, Target Control systems, and associated Target Mission Support Systems, Target Threat Simulation Program and Target Augmentation and Auxiliary Systems required to simulate real world threats.  These capabilities are required to execute developmental\/operational test and evaluation of naval combat weapon systems and to satisfy advanced fleet training requirements while ensuring the Navy continues to develop threat simulations of emerging threat requirements. \n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST AND EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "71.152"
                },
                "CurrentYear": {
                    "val": "36.662"
                },
                "BudgetYearOne": {
                    "val": "1.296"
                },
                "BudgetYearOneBase": {
                    "val": "1.296"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "58.730"
                },
                "CurrentYear": {
                    "val": "36.662"
                },
                "BudgetYearOne": {
                    "val": "23.053"
                },
                "BudgetYearOneBase": {
                    "val": "23.053"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-12.422"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "21.757"
                },
                "BudgetYearOneBase": {
                    "val": "21.757"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-11.015"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.407"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "21.900"
                                },
                                "BudgetYearOneBase": {
                                    "val": "21.900"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.143"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.143"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2018 funding request was reduced by $2.000 million to account for the availability of prior year execution balances.\n\nIn FY 2018, Aerial Target System Development was increased by $8.400M to fund the Supersonic and Subsonic Target platforms, Target Threat Simulation Program and Target Mission Support Systems program.  This increase restores the non-MSST related RDT&E funding for those other programs. \n\nFY 2018 was increased by another $15.500M to fund the QF-16 program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0609"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Target System Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "33.151"
                        },
                        "CurrentYear": {
                            "val": "11.310"
                        },
                        "BudgetYearOne": {
                            "val": "6.345"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.345"
                        },
                        "BudgetYearTwo": {
                            "val": "9.765"
                        },
                        "BudgetYearThree": {
                            "val": "7.963"
                        },
                        "BudgetYearFour": {
                            "val": "7.261"
                        },
                        "BudgetYearFive": {
                            "val": "7.460"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of the Aerial Target Systems Development program is the design and development of threat representative subsonic and supersonic aerial targets that simulate threat weapon systems, threat aircraft or threat Unmanned Aerial Vehicles.  In addition to representative air vehicles, this includes development of Target Control (TC) systems, and associated Target Augmentation and Auxiliary Systems (TA\/AS) which are used to replicate specific threats.  Targets and auxiliary payloads are developed to support test and evaluation of combat systems required to defend fleet surface and air units in a hostile environment.  As to specific hardware development, this project includes:\n\n - Supersonic Targets: GQM-163A Supersonic Sea-Skimming Target (SSST) and GQM-173A Multi-Stage Supersonic Target (MSST) program.  Supersonic targets represent supersonic anti-ship cruise missile threats.  The design and development of GQM-163A capabilities provide threat representative targets that are used in direct support of Developmental Test and Evaluation, Operational Test and Evaluation, and Live Fire Test and Evaluation of major combat weapons programs and, to a lesser degree, support fleet training.  Critical live-fire Test and Evaluation events are supported for AEGIS, DDG-1000, LHA-6, CVN-78, LCS, and LSD-41\/49 (SM-6, SM-2, RAM, SSDS, and ESSM).  GQM-163A is a non-recoverable supersonic sea skimming aerial target, capable of speeds in excess of Mach 2.5 and cruise altitudes from 13.0 to 66 ft.  The GQM-163A has also demonstrated a capability to perform a higher altitude diving threat profile.  Funding was also provided for closing out the GQM-173A (MSST) program.  MSST was a supersonic development effort that was terminated on September 25, 2015.  Remaining funds are planned to cover settlement costs.\n\n - Subsonic Targets: BQM-177A Subsonic Aerial Target (SSAT) development primarily represents subsonic anti-ship cruise missile threats, replacing legacy BQM-74E targets with a modernized subsonic target with increased capabilities.  The BQM-177A SSAT provides threat representation for developmental and operational test & evaluation events of major combat weapons systems programs and in support of fleet training events.  Specifically, the BQM-177A SSAT provides critical live-fire test and evaluation events for AEGIS, SM-6, SM-2, RAM, and ESSM.\n\n - Target Threat Simulation Program (TTSP), Target Mission Support Systems(TMSS), and Target Control and Target Augmentation and Auxiliary Systems (TC\/TA\/AS) development: The TTSP provides the payload equipment required to electronically enhance aerial targets to provide threat representative radio frequency signatures, specifically the electronic attack and threat radar emissions (active emitters).  TC provides command and control of targets to enable the execution of threat-representative mission profiles.  The mission also includes the design, development and qualification of various TMSS including but not limited to: scalar scorers, scoring ground station, telemetry antennas, radar and locator beacons, identification, friend or foe, and associated test sets.  TA\/AS enables each target to be uniquely configured for specific mission profiles and provide high fidelity simulation of foreign threats.  TA\/AS-configured targets are used for radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement and testing, radar cross section evaluation, decoy-effectiveness testing, maneuver analysis, electronic warfare evaluation, warhead-effectiveness testing and evaluation of fleet tactics.  TA\/AS scoring capabilities include both surface and airborne scalar and vector scoring systems.\n\n In addition to the design and development of target hardware and software, funding supports studies performed by a University Affiliated Research Center (UARC) to specify and verify needed target performance for future target development.  For the design and validation of targets under development, the UARC will provide engineering studies in areas such as structures, controls, guidance, and propulsion.  For those hardware and software items presently under development by commercial vendors, the UARC will provide oversight and validation of vendor design and development approach."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supersonic Targets"
                                    },
                                    "Description": {
                                        "val": "Provides funding for the development of GQM-163A upgrades\/evolutionary development to keep pace with evolving threat characteristics. Efforts include continued development of performance envelope characteristics to keep pace with emerging threat requirements such as development of updated flight profiles and vehicle signatures. Funds also support development of required improvements in the current infrastructure of the launch capability to accommodate the increased number of simultaneously launched targets from two to four.\n\n Funding will also support final termination settlement of the GQM-173 MSST development effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.111"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commenced shutdown activities in support of pending GQM-173A Multi-Stage Supersonic Target program termination, which includes closeout of ground and captive carry testing, Sprint Vehicle subsystem level flight tests, and validation of the models and simulations utilizing the Hardware In the Loop test bed.  Continued the GQM-163A Supersonic Sea Skimming Targets Quad Launch effort, which will provide the required improvements in the current infrastructure of the launch capability to accommodate the increased number of targets from two to four.  Commenced Radome and Radar Altimeter design and development efforts, Orbital Front End System space allocation studies for SSST, and other Engineering Change Proposals (ECPs) and improvements as required to replicate emerging threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Subsonic Targets"
                                    },
                                    "Description": {
                                        "val": "The BQM-177A Subsonic Aerial Target (SSAT) represents subsonic anti-ship cruise missile threats in direct support of the Test & Evaluation of major combat weapons systems programs and fleet training.  The BQM-177A SSAT provides dynamic, high-subsonic, sea-skimming, anti-ship cruise missile threat emulation for testing of USN ship defensive weapon systems and other surface-to-air systems and will replace current BQM-74E subsonic targets with increased capabilities featuring increased speed, longer range, lower cruise altitudes and greater maneuverability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.904"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed contractor led testing for qualification of BQM-177A SSAT system and continued Rocket Assisted Take Off (RATO)\/Jet Assisted Take Off (JATO) qualification test and evaluation efforts.  Continued to conduct design reviews and completed flight tests to validate integrity of target and address deficiencies when discovered including radome redesign efforts and component qualification testing.  Provided government program management, engineering, test, training and logistics support and contract support services towards accomplishment of engineering, manufacturing and developmental efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.571"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed Milestone C\/procurement decision and award the Low Rate Initial Production (LRIP) 1 contract to support an Initial Operational Capability (IOC) decision planned for FY 2018.  Continue Navy led flight testing.  Continue to review final design documents and perform required target characteristic testing to support key performance parameters and attributes.  Provide government program management, engineering, training, test and logistics support and contract support services towards the completion of the engineering, manufacturing, and developmental efforts including but not limited to engineering and system verification reviews, initial shipboard suitability testing, radome redesign, RATO\/JATO qualification efforts, and component qualification testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Navy led flight testing.  Provide government program management, engineering, test and logistics support and contract support services towards IOC and FRP decisions.  Support additional RATO\/JATO qualification efforts as required for safety of operations.  Continue engineering, and manufacturing, training, logistics and test efforts of the BQM-177A SSAT for transition to LRIP2 and FRP.  Continue training and logistics requirements towards Full Operational Capability including shipboard qualification and operations.  Continue initial shipboard suitability testing and qualification efforts.  Complete system validation and verification efforts and conduct production verification flight tests.  Conduct Physical Configuration Audit for baseline configuration and support initial efforts for incorporating Engineering Change Proposals in the baseline design configuration."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Threat Simulation Program (TTSP), Target Mission Support Systems (TMSS), Target Control (TC) and Target Augmentation and Auxiliary Systems (TA\/AS)"
                                    },
                                    "Description": {
                                        "val": "Continue to support the development of Target Control (TC) systems and TA\/AS capable of supporting Test and Evaluation (T&E) and fleet training activities to ensure emerging threat simulation requirements are met.  Target Control Systems (TCS) involves the improved command and control systems capable of controlling multiple targets simultaneously while delivering adequate fidelity of T&E telemetry data.  The TMSS program provides target control, scoring, location, and navigation of air, land and seaborne targets for fleet training and weapons systems test and evaluation.  Continue to support design, development and qualification of TMSS including but not limited to the current and next generation TC systems, scalar scorers, scoring ground station, telemetry antennas, radar and locator beacons, identification friend or foe and associated test sets.  Augmentation and auxiliary systems must be capable of augmenting targets in support of radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement\/test, radar cross section evaluation, decoy effectiveness, maneuver analysis, electronic warfare, warhead effectiveness and evaluation of fleet tactics, readiness, and training.  The TTSP provides the payload equipment required to electronically enhance aerial\/surface targets to provide threat representative Radio Frequency signatures, specifically the Electronic Attack and Threat Radar Emissions (Active Emitters).  The TTSP accomplishes this by providing a collection of modules which are integrated into individual targets in various configurations to provide the ability to simulate the RF environment.  TTSP equipment in various configurations is certified for carriage in aerial\/surface targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.136"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development, prototype, and integration of threat electronic attack & active emitter simulators to ensure the fleet met emerging threat simulation requirements.  Gathered and exploited threat intelligence.  As a result of the termination of the GQM-173A Multi-Stage Supersonic Target program, development of new threat simulations are necessary to satisfy the fleet's requirements to build operator confidence and proficiency in operation of anti-ship cruise missile defense systems.  Support the development and qualification of Target Mission Support Systems (TMSS) including but not limited to frequency upgrades, DSQ-50A Scalar Scorer, TCS Ground Control Station SW, & the GSQ-106C."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.739"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype, and integration of threat electronic attack & active emitter simulators to ensure the fleet meets emerging threat simulation equirements.  Gather and exploit threat intelligence.  Continue to support design, development and qualification of various TMSS including but not limited to TCS Radio Frequency Subsystem, the legacy frequency upgrade, DSQ-50A Scalar Scorer, AN\/DPN-90 Radar Beacon, & the GSQ-106C."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators to ensure the fleet meets emerging threat requirements. Gather and exploit threat intelligence. Continue to support the design, development and qualification of various TMSS equipment, such as the TCS Radio Frequency Subsystem (SNTC BLK 3). Begin development of the SNTC BLK 3a Ground Control Station with associated hardware and software upgrades. Continue development of the replacement DSQ-50A Scalar Scorer and its associated Ground Telemetry Station, as well as the replacement AN\/DPN-90 Radar Beacon."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN 2280"
                                    },
                                    "Title": {
                                        "val": "Aerial Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "40.462"
                                        },
                                        "CurrentYear": {
                                            "val": "137.484"
                                        },
                                        "BudgetYearOne": {
                                            "val": "124.757"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "124.757"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "128.404"
                                        },
                                        "BudgetYearThree": {
                                            "val": "131.952"
                                        },
                                        "BudgetYearFour": {
                                            "val": "212.543"
                                        },
                                        "BudgetYearFive": {
                                            "val": "162.769"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Supersonics: The GQM-163A Supersonic Sea-Skimming Target (SSST) is an Acquisition Category II program. Development strategy includes the continued development of the Quad Launch capability. The SSST program will also commence the development and design efforts for a new Radome and Radar Altimeter and other Engineering Change Proposals as required to emulate emerging threat systems. These development efforts will continue to be rolled into the production baseline. Production efforts are expected to continue at higher quantities in order to meet projected MDAP T&E requirements.\n\nCongress was notified on September 25, 2015 that the Department of the Navy made the decision to terminate the Multi-Stage Supersonic Target (MSST) development program. Termination settlement efforts are ongoing with DCMA.\n\nSubsonics: The BQM-177A Subsonic Aerial Target program is an Acquisition Category IVM program. It is currently undergoing developmental testing with Critical Design Review, Test Readiness Review \/ Flight Readiness Review completed in FY16 and Milestone C completed in 1st Quarter FY17. A Low Rate Initial Production (LRIP) 1 option contract is scheduled to be awarded in 3rd Quarter FY17. IOC is scheduled for 4th Quarter FY18. After exercising a second prenegotiated option for LRIP 2 in FY18, the program will transition to Full Rate Production in FY19.\n\nTarget Threat Simulation Program (TTSP), Target Mission Support Systems (TMSS), Target Control, and Target Augmentation and Auxiliary Systems: TTSP will continue to award contracts to support the development of electronic attack & threat radar simulations, ensuring the fleet requirement for simulations of emerging threats is met. Additional contracts will be awarded to support the development and design of TMSS upgrades, including but not limited to the current and next generation Target Control Systems, Scalar Scorers, Scoring Ground Station, Telemetry Antennas, Radar and Locator Beacons, Identification Friend or Foe and associated test sets."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT         PERFORMANCE REQUIREMENT               OBJECTIVE                       THRESHOLD                  TEST RESULT\n\n BQM-177           Maximum Speed at Low Altitude              0.95 M @ 6.6 ft @              0.90 M @ 10.0 ft @           TBD\n EMD               [Mach(M) at feet (ft) above wave           Sea State 5                    Sea State 3                                                                                                                                                                                                              crest at WMO Sea State conditions]"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0610"
                    },
                    "ProjectTitle": {
                        "val": "Wpn Sys T&E Trng Dev\/Proc"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "24.343"
                        },
                        "CurrentYear": {
                            "val": "24.094"
                        },
                        "BudgetYearOne": {
                            "val": "15.415"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.415"
                        },
                        "BudgetYearTwo": {
                            "val": "15.412"
                        },
                        "BudgetYearThree": {
                            "val": "15.411"
                        },
                        "BudgetYearFour": {
                            "val": "14.509"
                        },
                        "BudgetYearFive": {
                            "val": "14.307"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "2"
                            },
                            "PriorYear": {
                                "val": "5"
                            },
                            "CurrentYear": {
                                "val": "5"
                            },
                            "BudgetYearOne": {
                                "val": "3"
                            },
                            "BudgetYearOneBase": {
                                "val": "3"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development and procurement of aerial targets and associated systems used exclusively for test and evaluation of naval weapons systems which closely represent current and projected threats to fleet units in the joint strike and the littoral warfare environments.  These representations must include characteristics related to size, performance envelope, and electromagnetic and infrared signatures.  As threats change, changes must be made to keep the targets threat representative in response to changes in the test requirements of the developers of naval weapons systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "QF-16 Full-Scale Aerial Target (FSAT)"
                                    },
                                    "Description": {
                                        "val": "The QF-16 FSAT is being developed as a 4th generation, full scale, threat representative target providing a replacement for the FSAT\/QF-4 and are maintained and operated by the Air Force.  The QF-16 FSAT is a converted F-16 aircraft that provides a supersonic, high altitude, remote-controlled aerial target.  This target will have full command and control capability through normal flight envelopes.  The QF-16 FSAT target presentations will support aircraft and weapons systems testing and development, including that of the Joint Strike Fighter, AIM-9X Sidewinder missile, AIM-120 Advanced Medium Range Air-to-Air Missile, and Standard Missile-6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.343"
                                            },
                                            "Articles": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "Procure five (5) QF-16 FSAT test assets; Conducted regeneration of engines and airframes and drone conversion of QF-16 FSAT aircraft retrieved from Davis Monthan AFB storage."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.094"
                                            },
                                            "Articles": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "Procure five (5) QF-16 FSAT test assets; Conducted regeneration of engines and airframes and drone conversion of QF-16 FSAT aircraft retrieved from Davis Monthan AFB storage. Investigate ability to conduct QF-16 operations at the Navy's west coast Sea Test Range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.415"
                                            },
                                            "Articles": {
                                                "val": "3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.415"
                                            },
                                            "Articles": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Procure three (3) QF-16 FSAT test assets; Conducted regeneration of engines and airframes and drone conversion of QF-16 FSAT aircraft retrieved from Davis Monthan AFB storage."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A Memorandum of Agreement was signed between the United States Navy (USN) and the United States Air Force (USAF) for QF-16 Full-Scale Aerial Target Program, which is led by the USAF. Milestone C was achieved in 1st Quarter FY14. IOC was achieved in 4th Quarter FY16 & FOC is planned for 4th Quarter FY17. RDT&E funding was provided to procure the QF-16s because they are used\/expended to satisfy RDT&E requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT          PERFORMANCE REQUIREMENT                OBJECTIVE                 THRESHOLD             TEST RESULT\n\nQF-16                Drone Mission Performance                           Achieve requirement         Threshold=objective       TBD          \nFSAT                    Payload Integration                                       Achieve requirement    Threshold=objective      TBD \nSuperiority            carry, operation & monitoring TEMS,\nTarget                  ALE-47, AIM-9, ALQ-188, ALQ-167 ALE-56 & 300 Gallon Fuel Tank"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0612"
                    },
                    "ProjectTitle": {
                        "val": "Surface Targets Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.236"
                        },
                        "CurrentYear": {
                            "val": "1.258"
                        },
                        "BudgetYearOne": {
                            "val": "1.293"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.293"
                        },
                        "BudgetYearTwo": {
                            "val": "1.327"
                        },
                        "BudgetYearThree": {
                            "val": "1.357"
                        },
                        "BudgetYearFour": {
                            "val": "1.390"
                        },
                        "BudgetYearFive": {
                            "val": "1.419"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops seaborne targets and their related target augmentation systems in support of air-to-surface and surface-to-surface weapons test and evaluation and fleet training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Surface Targets Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.236"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed predictive models for response of Low Cost Modular Target (LCMT) and Polyethylene Tow Target (PETT) behind weaving tow vessels.  Developed stability-in-sea-state analysis tool to customize configurations of LCMT.  Conducted test and evaluation of basic swarm formation algorithms with High Speed Maneuverable Surface Target (HSMST).  Developed advanced target swarm formation controls with real-time group reassignments.  Developed enhanced precision for real-time scoring banner on seaborne targets.  Developed real-time display of weapon system lethality utilizing human target system (Humannequin).  Developed improved target navigation control tools for Portable Command and Control Unit (PCCU).  Researched and developed \"float away\" camera mount to preserve video data even when a seaborne target sinks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate SeaCAN on-board remote control system with new platform and systems for Fast Attack Craft Target (FACT).  Test new FACT platform performance and measure radar cross section and infrared signatures.  Develop graphical user interface (GUI) for target formation control during swarm training and test and evaluation exercises.  Integrate and test surface target collision avoidance hardware and software algorithms.  Develop and implement additional on-screen graphics to support complex target presentations.  Measure and populate data in stability software tool to include additional target platforms.  Research development of predictive algorithms for stability of dynamic tow targets at higher speeds.  Develop advanced radar and infrared signature enhancement for powered targets.  Research performance and capabilities of a Polyethylene Tow Target propelled with electric power."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.293"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.293"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop improved post-exercise analysis and playback capabilities.  Develop configurations of Low Cost Modular Target (LCMT) to support testing of Long Range Anti-Ship Missile (LRASM) and Joint Standoff Weapon (JSOW).  Develop improvements to target formation control.  Develop chaff countermeasure launch controller for seaborne targets.  Develop high fidelity control with feedback for target emitters and cameras.  Develop advanced radar and infrared signature enhancement for powered seaborne targets.  Develop ballast augmentation system for Ship Deployable Seaborne Target (SDST).  Develop improved seaborne target steering systems.  Monitor developments in Command and Control and support developments for System for Naval Target Control (SNTC) applicable to seaborne targets."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/5429"
                                    },
                                    "Title": {
                                        "val": "ASW SE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.593"
                                        },
                                        "CurrentYear": {
                                            "val": "22.319"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.571"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.571"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.809"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.032"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.263"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.490"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "92.077"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Review capability of inventory with respect to threat, weapons test schedules and fleet training requirements.  OBJECTIVE:  Available inventory of seaborne targets to meet fleet requirements."
                        }
                    }
                }
            ]
        }
    }
}