{
    "id": "2018-DefenseInformationSystemsAgency-PB-0400-JBOOK-d5bb8f4c10fc6311d805dd6cfab42eb11a7b61f2f10c4ede9c05096b1fa6a5c0-18",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DISA-U_RDTE_JustificationBook_Defense_Information_Systems_Agency_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Defense_Information_Systems_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305208K"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineNumber": {
            "val": "233"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "46.899"
            },
            "PriorYear": {
                "val": "3.239"
            },
            "CurrentYear": {
                "val": "3.030"
            },
            "BudgetYearOne": {
                "val": "3.049"
            },
            "BudgetYearOneBase": {
                "val": "3.049"
            },
            "BudgetYearTwo": {
                "val": "3.056"
            },
            "BudgetYearThree": {
                "val": "3.073"
            },
            "BudgetYearFour": {
                "val": "3.142"
            },
            "BudgetYearFive": {
                "val": "3.224"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "As the sole joint interoperability certification agent, the Joint Interoperability Test Command established and maintains a Distributed Development and Test Enterprise for the Department of Defense (DoD) Distributed Common Ground\/Surface System (DCGS) program, as directed by the Office of the Under Secretary of Defense (Intelligence).  DCGS is an integral and critical component of the overall DoD Intelligence, Surveillance, and Reconnaissance interoperability and data integration strategy which provides world-wide capabilities to receive, process, exploit, and disseminate data from airborne and national reconnaissance sensors\/platforms and commercial sources."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.239"
                },
                "CurrentYear": {
                    "val": "3.030"
                },
                "BudgetYearOne": {
                    "val": "3.323"
                },
                "BudgetYearOneBase": {
                    "val": "3.323"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.239"
                },
                "CurrentYear": {
                    "val": "3.030"
                },
                "BudgetYearOne": {
                    "val": "3.049"
                },
                "BudgetYearOneBase": {
                    "val": "3.049"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.274"
                },
                "BudgetYearOneBase": {
                    "val": "-0.274"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.274"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.274"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease of -$0.160 in FY 2018 is attributed to a reduction in life-cycle test infrastructure upgrades and replacement of the Distributed Development and Test Enterprise (DDTE). Part of the overall decrease (-$0.114) is attributed to the Service Requirements Review Board (SSRB) contract reduction."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "NF1"
                    },
                    "ProjectTitle": {
                        "val": "Distributed Common Ground\/Surface Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "46.899"
                        },
                        "PriorYear": {
                            "val": "3.239"
                        },
                        "CurrentYear": {
                            "val": "3.030"
                        },
                        "BudgetYearOne": {
                            "val": "3.049"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.049"
                        },
                        "BudgetYearTwo": {
                            "val": "3.056"
                        },
                        "BudgetYearThree": {
                            "val": "3.073"
                        },
                        "BudgetYearFour": {
                            "val": "3.142"
                        },
                        "BudgetYearFive": {
                            "val": "3.224"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Interoperability Test Command (JITC) coordinates with the Military Services and Defense Intelligence Agencies to conduct Joint\/Distributed Common Ground\/Surface System (DCGS) testing and analysis, including event coordination, configuration, instrumentation and integration functions on the Distributed Development and Test Enterprise (DDTE).  Under the DCGS Governance, this effort, referred to as the DCGS Test and Evaluation (T&E) Focus Team (FT), is composed of three parts:  the DDTE Focus Group, providing and sustaining a distributed development network; the Strategy Focus Group, looking at current and future net-enabled enterprise T&E methods; and the Execution Focus Group, which leverages the Strategy Focus Group’s methodologies in executing DCGS Enterprise assessment events, such as the annual DCGS demonstration, ENTERPRISE CHALLENGE.  These efforts improve systems engineering and T&E throughout all phases of the DCGS life-cycle, resulting in improved capabilities to share net-centric data and services between the DCGS Programs of Record (PoRs) and the overarching Defense Intelligence Information Enterprise (DI2E).\n\nOperates and maintains the DDTE, providing DCGS PoRs a virtual, operationally-relevant assessment environment maintaining connectivity between Service facilities, National Agency capabilities, and Coalition partners.  DDTE allows robust integration of modeling and simulation T&E capabilities across Joint DCGS events without introducing vulnerabilities to operational Command and Control networks and has enabled improvements in systems engineering, instrumentation and T&E throughout all phases of the DCGS life cycle. \n\nDCGS PoRs and Coalition partners use the DDTE network, which supports the net-centric maturity assessment of the DCGS Enterprise under the DCGS Governance, to integrate architecture, standards, and capabilities for implementation of the DCGS Integration Backbone and support the migration to net-centricity, including DCGS Enterprise services for the Military Departments, DCGS-Special Operations Forces and the DCGS Intelligence Community.  National Agency capabilities supporting DCGS include Geospatial Intelligence, Signals Intelligence, Measurement and Signature Intelligence and Human Intelligence, which are integrated and tested in the DDTE domain."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Common Ground\/Surface Systems (DCGS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.239"
                                            },
                                            "Text": {
                                                "val": "Continuing to support DDTE and to provide enhanced functionality with expanding T&E capability, with a focus on increasingly automated evaluations of net-centric data and web services. Incorporating new technologies such as cloud computing, mobile technology, and “big data” in assessment methodologies and practices. To further DCGS Enterprise and associated Defense Intelligence Information Enterprise (DI2E) capabilities, conducting compliance testing of data, metadata, and services against established standards to enhance the sharing and promote reuse of net centric capabilities.  Enhancing “Testing as a Service” (TaaS) capabilities that enable DCGS entities and other communities of interest (COIs), such as industry partners, to test for standards compliance early and often during the development and acquisition processes. Enterprise T&E support continues to include enterprise-level assessment events such as ENTERPRISE CHALLENGE for the DCGS PoRs, National Agencies and Coalition Partners. Continuing development and instrumentation for data collection and testing support on the DCGS network domains and enclaves; with the number of active DDTE nodes increasing from 19 to 21 as the DCGS PoRs participate in assessment venues with other DI2E entities. Developing and implementing passive instrumentation on operational networks that can gather data on capabilities not instantiated on the DDTE test domain to provide a more robust evaluation of the net-centric maturity of the DCGS Enterprise. Data collected by these assessment efforts are reflected in the Enterprise Maturity Model (EMM) and documented in an annual DCGS Enterprise Assessment Report."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.030"
                                            },
                                            "Text": {
                                                "val": "Continuing to support DDTE, provide enhanced functionality, expand T&E capability, and perform automated evaluations of net-centric data and web services with improved assessment methodologies and practices due to incorporating new technologies such as cloud computing, mobile technology, and “big data”. Continuing to conduct compliance testing of data, metadata, and services against established standards to enhance the sharing and promote reuse of net centric capabilities and to enhance “Testing as a Service” (TaaS) capabilities that enable DCGS entities and other communities of interest (COIs) to test for standards compliance during the development and acquisition processes. enterprise T&E support, such as enterprise-level assessment events i.e., ENTERPRISE CHALLENGE).  Development of and improvements to instrumentation for data collection and testing support on the DCGS network domains and enclaves for the DCGS PoRs, National Agencies and Coalition Partners continues; with the number of active DDTE nodes expected to increase as the DCGS Programs of Record (PoRs) participate in assessment venues with other DI2E entities. Developing and implementing passive instrumentation on operational networks that can gather data on capabilities not instantiated on the DDTE test domain to provide a more robust evaluation of the net-centric maturity of the DCGS Enterprise. Data collected by these assessment efforts are reflected in the Enterprise Maturity Model (EMM) and documented in an annual DCGS Enterprise Assessment Report.\n\nThe decrease of -$0.209 from FY 2016 to FY 2017 is due to reduced testing costs following automation improvements, reduction in the number of testing events and delay in end of life hardware replacement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.049"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.049"
                                            },
                                            "Text": {
                                                "val": "Continue to support DDTE, provide enhanced functionality, expand T&E capability, and perform automated evaluations of net-centric capabilities with improved assessment methodologies and practices due to incorporating new technologies such as cloud computing, mobile technology, and “big data”; the number of active DDTE nodes is expected to increase as the DCGS Programs of Record (PoRs) participate in assessment venues with other DI2E entities. Continue to conduct compliance testing of data, metadata, and web services against established standards to enhance the sharing and promote reuse of net centric solutions.  Continuing to expand TaaS capabilities that enable DCGS entities and other COIs to test for standards compliance during the development and acquisition processes. Continue enhancement of instrumentation and automated data collection tools to support testing on multiple network domains and enclaves where the DCGS PoRs, National Agencies and Coalition Partners test and operate.  Plan and conduct testing of enterprise cybersecurity solutions to determine if they comply with standards, support interoperability between the DCGS PoRs, and meet the DCGS Enterprise cybersecurity requirements. Data collected by these assessment efforts are reflected in an annual DCGS Enterprise Assessment Report that delineates how well the DCGS Enterprise shows progress over time in meeting the capabilities and closing the gaps reflected in the 2016 DCGS Enterprise Initial Capabilities Document. \n\nThe increase of +$0.133 in  FY 2018 will provide for the implementation of enhanced data analytics for DCGS.  This increase is partially offset by a decrease of -$0.114 attributed to the Service Requirements Review Board (SSRB) contract reduction."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A T&E Mission Support Services (MSS) cost plus fixed fee contract provides T&E support by performing a wide range of non-personal services to encompass testing, scientific, engineering, logistic, administrative, and ancillary support of the DISA T&E missions."
                        },
                        "PerformanceMetrics": {
                            "val": "The DCGS T&E FT performs a minimum of six DCGS Enterprise assessments per year, and the results are consolidated into the T&E FT Enterprise Assessment Report annually.  The T&E FT also provides input to the DCGS Enterprise Focus Team's State of the Enterprise (SoE) Report, which includes the Enterprise Maturity Model (EMM) and shows measurable DCGS Enterprise net-centric maturity progress over time.\n\nThe T&E FT also leverages Joint Interoperability Certification testing to support the evaluation of DCGS Enterprise maturity. In FY 2016, T&E FT performed twelve (12) DCGS Enterprise assessments.  This trend is expected to continue in FY2017. Of the six DCGS PoR systems, two hold current Joint Staff (JS), Command, Control, Communications, & Computers\/Cyber (J6) Interoperability (IOP) Certifications and continue to conduct IOP testing on emerging releases. One DCGS PoR has completed interoperability testing, and the joint IOP certification is pending. Of the three remaining PoRs, two are not required to be JS J6 certified, but the T&E FT leverages data collected during periodic IOP assessments of these programs during enterprise-level demonstrations and test events. Due to increased automation for data collection, parsing and analysis, in addition to advances in PoR and Enterprise maturity, the T&E FT increases the cumulative number of net-centric capability evaluations each year.\n\nIn FY 2016, T&E FT conducted twelve (12) DCGS Enterprise assessments.\n\nIn FY 2017, T&E FT will perform a minimum of ten (10) DCGS Enterprise assessments.\n\nIn FY 2018, T&E FT will perform a minimum of nine (9) DCGS Enterprise assessments."
                        }
                    }
                }
            ]
        }
    }
}