{
    "id": "2018-Navy-PB-1319-MJBOOK-0-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-22",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603673N"
        },
        "ProgramElementTitle": {
            "val": "(U)Future Naval Capabilities Advanced Tech Dev"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "251.173"
            },
            "CurrentYear": {
                "val": "249.092"
            },
            "BudgetYearOne": {
                "val": "231.772"
            },
            "BudgetYearOneBase": {
                "val": "231.772"
            },
            "BudgetYearTwo": {
                "val": "233.894"
            },
            "BudgetYearThree": {
                "val": "231.250"
            },
            "BudgetYearFour": {
                "val": "250.677"
            },
            "BudgetYearFive": {
                "val": "270.614"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) address the Advanced Technology Development associated with the Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the Navy's Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are identified by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders. The Enabling Capabilities (ECs) and associated technology product investments of the FNC Program are competitively selected by a 3-star Technology Oversight Group (TOG), chartered by the S&T Corporate Board and representing the requirements, acquisition, research and fleet\/forces communities of the Navy and the Marine Corps."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "265.562"
                },
                "CurrentYear": {
                    "val": "249.092"
                },
                "BudgetYearOne": {
                    "val": "259.009"
                },
                "BudgetYearOneBase": {
                    "val": "259.009"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "251.173"
                },
                "CurrentYear": {
                    "val": "249.092"
                },
                "BudgetYearOne": {
                    "val": "231.772"
                },
                "BudgetYearOneBase": {
                    "val": "231.772"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-14.389"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-27.237"
                },
                "BudgetYearOneBase": {
                    "val": "-27.237"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-9.029"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.360"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-27.237"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-27.237"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 funding request was reduced by -$5.0 million as required for the Department of the Navy to comply with the Bipartisan Budget Act of 2015. \n\nTechnical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3346"
                    },
                    "ProjectTitle": {
                        "val": "Future Naval Capabilities Adv Tech Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "244.414"
                        },
                        "CurrentYear": {
                            "val": "249.092"
                        },
                        "BudgetYearOne": {
                            "val": "231.772"
                        },
                        "BudgetYearOneBase": {
                            "val": "231.772"
                        },
                        "BudgetYearTwo": {
                            "val": "233.894"
                        },
                        "BudgetYearThree": {
                            "val": "231.250"
                        },
                        "BudgetYearFour": {
                            "val": "250.677"
                        },
                        "BudgetYearFive": {
                            "val": "270.614"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "FNC investments are typically 3-5 years in duration.  They provide a continuance of basic research by maturing technologies from a Technology Readiness Level (TRL) of 3 or 4 to a TRL of 6.  All FNC products require BA2 and BA3 funded technology development, which is coordinated to ensure tangible technology products are delivered upon completion of each investment.  Each year the TOG refreshes the FNC Program by approving new ECs and technology products as older ones get delivered.  After transition to an acquisition program, FNC products are further engineered, integrated and ultimately, delivered to the warfighter. The development and delivery of each FNC product is guided by a Technology Transition Agreement (TTA) that is signed by the requirements and acquisition sponsors, as well as the S&T developer.\n\nThis project supports the naval pillars of Capable Manpower, Enterprise and Platform Enablers, Expeditionary Maneuver Warfare, Force Health Protection, Forcenet, Power and Energy, Sea Basing, Sea Shield and Sea Strike.  Each of these pillars is listed as a separate R-2 Activity.  Under each R-2 Activity, the BA 6.3 accomplishments and plans for every Enabling Capability (EC) and Technology Product in the FNC Program are listed.  ECs are composed of one or more interrelated technology products, so for clarity, each product is shown under its EC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CAPABLE MANPOWER (CMP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Capable Manpower (CMP) FNC pillar.  The CMP Pillar develops deliverable technologies that provide new capabilities in manpower and personnel management, training and education, and human-systems integration for more intuitive systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.441"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY12-01 LIVE, VIRTUAL, & CONSTRUCTIVE TRAINING FIDELITY\n- Complete Cognitive Fidelity Synthetic Environment - Design and develop virtual simulations that elicit the appropriate perceptual-cognitive responses for Naval aviation training.\n- Complete Tactics & Speech Capable Semi-Automated Forces - Demonstrate software that automatically generates doctrinally accurate semi-autonomous forces that are adaptive to training scenario events.\n- Complete Virtual-Constructive Representations on Live Avionics Displays - Test, evaluate, and refine the Live, Virtual, & Constructive (LVC) symbology used during experimentation and validation efforts.\n\nEC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Demonstrate software that assesses the risks and capabilities of varying levels of manpower authorizations to operate a specific platform design during various mission scenarios.\n- Continue Platform Design  and Acquisition Toolset - Demonstrate software that assesses the trade space and cost commitments of different platform designs and manning compliments. \n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue Dynamic, Adaptive & Modular Training for UAS - Design knowledge structures for integration with DoN simulation and training systems.\n- Continue Selection for UAS Personnel  (SUPer) - Construct unmanned aircraft operator selection and classification test batteries, including underlying data collection instruments within the DoN's APEX framework.\n- Continue UAS Control Station Human Machine Interface - Create Common Control Station information display design specifications that focus on supervisory control and the reduction of the information demands placed on unmanned aircraft system operators.\n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Continue Decision Making-Learning Management System (DM-LMS) - Define existing Marine Corps measures and standards of decision making and instructional method guidelines, and develop software products to plan, assess, and track decision making skill development.\n- Continue Digital Integrated Representation of Tactical Environment (DIRTE) - Define existing Marine Corps CONOPS for classroom and sustainment training and develop rapid terrain modeling and sketchpad software products that enable small unit leaders and instructors to create effective decision making environments and scenarios.\n- Continue Simulation Tailored Training and Assessment (ST2A) - Define existing Marine Corps situated tutor techniques and unobtrusive monitoring techniques, and develop software and hardware prototypes to execute decision making programs of instruction and scenarios in simulation.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\n- Continue Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Develop threat response software models to support an objective, metrics-driven training and experimentation capability for Fast Attack Craft and Mine Warfare threats.\n\nEC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Initiate Operational Planning Tool - Demonstrate software to facilitate the planning cycle structure used by Navy command and control planners to prepare mission plans that range from the Maritime Operations Centers down to maritime tactical units."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Develop software that produces a feasible set of shipboard event timelines, workload packages, and skills for each billet created for a given ship and system design.\n- Complete Platform Design and Acquisition Toolset - Demonstrate software to simulate the design and manpower interactions that are used to determine the trade spaces and cost commitments required for a given platform design and manning compliment.\n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue UAS Control Station Human Machine Interface - Deliver Human Machine Interface Prototype Software for supervisory control of unmanned systems to the submarine combat system.\n- Complete Selection for UAS Personnel (SUPer) - Develop and demonstrate unmanned aircraft operator selection and classification test batteries.\n- Complete Dynamic, Adaptive & Modular Training for UAS - Develop and demonstrate automated scenarios and clutter entity behaviors in the Navy's common training system technology for the Next Generation Threat System.\n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Continue Digital Integrated Representation of Tactical Environment (DIRTE) - Define Enterprise level Application Programming Interface (API) requirements to create Virtual Battlespace 2 (VBS2) terrain from government supplied source data (e.g., National Geospatial-Intelligence Agency products such as Digital Terrain Elevation Data and Digital Feature Analysis Data).\n- Continue Simulation Tailored Training and Assessment (ST2A) - Develop software and hardware prototypes to execute decision making programs of instructional scenarios in simulation.\n- Continue Decision Making-Learning Management System (DM-LMS) - Develop a Marine Corps Training Information Management System (MCTIMS) software prototype to provide repository and trend analysis of performance data to inform training readiness assessments, including the performance and development of individual Marines, small unit leaders, and small units over time.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\t\n- Continue Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Demonstrate simulated Electromagnetic Environmental Effects on Fleet training and operational systems in a networked Live, Virtual, and Constructive environment in a distributed scenario-driven Fleet Synthetic Training event.\n\nEC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Continue Operational Planning Tool - Develop software to assist Carrier Strike Group staffs that support comprehensive\/collaborative planning through the use of decision support services, analytic tools, and common displays that assist planners during the creation of navigation and tactical plans.\n\nEC: CMP-FY17-02 FUTURE INTEGRATED TRAINING ENVIRONMENT (FITE)\n- Initiate Future Integrated Training Environment (FITE) - Develop technologies and techniques to integrate Marine Corps simulations to support Live, Virtual, and Constructive training events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Complete Manpower Planning and Optimization Toolset - Demonstrate the newly developed manpower planning and optimization functional enhancements targeted for transition.\n\nFNC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Complete UAS Control Station Human Machine Interface - Integrate human machine interface and vehicle controller software into the Advanced Processor Build (APB) -17 software update for the AN\/BYG-1 combat control system.\n\nFNC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Complete Decision Making-Learning Management System (DM-LMS) - Assess the reliability and validity of DM-LMS design measures.\n- Complete Digital Integrated Representation of Tactical Environment (DIRTE) - Test and demonstrate the Graphical User Interface (GUI) to assess the ease of use and ability to modify the terrain and associated features. \n- Complete Simulation Tailored Training and Assessment (ST2A) - Test and evaluate the full ADSUDM concept using the integrated training simulation demonstration prototype.\n\nFNC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\t\n- Complete Environment Designed to Undertake Counter A2AD Tactics, Training & Experimentation (EDUCAT2E) - Conduct a final demonstration and transition the newly developed, denied-and-degraded effects technology to platform sponsors, the training community, and combat system developers.\n\nFNC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Continue Operational Planning Tool - Develop new software tools that support comprehensive and collaborative planning through the use of decision support services, analytic tools, and common displays. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-01 under a new Information Warfare R-2 Activity)\n\nFNC: CMP-FY17-01 MANPOWER, PERSONNEL & TRAINING STRATEGIC PLANNING APPLICATION\n- Initiate Manpower, Personnel & Training Planning Application - For this FNC, delayed one year to start in FY18, develop decision support software to capture key interconnections, time delays and feedbacks between Manpower, Personnel, and Training stakeholders that serve as a common set of assumptions and boundaries for decision analyses. \n\nFNC: CMP-FY17-02 FUTURE INTEGRATED TRAINING ENVIRONMENT (FITE)\n- Continue Future Integrated Training Environment (FITE) - Develop synthetic environment language to communicate changes during run-time, and implement changes within the simulations.\n\nFNC: CMP-FY18-01 LEARNING CONTINUUM AND PERFORMANCE AID (LCAPA)\n- Initiate Learning Continuum and Performance Aid (LCaPA) - Commence development of a federated software system to manage an individualized learning continuum through on-the-job and other training events that includes career path guidance and performance tracking. \n\nFNC: CMP-FY18-02 MANNED AND UNMANNED COMMON PLANNING PICTURE\n- Initiate Manned and Unmanned Common Planning Picture - Commence development of software to enable a sailor to plan and brief manned (navigation, own ship, etc.) and unmanned (UUV and UAV) events simultaneously as an integrated planning tool that communicates the commander's intent. (In FY19, this FNC Product will be realigned within this PE to UW-FY18-01 under a new Undersea Warfare R-2 Activity)\n\nFNC: CMP-FY19-03 Fleet Training Technologies (FleeT2)\n- Initiate FleeT2 - Commence development of adaptive, dynamic tools to capture and assess mission performance of warfare teams and operators to support high-velocity and ready relevant learning of representational techniques, model dynamics, and high computational tractability. (In FY19, this FNC Product will be realigned within this PE to SW-FY19-04 under a new Surface Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENTERPRISE AND PLATFORM ENABLERS (EPE)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Enterprise and Platform Enablers (EPE) FNC pillar.  The EPE Pillar develops cross-cutting, deliverable technologies that provide new capabilities for naval service platforms that lower acquisition, operations and maintenance costs, improve system safety and availability, and improve platform survivability.  \n\nThe FY 2016 to FY 2017 decrease was due primarily to the completion of EPE-FY10-01, EPE-FY12-01 and EPE-FY12-02, and the planned ramp-down of EPE-FY09-07 and EPE-FY11-01.\n\nThe FY 2017 to FY 2018 decrease was due primarily to the completion of EPE-FY09-07 Advanced Material Propeller, EPE-FY11-01 Integrated Thermal Management System Design, and the ramp-down in the planned 6.3 effort for EPE-FY15-03 New Material(s) Development & Lab Characterization, which just started conducting experiments to fully characterize medium-scale material concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.482"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EPE-FY09-07 AFFORDABLE SUBMARINE PROPULSION AND CONTROL ACTUATION\n- Continue Advanced Material Propeller - Develop Full Scale Test Plan for the Collins Class Submarine.\n\nEC: EPE-FY10-01: ADVANCED SHIPBOARD WATER DESALINATION\n- Continue Advanced Navy Reverse Osmosis System - 100K GPD - Demonstrate and test a 100K Gallons Per Day (GPD) robust reverse osmosis based water purification system on ship platforms.\n- Complete Advanced Navy Reverse Osmosis System - 4K GPD - Demonstrate and test a 4,000 Gallons Per Day (GPD) robust reverse osmosis based water purification system.\n\nEC: EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT\n- Continue Integrated Thermal Management System Design - Finalize testing of a scale model and begin integrating the panels to a ship deck for the final demonstration.\n\nEC: EPE-FY12-01 CORROSION MITIGATION TECHNOLOGIES\n- Complete Corrosion Resistant Surface Treatment - Deliver impellers treated with Corrosion Resistant Surface Treatment to PMS-505 for installation on LCS.\n- Complete Sprayable Acoustic Damping Systems - Demonstrate and integrate spray applied damping systems for improved structural vibration control, total ownership cost reduction, improved platform performance, and reduced detectability.\n\nEC: EPE-FY12-02 INTEGRATED HYBRID STRUCTURAL MANAGEMENT SYSTEM (IHSMS)\n- Complete IHSMS Fleet Structural Health Management Decision Tool - Integrate structural health monitoring system into demonstration article, demonstrate structural health monitoring rotor hot-spot sensors and integration technologies, and evaluate system performance.\n\nEC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Continue Tools for Predicting Array Operational Loading & Distribution - Develop a design for a highly instrumented towed array to be used in validating the predictive model of the forces operating on a towed array.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Conduct test and evaluation of prototype surface treatment and repair tools to enable aluminum alloy sensitization repair\/desensitization technologies.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Integrate a detection tool with sensitization prediction software as a singular tool with both detection and predictive capabilities to provide the time to repair aluminum ship structures.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Demonstrate, test, and down select advanced coating and alloy combinations that are suitable for higher temperature capable gas turbine operation.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Develop new test methods for materials being developed under the program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.178"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EPE-FY09-07 AFFORDABLE SUBMARINE PROPULSION AND CONTROL ACTUATION\n- Complete Advanced Material Propeller - Conduct Full Scale Testing on a Collins Class Submarine.\n\nEC: EPE-FY10-01: ADVANCED SHIPBOARD WATER DESALINATION\n- Complete Advanced Navy Reverse Osmosis System - 100K GPD - Complete final testing of a 100K Gallons Per Day (GPD) robust reverse osmosis based water purification system on a ship platforms that was delayed due to reliable issues that were subsequently corrected.\n\nEC: EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT\n- Complete Integrated Thermal Management System Design - Demonstrate feasibility of flight deck thermal management system during at-sea test.\n\nEC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Continue Tools for Predicting Array Operational Loading & Distribution - Fabricate and use the previously designed highly instrumented towed array to validate the predictive model of the forces operating on a towed array.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Assess the effectiveness of the developed surface treatment and repair tools for desensitizing and repairing sensitized aluminum.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Integrate the Degree of Sensitization (DoS) prediction algorithm software into the DoS detection tool.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Demonstrate, test, and down-select advanced coatings and alloy combinations that are suitable for higher temperature marine gas turbine engine service in the marine environment.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Construct new test methods for the materials being developed.\n\nEC: EPE-FY16-01 ADVANCED TOPCOAT SYSTEM (ATS)\n- Initiate Advanced Topcoat Systems for Air Vehicle (ATS-AV) - Perform initial laboratory verification and qualification studies on modified primer and topcoat chemistries, including chemical analysis and material interaction compatibility verification.\n\nFNC:  EPE-FY19-04 Signature Management System (SMS)\n- Initiate SMS - Conduct advanced technology development for submarine applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.559"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.559"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Complete Tools for Predicting Array Operational Loading & Distribution - Conduct at-sea testing of an instrumented towed array on a Virginia Class submarine and continue validation efforts on the numerical tool.  \n\nFNC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Demonstrate aluminum coating effectiveness to minimize Degree of Sensitization (DoS) and develop aluminum DoS repair tools to mitigate corrosion damage. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-01 under a new Surface Warfare R-2 Activity)\n- Complete Aluminum Alloy Corrosion Prediction Tool - Demonstrate integration of Degree of Sensitization (DoS) detection algorithms with the DoS detection tool and conduct testing of the integrated capability.\n\nFNC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Conduct OEM qualification testing for environmental and mechanical properties, and ease of fabrication for engine components for a planned demonstration test. (In FY19, this FNC Product will be realigned within this PE to SW-FY15-01 under a new Surface Warfare R-2 Activity)\n\nFNC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Design and carry out experiments which fully characterize medium-scale material concepts. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-01 under a new Undersea Warfare R-2 Activity)\n\nFNC: EPE-FY16-01 ADVANCED TOPCOAT SYSTEM (ATS)\n- Continue Advanced Topcoat Systems for Air Vehicle (ATS-AV) - Perform initial laboratory verification and qualification studies on modified primer and topcoat chemistries, including chemical analysis and material-interaction compatibility verification. (In FY19, this FNC Product will be realigned within this PE to AW-FY16-01 under a new Air Warfare R-2 Activity)\n\nFNC:  EPE-FY19-04 Signature Management System (SMS)\n- Continue SMS - Continue developing advanced signature management technology for submarine applications. (In FY19, this FNC Product will be realigned within this PE to UW-FY19-01 under a new Undersea Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPEDITIONARY MANEUVER WARFARE (EMW)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains the Navy funded Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Expeditionary Maneuver Warfare (EMW) FNC Pillar.  The EMW Pillar develops deliverable technologies that provide new capabilities in expeditionary maneuver warfare, including naval ground forces, with special emphasis on regular and irregular warfare in urban environments and combating terrorism. \n\nThe FY 2016 to FY 2017 decrease was due to the planned ramp down of EMW-FY12-02 and the continuation of EMW-FY12-03, EMW-FY14-01 and EMW-FY16-01 in PE 0603640M Marine Corps Advanced Technology Demonstration.\n\nThe FY 2017 to FY 2018 decrease was due primarily to the completion and transition to acquisition of EMW-FY12-02 Future Joint Counter Radio-Controlled IED Electronic Warfare (JCREW) and the continuation of EMW-FY17-01 High Reliability DPICM Replacement (HRDR) in PE 0603640M Marine Corps Advanced Technology Demonstration which was funded in this PE in FY17."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.824"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Continue Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Using realistic scenarios, demonstrate tactical-level distributed jamming on multiple ground-based Electronic Warfare systems.\n- Continue Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Employing realistic scenarios, demonstrate the simultaneous reception and transmission of Electronic Warfare and blue-force communication waveforms.\n\nEC: EMW-FY12-03 WIDE AREA SURGICAL AND PERSISTENT SURVEILLANCE (WASPS) CAPABILITIES FOR TIER 2\/3 UAVs\n- Complete Tactical Nighttime Wide Area Surveillance, initiated in PE 0603640M - Conduct final demonstration and complete transition.\n\nEC:  EMW-FY13-01 AZIMUTH AND INERTIAL MICRO-ELECTRO-MECHANICAL SYSTEM (MEMS) NAVIGATION SYSTEM\n- Complete Micro-Electro-Mechanical (MEMS) Inertial Navigation System - Test and demonstrate a full Navigation System for hand-held targeting systems. \n\nEC: EMW-FY14-01 SPECTRAL AND RECONNAISSANCE IMAGERY FOR TACTICAL EXPLOITATION (SPRITE)\n- Complete Automated Processing for Spectral Exploitation and Dissemination (APSED) - Demonstrate an Electro-Optical (EO) and Hyper-Spectral Imagery (HSI) Image Processing architecture that includes EO to HSI cross-correlation and fusion, image archiving and retrieval, and exploitation product generation.\n- Complete Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS) - Demonstrate parts of the baseline design for a multi-model wide area sensor compatible with a small space, weight and power baseline.\n\nEC: EMW-FY16-01 DENSIFIED PROPELLANT FIRE FROM ENCLOSURE - CONFINED SPACE (FFE\/CS) PROPULSION TECHNOLOGIES\n- Initiate Densified Propellant Fire From Enclosure - Confined Space (FFE\/CS) Propulsion Technologies - Integrate rocket motor igniters with micro-electromechanical system ignition safety devices and multi-stage igniter plug designs to achieve warhead launch parameters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Complete Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Demonstrate tactical-level distributed jamming on multiple ground-based Electronic Warfare (EW) systems using realistic scenarios.\n- Complete Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Demonstrate the simultaneous reception and transmission of Electronic Warfare (EW) and blue-force communication waveforms using realistic scenarios.\n\nEC: EMW-FY16-01 DENSIFIED PROPELLANT FIRE FROM ENCLOSURE - CONFINED SPACE (FFE\/CS)\nPROPULSION TECHNOLOGIES\n- Continued in PE 0603640M Marine Corps Advanced Technology Demonstration\n\nEC: EMW-FY17-01 HIGH RELIABILITY DPICM REPLACEMENT (HRDR)\n- Initiate High Reliability DPICM Replacement - Demonstrate with the 155mm M777A2 gun launch through modeling and simulation that High Reliability Dual-purpose Improved Conventional Munitions hardware will survive setback and gun balloting forces in order to activate the on-board power supply and initialize the arming sequence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: EMW-FY17-01 HIGH RELIABILITY DPICM REPLACEMENT (HRDR)\n- Continued High Reliability DPICM Replacement in PE 0603640M."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE HEALTH PROTECTION (FHP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Force Health Protection (FHP) FNC pillar.  The FHP Pillar develops deliverable technologies that provide new capabilities that provide Sailors and Marines with the best possible protection from operational threats by reducing morbidity and mortality when casualties occur.\n\nThe FY 2016 to FY 2017 decrease was due primarily to the completion of FHP-FY11-01 and the planned ramp down of FHP-FY12-02, FHP-FY13-03 and FYP-FY14-01.\n\nThe FY 2017 to FY 2018 decrease was due primarily to the completion of 1) FHP-FY12-01 Automated Critical Care System (ACCS), which finished integration of software algorithms and hardware, and the performance of FDA tests\/trials, and 2) FHP-FY12-02 Saving lives with Emergency Medical Per-fluorocarbons in the Field (SEMPer Fi) for Sea, Air & Land Dysoxia, which down-selected candidate drugs based for the treatment of pulmonary hypertension and conducted a final demonstration of an optimal treatment application; and the planned ramp down of FHP-FY14-01 Acute Care Cover for Severely Injured Limbs (ACCSIL), which in FY18 is finishing the integration of the bioactive coating and external conformal cover, which will conclude the pre-clinical studies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.878"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY11-01 MULTIFUNCTIONAL BLOOD SUBSTITUTE (MFBS)\n- Complete Multifunctional Blood Substitute (MFBS) - Formulate a resuscitation fluid that provides volume expansion and improves clotting in hemorrhaging combat casualties.\n\nEC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM \n- Continue Automated Critical Care System (ACCS) - Integrate down-selected hardware with an autonomous software system to monitor and maintain combat causalities with minimal human intervention during a 2-6 hour Casualty Evacuation scenario.\n\nEC: FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n-Continue SEMPer Fi for Air Dysoxia - Perform down-select of candidate drugs based on small and large animal testing for treatment of pulmonary hypertension.\n- Continue SEMPer Fi for Land Blast Kit - Demonstrate an optimal treatment application and overall duration of therapeutic hypothermia for immediate treatment of blast overpressure in small and large animals, including injury to the brain and\/or internal organs.\n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Execute laboratory testing to optimize hypoxia-detection algorithms intended for use in high altitude operations. \n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Integrate outer cover materials and an internal pharmaceutical coating into a single system to improve the clinical outcome of severe wounds on the battlefield.\n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Algorithm - Refine developmental algorithms using experimental data to integrate blast intensity data with cognitive impairment data to predict the likelihood of brain injury after single or multiple blast exposures.\n- Continue Neuro-Functional Assessment Tool - Identify and refine a non-psychometric device that detects and estimates the severity of traumatic brain injury.\n- Continue Sensor - Conduct optimization and testing of a self-powered blast sensor that detects and quantifies acceleration, pressure and impulse from a given blast event."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM\n- Complete Automated Critical Care System (ACCS) - Complete integration of software algorithms and hardware, and perform FDA tests\/trials as required.  \n\nEC: FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n- Complete SEMPer Fi for Air Dysoxia - Finish down-select of candidate drugs based on small and large animal testing for treatment of pulmonary hypertension.\n- Complete SEMPer Fi for Land Blast Kit - Conduct final demonstration of an optimal treatment application and overall duration of therapeutic hypothermia for immediate treatment of blast overpressure in small and large animals, including injury to the brain and\/or internal organs.\n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH\n- Continue Hypoxia Alert and Mitigation System - Develop hypoxia alert system hardware and software to guide treatment of casualties in order to sustain performance during high-altitude mountain operations.\n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Integrate the bioactive coating and external conformal cover, conclude pre-clinical studies, and prepare for initiation clinical studies.  \n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Blast Load Assessment: Sense and Test (BLAST) (formerly sensor, algorithm, and neurofunctional assessment tool) - Formulate algorithms to guide medical evaluation decisions after exposure to potential traumatic brain injuries and provide scientific evidence for the development of safe blast exposure limits, enhance the neuro-functional assessment tool to discriminate between traumatic brain injury and other operational impacts, and integrate blast force data from the sensor into the predictive traumatic brain injury algorithm.\n\nEC: FHP-FY16-01 INCAPACITATION PREDICTION FOR READINESS IN EXPEDITIONARY DOMAINS - AN INTEGRATED COMPUTATIONAL TOOL (I-PREDICT)\n- Initiate I-PREDICT - Incorporate the high strain rate characteristics of human tissues to allow accurate prediction of military type injuries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Continue activities to adapt the hypoxia alert system hardware\/software to guide treatment of casualties in order to sustain performance during high-altitude mountain operations.\n\nFNC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Complete Acute Care Cover for Severely Injured Limbs (ACCSIL) - Integrate the bioactive coating and external conformal cover, which will conclude the pre-clinical studies.  \n\nFNC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Complete Blast Load Assessment: Sense and Test (BLAST) - Integrate blast force sensor technologies with algorithms relating blast force exposures to the likelihood of injury, and conduct clinical testing of the neuro-functional assessment tool.\n\nFNC: FHP-FY16-01 INCAPACITATION PREDICTION FOR READINESS IN EXPEDITIONARY DOMAINS - AN INTEGRATED COMPUTATIONAL TOOL (I-PREDICT)\n- Continue I-PREDICT - Conduct measurements of the high strain rate characteristics of human tissues to allow an accurate prediction of the severity of battlefield injuries."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCENET (FNT)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Forcenet (FNT) FNC Pillar.  The FNT pillar develops deliverable technologies that provide new capabilities in Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR), networking, navigation, sensors, decision support, cyber-space, intelligence, and space technologies that will provide the architectural framework for naval warfare in the information age.\n\nThe FY 2016 to FY 2017 increase was due primarily to the ramp up of FNT-FY14-02, FNT-FY15-01, FNT-FY15-02 and FNT-FY16-02, and the initiation of FNT-FY17-01, FNT-FY17-02 and FNT-FY17-04.\n\nThe FY 2017 to FY 2018 increase was due primarily to the planned ramp up of 1) FNT-FY13-03 Silk Thread, which is expanding advanced technology development efforts, 2) FNT-FY15-01 Advanced Airborne Early Warning Electronic Protection (AAEWEP), which is expanding the effort in order to implement techniques to improve the Advanced Hawkeye E2-D electronic protection capability, 3) FNT-FY17-02 Submarine Simultaneous Transmit and Receive (SubSTAR), which will expand to conduct testing of the prototype broadband simultaneous transmit and receive subsystems, and 4) FNT-FY17-04 Resilient Hull\/Infrastructure Mechanical & Electrical Security (RHIMES), which will expand to demonstrate resilient software to protect controllers and proactive information shaping capabilities in the laboratory; and the initiation of 1) FNT-FY18-04 A2AD Communication Operations with Nanosats (ACORN), which will Integrate and test a nanosat payload and UHF networking with a digital mobile radio, and 2) FNT-FY18-05 Advanced Coordination Techniques for Distributed EW, which will implement precision geo-location and coordinated engagement techniques, begin a domain analysis for familiarization with relevant Navy systems, and implement techniques for providing real-time propagation channel assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.830"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FNT-FY12-01 ADVANCED TACTICAL DATA LINK (ATDL)\n- Complete Mission-Based Waveform Controls & Networking - Port baseline waveform and Anti-Access\/Area Denial enhancements to reference implementation hardware for field testing and demonstration.\n\nEC: FNT-FY12-02 AUTONOMOUS PERSISTENT TACTICAL SURVEILLANCE\n- Complete Autonomous Information-Based Surveillance Control - Complete integration and testing of information based algorithms for Unmanned Aerial Vehicle (UAV) routing and pathing.\n- Complete Contextual Enterprise Information - Adapt the analytical services framework and finalize development of real-time enterprise exploitation algorithms for transition and participation in cloud-oriented limited technology experiments.\n- Complete Mobile Autonomous ISR to C2 Synchronization - Transition to MARCORSYSCOM a service that can track mission task readiness as a function of addressed information fulfillments and unaddressed information deficits.  \n\nEC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE \n- Continue EW Battle Management (EWBM) - Integrate interactive Electronic Warfare displays and alternate communications methods into Navy surface ship combat systems and command and control doctrine.\n\nEC: FNT-FY13-03 SILK THREAD\n- Continue Silk Thread Product 1 - Conduct advanced technology development.\n- Continue Silk Thread Product 2 - Conduct advanced technology development.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Continue Adaptive Multi-Int Correlation & Identification (AMICA) - Develop, test and modify algorithms to enable cross-domain information fusion and optimize use of remote sensing assets.\n- Continue Detection & Classification Algorithms (DCA) - Develop, test and modify algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Integrate new methods and demonstrate their performance via simulation in limited bandwidth environments.\n- Continue Data Exfiltration and Networked Platform Interaction - Integrate components with selected waveforms and evaluate communication performance in packages consistent with the size, weight and power constraints of sonobuoys and unmanned underwater vehicles.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Conduct integration and testing of E-2D Advanced Hawkeye electronic protection techniques.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud (formerly called Naval Tactical Cloud Analytics) - Develop, integrate and validate through Limited Technology Experiments, enhanced ASW, IAMD and EXW  situational awareness, decision support analytics and planning algorithms and widgets through mission focused exploitation of all relevant cross-domain data within the Naval Tactical Cloud.  \n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Demonstrate in the laboratory an initial modular Radio Frequency functionality for Size, Weight and Power (SWaP) restricted platforms.\n- Continue Electronic Warfare Tactical Decision Aid (EW-TACAID) - Demonstrate an Electronic Warfare display with an onboard, integrated, and adaptive high fidelity training capability to improve the warfighters' ability to manage increasingly complex Radio Frequency environments.\n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Demonstrate in the laboratory initial techniques for high speed data conversion and multi-function Radio Frequency processing.\n\nEC: FNT-FY16-01 BUGLE\n- Initiate Bugle - Develop and test algorithms for integration into communication systems.\n\nEC: FNT-FY16-02 COMBINED EO\/IR SURVEILLANCE AND RESPONSE SYSTEM (CESARS)\n- Initiate Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Develop and test an integrated, multiband laser and sensor architecture that is scalable and modular. \n- Initiate Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Develop and test an open architecture design for a panoramic, staring, imaging system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "59.633"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE\n- Continue EW Battle Management (EWBM) - Integrate Blue and Red force monitoring in Electronic Warfare (EW) planning and execution, and Navy communication and control doctrine.\n\nEC: FNT-FY13-03 SILK THREAD\n- Continue Silk Thread Product 1 - Conduct advanced technology development.\n- Continue Silk Thread Product 2 - Conduct advanced technology development.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Continue Adaptive Multi-Int Correlation & Identification (AMICA) - Develop, test and modify algorithms to enable cross-domain information fusion and optimization of theater and tactical battlespace assets to conduct anti-surface warfare.\n- Complete Detection & Classification Algorithms (DCA) - Develop, test and modify algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Develop algorithms and software to assure network connectivity for low latency data sharing and autonomous and adaptive Command and Control (C2) services for coordination of data collection and sharing.\n- Continue Data Exfiltration and Networked Platform Interaction - Demonstrate and assess the performance of the radio components and waveforms in the host platform in simulated environments.\n\nEC: FNT-FY14-03 EXCHANGE OF ACTIONABLE INFORMATION AT THE TACTICAL EDGE (EAITE)\n- Continue from PE 0603640M Actionable Information Tactical Applications from PE 0603640M - Develop algorithms to assess the content of a machine produced product to a reference Information Requirement (IR) ontology.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Implement techniques to improve Advanced Hawkeye E2-D electronic protection capability.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud - Test and evaluate new analytic services based on multi-source correlation (Environment, Combat Systems, C2, ISR, EW, Cyber and national\/offboard ISR) using property graphs, applying probabilistic analytic models for improved target detection and for historical and predictive analytics supporting ASW, IAMD and EXW amphibious missions.\n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Demonstrate the ability to simultaneously run and change in real time different Electronic Warfare\/Electronic INTelligence (EW\/ELINT) processing capabilities on the same modular hardware.\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Demonstrate in the laboratory an initial modular Broadband Radio Frequency (RF) front end coupled to a small Intelligence, Surveillance, and Reconnaissance (ISR) collection payload.\n- Continue Electronic Warfare Tactical Decision Aid (EW-TACAID) - Develop an intuitive Electronic Warfare display with an onboard integrated adaptive training capability to improve the ability of Electronic Support Measures to manage increasingly complex Radio Frequency environments.\n\nEC: FNT-FY16-01 BUGLE\n- Continue Bugle - Develop and test algorithms for integration into communication systems.\n\nEC: FNT-FY16-02 Combined EO\/IR Surveillance and Response System (CESARS)\n- Continue Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Begin fabrication of staring, panoramic situational awareness sensors.\n- Continue Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Begin fabrication of the high resolution sensor.\n\nEC: FNT-FY17-01 COMMUNICATIONS AND INTEROPERABILITY FOR INTEGRATED FIRES (CIIF)\n- Initiate Communications as a Service (CaaS) - Develop, emulate and prototype multi-commodity flow optimization techniques and routing\/bridging between Internet Protocol (IP) and non-IP networks with end-to-end Quality of Service (QoS).\n- Initiate Mission-based Networking for DDS (MiND) - Develop power-control, medium-access control and network topology\/routing to enhance bandwidth and scalability, while creating a new Internet Protocol (IP) interface and maintaining interoperability with legacy Cooperative Engagement Capability (CEC) systems.\n\nEC: FNT-FY17-02 SUBMARINE SIMULTANEOUS TRANSMIT AND RECEIVE (SUBSTAR)\n- Initiate Submarine Simultaneous Transmit and Receive (SubSTAR) - Verify concept of submarine broadband antenna enabling simultaneous transmit and receive capability.\n\nEC: FNT-FY17-04 RESILIENT HULL\/INFRASTRUCTURE MECHANICAL & ELECTRICAL SECURITY (RHIMES)\t\n- Initiate SCRAM - Develop and demonstrate software algorithms that protect naval Hull, Mechanical and Electrical (HM&E) systems against cyber threats.\n- Initiate SCAMM - Develop and demonstrate information shaping cyber capabilities for tactical platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "61.657"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "61.657"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE\n- Complete EW Battle Management (EWBM) - Automate blue and red force monitoring in Electronic Warfare (EW) planning and develop techniques to integrate that information into force level tactical decision making.\n\nFNC: FNT-FY13-03 SILK THREAD\n- Complete Silk Thread Product 1 - Complete hardware development and transition to designated programs of record.\n- Complete Silk Thread Product 2 - Complete hardware development and transition to designated programs of record.\n\nFNC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Complete Adaptive Multi-Int Correlation & Identification (AMICA) - Extended into FY18 to complete the modification of algorithms to enable cross-domain information fusion and optimization of theater and tactical battlespace assets to conduct anti-surface warfare.\n\nFNC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Complete Adaptive TCPED for ASW Services - Develop algorithms and software to ensure network connectivity for low latency data sharing and autonomous and adaptive Command and Control (C2) services for coordination of data collection and sharing.  \n- Complete Data Exfiltration and Networked Platform Interaction - Demonstrate and assess the performance of the radio components and waveforms in a host platform in simulated environments.\n\nFNC: FNT-FY14-03 EXCHANGE OF ACTIONABLE INFORMATION AT THE TACTICAL EDGE (EAITE)\n- Continue Actionable Information Tactical Applications - Develop gisting algorithms to assess the content of a machine produced product to a reference ontology. (In FY19, this FNC Product will be realigned within this PE to IW-FY14-02 under a new Information Warfare R-2 Activity) \n\nFNC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Test and improve Airborne Early Warning (AEW) electronic protection capabilities within a relevant environment. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-01 under a new Air Warfare R-2 Activity)\n\nFNC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud - Develop predictive motion models, enemy course-of-action and intent analytics with multi security levels for integrated fires and integrated air and missile defense operational intelligence. (In FY19, this FNC Product will be realigned within this PE to IW-FY15-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Implement and evaluate spectral interference mitigation and coordination techniques during laboratory and at-sea tests. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-02 under a new Undersea Warfare R-2 Activity)\n- Complete Electronic Warfare Tactical Decision Aid (EW-TACAID) - Implement and test techniques developed to provide efficient operator interfaces in support of netted sensor and coordinated EW operations.  \n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Demonstrate prototype effectiveness via testing in laboratory and at-sea scenarios. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-02 under a new Undersea Warfare R-2 Activity)\n\nFNC: FNT-FY16-01 BUGLE\n- Continue Bugle - Conduct testing and a demonstration of advanced waveforms. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY16-02 COMBINED EO\/IR SURVEILLANCE AND RESPONSE SYSTEM (CESARS)\n- Continue Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Implement final designs through the fabrication of the high resolution sensor and optics hardware, laser hardware, turret hardware, and processing and system controls. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-03 under a new Information Warfare R-2 Activity)\n- Continue Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Demonstrate a large Focal Plane Array (FPA) stitching and panoramic capability. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-03 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY17-01 COMMUNICATIONS AND INTEROPERABILITY FOR INTEGRATED FIRES (CIIF)\n- Continue Communications as a Service (CaaS) - Emulate, test and develop software for date forwarding and routing protocols between IP and non-IP networked data links. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-01 under a new Information Warfare R-2 Activity)\n- Continue Mission-Based Networking for DDS (MiND) - Initiate firmware porting and the porting of waveform software code to the emulation platform. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-01 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY17-02 SUBMARINE SIMULTANEOUS TRANSMIT AND RECEIVE (SUBSTAR)\n- Continue Submarine Simultaneous Transmit and Receive (SubSTAR) - Test and improve the prototype broadband simultaneous transmit and receive subsystems. (In FY19, this FNC Product will be realigned within this PE to UW-FY17-01 under a new Undersea Warfare R-2 Activity)\n\nFNC: FNT-FY17-04 RESILIENT HULL\/INFRASTRUCTURE MECHANICAL & ELECTRICAL SECURITY (RHIMES)\t\n- Continue SCAMM - Demonstrate proactive information shaping capabilities in the laboratory. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-02 under a new Information Warfare R-2 Activity)\n- Continue SCRAM- Demonstrate resilient software to protect redundant controllers and controllers without redundancy in a laboratory environment. (In FY19, this FNC Product will be realigned within this PE to SW-FY17-01 under a new Surface Warfare R-2 Activity)\n\nFNC: FNT-FY18-04 NANOSAT COMMUNICATIONS FOR A2AD OPERATIONS\n- Initiate Nanosat Communications Payloads - Integrate and test a nanosat payload to verify communications performance in the UHF-band in a laboratory environment. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity)\n- Initiate Shipboard Integration - Integrate and test UHF networking with a digital mobile radio using a shipboard antenna and tracking. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY18-05 ADVANCED COORDINATION TECHNIQUES FOR DISTRIBUTED EW\n- Initiate Coordinated Radio Frequency EW (CRFEW) - Implement precision geo-location and coordinated engagement techniques to surface ship applications in order to provide surface ships with emitter geo-location capabilities and the ability to coordinate electronic attack engagements on battlespace emitters. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity)\n- Initiate Next Generation Surface Electronic Warfare User Interface - Begin a domain analysis for familiarization with relevant Navy systems, programs of record, technical performers, and the system constraints imposed on human machine interface development. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity)\n- Initiate Propagation Channel Assessment and Prediction (PCAP) - Implement techniques for providing real-time propagation channel assessments using shipboard and netted radio frequency sensors and data communication infrastructures. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "POWER AND ENERGY (P&E)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Power and Energy (P&E) FNC pillar.  The P&E Pillar develops deliverable technologies that provide new capabilities in energy security, efficient power and energy systems, high energy and pulse power.   \n\nThe FY 2016 to FY 2017 increase was due primarily to the ramp-up of P&E-FY15-03 and the initiation of P&E-FY17-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.476"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-01 RENEWABLE-SUSTAINABLE EXPEDITIONARY POWER\n- Complete Renewable Thermal Engine - Conduct full-scale testing and a TRL 6 demonstration, and deliver tactical power system prototype to USMC transition sponsor.\n\nEC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Continue Air Independent Propulsion System - Conduct Phase II fuel cell energy system integration into a UUV energy section and conduct TRL-6 land-based testing and transition planning. \n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Develop final Phase II design for prototype circuit protection devices and initiate development of the devices and the associated test environment.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Continue Compact High Density Tactical Energy Storage - Develop and test a multifunction energy storage module system, which integrates target subcomponent technologies.\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop a subscale ship multi-function energy storage module integrated system and conduct initial shipboard testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.641"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Continue Air Independent Propulsion System - Continue conduct Phase II fuel cell energy system integration into a UUV energy section and conduct TRL-6 land-based testing and transition planning. \n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Select the appropriate 20kV semiconductor devices and develop the related circuit topology and fault sensing algorithms.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop a ship multi-function energy storage module integrated system and complete development of a safe non-propagating battery subsystem.\n- Continue Compact High Density Tactical Energy Storage - Initiate development of a full scale multifunction energy storage module with hybrid power system interface.\n\nEC: P&E-FY17-02 TORPEDO ADVANCED PROPULSION SYSTEM (TAPS)\n- Initiate Torpedo Advanced Propulsion System (TAPS) - Initiate limited component development and testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.817"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.817"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Complete Air Independent Propulsion System - Complete Phase II fuel cell energy system integration into a UUV energy section and conduct TRL-6 land-based testing and transition planning. \n\nFNC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Complete High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Complete circuit protection component testing in a relevant system environment.\n\nFNC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Complete Compact High Density Tactical Energy Storage - Complete development, demonstration, and testing of a full-scale Technology Readiness Level (TRL) 6 Compact High Density Tactical Energy Storage module with a hybrid power system interface.\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop and demonstrate a megawatt scale multifunction energy storage system with an incorporated non-propagating battery subsystem. \n\nFNC: P&E-FY17-02 TORPEDO ADVANCED PROPULSION SYSTEM (TAPS)\n- Continue Torpedo Advanced Propulsion System (TAPS) - Conduct limited component development and testing, preparing for a down-selection to one technology."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASING (BAS)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Basing (BAS) FNC pillar.  The BAS Pillar develops deliverable logistics, shipping and at-sea transfer technologies that provide new capabilities for projecting expeditionary force from the sea base and providing sea based joint operational independence through improved connector, at-sea transfer and shipboard logistical capabilities.  \n\nThe FY 2016 to FY 2017 decrease was due to the completion of BAS-FY11-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.719"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: BAS-FY11-01 CONNECTORS AND THE SEA BASE\n- Complete Advanced Mooring System - Demonstrate a fully capable advanced mooring system and transition it to sponsors.\n- Complete Environmental Ship Motion Forecasting - Develop wave and ship motion forecasting technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA SHIELD (SHD)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Shield (SHD) FNC pillar.  The SHD Pillar develops deliverable technologies that provide new capabilities in theater air and missile defense, anti-submarine warfare, mine countermeasures, defensive surface warfare, global defensive assurance, anti-terrorism, and fleet\/force protection.  \n\nThe FY 2016 to FY 2017 decrease was due primarily to the completion of SHD-FY10-01, SHD-FY10-03, SHD-FY11-01, SHD-FY12-01 and SHD-FY12-03, the planned ramp down of SHD-FY13-05, SHD-FY14-02 and SHD-FY16-05, and the movement of SHD-FY16-OSD out of the FNC Program into PE 0603782N.\n\nThe FY 2017 to FY 2018 decrease was due primarily to the completion of 1) SHD-FY13-05 High Altitude ASW (HAASW) from the P-8, which will finish the demonstration of next generation multi-static active capability sonobuoys, and 2) SHD-FY13-07 USV Payloads for Single Sortie Mine Countermeasures, which will perform a final system demonstration of the neutralizer test bed, the launch, recovery, communications, and recharging systems, and the automatic target recognition capability; and the planned ramp down of 1) SHD-FY12-04 Detection and Neutralization of Near-Surface Drifting-Oscillating Mines, which will finish in FY18 after completing a final demonstration of the multi-sensor detection of ocean mines, 2) SHD-FY15-07 Hyper Velocity Projectile, which will finish in FY18 after the assembly of hypervelocity projectiles in preparation for a full-up launch, and 3) SHD-FY16-06 Next Generation Airborne Passive System (NGAPS), which will wind down the testing and integration of hardware."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "75.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: SHD-FY10-01 ANTI-SHIP MISSILE DEFENSE TECHNOLOGIES\n- Complete Enhanced Lethality Guidance Algorithms (ELGA) - Demonstrate and validate the guidance algorithm with respect to exit criteria.\n- Complete Enhanced Maneuverability Missile Airframe (EMMA) - Demonstrate the dual pulse rocket motor and integrated thrust vector control, and deliver the final rocket motor design.\n\nEC: SHD-FY10-03 ADVANCED SONAR TECHNOLOGY FOR HIGH CLEARANCE RATE MCM\n- Complete Long Range LFBB Sonar (AUV Platform Option) - Perform final system demonstration and exit event.\n\nEC: SHD-FY10-05 AFFORDABLE VECTOR SENSOR TOWED ARRAY AND SIGNAL PROCESSING\n- Complete Vector Sensor Towed Array - Finalize the demonstration of a thin, twin-line capability in a single array.\n\nEC: SHD-FY11-01 TORPEDO COMMON HYBRID FUZING SYSTEM\n- Complete Torpedo Common Hybrid Fuzing System - Conduct final field testing, demonstrate a prototype system, and transition the system to acquisition for engineering development.\n\nEC: SHD-FY12-01 FORCE LEVEL RADAR RESOURCE MANAGEMENT FOR INTEGRATED AIR AND MISSILE DEFENSE (IAMD)\n- Complete Radar Resource Manager for IAMD - Conduct a final demonstration of the Radar Resource Manager and validate the technology deliverable with respect to exit criteria.\n\nEC: SHD-FY12-03 SONAR AUTOMATION\n- Complete Active Sonar Automation - Evaluate and deliver algorithms for use in current active sonar systems that improve operator performance and reduce workload.\n- Complete Passive Sonar Automation - Evaluate and deliver algorithms for use in current passive sonar systems that improve operator performance and reduce workload when used against quiet submarines in the presence of clutter.\n\nEC: SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Demonstrate multi-sensor detection of ocean mines from a manned helicopter.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Continue Cooperative Networked Radar - Conduct integration and testing for cross platform radar operation. \n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Continue Next Generation Multistatic Active Capability (NGMAC) - Improve and evaluate the performance of hardware and software for use in improving the Multistatic Active Capability sonobuoys and P-8A signal processing.\n- Complete Unmanned Targeting Air System (UTAS) - Integrate compact magnetometers into Unmanned Air System (UAS) candidates and develop test plans for a maneuver table to compare Tier 1 and Tier 2 UAS's for the ASW mission.\n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Continue MCM Payload Automation for Data Analysis - Develop and extend adaptive Automatic Target Recognition approaches to advanced environmental models supporting Net-centric Sensor Analysis for MIW (NSAM).\n- Continue MCM Payload Automation for Planning - Develop and extend adaptive Automatic Target Recognition approaches to advanced environmental models supporting the Mine-warfare Environmental Decision-Aid Library (MEDAL).\n- Continue Single Sortie MCM Detect-to-Engage Payload - Design and develop launch, recovery, communications, and recharging systems, and associated algorithms and vehicle payload support hardware.\n- Continue USV-based Mine Neutralization - Develop and modify the processing and hardware for neutralization technologies.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE \n- Continue Concept C Countermeasure - Develop test plan for array design improvements.\n- Continue ATT Timeline Compression (ATTTC) - Begin in-water demonstrations.\n- Complete HVU Mounted Sonar - Complete array electronics and fabricate the first transmit\/receive panels, validating performance in a lake test.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Autonomous Threat Detection and Localization - Develop and integrate node deployment modules and the weapons payload, and conduct functional testing.\n- Continue Remote Command & Control - Develop communications package improvements and conduct functional component and system testing.\n- Continue Tactical Positioning & Fire Control - Conduct testing and evaluation, and integrate improved sensor node hardware and detection, classification, localization and targeting algorithms.\n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S (formerly Terminator E, R and S) - Validate the Ship Self-Defense System (SSDS) algorithm and the fire control loop concept using modeling and simulation tools.\n\nEC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Initiate MCM Task Force Planning - Extend algorithms for squadron-level planning and re-planning.\n- Initiate Expeditionary MCM Automated Data Analysis - Develop advanced automatic target recognition capabilities for Synthetic Aperture Sonar (SAS) and closed-aperture SAS.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Continue Hyper Velocity Projectile - Design, fabricate and begin assembly of hypervelocity projectiles in preparation for a full-up launch to validate common interfaces for powder gun and railgun launch. \n\nEC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Initiate Ship-launched EW Extended Endurance Decoy (SEWEED) - Build mockups of the fuselage, rotor and antenna cavity for RF payload antenna isolation experiments.\n\nEC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Initiate Surface Ship Periscope Detection and Discrimination (SSPDD) - Customize hardware interfaces for assembly and integration of system level components.\n\nEC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Initiate Next Generation Airborne Passive System (NGAPS) - Develop algorithms and hardware for field communications control, health monitoring, mission planning and contact separation and correlation.   \n\nEC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Initiate Softkill Performance and Real-Time Assessment (SPARTA) - Develop and optimize performance assessment algorithms, and align them with a pending system requirements review.\n\n EC: SHD-FY16-OSD MODULAR UNDERSEA EFFECTORS (MUSE)\n- Initate Modular UnderSea Effectors (MUSE) - Commence design of delivery and mooring approaches, technologies to integrate UUV-based and encapsulated undersea weapons, and prototyping of advanced sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "68.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Complete Compact Modular Sensor-Processing Suite (CMSS) - Demonstrate multi-sensor detection of ocean mines from a manned helicopter.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Continue Cooperative Networked Radar - Initiate test and demonstration planning for software algorithms and techniques for cross-platform radar operation that will deliver enhanced sensitivity.\n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Complete Next Generation Multistatic Active Capability (NGMAC) - Demonstrate the Next Generation Multistatic Active Capability sonobuoys in a relevant at sea Navy environment.\n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Complete USV-based Mine Neutralization - Perform final system demonstration of Neutralizer Test Bed and associated technologies.\n- Complete Single Sortie MCM Detect-to-Engage Payload - Perform final system demonstration of launch, recovery, communications,  recharging systems, and associated algorithms\/vehicle payload support hardware.\n- Complete MCM Payload Automation for Data Analysis - Demonstrate system-level Automatic Target Recognition (ATR) capability at technology development exit event.\n- Complete MCM Payload Automation for Planning - Demonstrate component level risk analysis in war game exit event.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE\n- Continue ATT Timeline Compression (ATTTC) - Conduct in-water component testing and data collection.\n- Continue Concept C Countermeasure - Conduct bench testing of array design improvements and prepare for in-water tests.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Tactical Positioning & Fire Control - Demonstrate node deployment modules & weapons payload integration.\n- Continue Autonomous Threat Detection and Localization - Develop final sensor node hardware\/software and perform functional testing.\n- Continue Remote Command & Control - Demonstrate an integrated communications package.\n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S (formerly Terminator E, R and S) - Validate the Ship Self-Defense System (SSDS) algorithm and the fire control loop concept using modeling and simulation tools.\n\nEC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Continue MCM Task Force Planning - Develop approach to automate data management from Naval message traffic to support re-planning, scheduling, and situational awareness.\n- Continue Expeditionary MCM Automated Data Analysis - Extend in situ retraining algorithms to multi-band advanced sonar systems.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Continue Hyper Velocity Projectile - Design, fabricate and begin assembly of hypervelocity projectiles in preparation for a full-up launch to validate common interfaces for powder gun and railgun launches.\n\nEC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Continue Ship-launched EW Extended Endurance Decoy (SEWEED) - Build mockups of the fuselage, rotor, and antenna cavity for RF payload antenna isolation experiments.\n\nEC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Continue Surface Ship Periscope Detection and Discrimination (SSPDD) - Customize hardware interfaces for assembly and integration of system level components.\n\nEC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Continue Next Generation Airborne Passive System (NGAPS) - Integrate algorithms with hardware for field communications, control, health monitoring, mission planning and contact separation and correlation.\n\nEC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Continue Softkill Performance and Real-Time Assessment (SPARTA) - Develop and optimize performance assessment algorithms and align them with a pending system requirements review.\n\nEC: SHD-FY16-OSD MODULAR UNDERSEA EFFECTORS (MUSE)\n- Continued in PE 0603782N.\n\nEC: SHD-FY17-02 AUTONOMOUS UNMANNED SURFACE VEHICLES FOR MINE WARFARE (MIW)\n- Initiate Autonomous Situational Awareness and Hazard Avoidance System for USVs - Integrate autonomous control on an Unmanned Surface Vehicle (USV) and demonstrate at-sea.\n- Initiate High Temperature Superconducting (HTS) Magnetic Influence Sweep Payload for USVs - Integrate the superconducting system on an Unmanned Surface Vehicle (USV) and demonstrate at-sea.\n- Initiate Underway Refueling and Data Transfer for USVs and RMMVs - Integrate underway refueling and data transfer technology with Unmanned Surface Vehicles (USVs) and Remote Multi-Mission Vehicles (RMMVs) and demonstrate at-sea.\n\nEC: SHD-FY17-05 DEEP RELIABLE ACOUSTIC PATH EXPLOITATION SYSTEM (DRAPES)\n- Initiate Deep Reliable Acoustic Path Exploitation System (DRAPES) - Integrate algorithms and hardware for undersea communications, health monitoring, and contact separation and correlation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "59.974"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "59.974"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC:  SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Complete Compact Modular Sensor-Processing Suite (CMSS) - Finish the final Demonstration of the multi-sensor detection of ocean mines that had to be extended into FY18.\n\nFNC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Continue Cooperative Networked Radar - Conduct testing and demonstrating software algorithms and techniques for cross-platform radar operation deliver enhanced sensitivity.\n\nFNC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE\n- Continue ATT Timeline Compression (ATTTC) - Conduct a static in-water demonstration. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-03 under a new Surface Warfare R-2 Activity)\n- Continue Concept C Countermeasure - Conduct an at-sea static assessment of the complete subsystem. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-03 under a new Surface Warfare R-2 Activity)\n\nFNC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Autonomous Threat Detection and Localization - Conduct testing and preparations for an at-sea demonstration of the full detection, classification, localization, and tracking sequence on an Extra Large Unmanned Undersea Vehicle (XLUUV).\n- Continue Remote Command & Control - Conduct testing and preparations for an at-sea demonstration of full command and control functionality on an Extra Large Unmanned Undersea Vehicle (XLUUV).\n- Continue Tactical Positioning & Fire Control - Conduct testing and preparations for an at-sea demonstration of the sensor placement and firing solution functionality on an Extra Large Unmanned Undersea Vehicle (XLUUV).\n\nFNC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S - Validate the Ship Self-Defense System (SSDS) algorithm and the fire control loop concept using modeling and simulation tools. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-04 under a new Surface Warfare R-2 Activity)\n\nFNC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Continue Expeditionary MCM Automated Data Analysis - Collect at-sea training data for multi-band automatic target recognition and fusion algorithms. (In FY19, this FNC Product will be realigned within this PE to EMW-FY15-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue MCM Task Force Planning - Conduct experiments and a table-top war-game on the re-planning and planning of risk, using the results to update the algorithms and human-machine interface approach. (In FY19, this FNC Product will be realigned within this PE to EMW-FY15-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n\nFNC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Complete Hyper Velocity Projectile - Design, fabricate and begin assembly of hypervelocity projectiles in preparation for a full-up launch to validate common interfaces for powder gun and railgun launches.\n\nFNC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Continue Ship-launched EW Extended Endurance Decoy (SEWEED) - Conduct flight testing of the decoy demonstrator vehicle and isolation testing of the payload module. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-04 under a new Information Warfare R-2 Activity)\n\nFNC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Continue Surface Ship Periscope Detection and Discrimination (SSPDD) - Continue development and commence preparation of an initial test plan for the government-reference prototype sensor and data fusion system.\n\nFNC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Continue Next Generation Airborne Passive System (NGAPS) - Test and integrate hardware for field communications, control, health monitoring, mission planning and contact separation\/correlation. (In FY19, this FNC Product will be realigned within this PE to AW-FY16-02 under a new Air Warfare R-2 Activity)\n\nFNC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Continue Softkill Performance and Real-Time Assessment (SPARTA) - Develop and optimize performance assessment algorithms and align them with a pending system requirements review. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-05 under a new Information Warfare R-2 Activity)\n\nFNC: SHD-FY17-02 AUTONOMOUS UNMANNED SURFACE VEHICLES FOR MINE WARFARE (MIW)\n- Continue Autonomous Situational Awareness and Hazard Avoidance System for USVs - Demonstrate with an Unmanned Surface Vehicle (USV) an autonomous situational awareness and avoidance capability that enables avoidance of fixed and moving hazards, with the ability to regain track and revisit missed areas using low bandwidth communications. (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue High Temperature Superconducting (HTS) Magnetic Influence Sweep Payload for USVs - Demonstrate improved clearance rates and reduced risk to Unmanned Surface Vehicles (USVs) from mine detonation, and improved mean time between maintenance. (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue Underway Refueling and Data Transfer for USVs and RMMVs - Demonstrate automated\/unmanned refueling of an Unmanned Surface Vehicle (USV) with data download\/upload using a second unmanned platform in up to sea state 3. (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n\nFNC: SHD-FY17-05 DEEP RELIABLE ACOUSTIC PATH EXPLOITATION SYSTEM (DRAPES)\n- Continue Deep Reliable Acoustic Path Exploitation System (DRAPES) - Integrate algorithms and hardware for undersea communications, health monitoring, and contact separation\/correlation. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-03 under a new Information Warfare R-2 Activity)\n\nFNC: SHD-FY18-08 FORCE-LEVEL INTEGRATED FIRES REAL-TIME ENGAGEMENT COORDINATION AND PERFORMANCE ESTIMATION (FIRECAPE)\n- Initiate FIRECAPE Algorithms - Begin development of prototype tactical software and testing on tactical hardware to validate the performance of algorithms against complex threat raids. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-04 under a new Information Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA STRIKE (STK)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE.  The Sea Strike (STK) FNC pillar develops deliverable technologies that provide new capabilities in power projection and deterrence, precise and persistent offensive power, weapons, aircraft, and expeditionary warfare.  \n\nThe FY 2016 to FY 2017 increase was due primarily to the planned ramp-up of STK-FY15-01, STK-FY15-02, STK-FY16-01 and STK-FY17-04.\n\nThe FY 2017 to FY 2018 increase was due primarily to the planned ramp up of 1) STK-FY13-01 Long Range RF Find, Fix and ID, which will conduct testing, mitigate exceptions, and demonstrate the Long Range Find, Fix, and ID capability, 2) STK-FY15-01 Synthetic Aperture Radar Electronic Protection (SAREP), which will test, assess, and improve the synthetic aperture radar electronic protection capability in relevant littoral environments, 3) STK-FY15-02 Rotor-craft Advanced Protection from IR\/EO\/RPG (RAPIER), which will demonstrate the technological feasibility of a Rocket Propelled Grenade (RPG) hard-kill defense system and test the final Infra-Red Countermeasures (IRCM) prototype system to be used in the field test demonstration of countermeasures techniques, 4) STK-FY15-03 Extended Range Modular Undersea Heavyweight Vehicle (ER MUHV), which will conduct in-water testing of autonomy algorithms and the multiband and hybrid sonar, inertial navigation, and fiber optic systems, and 5) STK-FY16-01 Extended-Range Targeting (E-RAT), which will conduct technology concept demonstrations of subsystem models; and the initiation of STK-FY18-01 Precision Electronic Attack Technologies (PEAT), which will develop and implement Electronic Warfare (EW) techniques and supporting technology for multi-platforms effects and for intra-platform synchronized EW effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "42.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: STK-FY09-03 ENHANCED WEAPONS TECHNOLOGIES\n- Complete High Speed Components - Finish development and conduct final testing required for transition.\n\nEC: STK-FY12-01 SUBMARINE SURVIVABILITY - ELECTRONIC WARFARE\n- Complete Coherent Electronic Attack for Submarines (CEAS) - Develop prototype hardware and software for insertion of advanced electronic support and electronic attack techniques into a payload form factor consistent with compact applications, including submarine masts.  \n\nEC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Conduct integration and testing for moving maritime Radio Frequency identification algorithms.\n\nEC: STK-FY13-02 HOSTILE FIRE (HF) SUPPRESSION\n- Complete Hostile Fire Suppression System - Demonstrate real-time reactive hostile shooter suppression in a field test demonstration.\n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Demonstrate and evaluate relevant algorithms during at-sea testing.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Design, develop and demonstrate an advanced propulsion system for a future Air-to-Air missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Continue Bank Shot - Develop the software architecture and associated algorithms that provide for data fusion.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Demonstrate software operability and inter-operability for flexible weapon behaviors at the salvo level in an Anti-Access, Area-Denial environment.\n- Continue Collaborative Electronic Attack (CEA) - Integrate and test highly advanced electronic attack techniques to provide an advanced collaborative electronic attack capability against surface targets.\n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Conduct integration and testing of synthetic aperture radar electronic protection algorithms and techniques.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Demonstrate the technological feasibility of a Rocket Propelled Grenade (RPG) hard-kill defense system and its component operability on the MV-22.\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Develop Electro-Optical\/Infrared (EO\/IR) countermeasure high power sources and supporting optics that can be integrated into Joint and Allied systems.\n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Conduct in-water autonomy open-loop testing.\n- Continue MUHV Sensors, Navigation and Guidance - Conduct in-water navigation system demonstrations (open and closed loop).\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Conduct concept and technology demonstrations of subsystem models to assess the feasibility and operability of new technologies for targeting and fire control modes at extended ranges.\n\nEC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Initiate Reactive Electronic Attack Measures (REAM) - Develop a test bed for testing enhanced Radio Frequency sensing algorithms and an integration strategy for targeted transition systems.\n\nEC: STK-FY17-04 ALPO\n- Continue ALPO - Begin development of an advanced signal processing system in a relevant tactical environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.467"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Test and verify performance of algorithms for achieving Radio Frequency (RF) identification of moving maritime contacts.\n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Evaluate system performance based during in-water testing.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Design, develop and demonstrate an advanced propulsion system for a future Air-to-Air missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Complete Bank Shot - Develop the software architecture and associated algorithms that provide for data fusion.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Demonstrate software operability and interoperability for flexible weapon behaviors at the salvo level in an Anti-Access, Area-Denial environment.\n- Continue Collaborative Electronic Attack (CEA) - Perform lab testing of Collaborative Peer-to-Peer Adaptable Electronic Warfare (EW) Mission Prioritization and threat classification algorithms.\n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Test algorithms and techniques to improve synthetic aperture radar electronic protection.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Demonstrate the technological feasibility of a Rocket Propelled Grenade (RPG) hard-kill defense system and its component operability.\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Begin subcomponent design integration of the Electro-Optic (EO) source to be used in combination with an existing Infra-Red CounterMeasures (IRCM) Laser to support transition.\n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Conduct open-loop in-water demonstrations of autonomy algorithms for mission planning, waypoint navigation, and vehicle health assessment.\n- Continue MUHV Sensors, Navigation and Guidance - Conduct in-water demonstrations of multiband and hybrid sonar, inertial navigation, and fiber optic systems.\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Conduct technology concept demonstrations of subsystem models to assess the feasibility and operability of new technologies for the targeting and fire control modes at extended ranges.\n\nEC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Continue Reactive Electronic Attack Measures (REAM) - Design and integrate adaptive capabilities into an advanced prototype within an existing Electronic Attack (EA) suite subsystem and adaptive threat simulator.\n\nEC: STK-FY17-04 ALPO\n- Continue ALPO - Continue technology development of an advanced signal processing system in a relevant tactical environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.314"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.314"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Complete Long Range Find, Fix and ID - Conduct testing, mitigate exceptions, and demonstrate the Long Range Find, Fix, and ID capability.\n\nFNC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Complete Anti-Surface Warfare (ASuW) Weapon Upgrade - Demonstrate a phase II capability in a tactically relevant environment.\n\nFNC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Complete SMOKE - Design, develop and demonstrate an advanced propulsion system for a future air-to-air missile.\n\nFNC: STK-FY14-01 BANK SHOT\n- Complete Bank Shot - Develop the software architecture and associated algorithms that provide for data fusion.\n\nFNC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Complete Collaborative Anti-Surface Warfare Engagement (CASE) - Demonstrate software operability and interoperability for flexible weapon behaviors at the salvo level in an anti-access area-denial environment.\n- Continue Collaborative Electronic Attack (CEA) - Perform bench-top and hardware-in-the-loop testing of the electronic support\/electronic attack hardware and cognitive components. (In FY19, this FNC Product will be realigned within this PE to IW-FY14-03 under a new Information Warfare R-2 Activity)\n\nFNC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Test, assess, and improve the synthetic aperture radar electronic protection capability in relevant littoral environments. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-03 under a new Air Warfare R-2 Activity)\n\nFNC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Demonstrate the technological feasibility of a Rocket Propelled Grenade (RPG) hard-kill defense system and its component operability. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-04 under a new Air Warfare R-2 Activity)\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Build and test the final Infra-Red Countermeasures (IRCM) prototype system to be used in the field test demonstration of countermeasures techniques, build expendables based on derived expendable requirements, and perform radiometric measurements in the field. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-04 under a new Air Warfare R-2 Activity)\n\nFNC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Conduct in-water testing and assessment of autonomy algorithms for mission planning, waypoint navigation and vehicle health. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-03 under a new Undersea Warfare R-2 Activity)\n- Continue MUHV Sensors, Navigation and Guidance - Conduct in-water demonstrations for maturation assessment of the multiband and hybrid sonar, inertial navigation, and fiber optic systems. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-03 under a new Undersea Warfare R-2 Activity)\n\nFNC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Complete Extended-Range Targeting (E-RAT) - Conduct concept and technology demonstrations of subsystem models to assess the feasibility and operability of new technologies for targeting and fire control modes at extended ranges.\n\nFNC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Continue Reactive Electronic Attack Measures (REAM) - Test and improve reactive electronic attack measures in the representative environment. (In FY19, this FNC Product will be realigned within this PE to AW-FY16-04 under a new Air Warfare R-2 Activity)\n\nFNC: STK-FY17-04 ALPO\n- Complete ALPO - Complete the proof of technological feasibility and assessment phase of an advanced signal processing system in a relevant tactical environment.\n\nFNC: STK-FY18-01 PRECISION ELECTRONIC ATTACK TECHNOLOGIES (PEAT)\n- Initiate Multi-platform Retrodirective EW - Develop and implement Electronic Warfare (EW) techniques and supporting technology for multi-platforms effects. (In FY19, this FNC Product will be realigned within this PE to AW-FY18-01 under a new Air Warfare R-2 Activity)\n- Initiate Single Platform Coherent Arrays - Develop and implement Electronic Warfare techniques and supporting technologies for intra-platform synchronized EW effects. (In FY19, this FNC Product will be realigned within this PE to AW-FY18-01 under a new Air Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of FNC technology products within this PE.  In all cases, these technology products support the Department of the Navy's FNC Program and are managed at the Office of Naval Research.  All FNC investments in this PE are subjected to management oversight by 2-star chaired Integrated Product Teams (IPTs) that control the naval pillars of Sea Shield, Sea Strike, Sea Basing, Forcenet, Naval Expeditionary Maneuver Warfare, Enterprise and Platform Enablers, Power and Energy, Capable Manpower, and Force Health Protection.  Each EC is aligned to a pillar and each technology product is aligned to an EC.  At the lowest level, each technology product is measured against both technical and financial milestones on a monthly basis.  Annually, each technology product is reviewed in depth for technical performance and development status by the Chief of Naval Research against goals that have been approved by the Navy's 3-star Technology Oversight Group (TOG).  Also annually, each technology product is reviewed by its 2-star chaired pillar IPT for transition planning and adequacy and transition commitment level.   Products must meet TOG required transition commitment levels for S&T development to continue.  Transition issues and required adjustments are reported annually by the Chief of Naval Research to the TOG, which establishes investment priorities for the FNC Program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.759"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.759"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The efforts described in this Project address the Advanced Technology Development associated with the Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the Navy's Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are identified by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders. The Enabling Capabilities (ECs) and associated technology product investments of the FNC Program are competitively selected by a 3-star Technology Oversight Group (TOG), chartered by the S&T Corporate Board and representing the requirements, acquisition, research and fleet\/forces communities of the Navy and the Marine Corps."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "ASW Research Prog - Cong"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.759"
                                        },
                                        "Text": {
                                            "val": "Expand field experimentation into new environments to further refine understanding of upper ocean acoustical phenomena for passive detection."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In all cases, FNC technology products support the Department of the Navy's FNC Program and are managed at the Office of Naval Research.  All FNC investments in this PE are subjected to management oversight by 2-star chaired Integrated Product Teams (IPTs).  Each EC is aligned to a pillar and each technology product is aligned to an EC.  At the lowest level, each technology product is measured against both technical and financial milestones on a monthly basis.  Annually, each technology product is reviewed in depth for technical performance and development status by the Chief of Naval Research against goals that have been approved by the Navy's 3-star Technology Oversight Group (TOG).  Also annually, each technology product is reviewed by its 2-star chaired pillar IPT for transition planning and adequacy and transition commitment level.   Products must meet TOG required transition commitment levels for S&T development to continue.  Transition issues and required adjustments are reported annually by the Chief of Naval Research to the TOG, which establishes investment priorities for the FNC Program."
                        }
                    }
                }
            ]
        }
    }
}