{
    "id": "2018-Army-PB-2040-JBOOK-4d642436f65ddc83c084fdb1d917f4809eff5a3f2d9cca01c78cf59a8dd3a26e-5",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602303A"
        },
        "ProgramElementTitle": {
            "val": "Missile Technology"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "51.801"
            },
            "CurrentYear": {
                "val": "44.313"
            },
            "BudgetYearOne": {
                "val": "43.742"
            },
            "BudgetYearOneBase": {
                "val": "43.742"
            },
            "BudgetYearTwo": {
                "val": "46.919"
            },
            "BudgetYearThree": {
                "val": "47.742"
            },
            "BudgetYearFour": {
                "val": "50.936"
            },
            "BudgetYearFive": {
                "val": "51.695"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) designs, fabricates and evaluates advanced component technologies for tactical missiles, rockets, guided munitions, and their launch systems in order to increase lethality, precision, and effectiveness under adverse battlefield conditions while reducing system cost, size and weight. Major goals in Project 214 include enhancing the survivability of the munition, launch and fire control systems and increasing kill probabilities against diverse targets.\n\nThe work in this PE is complimentary to PE 0603313A (Missile and Rocket Advanced Technology) and fully coordinated with PE 0602307A (Advanced Weapons Technology), PE 0602618A (Ballistics Technology, Robotics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0602782A (Command, Control, Communications Technology), and PE 0708045A (End Item Industrial Preparedness Activities).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThe work in this PE is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.553"
                },
                "CurrentYear": {
                    "val": "44.313"
                },
                "BudgetYearOne": {
                    "val": "45.326"
                },
                "BudgetYearOneBase": {
                    "val": "45.326"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "51.801"
                },
                "CurrentYear": {
                    "val": "44.313"
                },
                "BudgetYearOne": {
                    "val": "43.742"
                },
                "BudgetYearOneBase": {
                    "val": "43.742"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.752"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.584"
                },
                "BudgetYearOneBase": {
                    "val": "-1.584"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.752"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.712"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.712"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.128"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.128"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "214"
                    },
                    "ProjectTitle": {
                        "val": "Missile Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "43.301"
                        },
                        "CurrentYear": {
                            "val": "44.313"
                        },
                        "BudgetYearOne": {
                            "val": "43.742"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.742"
                        },
                        "BudgetYearTwo": {
                            "val": "46.919"
                        },
                        "BudgetYearThree": {
                            "val": "47.742"
                        },
                        "BudgetYearFour": {
                            "val": "50.936"
                        },
                        "BudgetYearFive": {
                            "val": "51.695"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs, fabricates, and evaluates missile and rocket component technologies that support demonstration of affordable, lightweight, highly lethal missiles and rockets. Major areas of research include: guidance, navigation, and controls; target acquisition systems; multi-spectral seekers; high-fidelity simulations; sustainment; aerodynamics and structures; launch systems, fire control technologies; payloads; and propulsion including research to help solve the insensitive munitions requirements. A theme embedded throughout the efforts in this project is smaller, lighter, and cheaper (SLC) missile technology to reduce the cost and logistical burden of precision munitions. \n\nThis Project supports the Army Science and Technology Lethality and Command, Control, Communications and Intelligence (C3I) portfolios.\n\nMajor products of this Project transition to PE 0603313A (Missile and Rocket Advanced Technology). \n \nThe cited work is consistent with the Director, Defense Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this Project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Seeker Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the design, fabrication and evaluation of missile seekers, sensors, and software.  The goal is to increase affordability and performance of missile seekers through improvement of algorithms, imaging, and thermal management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.612"
                                            },
                                            "Text": {
                                                "val": "Fabricated, integrated, and tested novel micro-cooler technologies, improving size, weight, power and reliability of advanced infrared tactical seekers; designed and fabricated advanced ultra-small seeker components for integration into reduced-weight missiles, including aviation and long range fires missiles; developed and refined sensor and software algorithms to improve the detection and tracking of airborne threats"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.659"
                                            },
                                            "Text": {
                                                "val": "Mature and assess capability of a compact, low cost radially omni-directional laser target detection device for the counter unmanned aerial systems (UAS) mission; mature and evaluate a laser-based, shared-aperture system capable of detecting and tracking sensor payloads of threat UAS; design a standard methodology and modeling capability to measure and track performance for passive sensors operating in the visible to infrared (IR) spectrum which will be applied to future tracker designs for improved and uniform performance; and design a strap-down, low-cost, IR seeker with passive precision acquisition and tracking algorithms for both stationary and moving targets; the seeker concept utilizes unique targeting solution with user-defined targets from reconnaissance imagery for true fire-and-forget engagements against a broad target set and is applicable in global positioning system (GPS) denied environments. Seeker hardware and interface are form factored for use on small guided munitions with modular open systems architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.740"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.740"
                                            },
                                            "Text": {
                                                "val": "Will develop feature extraction\/classification  and tracker algorithms for resolved and unresolved unmanned aerial system to supplement existing surveillance assets; continue to develop infrared passive precision acquisition and tracking algorithms for true fire-and-forget engagements in GPS-denied environments with seeker hardware and interface formed for use on small guided munitions with modular open systems architectures; investigate technologies that support a low cost, strap down seeker system for counter unmanned aerial systems and will evaluate potential missile guidance errors; conduct design analysis for field of view, stabilization, resolution for a man-portable, Air Defense missile and investigate the performance of tactical optics over temperature with the use of additive manufacturing; develop a compact, low cost laser ranging sensor for range finding and target detection of personnel in defilade and develop a height of burst sensor for lethality against personnel."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Guidance, Navigation and Controls Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates and evaluates guidance, navigation, and control systems and software, as well as information and signal processing systems for rocket and missile applications. Goals of this effort include more affordable missile guidance; miniaturization of guidance electronics; maintaining performance in GPS denied environments; improved image processing; improved missile power systems; improved communication with ground and other systems; technologies to track and respond to threat and offensive munition swarms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.188"
                                            },
                                            "Text": {
                                                "val": "Developed initial navigation, position, and timing testbed architecture to accept input from multiple sensors to include inertial, visual, and GPS to refine robust navigation fusion algorithms that provide accuracy in GPS assisted\/degraded\/denied environments; continuing development and evaluation of unique navigation technologies and algorithms aimed at reducing size, weight, power and cost, and dependence on the GPS while increasing or maintaining accuracy; designing novel technology for high current, extended life power sources, to enable longer flight times and increased shelf life of small guided missiles"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.630"
                                            },
                                            "Text": {
                                                "val": "Continue to mature inertial navigation systems with efforts focused on miniaturizing high performance inertial system components into significantly smaller packages for tactical missile applications while maintaining affordability; design small, precision inertial sensors\/accelerometers for fast, accurate north finding capability required to support target location systems\/missile initialization; design novel battery technologies for high current batteries with high safety, low self-discharge, and long shelf life over wide range of temperature for long range small guided missiles; explore novel technology for augmentation of lithium polymer battery storage shelf life through integration of donor power storage technologies and subsystems to increase shelf life for small maneuvering missile applications; design a guidance and control algorithm that can leverage the computing capabilities available in emerging technology and characterize its ability to improve missile performance; design roll trajectories that significantly improves the inertial-only navigation performance of missile navigation systems using the existing roll control channel of the missile system, thereby improving system performance in GPS challenged environments; investigate current state-of-the-art additive manufacturing processes; design models and empirical data for multiple types of additive manufacturing materials and a materials database for applications to missile electronic systems; design processes to deposit electronic layers of radio frequency (RF) components in and within printed objects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.773"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.773"
                                            },
                                            "Text": {
                                                "val": "Will refine and develop a multi-sensor survey system by integrating inertial navigation sensors, chip-scale atomic clock (CSAC), optics and Global Positioning System (GPS) to provide highly accurate Position, Navigation and Timing (PNT) data in GPS degraded or denied environments; refine the design of small, precision inertial sensors\/accelerometers for fast, accurate north-finding required to support target location systems\/missile initialization; continue design and fabrication of test articles for increased current capacity batteries for long range, small guided missiles; combine Radio Frequency (RF) and electronics in 3-dimensional (3D) printed objects, generate  models and databases, and assess applications to reduce size, weight, and cost of missile systems; design microelectromechanical systems (MEMS) gyroscope and optical frequency shifting device for next generation inertial sensors; develop laser source filters for semi-active Laser seeker optics and develop advanced machine intelligence and image processing techniques for enhanced target acquisition and engagement; investigate magneto-electric composites, advanced system-on-a-chip (SoC) integrated circuit electronics parts, and design processes that reduce the amount of thermal buildup."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Fire Control Systems, Sustainment, Simulations, and Launchers"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates fire control and tracking sensor technologies for area protection and air defense, technologies to increase missile useful life and reliability, advanced simulations to increase performance and reduce size, weight, and cost of missile systems, and launcher technology to deliver effects from air and ground platforms. Fire control radar effort is in coordination with PE 0602270A, Project 906 and PE 0603772A, Project 243."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.260"
                                            },
                                            "Text": {
                                                "val": "Designed and fabricated critical phased array radar technology components for a novel radar testbed to support air defense activities such as threat identification and assessment and high-value asset protection; designed and fabricated radar testbed critical components such as transmit\/receive modules; furthered mature target identification and classification algorithms focusing on integrating infrared imagery and development of ground target feature extraction increasing targeting fidelity and situational awareness; analyzed novel copper wire bond material properties and designed methodology to define qualification and acceptance for missile electronics reliability; developed initial RF predictive methodologies to create valid and reliable threat UAS RF models facilitating advanced simulations for air defense activities"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.355"
                                            },
                                            "Text": {
                                                "val": "Continue digital radar testbed establishment to develop methods to counter evolving threats and maintain overmatch capability; continue with fabrication and evaluation of transmit\/receive element array for increased firm track ranges and higher update rates; generate an Interface Control Document (ICD) between the digital radar testbed antenna array front-end and the Future Fires Radar open systems architecture back-end processing software to ensure compatibility and utilization for air defense capabilities; will continue to provide target identification algorithms for targets of interest with multiple sensor input; complete evaluation of reliability improvements of semiconductor devices using copper wire interconnects and identify key factors that mitigate negative reliability effects in target electronic devices; investigate and design an open\/modular architecture for future missile health monitoring units (HMUs) that address shortfalls\/limitations in existing fielded capability and accommodate lower cost\/quicker expansion of missile HMU capability; continue to mature UAS modeling validation processes with establishment of RF predictive methodologies; establish methods to forecast the behavior and uncertainty of air defense targets to fully leverage independent shooter capabilities in a multiple shooter air defense context; design air defense shooter engagement management algorithms informed by target forecasting algorithms; and will design new modeling and simulation techniques to improve the fidelity of complex scene generation utilized in the evaluation and analysis of infrared sensors and seekers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.409"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.409"
                                            },
                                            "Text": {
                                                "val": "Will further development of the Digital Array Radar Testbed (DART) which will be used in the development of methods to counter evolving threats and maintain overmatch capability; further fabrication and evaluation of transmit\/receive element array for increased firm track ranges and higher update rates; refine the Interface Control Document (ICD) between the digital radar testbed antenna array front-end and the Future Fires Radar open systems architecture back-end processing software to ensure compatibility and utilization for air defense capabilities; investigate a radar employing a Low Probability of Intercept chaotic waveform to detect and track small UAS systems and document results to quantify system performance and investigate the transition of the technology to other Army Air Defense radars; will refine target identification algorithms for targets of interest with multiple sensor; further develop the design of modeling and simulation tools to enable increased weather fidelity with simultaneous results across all United States (US) and world climates; further develop UAS modeling validation processes with establishment of RF predictive methodologies; investigate designs for missile airframe stability and control that includes advanced materials and miniature actuator technology; establish behind armor debris prediction capabilities for multiple shaped charge materials and designs; investigate missile battery aging behavior and mechanisms responsible for degraded reliability; investigate the viability of an affordable common, man-portable fire control system to launch both ground and Air Defense missile. This effort will be conducted in conjunction with the Communications-Electronics Research, Development and Engineering Center (CERDEC) and Army Research Laboratory (ARL)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Propulsion, Structures, Lethality, and Aerodynamic Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates, evaluates and tests missile enabling technologies including: advanced missile propulsion with reduced launch signatures; increased lethality and reduced weight and size using advanced materials and additive manufacturing. Missile Propulsion, Structures and Lethality efforts are in coordination with PE 0602618A, Project H80 and PE 0602624A, Project H28."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.834"
                                            },
                                            "Text": {
                                                "val": "Continued test and refinement of novel propulsion systems to increase missile range and reduce time of flight for extended range propulsion systems; designed and conducted performance testing of structurally optimized missile components developed using additive manufacturing techniques for reduced weight and improved strength missile components; fabricated and performed system integration tests of lightweight warhead case technologies to provide reinforced structure defeat capability; investigated, scaled up and tested emerging disruptive energetic material from the ARL in coordination with the Armaments Research Development and Engineering Center (ARDEC); designed an experimental rocket motor intended to provide increased missile range via enhanced burning rate; created and evaluated novel aerodynamic structures to support extended range and maneuvering missile applications"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.658"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate performance enhancement capability of physical burn rate augmentation for minimum signature propellant to improve volume efficiency of tactical missiles; utilize emerging energetic ingredient technologies to provide minimum smoke propellants that offer improved ballistic performance, improved mechanical properties over expanded temperature extremes, and enhanced safety performance under battlefield threats; design and characterize rocket nozzle and case insulation materials to improve insulation and erosive properties, and reduce cost for tactical missile applications; investigate and evaluate laser welding and light weight coating technology to reduce cost and manufacturing time for composite structures; design and validate logic\/algorithms that integrate target classification and identification information available from multiple weapon platform sources; use target classification information to construct fuze commands for tailorable effects payloads that optimize target defeat, minimize collateral effects, and facilitate multi-use, tailorable effects weapons; and perform concept characterization and integration experimentation of brassboard designs of advanced shaped charge, explosively formed penetrators, and fragmentation technologies established in collaboration with ARDEC and ARL to enable a family of future munitions and missiles to enhance warfighter lethality and provide overmatch for the future battlefield."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.749"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.749"
                                            },
                                            "Text": {
                                                "val": "Will conduct static test firings in representative propellant grain geometries for both minimum smoke and high performance propellants; investigate attributes of technology to mitigate temperature sensitivity of reduced shock-sensitivity minimum smoke propellants; investigate low-cost integral rocket ramjet solutions, including combustion testing of advanced fuels, for Army missions to allow extended range within a smaller size than achievable using all-solid propulsion approaches; validate laser welding process and electrically conductive coating technology to reduce weight and cost of composite structures; design and test novel warhead technologies for providing overwhelming catastrophic effects against current and emerging threat vehicles to include Main Battle Tanks (MBT); refine concept characterization and integration experiments of brassboard designs of advanced shaped charge, explosively formed penetrators, and fragmentation technologies in collaboration with ARDEC and ARL to enhance warfighter lethality and provide overmatch; investigate approaches to reduce multi-spectral launch signature for minimum smoke propulsion systems; investigate the utility of a low-cost pulsed solid rocket motor approach to provide enhanced mission flexibility for aviation-launched small guided missiles; investigate modeling tools, additive manufacturing processes, and materials to optimize performance and reducing weight and cost of missile structures; investigate lethality performance low-cost reactive penetrators against dispersed targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Role Missile Technology"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates critical technology and designs component for future affordable rockets and missiles to provide overwhelming defeat of conventional and asymmetrical threats in all environments. Successful technologies are matured and demonstrated in PE 0603313A, Project 263\/704."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.210"
                                            },
                                            "Text": {
                                                "val": "Refined detailed trade studies identifying critical technologies for next-generation close combat, precision missile systems enabling increased range for a man portable system; developed and evaluated 3D precision targeting software for Soldier, maneuver and fire support weapon applications; performed requirements definition, component trade studies, and preliminary component designs for a precision, maneuverable missile to meet emerging mission needs; designed and developed critical components (hardware and software) that support an open systems architecture to enable modular designs of guided and unguided missiles"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.099"
                                            },
                                            "Text": {
                                                "val": "Evolve precision guided missile concepts based on emerging requirements; advance research and design missile technologies such as guidance and tracker algorithms; design novel hardware-in-the-loop (HWIL) capabilities through algorithm establishment and unique modeling and simulation test equipment required to support open system architecture concepts; continue to inform and evaluate detailed designs and identify critical components required; and  integrate modular missile technology components and open system architecture into subsystems and verify subsystem performance in bench-level and laboratory environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.070"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.070"
                                            },
                                            "Text": {
                                                "val": "Will continue detailed designs and component development of low-cost guidance, navigation and control systems; multi-purpose warhead\/fuzing technologies; and low-cost range finding and sighting systems for small unit precision lethality against multiple targets at extended ranges; design and conduct laboratory evaluations of subsystems for expanding the applicability of the modular open systems architecture to the drop\/glide variant missile."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Defense Missile Technologies (formerly Counter Unmanned Aerial Systems and Counter Cruise Missile)"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and provides technologies and performs necessary trade studies to provide the key components for maturation and demonstration of air defense missiles to counter threats such as UAS and cruise missile systems. This work supports efforts in PE 0603313A, Projects 263 & 704."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.946"
                                            },
                                            "Text": {
                                                "val": "Continued development of critical interceptor technologies and components such as seeker, control system, mission computer, power system, and propulsion; designed and implemented software application algorithms for maneuver and fire support weapon targeting including expanded sensor inputs, threat flight path predictions, and calculated interceptor flight time for counter UAS missions"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.176"
                                            },
                                            "Text": {
                                                "val": "Continue establishment, fabrication and evaluation of critical air defense interceptor technologies and components: control system, mission computer, and power system; and continue to design and implement software application algorithms for maneuver and fire support weapon targeting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.368"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.368"
                                            },
                                            "Text": {
                                                "val": "Will further the design of critical air defense interceptor technologies and components; perform the mission computer, and power system laboratory bench testing and demonstration in preparation for integration into guidance electronics units for the Ballistic and Control Test Vehicle evaluations; continue design of the control actuation system and demonstrate it in laboratory dynamic flight test simulation apparatus; design and develop software algorithms to provide common targeting data across multiple tactical echelons, enabling a common operating picture for maneuver and fire support weapon targeting."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Missile Enabling Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the studies, design, establishment, fabrication, and evaluation of components and subsystems critical to produce affordable discriminate extended range precision missiles. Critical component technologies include: advanced propulsion, seekers\/sensors, fire control, datalink, guidance, navigation and controls, and airframes. These technologies transition to PE 0603313A, Project 263 for maturation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.922"
                                            },
                                            "Text": {
                                                "val": "Conducted component\/subsystem trade studies to determine subsystem requirements for an affordable discriminate extended range precision missile; began design of critical component technologies identified through subsystem trade studies"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.610"
                                            },
                                            "Text": {
                                                "val": "Continue component\/subsystem trade studies and refine and assess initial designs of critical component technologies to support the design of affordable discriminate extended range precision missile concepts. Critical component technologies include: advanced propulsion, seekers\/sensors, fire control, datalink, guidance, navigation and controls, and maneuverable airframes, and platform integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.787"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.787"
                                            },
                                            "Text": {
                                                "val": "Will refine component\/subsystem trade studies and begin to design, fabricate and test component technologies to provide the capability to engage maritime targets with lethal effects. Critical component technologies will include: sensors, data-links, guidance, navigation, controls, aerodynamics, thermal protection systems and fuze integrated payloads."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Fires Enabling Technology"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on performing the necessary trade studies, and designing, establishing, fabricating and evaluating critical component technologies needed to support a long range fires capability. These technologies transition to PE 0603313A Project 263 for maturation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.329"
                                            },
                                            "Text": {
                                                "val": "Designed and began fabricating of advanced solid rocket motors to increase range for long range fires missiles; explored novel navigation techniques specific to the timelines required for long range fires missiles in GPS denied environments; integrated and conducted dynamic tests of a blast\/fragmentation warhead and hardened multi-point fuze designed to produce effectiveness against both point and area targets, providing a single warhead variant for long range fires applications; conducted full scale tests against select military operations and urban terrain targets to characterize lethality"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.126"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate and assess emerging navigation technologies and techniques; design navigation system integration architectures and algorithms capable of integrating emerging navigation technologies into an alternate precision navigation solution; and continue performance evaluations of blast\/fragmentation warhead and hardened multi-point fuze designed to produce effectiveness against both point and area targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.846"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.846"
                                            },
                                            "Text": {
                                                "val": "Will investigate emerging navigation technologies and techniques; design navigation system integration architectures and algorithms capable of combining emerging navigation technologies into an alternate precision navigation solution; design propulsion systems to increase the range of the system; design light weight airframe structures to increase range of the system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "G05"
                    },
                    "ProjectTitle": {
                        "val": "MISSILE TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.500"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This is a Congressional Interest Item."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.500"
                                        },
                                        "Text": {
                                            "val": "Program increase for missile technology research"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}