{
    "id": "2018-UnitedStatesSpecialOperationsCommand-PB-0400-MJBOOK-0-0-d217468626b8001e5fa0f225183316ac4f61a4b93b4d909fcfb8e94b4eef34b9-3",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-SOCOM-U_RDTE_MasterJustificationBook_United_States_Special_Operations_Command_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_United_States_Special_Operations_Command_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305208BB"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineNumber": {
            "val": "230"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "32.509"
            },
            "PriorYear": {
                "val": "5.302"
            },
            "CurrentYear": {
                "val": "5.415"
            },
            "BudgetYearOne": {
                "val": "5.496"
            },
            "BudgetYearOneBase": {
                "val": "5.496"
            },
            "BudgetYearTwo": {
                "val": "6.345"
            },
            "BudgetYearThree": {
                "val": "6.451"
            },
            "BudgetYearFour": {
                "val": "6.580"
            },
            "BudgetYearFive": {
                "val": "6.712"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is part of the Military Intelligence Program (MIP). The Distributed Common Ground\/Surface System Special Operations Forces (DCGS-SOF) is part of a family of systems providing Intelligence, Surveillance, and Reconnaissance Processing, Exploitation, Dissemination (PED), and analytical capabilities at the Joint Task Force level and below through a combination of reach back, forward support, and collaboration.  The mission tailored infrastructure interconnects the warfighter and sensors to find and fix High Value Targets and provides a network-enabled, interoperable construct allowing continual, unimpeded sharing of intelligence data, information and services with SOF and between the Services, other national intelligence agencies, combatant commands and multi-national partners.  It connects the SOF warfighter with the essential intelligence information and provides situation awareness information to the SOF leadership at all echelons.  The four components of DCGS-SOF include the following:  The Enterprise provides infrastructure and processing capability to allow for worldwide SOF intelligence information sharing. Full Motion Video PED provides (FMV) PED capabilities in garrison and deployed environments of manned and unmanned sensors.  SILENT DAGGER provides Signals Intelligence exploitation capability in both garrison and deployed environments. The All Source Information Fusion (ASIF) will provide the intelligence analytical tools via a global and disconnected architecture."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.302"
                },
                "CurrentYear": {
                    "val": "5.415"
                },
                "BudgetYearOne": {
                    "val": "5.496"
                },
                "BudgetYearOneBase": {
                    "val": "5.496"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.302"
                },
                "CurrentYear": {
                    "val": "5.415"
                },
                "BudgetYearOne": {
                    "val": "5.496"
                },
                "BudgetYearOneBase": {
                    "val": "5.496"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "SummaryExplanation": {
                "val": "Funding: \n\nFY 2016:  None.  \n\nFY 2017:  None.\n\nFY 2018:  None.\n\nSchedule:  None.\n \nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S400A"
                    },
                    "ProjectTitle": {
                        "val": "Distributed Common Ground\/Surface Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "32.509"
                        },
                        "PriorYear": {
                            "val": "5.302"
                        },
                        "CurrentYear": {
                            "val": "5.415"
                        },
                        "BudgetYearOne": {
                            "val": "5.496"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.496"
                        },
                        "BudgetYearTwo": {
                            "val": "6.345"
                        },
                        "BudgetYearThree": {
                            "val": "6.451"
                        },
                        "BudgetYearFour": {
                            "val": "6.580"
                        },
                        "BudgetYearFive": {
                            "val": "6.712"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element is part of the Military Intelligence Program (MIP). The Distributed Common Ground\/Surface System Special Operations Forces (DCGS-SOF) is part of a family of systems providing Intelligence, Surveillance and Reconnaissance (ISR) Processing, Exploitation, Dissemination (PED), and analytical capabilities at the Joint Task Force level and below through a combination of reach back, forward support, and collaboration.  The mission tailored infrastructure interconnects the warfighter and sensors to find and fix High Value Targets and provides a network-enabled, interoperable construct allowing continual, unimpeded sharing of intelligence data, information and services with SOF and between the Services, other national intelligence agencies, combatant commands and multi-national partners.  It connects the SOF warfighter with the essential intelligence information and provides situation awareness information to the SOF leadership at all echelons.  The four components of DCGS-SOF include the following:  The Enterprise provides infrastructure and processing capability to allow for worldwide SOF intelligence information sharing. Full Motion Video (FMV) PED provides PED capabilities in garrison and deployed environments of manned and unmanned sensors.  SILENT DAGGER provides Signals Intelligence exploitation capability in both garrison and deployed environments. The All Source Information Fusion (ASIF) will provide the intelligence analytical tools via a global and disconnected architecture."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DCGS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.302"
                                            },
                                            "Text": {
                                                "val": "Continued to integrate emerging technologies and capability for Enterprise and ASIF to include:  Advanced analytics, user interface, and disconnected operations into the DCGS-SOF baseline; Continued to refine and integrate FMV PED emerging technologies and capabilities such as:  request for information tool and voice-to-text translation. Continued DCGS-SOF Limited Objective Events and exercise participation to test integration efforts.  Began development of the DCGS-SOF next generation pipeline development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.415"
                                            },
                                            "Text": {
                                                "val": "Continue integration of emerging technologies and capability for Enterprise and ASIF to include:  Advanced analytics, user interface, cloud technologies, and disconnected operations into the DCGS-SOF baseline. Continue to refine and integrate FMV PED emerging technologies and capabilities such as: over-watch\/compound monitoring, develop analyst trip wire tools, next generation imaging, coalition interoperability and video exploitation tools, patterns of movement characterization and detection for single mission. Continue development of the DCGS-SOF next generation pipeline. Continue Defense Intelligence Information Environment and Joint Information environment coordination."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.496"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.496"
                                            },
                                            "Text": {
                                                "val": "Continues integration of emerging technologies and capability for Enterprise and ASIF to include:  Advanced analytics, user interface, and disconnected operations into the DCGS-SOF baseline. Continues refining and integration of FMV PED emerging technologies and capabilities such as:  over-watch\/compound monitoring, develop analyst trip wire tools, next generation analytics processing, upgrading imaging and video exploitation tools, patterns of movement characterization and detection for single mission. Continues DCGS-SOF Limited Objective Events and exercise participation to test integration efforts. Continues development of the interoperability with Coalition partners, Defense Intelligence Information Environment, and Joint Information Environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC\/020401INTL"
                                    },
                                    "Title": {
                                        "val": "Distributed Common Ground\/Surface System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.333"
                                        },
                                        "CurrentYear": {
                                            "val": "15.232"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.042"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.042"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.676"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.995"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.248"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.684"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "DCGS-SOF leverages SOF programs, DoD partners, National labs, and other Government Agencies to integrate commercial\/government off-the-shelf systems, and other mature technologies into the Program of Record which resides within the SOF Information Enterprise and enables more agile access to (searchable, discoverable) and sharing of data and services to meet SOF-peculiar documented requirements.  The technology allows for seamless integration and federation with DoD, interagency, and Coalition tactical ISR PED systems.  The DCGS-SOF program office employs an agile development process with capability insertions into the development baseline for assessment and future deployment into the operational baseline.  All development requirements are prioritized through the DCGS Requirements Working Group (DRWG) chaired by J2.  Once approved, the requirements are evaluated and scheduled by an engineering development team.  Using this methodology allows capabilities to be inserted in a fast and agile manner based on user requirements and priorities.  All evolutionary technology insertions (ETIs) in the R-4 schedule are based on current program office projections.  If requirements change based on the DRWG, the ETI and version capabilities identified may change."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}