{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c43fbf6cbb750060d4e843075183a8e999b0dddb3a2f8fae77d834880adb92d8-86",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0303140D8Z"
        },
        "ProgramElementTitle": {
            "val": "Information Systems Security Program"
        },
        "R1LineNumber": {
            "val": "208"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "21.246"
            },
            "PriorYear": {
                "val": "8.649"
            },
            "CurrentYear": {
                "val": "8.876"
            },
            "BudgetYearOne": {
                "val": "9.415"
            },
            "BudgetYearOneBase": {
                "val": "9.415"
            },
            "BudgetYearTwo": {
                "val": "9.966"
            },
            "BudgetYearThree": {
                "val": "10.067"
            },
            "BudgetYearFour": {
                "val": "10.262"
            },
            "BudgetYearFive": {
                "val": "10.491"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DoD CIO Information Systems Security Program (ISSP) provides for focused research, development, testing and integration of technology and technical solutions critical to the Defense Cybersecurity and Information Assurance Program to meet the requirements of 10 USC 2224 (Defense Information Assurance Program), 44 USC 3544, (Federal Information Security Management Act of 2002), OMB Circular A-130, and DoD Directives\/Instructions 8500, 8510, 8520, 8530, and 8540.  This program is funded under Budget activity 7, Operational System Development because it integrates technology and technical solutions to the Defense Information Assurance Program.\n\nISSP RDT&E funds support the DoD CIO and its mission partners on architecting, engineering, and technical matters for developing governance processes and structures; on evolving and enabling a more integrated and synchronized Joint Information Environment that will leverage a single and converged joint enterprise IT platform; on the continued development of the U.S. Government’s ability to prevent and defend against adversarial and\/or commercial information and communications technology supply-chain attacks on its mission critical systems, networks, and devices; on improving oversight of the life-cycle management of cybersecurity risks; and on the integration of cybersecurity standards, methods, and procedures across the DoD for a more robust and resilient cybersecurity posture."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.940"
                },
                "CurrentYear": {
                    "val": "8.876"
                },
                "BudgetYearOne": {
                    "val": "9.594"
                },
                "BudgetYearOneBase": {
                    "val": "9.594"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.649"
                },
                "CurrentYear": {
                    "val": "8.876"
                },
                "BudgetYearOne": {
                    "val": "9.415"
                },
                "BudgetYearOneBase": {
                    "val": "9.415"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.291"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.179"
                },
                "BudgetYearOneBase": {
                    "val": "-0.179"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.291"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "SRRB Efficiency"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.332"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.332"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.153"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.153"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  SIBR Adjustment -0.253 million, STTR Adjustment -0.038 million.\nFY 2017:  No change.\nFY 2018:  SRRB Efficiency -0.332 million, Program adjustment 0.153 million."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "140"
                    },
                    "ProjectTitle": {
                        "val": "Information Systems Security Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "21.246"
                        },
                        "PriorYear": {
                            "val": "8.649"
                        },
                        "CurrentYear": {
                            "val": "8.876"
                        },
                        "BudgetYearOne": {
                            "val": "9.415"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.415"
                        },
                        "BudgetYearTwo": {
                            "val": "9.966"
                        },
                        "BudgetYearThree": {
                            "val": "10.067"
                        },
                        "BudgetYearFour": {
                            "val": "10.262"
                        },
                        "BudgetYearFive": {
                            "val": "10.491"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DoD CIO Information Systems Security Program (ISSP) provides for focused research, development, testing and integration of technology and technical solutions critical to the Defense Cybersecurity and Information Assurance Program to meet the requirements of 10 USC 2224 (Defense Information Assurance Program), 44 USC 3544, (Federal Information Security Management Act of 2002), OMB Circular A-130, and DoD Directives\/Instructions 8500, 8510, 8520, 8530, and 8540.  This program is funded under Budget activity 7, Operational System Development because it integrates technology and technical solutions to the Defense Information Assurance Program.\n\nISSP RDT&E funds support the DoD CIO and its mission partners on architecting, engineering, and technical matters for developing governance processes and structures; on evolving and enabling a more integrated and synchronized Joint Information Environment (JIE) to provide the means for more integrated information sharing and collaboration that also endeavors to close identified gaps across all mission areas with a shared network of core enterprise services; on the continued development of the U.S. Government’s ability to prevent and defend against adversarial and\/or commercial information and communications technology supply-chain attacks on its mission critical systems, networks, and devices; on improving oversight of the life-cycle management of cybersecurity risks; and on the integration of cybersecurity standards, methods, and procedures across the DoD for a more robust and resilient cybersecurity posture."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Systems Security Program Plans and Accomplishments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.649"
                                            },
                                            "Text": {
                                                "val": "•\tDeveloped required engineering support concepts for critical architectures, to include the Joint Information Environment, C4I tactical networks, and for coalition and other mission partners.  Continue to develop, refine, and implement a Joint Information Environment single security architecture strategy, and the related strategic metrics and enhanced analytical capabilities.\n\n•\tDeveloped strategies for successful defenses and operations in the event of sophisticated cyber adversaries and large-scale cyber incidents, analyses & development of metrics focused on the cybersecurity domain, on cybersecurity scorecard and automation, analyses to support policy development and refinement, oversight, and formulation of programmatic advice, and analyses to support various collaborative advisory and governance bodies.\n\n•\tResearched means of assessing and prioritizing supply-chain threats and responses, for training regarding threats and risks, and for program protection plans to address supply-chain risks, to help ensure implementation of consistent protection practices from supply chain exploitation and attack within\/by individual procurements of materiel and services on which the DoD systems, networks, and missions depend..\n\n•\tDeveloped paradigm of threat-based system-security-engineering, including generation of critical design artifacts (threat analyses, risk analyses, system-of- system-security architectures), and with demonstrated applications to space systems and mission partner environment (MPE).\n\n•\tContinued to develop a more robust governance mechanism to minimize supply chain risks across the DoD components and activities, and to develop an overarching international standard, or an improved integrated family of existing standards, for improving supply-chain-risk-management.\n\n•\tContinued developing the means for improved mission assurance, mitigation analyses, and vulnerability detection via hardware and software testing, and for acquisitions that are better integrated with informed threat prospects.\n\n•\tDeveloped and published supportive standards, guidance, and processes on the web-based Knowledge Service, for the continual reauthorization and cyber strengthening of information systems, and in satisfaction of requirements mandated by OMB Circular A-130.\n\n•\tSupported key acquisition programs-of-record (i.e., Major Automated Information Systems; Major Defense Acquisition Programs, and other special interest developmental and acquisition activities) to drive the development and implementation of more effective cybersecurity strategies, risk management plans, and processes.\n\n•\tDeveloped, published, and refined DoD mobility strategy, and processes for use of commercial Cloud providers; to develop Cloud computing security guidance that details cybersecurity guidance and procedures for use by potential commercial Cloud service providers, and continued oversight of policies and capabilities to support comprehensive cybersecurity capability for the Joint Information Environment (JIE), including the DoD Cloud and mobile device strategies and roadmaps."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.876"
                                            },
                                            "Text": {
                                                "val": "•\tContinue to develop and provide required engineering support for critical architectures, to include the Joint Information Environment, C4I tactical networks, and for coalition and other mission partners.  Continue to develop, refine, and implement a Joint Information Environment single security architecture strategy, and the related strategic metrics and enhanced analytical capabilities.\n\n•\tContinue to develop and implement strategies for successful defenses and operations in the event of sophisticated cyber adversaries and large-scale cyber incidents.\n\n•\tContinue to research to develop means of assessing and prioritizing supply-chain threats and responses, for training regarding threats and risks, and for program protection plans to address supply-chain risks, to help ensure implementation of consistent protection practices from supply chain exploitation and attack within\/by individual procurements of materiel and services on which the DoD systems, networks, and missions depend..\n\n•\tContinue threat-based system-security-engineering efforts and development of critical design artifacts (threat analyses, risk analyses, system-of- system-security architectures), having demonstrated applications to space systems and mission partner environment (MPE).\n\n•\tContinue development and implementation of a more robust governance mechanism to minimize supply chain risks across the DoD components and activities, and to develop an overarching international standard, or an improved integrated family of existing standards, for improving supply-chain-risk-management.\n\n•\tContinue to develop the means for improved mission assurance, mitigation analyses, and vulnerability detection via hardware and software testing, and for acquisitions that are better integrated with informed threat prospects.\n\n•\tContinue to develop and publish supportive standards, guidance, and processes on the web-based Knowledge Service, for the continual reauthorization and cyber strengthening of information systems, and in satisfaction of requirements mandated by OMB Circular A-130.\n\n•\tContinue to support key acquisition programs-of-record (i.e., Major Automated Information Systems; Major Defense Acquisition Programs, and other special interest developmental and acquisition activities) to drive the development and implementation of more effective cybersecurity strategies, risk management plans, and processes.\n\n•\tContinue to develop, publish, and refine DoD mobility strategy, and processes for use of commercial Cloud providers; to develop Cloud computing security guidance that details cybersecurity guidance and procedures for use by potential commercial Cloud service providers, and continued oversight of policies and capabilities to support comprehensive cybersecurity capability for the Joint Information Environment (JIE), including the DoD Cloud and mobile device strategies and roadmap"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.415"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.415"
                                            },
                                            "Text": {
                                                "val": "•\tContinue to develop and provide required engineering support for critical architectures, to include the Joint Information Environment, C4I tactical networks, and for coalition and other mission partners.  Continue to develop, refine, and implement a Joint Information Environment single security architecture strategy, and the related strategic metrics and enhanced analytical capabilities.\n\n•\tContinue to develop and implement strategies for successful defenses and operations in the event of sophisticated cyber adversaries and large-scale cyber incidents.\n\n•\tContinue to research to develop means of assessing and prioritizing supply-chain threats and responses, for training regarding threats and risks, and for program protection plans to address supply-chain risks, to help ensure implementation of consistent protection practices from supply chain exploitation and attack within\/by individual procurements of materiel and services on which the DoD systems, networks, and missions depend..\n\n•\tContinue threat-based system-security-engineering efforts and development of critical design artifacts (threat analyses, risk analyses, system-of- system-security architectures), having demonstrated applications to space systems and mission partner environment (MPE).\n\n•\tContinue development and implementation of a more robust governance mechanism to minimize supply chain risks across the DoD components and activities, and to develop an overarching international standard, or an improved integrated family of existing standards, for improving supply-chain-risk-management.\n\n•\tContinue to develop the means for improved mission assurance, mitigation analyses, and vulnerability detection via hardware and software testing, and for acquisitions that are better integrated with informed threat prospects.\n\n•\tContinue to develop and publish supportive standards, guidance, and processes on the web-based Knowledge Service, for the continual reauthorization and cyber strengthening of information systems, and in satisfaction of requirements mandated by OMB Circular A-130.\n\n•\tContinue to support key acquisition programs-of-record (i.e., Major Automated Information Systems; Major Defense Acquisition Programs, and other special interest developmental and acquisition activities) to drive the development and implementation of more effective cybersecurity strategies, risk management plans, and processes.\n\n•\tContinue to develop, publish, and refine DoD mobility strategy, and processes for use of commercial Cloud providers; to develop Cloud computing security guidance that details cybersecurity guidance and procedures for use by potential commercial Cloud service providers, and continued oversight of policies and capabilities to support comprehensive cybersecurity capability for the Joint Information Environment (JIE), including the DoD Cloud and mobile device strategies and roadmaps."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0303140D8Z O&M DW"
                                    },
                                    "Title": {
                                        "val": "Information System Security Program"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.490"
                                        },
                                        "CurrentYear": {
                                            "val": "11.321"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.867"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.867"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.474"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.590"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.809"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.033"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "-  Annual FISMA metrics\n-  Evolving JIE cybersecurity metrics"
                        }
                    }
                }
            ]
        }
    }
}