{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-31",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604822A"
        },
        "ProgramElementTitle": {
            "val": "General Fund Enterprise Business System (GFEBS)"
        },
        "R1LineNumber": {
            "val": "111"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.533"
            },
            "CurrentYear": {
                "val": "6.805"
            },
            "BudgetYearOne": {
                "val": "49.554"
            },
            "BudgetYearOneBase": {
                "val": "49.554"
            },
            "BudgetYearTwo": {
                "val": "36.931"
            },
            "BudgetYearThree": {
                "val": "42.002"
            },
            "BudgetYearFour": {
                "val": "22.460"
            },
            "BudgetYearFive": {
                "val": "18.967"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The General Fund Business Enterprise System (GFEBS) is a Major Automated Information System program and is currently in the sustainment phase. It followed the DoD Business Enterprise Architecture which is aligned to the mandated Federal Enterprise Architecture. GFEBS was implemented to fulfill the needs and comply with the Federal Financial Management Improvement Act, The Chief Financial Officers Act of 1990, the Government Performance and Results Act of 1993, the Government Management Reform Act of 1994, and the Clinger-Cohen Act of 1996 and to fulfill the stated mission of the Assistant Secretary of the Army for Financial Management and Comptroller. GFEBS replaced subsumed the capabilities of, in full or in part, financial systems operating in excess of 40 years including the Standard Finance System and other costly feeder systems which do not allow the Department of Defense or the U.S. government to achieve an unqualified audit opinion on its financial statements. GFEBS is used to administer the Army's General Fund. GFEBS was developed using a commercial off-the-shelf Enterprise Resource Planning system that is certified by the Chief, Financial Officer Council and provides six core financial functions. GFEBS allows tactical commanders to make informed decisions on a virtually real time information. On 1 October 2008, GFEBS deployed to Wave 1 end users at Fort Jackson Garrison, Defense Finance Accounting Service (DFAS) Indianapolis, Indiana and several other organizations. The Full Deployment Decision was received by the Milestone Decision Authority on 24 June 2011 and Full Deployment was Full Deployment was achieved on 1 July 2012.  Today, GFEBS continues in sustainment.  Efforts include sustaining the system and infrastructure, making modifications needed for audit readiness, compliancy, and upgrades required to maintain the system and meet SAP standards. Additionally, GFEBS continues to make changes as requested by the user community through the Process Owners Group, an SES and General Officers level board that prioritizes user needs.  Some of these changes require developmental funding.\n\nGFEBS-Sensitive Activities (SA): GFEBS-Sensitive Activities (SA): GFEBS-SA leverages the GFEBS base system, and is a commercial off-the-shelf Enterprise Resource Planning System certified by the Chief Financial Officers Council.  Army still has classified and sensitive financial activity remaining in legacy systems that cannot be processed in our new, fully-fielded GFEBS. To protect sensitive information and enable auditability, Army needs a separate instance of GFEBS operated on a secure network for processing sensitive and classified financial transactions. GFEBS-SA will be implemented to 3,000 users across 100 locations worldwide. GFEBS-SA will integrate seamlessly with GFEBS to provide secure, web-based financial execution and reporting capabilities to the Army's classified and sensitive activities. SA is envisioned as a fully functional GFEBS application operated on a secure network leveraging off of the sustained system design.\n\nGFEBS Increment II:  GFEBS Increment II delivers new capabilities implemented in the GFEBS baseline.  GFEBS Increment II will provide an extensive risk reduction per wave as required throughout the increment.  Each wave will increase operational capabilities to enhance financial management, further audit readiness, allow integrated manning and budgeting, enable standardize labor tracking, allow end-to-end integration, enable legacy system retirement (~ 19+), and improve business analytics.  The new Increment II requirements have been categorized by the functional community as Integrated Resource Management (IRM), Standard Labor Time Tracking (SLTT), and Expanded Financial Integration (EFI)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.155"
                },
                "CurrentYear": {
                    "val": "6.805"
                },
                "BudgetYearOne": {
                    "val": "24.809"
                },
                "BudgetYearOneBase": {
                    "val": "24.809"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.533"
                },
                "CurrentYear": {
                    "val": "6.805"
                },
                "BudgetYearOne": {
                    "val": "49.554"
                },
                "BudgetYearOneBase": {
                    "val": "49.554"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.622"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "24.745"
                },
                "BudgetYearOneBase": {
                    "val": "24.745"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.622"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "24.745"
                                },
                                "BudgetYearOneBase": {
                                    "val": "24.745"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 funds realigned to GFEBS-SA (DV6) project in alignment with Army priorities. The GFEBS SA program was revamped and on a steady stream for contract execution."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DV6"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.415"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "39.554"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.554"
                        },
                        "BudgetYearTwo": {
                            "val": "32.631"
                        },
                        "BudgetYearThree": {
                            "val": "32.657"
                        },
                        "BudgetYearFour": {
                            "val": "17.808"
                        },
                        "BudgetYearFive": {
                            "val": "3.328"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project DV6 is General Fund Enterprise Business System - Sensitive Activities (GFEBS-SA)."
                        },
                        "ProjectMissionDescription": {
                            "val": "GFEBS-SA will be a fully functional GFEBS application operated on a secure network (SIPRNET), including additional performance requirements designed to protect sensitive intelligence operations and special operations missions. It will process Secret Collateral and below information while providing the GFEBS capabilities such as distribution and execution of appropriated funds, cost management, financial reporting, and asset management. GFEBS-SA will support the information exchanges with outside organizations that support the Army's sensitive activities mission including cross-security domain integration between SIPRNet and NIPRNet with GFEBS and other system partners. Services will be capable of being upgraded throughout the life of the program in order to incorporate advances in best business practices. GFEBS-SA is an essential financial program to comply with the Chief Financial Officers (CFO) Act and the Federal Financial Management Improvement Act (FFMIA) and prevent compromise of data that could cause grave harm to U.S. forces.\n\nInitial implementation of the GFEBS SA project did not require development funds beyond FY16. Through Army analysis of the System Integrator, the project was reset on 9 September 2016 after an Army determination was made that the awarded System Integrator could not deliver a solution to meet the GFEBS-SA requirement. With this reset and Army strategic direction, GFEBS-SA is on track. A new System Integrator contract was awarded on 24 April 2017."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Funds provide development efforts for GFEBS-SA."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.415"
                                            },
                                            "Text": {
                                                "val": "Funds provide development efforts for GFEBS-SA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "39.554"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "39.554"
                                            },
                                            "Text": {
                                                "val": "Funds in FY18 are required to support system development including completion of build 1 consisting of 213 objects and design of build 2 consisting of 320 objects. Additionally, FY18 funding supports Program Office costs including System Engineering tools, Support Contract Labor, RMF\/Cyber Security support, and DISA Data Center."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Plan, develop, and manage GFEBS-SA as a separate instance from GFEBS base program to support evolutionary delivery of capabilities. The GFEBS-SA solution will be acquired as one Increment.  Software will be incrementally developed through a set of builds to achieve full capability."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Accenture Federal LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "29.577"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "29.577"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "29.577"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PdM GFEBS SA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Arlington, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.226"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.415"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.137"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.137"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.778"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC\/ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.960"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.840"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.840"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.800"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-68.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Program Management"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone B (ATP 3)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development System Build 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development System Build 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development System Build 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operating Capabiity (IOC)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment (FD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EV4"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System Inc 2"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "6.805"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.728"
                        },
                        "BudgetYearThree": {
                            "val": "6.723"
                        },
                        "BudgetYearFour": {
                            "val": "1.980"
                        },
                        "BudgetYearFive": {
                            "val": "12.889"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "30.125"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "GFEBS Increment II: Delivers new capabilities to the GFEBS baseline. GFEBS Increment II will provide an extensive risk reduction per wave, as required throughout the increment. Each wave will increase operational capabilities to enhance financial management, further audit readiness, allow integrated manning and budgeting, enable standardize labor tracking, allow end-to-end integration, enable legacy system retirement (~ 19+), and improve business analytics. The new Increment II requirements have been categorized by the functional community as Integrated Resource Management (IRM), Standard Labor Time Tracking (SLTT), and Enhanced Financial Integration (EFI). The Army is pursuing an IRM capability that focuses on programmed manning, program and budget planning and reporting processes across the Army. The capability will enable the Army to efficiently reconcile budget execution against program & strategic plans, create forward looking predictive cost analytics, and efficiently manage its organizational structures. The capability will provide full visibility into programmed manning and budget execution planning & programming processes and data across Army Commands. Until an enterprise solution is provided, the Army's IRM business process will lack enterprise level visibility and will be unable to author and manage Command TDA force structures that satisfy Global Force Management (GFM) requirements for an Army in motion. SLTT will be able to track labor hours  for Civilian, Military and Contractors and map them to the Army authoritative outputs (products and services) which they support. This effort will eliminate redundant  labor tracking systems, increase efficiencies, ensure the workforce is the right size and mix, and will be financially auditable. These labor hours will be accurate and the costs associated with this labor will be mapped in a timely manner (especially since some Army organizations are fully reimbursable). By doing this, the Army can terminate other time tracking systems or processes currently being used. Furthermore, it will support the audibility of reimbursable intra-Army work. Enhanced Financial Integration (EFI), an enterprise financial solution to improve capabilities and provide force modernization. This will be achieved by subsuming legacy and obsolete technology, which replaces Funds Control Module (FCM) functionality with a direct interface to the various logistics systems, and streamlines the requisition process for material essential for Soldiers, Army readiness, and sustainment of current operations. In addition, to enhancements in Gift Funds (Investments), consumption of PRIDE (Planning Resource Infrastructure Development and Evaluation) Data, GFEBS Business Intelligence Legacy data consolidation, MILPERS Phase 2, and other capabilities which provide audit readiness, statutory and regulatory compliance, and financial business process improvements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GFEBS Increment II"
                                    },
                                    "Description": {
                                        "val": "GFEBS Increment II will increase operational capabilities to enhance financial management, further audit readiness, allow integrated manning and budgeting, enable standardize labor tracking, allow end-to-end integration, enable legacy system retirement (~ 19+), and improve business analytics.  The new Increment II requirements have been categorized by the functional community as Integrated Resource Management (IRM), Standard Labor Time Tracking (SLTT), and Expanded Financial Integration (EFI)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.805"
                                            },
                                            "Text": {
                                                "val": "Acquisition planning and pre-award documentation for development contract."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "The PMO will participate in a robust requirements definition, comprehensive analyses of alternative, an initial business process design activities with the functional community, and will prepare the required acquisition documentation to achieve authorization to proceed with acquiring the required capability. These efforts require PMO expertise across all areas: acquisition, technical, functional, testing, management, and programmatic (e.g. contracts, budget)."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "GF5"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.118"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "10.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.572"
                        },
                        "BudgetYearThree": {
                            "val": "2.622"
                        },
                        "BudgetYearFour": {
                            "val": "2.672"
                        },
                        "BudgetYearFive": {
                            "val": "2.750"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "34.734"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The General Fund Business Enterprise System (GFEBS) is a Major Automated Information System program and is currently in the sustainment phase. GFEBS continues to refine system capabilities\/enhancements prioritized by the GFEBS Process Owners Group (POG), an SES and General Officer level board representing the needs of GFEBS functional community.  Additionally, GFEBS continues to focus on infrastructure updates as required to meet SAP requirements and best practices. Some of these changes require developmental funding. GFEBS followed the DoD Business Enterprise Architecture which is aligned to the mandated Federal Enterprise Architecture. GFEBS was implemented to fulfill the needs and comply with the Federal Financial Management Improvement Act, The Chief Financial Officers Act of 1990, the Government Performance and Results Act of 1993, the Government Management Reform Act of 1994, and the Clinger-Cohen Act of 1996 and to fulfill the stated mission of the Assistant Secretary of the Army for Financial Management and Comptroller. GFEBS replaced, in full or in part, financial systems operating in excess of 40 years including the Standard Finance Systems and other costly feeder systems which do not allow the Department of Defense or the U.S. government to      achieve an unqualified audit opinion on its financial statements. GFEBS is used to administering the Army's General Fund. GFEBS was developed using a commercial off-the-shelf Enterprise Resource Planning system that is certified by the Chief, Financial Officer Council and provides six core financial functions. GFEBS allows tactical commanders to make informed decisions on a virtually real time system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Capability Enhancement"
                                    },
                                    "Description": {
                                        "val": "Major changes to the system needed to update the infrastructure as required to meet SAP requirements and best practices and capability enhancement initiatives needed to increase GFEBS current capability and performance of major system enhancements required to maintain compliance with Federal Financial Management Improvement Act (FFMIA), Business Enterprise Agency (BEA), and Standard Financial Information Structure (SFIS) requirements and auditability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.118"
                                            },
                                            "Text": {
                                                "val": "Funding provided infrastructure support, with the establishment of a portfolio Prototype & Integration Environment (PIE), continued expansion of a GFEBS pilot program Supplier Self-Service (SuS), and the support of Integrated Resource Management (IRM) and Standard Labor Time Tracking (SLTT) Analysis of Alternatives (AoA) activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "FY18 funding supports Financial Integration Process Owners Group requested enhancements and enhancement\/new capability related to audit and compliance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BE4168, GFEBS"
                                    },
                                    "Title": {
                                        "val": "Other Procurement, Army"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.540"
                                        },
                                        "CurrentYear": {
                                            "val": "6.416"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.465"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.465"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.608"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.610"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.453"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.571"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "42.663"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NA"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "120.968"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HQAES Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "VAR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.118"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.118"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-69.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Sustainment Development Task Order Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements 2018"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Enhancements 2019"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}