{
    "id": "2018-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-8c969fda2b08c8b1edabf434c4065342c0a47952a0575e86cbca2b99dbcebccc-11",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603760E"
        },
        "ProgramElementTitle": {
            "val": "COMMAND, CONTROL AND COMMUNICATIONS SYSTEMS"
        },
        "R1LineNumber": {
            "val": "57"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "201.635"
            },
            "CurrentYear": {
                "val": "155.081"
            },
            "BudgetYearOne": {
                "val": "106.787"
            },
            "BudgetYearOneBase": {
                "val": "106.787"
            },
            "BudgetYearTwo": {
                "val": "137.904"
            },
            "BudgetYearThree": {
                "val": "99.503"
            },
            "BudgetYearFour": {
                "val": "127.183"
            },
            "BudgetYearFive": {
                "val": "203.483"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Command, Control and Communications Systems program element is budgeted in the Advanced Technology Development Budget Activity because its purpose is to demonstrate and evaluate advanced information systems research and development concepts.\n\nThe success of military operations depends on timely, reliable, secure, and synchronized dissemination of command and control and relevant situational awareness information to every military echelon. While wired communications and networks are fairly well developed, providing assured high-bandwidth mobile wireless capabilities that match or exceed commercial wired infrastructure is needed to meet the demands of military users. The goal of the Information Integration Systems project is to develop and demonstrate technologies that will provide effective communications to U.S. forces. Approaches to this goal include developing technologies in these areas:\n- High-Capacity Links technologies - enables greater back-haul capability.\n- Advanced Networking technologies - supports resilience, adaptability, and scalability.\n- Low Probability of Detection and Anti-Jam (LPD\/AJ) technologies - provides assured communications in very high-threat environments.\n- Novel Radio Frequency and Spectral Sensing (RF\/SS) - supports efficient spectrum management in congested environments and detection of electromagnetic threats."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "201.335"
                },
                "CurrentYear": {
                    "val": "155.081"
                },
                "BudgetYearOne": {
                    "val": "185.554"
                },
                "BudgetYearOneBase": {
                    "val": "185.554"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "201.635"
                },
                "CurrentYear": {
                    "val": "155.081"
                },
                "BudgetYearOne": {
                    "val": "106.787"
                },
                "BudgetYearOneBase": {
                    "val": "106.787"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.300"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-78.767"
                },
                "BudgetYearOneBase": {
                    "val": "-78.767"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "8.379"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-8.079"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-78.767"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-78.767"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer. \nFY 2017:  N\/A\nFY 2018:  Decrease reflects completion of the Wireless Network Defense program in FY 2017 and other program rephasing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CCC-02"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION INTEGRATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "94.626"
                        },
                        "CurrentYear": {
                            "val": "93.781"
                        },
                        "BudgetYearOne": {
                            "val": "55.928"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.928"
                        },
                        "BudgetYearTwo": {
                            "val": "88.419"
                        },
                        "BudgetYearThree": {
                            "val": "80.233"
                        },
                        "BudgetYearFour": {
                            "val": "117.183"
                        },
                        "BudgetYearFive": {
                            "val": "203.483"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The success of military operations depends on timely, reliable, secure, and synchronized dissemination of command and control and relevant situational awareness information to every military echelon.  While wired communications and networks are fairly well developed, providing assured high-bandwidth mobile wireless capabilities that match or exceed commercial wired infrastructure is needed to meet the demands of military users.  The goal of the Information Integration Systems project is to develop and demonstrate technologies that will provide effective communications to U.S. forces.  Approaches to this goal include developing technologies in these areas:\n-  High-Capacity Links technologies - enables greater back-haul capability.\n-  Advanced Networking technologies - supports resilience, adaptability, and scalability.\n-  Low Probability of Detection and Anti-Jam (LPD\/AJ) technologies - provides assured communications in very high-threat environments.\n-  Novel Radio Frequency and Spectral Sensing (RF\/SS) - supports efficient spectrum management in congested environments and detection of electromagnetic threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "100 Gb\/s RF Backbone"
                                    },
                                    "Description": {
                                        "val": "The proliferation of video, voice, chat, and other important data-streams on the battlefield is driving a need for higher capacity, reliable, assured, and all-weather communications that are deployable on a wide range of air, ground, and maritime platforms.  The goal of this High-Capacity Links technologies program is to demonstrate a 100 Gigabit-per-second (Gb\/s) radio frequency (RF) backbone that will meet the anticipated mid-term (within 3-10 years) wireless networking requirements of deployed military forces.  DARPA's hybrid Free Space Optical RF Communications Adjunct (ORCA) system has broken the 10 Gb\/s wireless network boundary using free-space optical links, but all-weather Ku band components are currently limited to much less than 1Gb\/s capacity.  Furthermore, the hybrid optical\/RF system exhibits size, weight, and power (SWaP) consumption characteristics that preclude deployment on many SWaP-limited platforms.  Moving to a millimeter-wave (mmW) solution will provide high capacity and all-weather resiliency, but presents technical challenges that include the generation of higher-order waveforms (beyond common data link), efficient power transmission, high-speed routing, and low-noise receivers.  This program seeks to develop the constituent subsystems (waveform generation, efficient power amplifiers, and receivers) and spatial multiplexing architectures to construct an all-weather mmW 100 Gb\/s backbone at half the SWaP consumption of the current ORCA system.  The 100 Gb\/s RF Backbone program is intended for transition to multiple Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.824"
                                            },
                                            "Text": {
                                                "val": "-  Continued to reduce the size, weight, and power of the system components to metrics consistent with high altitude, long endurance aerial platforms.\n-  Conducted laboratory tests of merged higher-order modulation and spatial multiplexing technologies.\n-  Initiated prototype performance evaluation planning for mountain-to-ground tests at a Government test range.\n-  Developed initial pointing, acquisition, and tracking capabilities to support mobile link operation.\n-  Conducted initial prototype testing using multiple system configurations to characterize initial system performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.638"
                                            },
                                            "Text": {
                                                "val": "-  Refine software and firmware of constituent technologies based on results of initial testing.\n-  Conduct multiple field tests of the prototype hardware at a Government test range.\n-  Integrate prototype onto test aircraft and conduct air-to-ground testing at a Government test range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.268"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.268"
                                            },
                                            "Text": {
                                                "val": "-  Complete air-to-ground testing and conduct flight demonstration to Services.\n-  Make technologies from the 100 Gb\/s RF Backbone system available for transition to the Services, and specifically to the Air Force Common Data Link project."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced RF Mapping"
                                    },
                                    "Description": {
                                        "val": "One of the key advantages on the battlefield is the ability to actively sense and manipulate the radio frequency (RF) environment, enabling reliable and assured communications, as well as effectively mapping and manipulating the adversary's communications in ways that defy their situational awareness, understanding, or response.  Current approaches are emitter-based, with the signal processing techniques focused on array and time-based processing for each emitter.  As the RF environment becomes more complex and cluttered, the number of collection assets and the required level of signal processing inhibits our capability to pervasively sense and manipulate at the precision (time, frequency, and space) required for effective action.  To address these Radio Frequency and Spectral Sensing (RF\/SS) challenges, the Advanced RF Mapping program will develop and demonstrate new concepts for sensing and manipulating the RF environment based on distributed rather than centralized collection.  This approach will take advantage of the proliferation of RF devices, such as radios and cell phones, on the battlefield.  To leverage these existing devices effectively, the program will develop new algorithms that can map the RF environment with minimal communication load between devices.  The Advanced RF Mapping program will also develop approaches to exploit our precise knowledge of the RF environment and the distributed proximity of RF devices to provide reliable and assured communications for our warfighter as well as to infiltrate or negate our adversaries' communications networks.  Building upon technologies investigated within other programs within this project, the Advanced RF Mapping program will enable both offensive and defensive operations in complex RF environments.  Advanced RF Mapping technology is planned to transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.964"
                                            },
                                            "Text": {
                                                "val": "-  Conducted RF Mapping tactical demonstrations.\n-  Developed a baseline sensor management user interface and command and control software layer to enable mission planners to task RF devices and configure the RF mapping system.\n-  Developed a baseline user interface for presenting RF mapping information to tactical units.\n-  Developed software for interconnecting the RF mapping capability with other tactical Electronic Warfare (EW) systems enabling cueing and results sharing.\n-  Developed interface control documentation (ICD) that permitted vendors to independently integrate third party RF devices and applications for use as additional RF Mapping sensors.\n-  Developed software for storing RF maps and querying the stored data for both tactical use and post-mission analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.880"
                                            },
                                            "Text": {
                                                "val": "-  Enhance the baseline sensor management and RF Mapping user interfaces for the Services.\n-  Develop final Command and Control (C2) software configurations to integrate RF Mapping sensors into existing Service architectures, to enhance RF sensing capacity.\n-  Integrate additional third party sensors, such as U.S. Marine Corps and Special Operations Command (SOCOM) Counter Remotely Controlled Improvised Explosive Device Electronic Warfare (CREW) into the RF Mapping architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.322"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.322"
                                            },
                                            "Text": {
                                                "val": "-  Continue to participate in Service exercises to demonstrate the system's ability to provide RF sensing and manipulation and inform new tactics, techniques and procedures.\n-  Transition Advanced RF Mapping or elements to the Services, primarily Marine Corps, and SOCOM for operational use."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communication in Contested Environments (C2E)"
                                    },
                                    "Description": {
                                        "val": "The Communication in Contested Environments (C2E) program will seek to address communications problems anticipated in networked airborne systems in the mid-21st century. Expected growth in sensor systems, unmanned systems, and internetworked weapons systems will strain the size of networks that our current communications technology can support in the contested environment.  As adversary capabilities advance, the DoD will need new techniques to quickly and efficiently accommodate better networking and improved communications capabilities, specifically communications systems with higher capacity, lower latency, greater jamming resistance, and reduced detectability.  As part of Advanced Networking technologies efforts, the C2E program addresses these needs with a three-pronged approach: first, to develop heterogeneous networking capabilities and advanced communication technology for airborne systems.  Low Probability of Detection (LPD), Anti-Jam (AJ), low latency, and high capacity communication protocols will be developed.  Second, to create a government controlled and maintained reference architecture for communications systems that draws from commercial communication architectures.  The defense contractor community can build specific communications systems based upon this reference architecture.  Finally, C2E will create a government controlled development environment to allow rapid refresh of communications technology and allow third party native application and waveform developers to contribute their own communications technologies.  Technologies from this program are planned to transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.269"
                                            },
                                            "Text": {
                                                "val": "-  Completed development of advanced network processing functions for implementation in an Application Specific Integrated Circuit (ASIC).\n-  Created novel LPD\/AJ capabilities and initiated integration into C2E radios.\n-  Matured design of ASIC.\n-  Released updated version of the combined software architecture, development environment and tool set, verification environment, and repository.\n-  Demonstrated Heterogeneous Networking LPD\/AJ features.\n-  Continued development of the C2E waveforms.\n-  Demonstrated airborne tactical network waveform interoperability on the C2E reference architecture.\n-  Enhanced the software development environment to improve functionality and ease of use."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.763"
                                            },
                                            "Text": {
                                                "val": "-  Finalize verification testing and system integration of the C2E Common-modem Hardware Integrated Library (CHIL).\n-  Complete development and integration of the C2E CHIL on the Ruggedized Flight System radios.\n-  Initiate development and testing of the Ruggedized Flight System radio with airborne tactical waveforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.159"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.159"
                                            },
                                            "Text": {
                                                "val": "-  Complete integration and testing of the Ruggedized Flight System radio.\n-  Demonstrate airborne tactical network waveform interoperability on the C2E Ruggedized Flight System radio."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamic Network Adaptation for Mission Optimization (DyNAMO)"
                                    },
                                    "Description": {
                                        "val": "Wireless networks have evolved into complex systems having many configurable parameters\/features, including link data rates, power settings, inter-network gateways, and security associations.  The optimal settings for these features vary greatly depending on the mission for which the network is deployed and the environment in which it is operating.  Currently, the majority of these features are optimized off-line for specific scenarios and assumptions and are pre-set before use in a mission.  There is no capability for the settings to adapt if the actual mission or environment differs from the original assumptions used to configure the network.  The problem is exacerbated in scenarios in which intelligent adversaries can affect the topology and operation of the network unpredictably and on short timescales.  Furthermore, future operations will include multiple, different radios interconnected on the same platform, and those existing networks lack a common standard for interoperability.  The Dynamic Network Adaptation for Mission Optimization (DyNAMO) program will develop software that addresses the incompatibilities preventing information sharing across independent airborne networks and develop new approaches to configure and control networks and networks of networks for operation in dynamic and contested environments.  The program will address optimization within legacy and future military networks, interactions between networks, and availability of necessary network services to support mission success.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.075"
                                            },
                                            "Text": {
                                                "val": "-  Commenced development of candidate near-real-time optimization algorithms to improve network reliability and efficiency when affected by advanced threats.\n-  Initiated analysis of candidate inter-network coordination and decentralized network services for operation in the presence of a peer adversary.\n-  Commenced development of mission-based network architecture control and information delivery mechanisms.\n-  Initiated development of an emulation environment that will be used to evaluate both individual DyNAMO technology developments and system solutions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.787"
                                            },
                                            "Text": {
                                                "val": "-  Continue development of near-real-time optimization algorithms.\n-  Develop and integrate inter-network coordination and decentralized network services.\n-  Continue development and integration of mission-based network architecture control and information delivery mechanisms.\n-  Conduct testing of individual technology developments in an emulation environment.\n-  Conduct system-level emulation test of system with initial instantiation of internetwork coordination and mission-based control.\n-  Initiate integration to support hardware-in-the-loop test of system with initial instantiation of internetwork coordination and mission-based control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.998"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.998"
                                            },
                                            "Text": {
                                                "val": "-  Continue development and integrate initial instantiation of real-time optimization algorithms in radio hardware.\n-  Continue development and integration of mission-based network architecture control and information delivery mechanisms.\n-  Conduct hardware-in-the-loop test of integrated system with instantiations of internetwork coordination, mission-based control, and real-time optimization.\n-  Conduct flight test of integrated system with instantiations of internetwork coordination, mission-based control, and real-time optimization.\n-  Conduct system-level emulation test of advanced network infrastructure with final instantiation of internetwork coordination, mission-based control, and real-time optimization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Efficiency and Access"
                                    },
                                    "Description": {
                                        "val": "The Federal Government is working to transition large swaths of spectrum (up to 500 MHz) from Federal (DoD is the primary contributor) to civilian use for broadband telecommunications.  The DoD will need more highly integrated and networked data\/sensor capacity over the next decades and will therefore need new technology that requires less spectrum to operate.  The objective of the Spectrum Efficiency and Access program is to investigate improvements in spectral reuse, such as spectrum sharing of sensor\/radar bands.  The program will leverage technical trends in cooperative sharing to exploit radar anti-jam and interference mitigation technologies that could enable spectrum sharing by allowing overlay of communications within the same spectral footprint.  The approach will include exploring real-time control data links between radars and communications systems, and developing the advanced waveforms and components to enable radars and communication networks to operate in close proximity.  The ultimate goal is to turn the DoD spectrum loss into a net gain of up to hundreds of MHz in capacity.  Technology from this program will be made available to the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.990"
                                            },
                                            "Text": {
                                                "val": "-  Modeled and assessed methods for automatically mitigating interfering transmissions caused by malfunctioning or misconfigured communications devices.\n-  Developed and assessed updated strategies to defend military systems against threats created by sharing spectrum information between military radars and commercial communications systems.\n-  Analyzed and developed baseline version of control system to manage spectrum sharing mechanisms.\n-  Conducted laboratory demonstrations of spectrum sharing among conforming radar and military and commercial communications systems that incorporates multiple sharing mechanisms.\n-  Performed initial vulnerability assessment of the spectrum sharing control system and sharing mechanisms through simulated attacks.\n-  Modeled and assessed performance of jointly designed military radar and military communications systems operating in a shared spectrum allocation in electronic countermeasure operating environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.530"
                                            },
                                            "Text": {
                                                "val": "-  Develop improved version of the Command and Control (C2) system to manage spectrum sharing and coordination mechanisms between U.S. and coalition military systems.\n-  Integrate hardware and software necessary to support system C2, sharing and coordination mechanisms, software application needs, security level requirements, and best electronic protections technologies and techniques.\n-  Conduct field demonstrations with candidate systems that incorporate multiple spectrum sharing and coordination mechanisms.\n-  Develop transition plan and continue engagement with Navy and Army stakeholders."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.689"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.689"
                                            },
                                            "Text": {
                                                "val": "-  Update candidate system hardware and software necessary to mitigate overall system vulnerability.\n-  Conduct field demonstrations in operationally representative environments with candidate systems that incorporate multiple spectrum sharing and coordination mechanisms.\n-  Implement transition plans with identified Navy and Army stakeholders."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE) program is to develop innovative networking and information sharing approaches that enable U.S. and coalition forces to effectively and efficiently coordinate tactical operations by eliminating today's prohibitive cost and security barriers.  Building upon the Spectrum Efficiency and Access program, which is budgeted in this PE\/Project, and research into the use of commercial systems and infrastructure to support military operations, SHARE provides new opportunities for U.S. and coalition forces to gain and maintain a tactical advantage on the battlefield.  Coordination includes providing all the information required to enable the command and control necessary to plan and execute operations in all phases of warfare.  Technology from this program will be made available to the Services and DoD Agencies that work with coalition partners."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop the network architecture and software for secure and resilient sharing of information within coalition partners.\n-  Define the security environment and overall system security architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.492"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.492"
                                            },
                                            "Text": {
                                                "val": "-  Perform laboratory experiments and evaluations of the network software for secure and resilient sharing.\n-  Develop software for commercial handheld devices to support sharing of information at multiple security levels.\n-  Develop the architecture and software for automated configuration of multiple security levels across coalition networks.\n-  Perform red team assessment of the security of the software architecture to characterize detectable vulnerabilities and compliance with SHARE program objectives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Network Defense"
                                    },
                                    "Description": {
                                        "val": "A highly networked and enabled force increases efficiency, effectiveness, and safety by making relevant information available when it is needed and at the appropriate location (person\/platform\/system).  Accomplishing this depends on providing reliable wireless communications to all U.S. forces, platforms, and devices in all phases of conflict.  Based on initial work under this effort, the Spectrum Efficiency and Access program in this PE\/Project was created to enable reliable operation of military and commercial communications and radar systems when occupying the same spectrum bands.  As part of the Advanced Networks technologies effort, the Wireless Network Defense program increases wireless network capacity and reliability for tactical users, with the ultimate vision of making high quality data services pervasive throughout the DoD.  The primary focus is mitigation of advanced threats particular to the security of wireless networks.  The program intends to leverage the capabilities of the dynamic network to identify sources of misinformation, whether malicious or due to poor configuration, across the functional components of the complex system, and mitigate the corresponding effects.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.504"
                                            },
                                            "Text": {
                                                "val": "-  Increased severity of attacks on prototype system and continued to test resilience in laboratory environment.\n-  Completed integration of candidate algorithms and protocols to prepare for field experiments.\n-  Refined protection mechanisms based on test findings and began development of systems for transition to military tactical radios.\n-  Began integration with military tactical radios, quantifying the performance impact through experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.183"
                                            },
                                            "Text": {
                                                "val": "-  Perform field testing of the radios and the radio network, using Wireless Network Defense to detect and mitigate network attacks against the radios.\n-  Perform final test of the mixture of hardware and emulated radios, demonstrating the ability of Wireless Network Defense to detect and mitigate network attacks in large, heterogeneous networks of tactically relevant radios to facilitate transition to the Army and Marine Corps."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-06"
                    },
                    "ProjectTitle": {
                        "val": "COMMAND, CONTROL AND COMMUNICATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "107.009"
                        },
                        "CurrentYear": {
                            "val": "61.300"
                        },
                        "BudgetYearOne": {
                            "val": "50.859"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.859"
                        },
                        "BudgetYearTwo": {
                            "val": "49.485"
                        },
                        "BudgetYearThree": {
                            "val": "19.270"
                        },
                        "BudgetYearFour": {
                            "val": "10.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "107.009"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "61.300"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "50.859"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "50.859"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}