{
    "id": "2018-Army-PB-2040-JBOOK-4d642436f65ddc83c084fdb1d917f4809eff5a3f2d9cca01c78cf59a8dd3a26e-15",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602712A"
        },
        "ProgramElementTitle": {
            "val": "Countermine Systems"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "35.586"
            },
            "CurrentYear": {
                "val": "26.497"
            },
            "BudgetYearOne": {
                "val": "26.190"
            },
            "BudgetYearOneBase": {
                "val": "26.190"
            },
            "BudgetYearTwo": {
                "val": "25.111"
            },
            "BudgetYearThree": {
                "val": "29.692"
            },
            "BudgetYearFour": {
                "val": "30.234"
            },
            "BudgetYearFive": {
                "val": "30.851"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates, designs, and evaluates technologies to improve counter explosive hazard detection, signature management and counter-sensor capabilities. Focus areas are sensor components, sub-components and software algorithms to improve detection of mines and, explosive threats; directed energy; novel methods to defeat mines and explosive threats; and signature management technologies to reduce the reconnaissance capabilities of enemy forces. The technologies being investigated are for both mounted and dismounted applications. Project H24 advances state of the art counter explosive hazard technologies to accurately detect and neutralize threats with a high probability, reduce false alarms, and enable an increased operational tempo. Project H35 evaluates and develops advanced sensor protection, signature management and deception techniques for masking friendly force capabilities and intentions.\n\nWork in this PE is related to and fully coordinated with complements PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602709A (Night Vision Technology), PE 0602784A (Military Engineering Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603606A (Landmine Warfare and Barrier Advanced Technology), and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army\nModernization Strategy.\n\nWork in this PE is performed by the United States (U.S.) Army Research, Development and Engineering Command (RDECOM)\/Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.568"
                },
                "CurrentYear": {
                    "val": "26.497"
                },
                "BudgetYearOne": {
                    "val": "26.663"
                },
                "BudgetYearOneBase": {
                    "val": "26.663"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "35.586"
                },
                "CurrentYear": {
                    "val": "26.497"
                },
                "BudgetYearOne": {
                    "val": "26.190"
                },
                "BudgetYearOneBase": {
                    "val": "26.190"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.982"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.473"
                },
                "BudgetYearOneBase": {
                    "val": "-0.473"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.982"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.027"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.027"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H24"
                    },
                    "ProjectTitle": {
                        "val": "Countermine Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.686"
                        },
                        "CurrentYear": {
                            "val": "20.821"
                        },
                        "BudgetYearOne": {
                            "val": "20.453"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.453"
                        },
                        "BudgetYearTwo": {
                            "val": "18.248"
                        },
                        "BudgetYearThree": {
                            "val": "21.695"
                        },
                        "BudgetYearFour": {
                            "val": "22.114"
                        },
                        "BudgetYearFive": {
                            "val": "22.565"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs and evaluates new technology components, sub-components and software algorithms for detection, discrimination and neutralization of individual mines, minefields and other explosive threats. The goals of this Project are to accurately detect threats with a high probability, reduce false alarms and enable an increased operational tempo.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate, Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Standoff Sensors for Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the challenges of sensing and confirming potential in-road and roadside threats at standoff ranges. The effort focuses on understanding the phenomenologies that impact sensor design concepts and steer novel technologies that provide the primary means for detecting anomalies. The result is higher-confidence target detection and improved clutter\/background filtering. Examples of candidate technologies include Forward Looking (FL) Electro-Optic\/Infrared (EO\/IR) and Ground Penetrating Radar (GPR) sensors, which are used to detect surface"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.571"
                                            },
                                            "Text": {
                                                "val": "Validated dual band FL GPR components using new phased arrays; explored polarization phenomenologies with Short Wave Infrared (SWIR) through Long Wave Infrared (LWIR) waveband sensors to discriminate man-made objects; investigated vibration sensors to distinguish targets from clutter; explored ground profiling sensors (Light Detection and Ranging (LIDAR), X-band radar) to improve FL GPR data by removing surface clutter; studied new identification and confirmation sensors, such as autonomous Neutron Gamma sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.511"
                                            },
                                            "Text": {
                                                "val": "Will continue the investigation of vibration sensing and polarization technologies for the discrimination of man-made objects; will continue the investigation of advanced processing techniques to combine FL GPR and FL vibration sensor data in order to reduce false alarm rates; will continue to investigate new sensors for identification and confirmation of threats; will investigate microwave sensors, as well as digital receivers, for increased sensitivity of FL GPR sensors in order to help discriminate concealed explosive hazards on roadsides; will explore techniques to detect wires from standoff distances."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.155"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.155"
                                            },
                                            "Text": {
                                                "val": "Will explore and develop novel sensing methods using multiple geometric configurations to enhance FL sensor modalities, including multi-look GPR, LWIR and Visible; mature processing techniques by combining datasets from multiple sensor technologies in order to improve probability of detecting threats in complex environments; investigate new sensors for confirmation of threats for modular platforms; validate techniques to detect wires from standoff distances."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemically Specific Detection of Explosive Threats"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging chemical explosive hazard detection technologies, including Home Made Explosives (HMEs), to address Warfighter needs. The effort will provide technologies for standoff detection and confirmation of emerging threats and production facilities, and it is complimentary to the work being accomplished under Program Element (PE) 0602622A\/Project 552."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.748"
                                            },
                                            "Text": {
                                                "val": "Analyzed data collected in various conditions, and optimized sensitivity and spectral selectivity of new polymer-based quantum dot sensors using remote and hand held excitation sources; investigated new technologies to extract surface vapor signals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Explosive Hazard Detection Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging component technologies to enhance detection of explosive hazards, including metallic and non-metallic landmines, Improvised Explosive Devices (IEDs), HMEs, and Explosively Formed Penetrators (EFPs). Emphasis is on increased coverage area, higher detection rates and increased discrimination probabilities. Technologies that provide low Size, Weight, and Power (SWaP) solutions are considered and studied to ensure solutions are viable for Soldier-portable applications. This effort also investigates advanced signal processing and detection algorithms for increased real-time feedback for threat detection and identification, and it collects data to inform studies investigating methods to reduce the operator's cognitive burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.484"
                                            },
                                            "Text": {
                                                "val": "Conducted data collections in relevant simulated environments to refine the best combination of novel components and sensors for real-time detection and identification of buried explosive hazard threats, including atomic magnetometers for nuclear quadrupole resonance (NQR), GPR, and frequency domain metal detectors; explored advanced signal processing approaches using correlated data from various modalities and determined optimal data processing and algorithm techniques; utilized outcome of optimal datasets as feedback to sensor redesigns and experimentation; determined highly accurate sensor position to improve feedback to reduce the operator's cognitive burden and improve clutter rejection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Text": {
                                                "val": "Will refine data collection processes to incorporate controlled, relevant outdoor environments with refined combinations of novel components and sensors that will be used for real-time detection and identification of buried explosive hazard threats; will continue to investigate advanced signal processing approaches and to design optimal data algorithms and processing techniques; will conduct data collections and analyses to verify the accuracy of sensor position designs and to determine the level of improvement in feedback to operators to reduce cognitive burden and reduce clutter."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.508"
                                            },
                                            "Text": {
                                                "val": "Will finalize combinations of novel components and sensors to support real-time detection and identification of buried explosive hazard threats in relevant outdoor environments; conduct experiments to confirm component designs and mature signal processing techniques; mature visualization components to enhance clutter rejection and improve operator interfaces; conduct limited user assessment of integrated breadboard design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Explosive Hazard Phenomonology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates potential long term solutions to nonconventional explosive hazard threats. It leverages recent lessons learned to investigate new ideas and emerging technologies to counter explosive hazards through gaining a better understanding of how to detect, neutralize and mitigate the threat. The effort includes a series of innovative exploration and discovery events focused on the identification of new ideas and concepts in structured and organized framework, enabling the Army to identify\/assess opportunities to leverage technologies traditionally associated with other arenas, such as the intelligence community, big data, and the financial industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.883"
                                            },
                                            "Text": {
                                                "val": "Continued the series of knowledge capture events with industry and academia; focused efforts on characterizing counter-IED detection phenomenology; continued analysis and began validation of research areas focusing on non-traditional approaches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.810"
                                            },
                                            "Text": {
                                                "val": "Will continue the ongoing series of innovative investigation and informational events with industry and academia to collect information on previously unexplored phenomenologies; based on the knowledge gained from Fiscal Year (FY) 2015 and FY16 knowledge capture events, will evaluate and validate nonconventional Counter Explosive Hazard (CEH) technologies for buried or concealed explosive hazard detection, such as multi-static GPR, polarized ultraviolet (UV) radiation, and explore novel passive radio frequency (RF)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.790"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.790"
                                            },
                                            "Text": {
                                                "val": "Will evaluate and validate nonconventional CEH technologies for buried or concealed explosive hazard detection, such as novel neutron sources and gamma detectors for identification of buried explosive, and RF atomic magnetometers for discrimination of buried man-made objects; continue the ongoing series of innovative investigation and informational events with industry and academia to collect information on previously unexplored phenomenologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H35"
                    },
                    "ProjectTitle": {
                        "val": "Camouflage  & Counter-Recon Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.400"
                        },
                        "CurrentYear": {
                            "val": "5.676"
                        },
                        "BudgetYearOne": {
                            "val": "5.737"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.737"
                        },
                        "BudgetYearTwo": {
                            "val": "6.863"
                        },
                        "BudgetYearThree": {
                            "val": "7.997"
                        },
                        "BudgetYearFour": {
                            "val": "8.120"
                        },
                        "BudgetYearFive": {
                            "val": "8.286"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs and evaluates techniques for masking friendly force capabilities and intentions. The Project pursues technologies to reduce the susceptibility of sensor systems to detection and targeting by threat forces, as well as to inform the development of next generation camouflage coatings and paints. Novel technologies are investigated, such as novel optics designs combined with signal processing, spectral filtering, and threat sensing algorithms.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States (U.S.) Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate, Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Camouflage and Counter-Reconnaissance Technology for Advanced Spectral Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and advances new techniques to reduce susceptibility of sensors and signature reduction approaches to detection by lasers, Electro-Optic (EO) sensor systems and Infrared (IR) sensor systems. The primary objectives are to reduce the reflectivity of currently fielded and emerging EO and sensors and next generation camouflage nets due to incoming energy from lasers as well as EO and IR sensor systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.400"
                                            },
                                            "Text": {
                                                "val": "Studied uncooled FPA resiliency against laser threats; investigated uncooled focal plane array (FPA) protection including Micro-electromechanical Systems (MEMS) devices and tunable IR filters; investigated best approach to harden daylight (Day-TV) cameras against laser threats; investigated methods of laser protection for high performance cooled IR sensors, including linear and non-linear optical approaches. Explored spectral response of next generation lightweight camouflage net systems, as well as different methods to imbed a thermal pattern into the net systems; optimized the performance of multispectral camouflage to counter emerging threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.676"
                                            },
                                            "Text": {
                                                "val": "Will investigate sensor vulnerabilities to future laser threats, and will develop algorithms and explore new materials, devices, and strategies to counter these threats; will develop sensor protection technologies that can be applied across multiple platforms; will continue to investigate techniques to minimize the spectral signatures of two-sided camouflage nets for desert and woodland environments; will investigate the colors, patterns and materials needed to design arctic camouflage patterns with minimal spectral signatures; will research future urban camouflage solutions for both vehicles and dismounts; will explore hyperspectral sensor technology to locate both red force and blue force targets in obscured locations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.737"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.737"
                                            },
                                            "Text": {
                                                "val": "Will validate through experimentation optical cross section reduction methods for day television (TV) sensors; continue to investigate sensor vulnerabilities to future laser threats; research new materials, devices, and strategies to counter these threats; develop sensor protection technologies that can be applied to new day TV sensors employed on multiple platforms. Define signature reduction characteristics for urban and artic camouflage solutions for both vehicles and dismounts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HB2"
                    },
                    "ProjectTitle": {
                        "val": "COUNTERMINE COMPONENT TECHNOLOGY (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.500"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Countermine Systems applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "11.500"
                                        },
                                        "Text": {
                                            "val": "This is a Congressional Interest Item"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}