{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-22",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604780A"
        },
        "ProgramElementTitle": {
            "val": "Combined Arms Tactical Trainer (CATT) Core"
        },
        "R1LineNumber": {
            "val": "102"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.808"
            },
            "CurrentYear": {
                "val": "15.068"
            },
            "BudgetYearOne": {
                "val": "18.566"
            },
            "BudgetYearOneBase": {
                "val": "18.566"
            },
            "BudgetYearTwo": {
                "val": "19.601"
            },
            "BudgetYearThree": {
                "val": "20.415"
            },
            "BudgetYearFour": {
                "val": "17.361"
            },
            "BudgetYearFive": {
                "val": "10.962"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Combined Arms Tactical Trainers (CATT) represent a family of combined arms simulation systems designed to support the Army's simulation-based, Combined Arms Training Strategy. The CATT program portfolio directly supports the Army's Training Strategy and progressive training model by providing realistic training events and comprehensive After Action Reviews (AAR). CATT enables units, from crew to the battalion task force level, to conduct a wide variety of combat tasks on a realistic, interactive, synthetic battlefield.  CATT's combination of manned simulators and staff officer workstations enables units to train as a combined arms team in a cost effective manner.  The primary CATT system is the Close Combat Tactical Trainer (CCTT) which provides the underlying baseline architecture and AAR for CATT expansions, Pre-Planned Product Improvements (P3I) and system enhancements.  The Reconfigurable Vehicle Simulator (RVS) supports combat convoy operations and Improvised Explosive Devices (IED) tasks.  Synthetic Environment (SE) Core provides for the expansion of the synthetic environment baseline to include enhanced interoperability and the products and infrastructure to support current and future combat operations and mission rehearsal required for Unified Land Operations.  The first synthetic environments expanded were in the Aviation Combined Arms Tactical Trainer (AVCATT) and the CCTT for both the Active and Reserve components.  Gaming Technology provides an application to train and rehearse convoy-operations, platoon level, mounted infantry tactics, dismounted operations, rules-of-engagement training, cross-cultural communications training, IED defeat training, route clearance, ground-air coordination, Unmanned Aerial Vehicle (UAV) integration, and other small unit and individual training and mission rehearsal requirements.  Soldiers can train in a common environment on geotypical or geospecific virtual terrain.  It is also possible to link Gaming technology to actual communication, command, control, computer, and intelligence (C4I) systems and other CATT simulation systems to increase the utility and realism of the training.  By practicing skills in CATT, units are able to effectively prepare for costly live fire and maneuver exercises, as well as training tasks deemed too hazardous to conduct in a live training environment. Fielded in both fixed site and mobile versions, CATT enables both Active and Reserve component units to prepare for real world contingency missions.  By being able to use a wide array of training terrain databases and modify the behavior of the computer generated opposing forces, CATT offers an unlimited array of training options to support the Army's many regional combat missions.  The combination of tough field and live fire training, and realistic simulation training in CATT, is the formula to prepare Soldiers and their Leaders for the uncertainties they face in combat operations.\n\nFY 2018 core funding of $.937 million for CCTT enables gaming technology and visualization for maneuver training, and the P3I for the CCTT in order to reduce life cycle costs.\n\nFY 2018 base funding of $0.536 million will continue program management activities in conducting market research for future Engineering and Manufacturing Development (EMD) phase of GFT flagship replacement.\n\nFY 2018 base funding of $11.513 million will continue the efforts of providing development of the capability to produce common terrain databases to maintain concurrency with supported training systems. FY 2018 funds will continue modifying the Terrain Development process for constructive terrain databases, and continue to enhance OneSAF in the SE Core Architecture. Base funding also provides continuous development of new OneSAF capabilities for virtual simulations and enables interoperability with the Live, Virtual, Constructive Integrated Training Environment (LVC ITE); this is a cost avoidance for individual virtual simulators in that they do not develop and maintain separate Semi-Automated Forces (SAFs). SE Core will continue to upgrade, integrate and refine the Common Virtual Components, and continue to develop common visual models and transportation networks.\n  \nFY 2018 base funding of $5.580 million for AVCATT will design and develop software to inter-operate with other training devices and simulators in a Common Operating Environment (COE).  This is required to enable training with the Universal Mission Simulator, CCTT, Games For Training, and LVC-IA.  Additionally, the base funding will be used to design and develop the replacement of the Image Generator system as part of hardware modernization."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.622"
                },
                "CurrentYear": {
                    "val": "15.068"
                },
                "BudgetYearOne": {
                    "val": "18.053"
                },
                "BudgetYearOneBase": {
                    "val": "18.053"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.808"
                },
                "CurrentYear": {
                    "val": "15.068"
                },
                "BudgetYearOne": {
                    "val": "18.566"
                },
                "BudgetYearOneBase": {
                    "val": "18.566"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.814"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.513"
                },
                "BudgetYearOneBase": {
                    "val": "0.513"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.814"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.513"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.513"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "571"
                    },
                    "ProjectTitle": {
                        "val": "Close Cbt Tact Trainer"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.725"
                        },
                        "CurrentYear": {
                            "val": "0.998"
                        },
                        "BudgetYearOne": {
                            "val": "0.937"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.937"
                        },
                        "BudgetYearTwo": {
                            "val": "0.845"
                        },
                        "BudgetYearThree": {
                            "val": "0.836"
                        },
                        "BudgetYearFour": {
                            "val": "0.536"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Close Combat Tactical Trainer (CCTT) immersively and comprehensively trains Armor, Cavalry, Infantry, Mechanized Infantry, and Armored Reconnaissance units from squad through Battalion\/Squadron level, to include their staffs.  The primary training audience operates from full-crew simulators, reconfigurable command posts, and live battalion command posts to accomplish their combined arms training tasks. CCTT is a ground based, collective training device comprised of the CCTT and the Reconfigurable Vehicle Tactical Trainer (RVTT).  CCTT is comprised of full fidelity, manned simulators for the M1 Abrams main battle tank, M2 Bradley Fighting Vehicles (BFV) variants, and Cavalry Fighting Vehicles (CFV).  RVTT is a CCTT Reconfigurable Vehicle Simulator (RVS) comprised of full fidelity, manned simulators for the High Mobility Multipurpose Wheeled Vehicle (HMMWV) and Heavy Expanded Mobility Tactical Truck (HEMTT).  \n\nFY 2018 core funding of $.937 million for CCTT enables: the continued development and integration of gaming technology, development of visualization technology, support of maneuver training, and the P3I to reduce life cycle costs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Close Combat Tactical Trainer (CCTT) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the CCTT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.125"
                                            },
                                            "Text": {
                                                "val": "Supported government program management, engineering, technical, contracting support, and continues operational evaluation support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.163"
                                            },
                                            "Text": {
                                                "val": "Will support government program management, engineering, technical, contracting support, and will continue operational evaluation support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.166"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.166"
                                            },
                                            "Text": {
                                                "val": "Will support government program management, engineering, technical, contracting support, and will continue operational evaluation support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for CCTT, and Interoperability between CCTT."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for CCTT."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Enabled the integration of gaming technology into CCTT in support of maneuver training for Armor Brigade Combat Teams."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.835"
                                            },
                                            "Text": {
                                                "val": "Will enable the continued development and integration of gaming technology; and development of virtualization technology into CCTT in support of maneuver training for Armor Brigade Combat Teams."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.771"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.771"
                                            },
                                            "Text": {
                                                "val": "Will enable the continued development and integration of gaming technology; and development of virtualization technology into CCTT in support of maneuver training for Armor Brigade Combat Teams."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA3, Appropriation NA0170"
                                    },
                                    "Title": {
                                        "val": "OPA3, Appropriation NA0170"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.210"
                                        },
                                        "CurrentYear": {
                                            "val": "59.771"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.718"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.718"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "47.135"
                                        },
                                        "BudgetYearThree": {
                                            "val": "51.430"
                                        },
                                        "BudgetYearFour": {
                                            "val": "39.503"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.274"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA, Appropriation 121018000"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation 121018000"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.687"
                                        },
                                        "CurrentYear": {
                                            "val": "2.960"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.235"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.235"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.648"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.893"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.973"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.164"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The RDT&E efforts are essential to provide enhancements for the hardware and software of the program to meet warfighter mission priorities and validated requirements.  These enhancements, after proper testing, will be procured and fielded with the programs procurement funds."
                        },
                        "AcquisitionStrategy": {
                            "val": "All CCTT development will utilize small business competively awarded contract vehicles or agreements with the Army Research Laboratory (ARL) and other Army programs for support of research and development."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "577"
                    },
                    "ProjectTitle": {
                        "val": "Gaming Technology In Support Of Army Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.880"
                        },
                        "CurrentYear": {
                            "val": "1.979"
                        },
                        "BudgetYearOne": {
                            "val": "0.536"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.536"
                        },
                        "BudgetYearTwo": {
                            "val": "0.545"
                        },
                        "BudgetYearThree": {
                            "val": "1.002"
                        },
                        "BudgetYearFour": {
                            "val": "1.228"
                        },
                        "BudgetYearFive": {
                            "val": "0.618"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Games for Training (GFT) Program prepares Soldiers and leaders for combined arms maneuver operations for Force 2025 and beyond in support of the Joint Force and allies with tailorable and scalable training and mission rehearsal capabilities. Gaming Technology provides an application to train and rehearse convoy-operations, platoon level, mounted infantry tactics, dismounted operations, rules-of-engagement training, cross-cultural communications training, IED defeat training, route clearance, groundair coordination, Unmanned Aerial Vehicle (UAV) integration, and other small unit and individual training and mission rehearsal requirements. The GFT program satisfies the Active, the National Guard, and the Army Reserves' educational requirements in the Operational, Institutional, and Self-Development Training Domains with a low-overhead, flexible, persistent training capability on geo-specific and geo-typical terrain that is relevant with all military platforms and weapon systems. GFT comprehensively trains Company and below formations to operate in today's dynamic combat environment. GFT trains higher multi-echelon units and staffs without troops to meet Combatant Commanders’ requirements.  \n\nFY 2018 base funding of $0.536 million will continue program management activities in conducting market research for future Engineering and Manufacturing Development (EMD) phase of GFT flagship replacement. The decision to pursue GFT Increment II capability was deferred."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Games for Training (GFT) program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the GFT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.660"
                                            },
                                            "Text": {
                                                "val": "Funding provided modifications to the GFT system to ensure compliance with the LVC in support of Force 2025 and beyond. It also integrated new commercial and Government technology products into the current Gaming System."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.692"
                                            },
                                            "Text": {
                                                "val": "Funding will provide concurrency modifications to the GFT system to ensure integration compliance with Live, Virtual and Constructive simulations and Mission Command Systems in support of Force 2025 and beyond training. Funding will allow for Engineering and Manufacturing Development of the GFT system into Common Operating Environment (COE) for Data Cloud and Hand Held environments. Funding also provides market research for the GFT flagship replacement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management for the GFT program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the GFT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.220"
                                            },
                                            "Text": {
                                                "val": "Government program management, engineering, technical, contract and test activities provided integration of software, fielding, and web hosted support to U.S. Army Soldier tactical training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.287"
                                            },
                                            "Text": {
                                                "val": "Government program management, engineering, technical, contract and test activities will provide integration of software, fielding, and web hosted support to U.S. Army Soldier tactical training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.536"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.536"
                                            },
                                            "Text": {
                                                "val": "Government program management, engineering, technical, contract and test activities to support market research for future commercial and Government gaming solutions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA 3"
                                    },
                                    "Title": {
                                        "val": "OPA 3, Appropriation NA0176 Gaming Technology in Support of Army Training"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.793"
                                        },
                                        "CurrentYear": {
                                            "val": "11.543"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.406"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.406"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.454"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.483"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.395"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.179"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation 121018000, TCAT"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "0.250"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.241"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.241"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.240"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.238"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.237"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.250"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "OPA funding provides concurrency of the Virtual Battlespace 3 (VBS3) Flagship software license that provides the Army enterprise use rights. Additionally, funding provides for the procurement of new gaming hardware suites and gaming system refresh. The GFT program will also provide other commercial and Government off-the-shelf game software applications used to train Active, Reserve, and Army National Guard soldiers in a PC based, shared environment. OMA funding provides and supports Games for Training hardware and software Information Assurance (IA) and Risk Management Framework (RMF) requirements."
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy is to annually procure an Army-wide software license for a commercial or Government game based training system, Virtual Battlespace 3 (VBS3) and associated Games for Training system hardware that consists of a common desktop or laptop computer, headset, and peripherals. In support of concurrency initiatives to the COTS solution, the GFT program conducts development and integration activities for new models and visual concurrency into the VBS3 flagship software baseline.\n\nThe government awarded a single award, multiple year Firm Fixed Price contract with a single base year awarded in FY13 and option years exercised in FY14, FY15, and FY16. FY17 will be the final option year and will result in an Army wide perpetual license that will be used until procurement of the flagship replacement.\n\nEfforts for flagship replacement gaming capability are currently being initiated for an FY19 start."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "582"
                    },
                    "ProjectTitle": {
                        "val": "Synthetic Envir Core"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.035"
                        },
                        "CurrentYear": {
                            "val": "9.322"
                        },
                        "BudgetYearOne": {
                            "val": "11.513"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.513"
                        },
                        "BudgetYearTwo": {
                            "val": "10.077"
                        },
                        "BudgetYearThree": {
                            "val": "10.179"
                        },
                        "BudgetYearFour": {
                            "val": "10.221"
                        },
                        "BudgetYearFive": {
                            "val": "10.344"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the Synthetic Environment Core (SE Core) Program.  SE Core's mission is to ensure the Army's training systems and simulators are integrated and interoperable in support of U.S. Army Readiness. SE Core provides virtual simulators with visual models (buildings and vehicles), terrain (over which the simulator moves), and entity behaviors (models performing realistic and appropriate actions such as movement and weapon effects) that are relevant and realistic to Force 2025 and beyond.  The result is a \"Fair Fight\" capability; no simulator or operator will have an inherent advantage over another.  Fair Fight allows for air and ground to have coordinated and integrated training events that accurately replicate combat operations.  Additionally, SE Core is building the Army's Common Virtual Environment (CVE) that provides the linkage between simulators and establishes a common environment for interoperability, allowing various simulators to be linked together for a train-as-we-fight capability. SE Core is a foundational element in the Integrated Training Environment linking the embedded systems, multi-mode Live, Virtual, Constructive, Gaming (LVCG) training capability with current systems.\n\nThe SE Core components are Virtual One Semi-Automated Forces (OneSAF) integration; terrain database generation; common visual models; virtual systems architecture; a dynamic environment; and mission command development. A major SE Core component is the Standard Terrain Database Generation Capability (STDGC) process used to generate the synthetic terrain used in simulators and simulations. This terrain is a key component for virtual simulators and constructive simulations and will meet the demands of today's and future simulations.\n\nFY17 base funding request decreased significantly from the PB16 submission due to a de-scoping of program requirements.\n\nFY 2018 base funding of $11.513 million will continue the development of the terrain generation capability for common terrain databases to maintain concurrency with supported training systems. FY 2018 funds will continue developing the terrain generation tools and process for constructive terrain databases, and continue to enhance OneSAF in the SE Core Architecture. Base funding also provides continuous development of new OneSAF capabilities for virtual simulations and enables interoperability with the Live, Virtual, Constructive Integrated Training Environment (LVC ITE); this is a cost avoidance for individual virtual simulators in that they do not develop and maintain separate Semi-Automated Forces (SAFs). SE Core will continue to upgrade, integrate and refine the Common Virtual Components, and continue to develop common visual models and transportation networks. Base funding will also begin development of new tools and processes needed to support the Dense Urban Terrain environment requirement."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Synthetic Environment Core (SE Core) program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the SE Core program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.250"
                                            },
                                            "Text": {
                                                "val": "Increment 2 provided expansion of the terrain generation capability to meet the demand for synthetic terrain for training including constructive simulation and gaming.  Efforts to improve interoperability across simulators and simulations continued to include transportation networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.730"
                                            },
                                            "Text": {
                                                "val": "Continues to satisfy requirements in preparation to complete Increment 2.  Efforts will automate the terrain generation capability to meet the demand for synthetic terrain for constructive and gaming training. Will also increase interoperability across simulators and simulations by improving subterranean capabilities and transportation networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.841"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.841"
                                            },
                                            "Text": {
                                                "val": "Satisfy requirements necessary to initiate Increment 3. Efforts will continue to automate the terrain generation capability to meet the demand for synthetic terrain for constructive and gaming training. Will also continue to increase interoperability across simulators and simulations by improving subterranean capabilities and building interiors. Will begin development of new tools and processes needed to support the Dense Urban Terrain environment requirement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Synthetic Environment Core (SE Core) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the SE Core program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.785"
                                            },
                                            "Text": {
                                                "val": "Provided program management, engineering and technical oversight, contract support, and travel for support of site surveys and Subject Matter Experts for the development of SE Core.  Additionally, started acquisition management for the solicitation and evaluation for a new SE Core contract award."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.592"
                                            },
                                            "Text": {
                                                "val": "Will provide program management, engineering and technical oversight, contract support, and travel for support of site surveys and Subject Matter Experts for the development of SE Core."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.672"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.672"
                                            },
                                            "Text": {
                                                "val": "Will provide program management, engineering and technical oversight, contract support, and travel for support of site surveys and Subject Matter Experts for the development of SE Core under the newly awarded contract."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OMA, Appropriation, 121018000"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation 121018000, TBWG"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.436"
                                        },
                                        "CurrentYear": {
                                            "val": "16.878"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.432"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.432"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.609"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.165"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.947"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.570"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "OMA funds are used to generate and maintain the synthetic terrain, models, and virtual OneSAF for the Army’s Integrated Training Environment (ITE) concept."
                        },
                        "AcquisitionStrategy": {
                            "val": "The SE Core program is post Milestone B and will remain in the Engineering and Manufacturing Development phase for the remainder of its lifecycle.  SE Core is a \"software only\" program that continuously develops terrain, virtual models and other software products for integration into existing training systems. It does not field products to the end user, therefore the program will not require a Milestone C decision or go into the Production phase. The SE Core program is developing the software tools and processes to develop the Army's common virtual environment to link simulation devices (to include: CCTT, AVCATT, GFT, LVC-IA, HITS, JLCCTC, FIRESIM, OneSAF) into an interoperable environment and maintaining the synthetic terrain, models, and virtual OneSAF for the Army's Integrated Training Environment (ITE) concept. \n\nThe government awarded Increment 2 as a single award, cost plus fixed fee (CPFF), indefinite delivery indefinite quantity (IDIQ) contract to Leidos in August 2011 with a period of performance start date of December 2011. Leidos was formerly known as Science Applications International Corporation (SAIC).  This contract has a one-year base with four one-year options.  The government exercised the first option in December 2012, the second option in December 2013, the third option in December 2014 and the fourth option in December 2015. The government will award a final delivery order in December 2016 that extends the period of performance of the Increment 2 contract into December 2017.\n\nIn keeping with the original SE Core acquisition strategy of continuous development, the government intends to award the Increment 3 contract as a single award, CPFF, IDIQ contract in FY18. The contract will have a one year base and four one-year options with a target end date of 2022 to accommodate the extension of the program lifecycle by two years in order to support the Army's Integrated Training Environment."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.622"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.622"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.622"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.018"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.785"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.592"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.672"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.672"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technology Development - Architecture and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.946"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.946"
                                                    },
                                                    "TargetValue": {
                                                        "val": "6.946"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development -Architecture and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "50.785"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "50.785"
                                                    },
                                                    "TargetValue": {
                                                        "val": "50.785"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development -Database Virtual Environment Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CAE, USA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "56.179"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "56.179"
                                                    },
                                                    "TargetValue": {
                                                        "val": "56.179"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development- Common Virtual Environment & Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "55.025"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.730"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "77.005"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development- Common Virtual Environment & Management INC III"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ACC-Orlando"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.841"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.841"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.841"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technology Development - Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Test Community"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.125"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.125"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.125"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-18.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Increment 2 (Development and Integration)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 3 (Development and Integration)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "585"
                    },
                    "ProjectTitle": {
                        "val": "Aviation Combined Arms Tactical Trainer"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.168"
                        },
                        "CurrentYear": {
                            "val": "2.769"
                        },
                        "BudgetYearOne": {
                            "val": "5.580"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.580"
                        },
                        "BudgetYearTwo": {
                            "val": "8.134"
                        },
                        "BudgetYearThree": {
                            "val": "8.398"
                        },
                        "BudgetYearFour": {
                            "val": "5.376"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Aviation Combined Arms Tactical Trainer (AVCATT) is Army Aviation's only Collective Training Program of Record for Active, Reserve, and Army National Guard Aviation Units.  AVCATT enables unit collective and combined arms air-ground training for AH-64, UH-60, CH-47, OH-58, and UH-72 aircrews within the Live, Virtual and Constructive (LVC) Integrated Training Environment (ITE). The AVCATT also supports the training of Non-Rated crew members in crew coordination, flight, aerial gunnery, hoist, and slingload related tasks via the Non-Rated Crew Member Manned Module (NCM3); which can be linked to AVCATT's UH-60, CH-47, and UH-72 cockpit configurations to support a unit's specific Mission Training Requirements.   \n\nFY2018 base funding for AVCATT will design and develop software to inter-operate with other training devices and simulators in a Common Operating Environment (COE).  This is required to enable training with the Universal Mission Simulator, CCTT, Games For Training, and LVC-IA.  Additionally, the base funding will be used to design and develop the replacement of the Image Generator system as part of hardware modernization."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Aviation Combined Arms Tactical Trainer (AVCATT) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the AVCATT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.168"
                                            },
                                            "Text": {
                                                "val": "Supported government program management, engineering, technical, contracting support, and continues operational evaluation support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.185"
                                            },
                                            "Text": {
                                                "val": "Will support government program management, engineering, technical, contracting support, and continues operational evaluation support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.104"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.104"
                                            },
                                            "Text": {
                                                "val": "Will support government program management, engineering, technical, contracting support, and continues operational evaluation support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Aviation Combined Arms Tactical Trainer (AVCATT) program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the AVCATT program."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.584"
                                            },
                                            "Text": {
                                                "val": "Will complete the design, development, and testing for the first article test for a virtualized AVCATT manned module architecture in order to reduce the current computer hardware footprint in preparation for FY18 planned hardware modernization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.476"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.476"
                                            },
                                            "Text": {
                                                "val": "Will complete development and testing for new interfaces and protocols for the system to inter-operate with other training devices and simulators in a Common Operating Environment (COE).  Will begin design and development of upgraded image generators in preparation for FY20 planned hardware modernization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Other Procurement, Army"
                                    },
                                    "Title": {
                                        "val": "OPA3, Appropriation NA0173 Aviation Combined Arms Tactical Trainer"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.068"
                                        },
                                        "CurrentYear": {
                                            "val": "40.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "30.568"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "30.568"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.281"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.062"
                                        },
                                        "BudgetYearFour": {
                                            "val": "32.430"
                                        },
                                        "BudgetYearFive": {
                                            "val": "42.191"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Operations and Maintenance, Army"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation 121018000 Aviation Combined Arms Tactical Trainer"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.100"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "0.100"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The government awarded a single award, cost plus fixed fee (CPFF), indefinite delivery indefinite quantity (IDIQ) contract to Applied Visual Technologies, a minority owned, small disadvantaged business, in December 2012. The period of performance of the base contract is through December 2017. Additional tasks are exercised through delivery orders which each have multiple options for development. The most recently awarded RDTE effort was on the fourth delivery order, awarded in September 2014, which included options for gunnery enhancements, integrated data modem development, training environment virtualization, aviation mission planning software development, maintenance tool kit development, manned unmanned teaming, and AH-64E concurrency development.\n\nThe government awarded a single award, CPFF, IDIQ services contract to Cole Engineering Services, Inc, a small business, in September 2015.  The period of performance of the base contract is through September 2020.   The third task order, awarded in June 2016, included hardware modernization development and Windows 10 research and testing.   \n\nAVCATT utilizes small business competitively awarded contract vehicles when able. Currently small businesses are conducting development for dynamic terrain enhancements, NCM3 development, and training effectiveness analysis.\n\nThe AVCATT program is post Milestone C. Although the system is in the production phase, continuous research, development, testing, and engineering is required in order to maintain concurrency with the real world aircraft and systems that the AVCATT simulates in the virtual training environment. The AVCATT program has fielded the full base order of issue of 23 suites but continues to release incremental hardware and software upgrades at approximate semiannual intervals."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}