{
    "id": "2018-MissileDefenseAgency-PB-0400-JBOOK-ecb599f298355e00e598f803f2d210c3bb32a52ac3f448eb2765e4feeff6ff48-4",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-MDA-U_RDTE_JustificationBook_Missile_Defense_Agency_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Missile_Defense_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603180C"
        },
        "ProgramElementTitle": {
            "val": "Advanced Research"
        },
        "R1LineNumber": {
            "val": "31"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "41.005"
            },
            "PriorYear": {
                "val": "16.987"
            },
            "CurrentYear": {
                "val": "27.733"
            },
            "BudgetYearOne": {
                "val": "20.184"
            },
            "BudgetYearOneBase": {
                "val": "20.184"
            },
            "BudgetYearTwo": {
                "val": "20.695"
            },
            "BudgetYearThree": {
                "val": "21.555"
            },
            "BudgetYearFour": {
                "val": "21.936"
            },
            "BudgetYearFive": {
                "val": "22.361"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "N\/A"
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Research PE conducts leading edge advanced research and development to create and enable future missile defense capabilities.  Missile Defense Agency executes this mission by capitalizing on the creativity and innovation of the brightest minds in our Nation's universities and small businesses, collaborative research partnerships between allied country academic institutions, and innovative ideas from industry.  This includes a focus on facilitating the transition of technology to the Ballistic Missile Defense System (BMDS) through a Commercialization and Transition Office and the execution of the Rapid Innovation Fund Program.\n\nFY 2017 Amended Budget Request Justification:  $+4.300M is required to address Joint Emergent Operational Need requirement to ensure readiness of the BMDS. $+4.300M Project MD25 - Advanced Technology Development\/Advanced Research to begin FY 2017 National Defense Authorization Act (NDAA) required development of a Hypersonic Threat Defense program.  Leverages Army Night Vision Lab and other Services' investments in large Focal Panel Arrays (FPA) that can maintain high sensitivity at higher operating temperature."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.364"
                },
                "CurrentYear": {
                    "val": "23.433"
                },
                "BudgetYearOne": {
                    "val": "19.870"
                },
                "BudgetYearOneBase": {
                    "val": "19.870"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.987"
                },
                "CurrentYear": {
                    "val": "27.733"
                },
                "BudgetYearOne": {
                    "val": "20.184"
                },
                "BudgetYearOneBase": {
                    "val": "20.184"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.377"
                },
                "CurrentYear": {
                    "val": "4.300"
                },
                "BudgetYearOne": {
                    "val": "0.314"
                },
                "BudgetYearOneBase": {
                    "val": "0.314"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.377"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "4.300"
                                },
                                "BudgetYearOne": {
                                    "val": "0.314"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.314"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 Amended Budget Request Justification:  $+4.300M is required to address Joint Emergent Operational Need requirement to ensure readiness of the BMDS."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD25"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "41.005"
                        },
                        "PriorYear": {
                            "val": "16.061"
                        },
                        "CurrentYear": {
                            "val": "26.900"
                        },
                        "BudgetYearOne": {
                            "val": "19.302"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.302"
                        },
                        "BudgetYearTwo": {
                            "val": "19.723"
                        },
                        "BudgetYearThree": {
                            "val": "20.580"
                        },
                        "BudgetYearFour": {
                            "val": "20.905"
                        },
                        "BudgetYearFive": {
                            "val": "21.319"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "MDA explores potential new BMDS capabilities by leveraging the creativity and innovation of the Nation's small businesses and universities to conduct advanced technology development. MDA also pursues advanced technology development through cooperative international research agreements between U.S. and foreign universities of allied nations. The program manages the selection process and administers the Missile Defense Small Business Innovation Research program element, 0605502C.  Small Business Innovation Research topics and projects are selected annually based on identified needs across the BMDS and executed in partnership with sponsoring intra-agency organizations. \n\nMDA's Advanced Technology Development Project pursues a broad range of emerging technology targeted for application and insertion into the BMDS.  This work facilitates the commercialization and transition of promising technology into the BMDS by promoting a cooperative environment to reduce cost and increase return on investment between small business, prime contractors, and MDA elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Description": {
                                        "val": "This activity funds technology\/research initiatives.\nSpecific and\/or unique accomplishments to a FY are as follows:\n-Conduct systems engineering, integration, research, and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats \n-Leverage university to university international research opportunities with allied nations to enhance BMDS advanced technology initiatives and build stronger relationships with MDA North Atlantic treaty Organization allied nations and our partner countries\n-Manage the selection process of Small Business Innovation Research and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.061"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Pursued on-going scientific and engineering university research initiatives and projects:\n  --Texas A&M University: Solid Propellant Additives for Divert Attitude Control System (DACS) Applications \n  --Texas A&M University: Hybrid Waveguide Micro Electro Mechanical System Optical Signal Processor\n  --Alabama A&M University: Reconfigurable Computing for Multi-Sensor Tracking Applications \n  --University of Texas at Austin: Nanomaterial-based Ink-Jet Printing Science and Technology for Conformable X-\n     Band Phased Array Antenna\n  --University of New Hampshire: Gas Circulator for Diode Pumped Alkali Laser (DPAL)\n  --University of Connecticut: Development of Innovative Solutions for Hardware Security, and Detection and\n     Prevention\n  -- University of New Hampshire: Numerical Simulations of DPAL with Co-Flowing Planar Jet Geometries\n  -- Auburn University \/ Middle East Technical University, Turkey: Integrated Framework for Engineering\n     Replicability into High Assurance Ballistic Missile Defense System (BMDS) Simulations\n\n-Sponsored breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement, to include research in: \n  -- Radar Systems\n  -- Directed Energy Systems\n  -- Electro-Optical Infrared Sensor Systems\n  -- Computer Science, Signal and Data Processing\n  -- Mechanical and Aerospace engineering\n  -- Decision Theory\n  -- Modeling & Simulation\n  -- Interceptor Technology\n  -- Sensor Technology\n\n-Partnered with industry, the High Energy Laser Joint Technology Office, universities and national laboratories through advanced technology initiatives to improve sensor technology, high energy laser acquisition, tracking, and pointing technology, and lightweight fiber laser amplifiers"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The increase in funding from FY 2016 to FY 2017 provides additional funding to the highly successful effort for transitioning advanced material technology to the BMDS, along with initiatives in Nano-technology (propellants, batteries, electronics, multifunctional structures, thermal management, and electro-optics) and additive manufacturing technology for interceptor propulsion and structural components.\n\n-Partner with industry, universities, and national laboratories through advanced technology initiatives:\n       --Nano-technology initiatives\n          ---Propellants\n          ---Batteries\n          ---Electronics\n          ---Multifunctional structures\n          ---Thermal management\n          ---Electro-optics\n      --Additive manufacturing technology initiatives for interceptor propulsion and structural components\n\n-Pursue on-going scientific and engineering university research initiatives and projects, including:\n  --Alabama A&M University: Reconfigurable Computing for Multi-Sensor Tracking Applications\n  --Auburn University \/ Middle East Technical University, Turkey: Integrated Framework for Engineering\n     Replicability into High Assurance BMDS Simulations\n  --Howard University: Machine Learning for Analyzing the Forensics and Reliability of Integrated Circuits\n  --Johns Hopkins University: Improvements in Thermal Battery Capabilities\n  --Purdue University: Development and Characterization of Hypergolic Propellants\n  --Purdue University: Investigation of Root Causes of Combustion Instability \n  --Texas A&M University: Propellant Formulations for Suppressing Combustion Instability in Solid Rocket Motors\n  --Texas A&M University: Hysteresis Engineering of Adaptive Materials for Electronic and Optoelectric Devices\n  --University of Connecticut: Radar and Electro Optical Systems Track Detection Algorithms \n  --University of Dayton: Common Aperture Light Weight Multi-Aperture All Electric High Energy Laser\n  --University of Michigan: Narrow-Band Infrared Spectral Filtering via Silicon Sub-Wavelength Dielectric Gratings\n  --University of Nebraska \/ University of Bordeaux, France: Diamond Coating Adaptive to Substrate Materials\n  --University of Texas El Paso: Hydroxyl Ammonium Nitrate Based Advanced Hybrid Rocket Motor Technologies\n  --Washington State University: Reliability of Through Silicon Vias and Solder Microbumps in 3D Electronics for High Performance Defense\n     Applications\n\n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement, to include research in: \n  -- Radar systems\n  -- Directed energy systems\n  -- Electro-optical infrared sensor systems\n  -- Computer science, signal, and data processing\n  -- Mechanical and aerospace engineering\n  -- Decision theory\n  -- Modeling & simulation\n  -- Interceptor technology\n  -- Sensor technology\n\n-Partner with industry, universities and national laboratories through advanced technology initiatives to develop improvements, including:\n  --Space and sensor technology\n      --Nanosat technology demonstrations\n      --Radiation hardened mirror technology\n      --Multi-static radar technology to include interferometric processing\n      --Radiation hardened strained-layer superlattice focal plane arrays\n      --Improvements in spacecraft manufacturing efficiency\n      --Deep learning algorithms for missile discrimination\n  --Directed energy technology\n      --High power optical fibers\n      --Quick recovery high energy diodes\n      --Ultra low size weight and power diode pump modules\n      --Large stroke, high spatial bandwidth, deformable mirrors\n      --Light weight, dampened optical benches\n      --Optics and coatings for alkali environments\n  --Interceptor technology\n      --Aerospace-grade Rayon technology development\n      --Liquid bipropellant combustion models\n      --Liquid propellant neutralization\n      --Navigation algorithm technology development\n  --Future Ballistic Missile Defense System concept development\n      --Advanced sensor algorithm initiative\n      --Aerospace vehicle target, tracking, and discrimination\n      --Radar interferometric processing for electro magnetic rail gun \n  --Low cost sensor development for Advanced Threat Tracking\n     --Leverage Army Night Vision Lab investments in large focal plane arrays that maintain high sensitivity at higher operating\n     temperatures and other technology investments in wide field of view optics\n     --Produce and demonstrate a breadboard 4k x 4k strained layer superlattice focal plane arrays and wide field of view optics\n\n\n-Continue an International Cooperative Agreement between the DoD and the Ministry of Defense of the Kingdom of Denmark concerning ballistic missile defense technology (Frequency Modulated Continuous Wave Radar project) to determine the utility of high-resolution range\/range-rate radar technology for ballistic missile defense applications"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.302"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.302"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Partner with industry, universities and national laboratories through advanced technology initiatives to develop improvements, including:\n     --Nano-technology initiatives\n          ---Propellants\n          ---Batteries\n          ---Electronics\n          ---Multifunctional structures\n          ---Thermal management\n          ---Electro-optics\n     --Additive manufacturing technology initiatives for interceptor propulsion and structural components\n     --Space and sensor technology\n         ---Nanosat technology demonstrations\n         ---Radiation hardened mirror technology\n         ---Radiation hardened strained-layer superlattice focal plane arrays\n         ---BMDS nosecone test program to mature nosecone manufacturing technology to a high technology readiness level for implementation into the BMDS\n         ---4D carbon-carbon manufacturing process addressing obsolescence issue\n         ---Next generation seeker window development\n         ---Deep learning algorithms for missile discrimination\n     --Directed energy technology\n         ---High power optical fibers\n         ---Quick recovery high energy diodes\n         ---Ultra low size weight and power diode pump modules\n         ---Large stroke, high spatial bandwidth, deformable mirrors\n         ---Light weight, dampened optical benches\n         ---Optics and coatings for alkali environments\n    --Interceptor technology\n        ---Aerospace-grade Rayon technology development\n        ---Liquid bipropellant combustion models\n        ---Liquid propellant neutralization\n        ---Navigation algorithm technology development\n    --Future Ballistic Missile Defense System concept development\n        ---Advanced sensor algorithm initiative\n        ---Aerospace vehicle target, tracking, and discrimination\n        ---Radar interferometric processing for electro magnetic rail gun \n\n-Pursue on-going scientific and engineering university research initiatives and projects, including:\n  --Johns Hopkins University: Improvements in Thermal Battery Capabilities\n  --North Carolina State University\/Czech Tech University: Space Debris Exploration: Modeling and Fusion Algorithms\n  --Penn State University: Development of High Performance W-Based Alloys with Sub-Grained Microstructure by Field Assisted Sintering\n     Technology for Rocket Nozzles:\n  --Purdue University: Development and Characterization of Hypergolic Propellants\n  --Purdue University: Investigation of Root Causes of Combustion Instability \n  --Purdue University: Reliability Risk Management of Gold Contaminated Tin-Lead and Lead-Free Solder Joints in Military Electronics\n  --Texas A&M University: Propellant Formulations for Suppressing Combustion Instability in Solid Rocket Motors\n  --Texas A&M University: Hysteresis Engineering of Adaptive Materials for Electronic and Opto-Electric Devices\n  --University of Michigan: Narrow-Band Infrared Spectral Filtering via Silicon Sub-Wavelength Dielectric Gratings\n  --Washington State University: Reliability of Through Silicon Vias and Solder Microbumps in 3D Electronics for High Performance Defense\n     Applications\n\n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement, to include research in: \n  -- Radar Systems\n  -- Directed Energy Systems\n  -- Electro-Optical Infrared Sensor Systems\n  -- Computer Science, Signal, and Data Processing\n  -- Mechanical and Aerospace engineering\n  -- Decision Theory\n  -- Modeling & Simulation\n  -- Interceptor Technology\n  -- Sensor Technology\n\n-Continue an International Cooperative Agreement between the DoD and the Ministry of Defense of the Kingdom of Denmark concerning ballistic missile defense technology (Frequency Modulated Continuous Wave Radar project) to determine the utility of high-resolution range\/range-rate radar technology for ballistic missile defense applications"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603176C"
                                    },
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.853"
                                        },
                                        "CurrentYear": {
                                            "val": "17.880"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.996"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.996"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.741"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.048"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.319"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.361"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.981"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603178C"
                                    },
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "50.263"
                                        },
                                        "CurrentYear": {
                                            "val": "71.843"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.495"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.495"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603294C"
                                    },
                                    "Title": {
                                        "val": "Common Kill Vehicle Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "60.851"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "252.879"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "252.879"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "321.175"
                                        },
                                        "BudgetYearThree": {
                                            "val": "110.934"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy to conduct these technology development agreements consists of partnering with accredited domestic universities, small businesses, and nonprofit organizations. MDA awards competitive procurements via the MDA Science and Technology Advanced Research Broad Agency Announcement; the Advanced Technology Innovation Broad Agency Announcement; the Small Business Innovation Research program; and the Small Business Technology Transfer program."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.926"
                        },
                        "CurrentYear": {
                            "val": "0.833"
                        },
                        "BudgetYearOne": {
                            "val": "0.882"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.882"
                        },
                        "BudgetYearTwo": {
                            "val": "0.972"
                        },
                        "BudgetYearThree": {
                            "val": "0.975"
                        },
                        "BudgetYearFour": {
                            "val": "1.031"
                        },
                        "BudgetYearFive": {
                            "val": "1.042"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "PWS contains non-headquarters management costs in support of MDA functions and activities across the entire BMDS.  It Includes Government Civilians, and Contract Support Services.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes Global Deployment personnel and support performing deployment site preparation and activation and, provides facility capabilities for MDA Executing Agent locations.  Other MDA wide costs includes:  physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office, equipment, vehicle, and warehouse leases; utilities and base operations; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. PWS is allocated on a pro-rata basis and therefore, fluctuates by year based on the adjusted RDT&E profile (which excludes: 0305103C Cyber Security Initiative, 0603274C Special Programs, 0603913C Israeli Cooperative Program and 0901598C Management Headquarters)."
                        }
                    }
                }
            ]
        }
    }
}