{
    "id": "2018-Army-PB-2040-JBOOK-9aa9f1fe9c59f65bfc5dfa6d936fd388f1925b6896e4539f6df61c67f8924dcf-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA1-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601101A"
        },
        "ProgramElementTitle": {
            "val": "In-House Laboratory Independent Research"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "12.525"
            },
            "CurrentYear": {
                "val": "12.381"
            },
            "BudgetYearOne": {
                "val": "12.010"
            },
            "BudgetYearOneBase": {
                "val": "12.010"
            },
            "BudgetYearTwo": {
                "val": "11.594"
            },
            "BudgetYearThree": {
                "val": "11.788"
            },
            "BudgetYearFour": {
                "val": "12.024"
            },
            "BudgetYearFive": {
                "val": "12.271"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports basic research at the Army laboratories through the In-House Laboratory Independent Research (ILIR) program.  Basic research lays the foundation for future developmental efforts by identifying fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge.  The ILIR program serves as a catalyst for major technology breakthroughs by providing laboratory directors flexibility in implementing novel research ideas, by nurturing promising young scientists and engineers, and is used to attract and retain top doctoral degreed scientists and engineers.  The ILIR program also provides a source of competitive funds for peer reviewed efforts at Army laboratories to stimulate high quality, innovative research with significant opportunity for payoff to Army warfighting capability.  \n\nThis PE supports ILIR at the Army Materiel Command's (AMC) six Research, Development, and Engineering Centers (Project 91A); at the six United States (U.S.) Army Medical Research and Material Command Laboratories (Project 91C); the seven laboratories within the Corps Of Engineers' U.S. Army Engineer Research and Development Centers (Project 91D); and at the U.S. Space and Missile Defense Command (SMDC) Technical Center (Project F16).\n\nWork in the PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by AMC, the Medical Research Materiel Command (MRMC), the Engineer Research and Development Center (ERDC) (multiple sites); and the SMDC Technical Center (Huntsville,AL)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.018"
                },
                "CurrentYear": {
                    "val": "12.381"
                },
                "BudgetYearOne": {
                    "val": "11.971"
                },
                "BudgetYearOneBase": {
                    "val": "11.971"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.525"
                },
                "CurrentYear": {
                    "val": "12.381"
                },
                "BudgetYearOne": {
                    "val": "12.010"
                },
                "BudgetYearOneBase": {
                    "val": "12.010"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.493"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.039"
                },
                "BudgetYearOneBase": {
                    "val": "0.039"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.493"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.002"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.041"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.041"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "91A"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-AMC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.639"
                        },
                        "CurrentYear": {
                            "val": "11.457"
                        },
                        "BudgetYearOne": {
                            "val": "11.069"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.069"
                        },
                        "BudgetYearTwo": {
                            "val": "10.635"
                        },
                        "BudgetYearThree": {
                            "val": "10.809"
                        },
                        "BudgetYearFour": {
                            "val": "11.025"
                        },
                        "BudgetYearFive": {
                            "val": "11.251"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds basic research within the Army Materiel Command's (AMC) Research, Development, and Engineering Centers (RDECs) and lays the foundation for future developmental efforts by identifying the fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Edgewood Chemical and Biological Center, Aberdeen Proving Grounds, MD within AMC, the Armaments Research, Development, and Engineering Center, Picatinny, NJ, the Tank and Automotive Research, Development, and Engineering Center, Warren, MI, the Natick Soldier Research, Development, and Engineering Center, Natick, MA, the Aviation and Missile Research, Development, and Engineering Center, Huntsville, AL, and the Communications and Electronics Research, Development, and Engineering Center, Ft. Monmouth, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Edgewood Chemical Biological Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in chemistry, biology, biotechnology, and aerosol for countering improvised explosive devices (IEDs), obscurants, and\/or target defeat.  Work in this project provides theoretical underpinnings for Program Element (PE) 0602622A (Chemical, Smoke, and Equipment Defeating Technologies)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.979"
                                            },
                                            "Text": {
                                                "val": "Continued to further fundamental research to understand rational molecular and nano-system design, synthetic biology, nano-scale chemical and biological sensing and signaling, molecular toxicology, interfacial phenomena of particulate matter (solid\/liquid) with chemical surfaces, and synthesis of new materials for protection, decontamination, and detection, and research the mathematics involved in data processing and interpretation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Text": {
                                                "val": "Will further fundamental research to understand rational molecular synthesis and novel materials, synthetic biology, nano-scale chemical and biological sensing, molecular toxicology, aerosol sciences, interfacial phenomena of particulate matter (solid\/liquid) with chemical surfaces, and synthesis of new materials for protection, decontamination, and detection, and research the mathematics involved in data processing and interpretation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.056"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Text": {
                                                "val": "Will conduct fundamental research in synthetic biology focusing on understanding genetic drift, mutation rates, as well as the structure function relationships of proteins. Explorations into molecular toxicology will focus on developing the use of human and animal pluripotent stem cells to derive toxicological end points rather than using whole animal studies. Physical and mathematical investigations into aerosol particle behaviors will be used to help develop knowledge on their behavior during deposition into the atmosphere as well as in the respiratory tract."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armaments Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in weapons component development, explosives synthesis\/detection and area denial.  Work in this project provides theoretical underpinnings for PE 0602307A (Advanced Weapons Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.591"
                                            },
                                            "Text": {
                                                "val": "Continued further basic research in areas such as advanced materials and nanotechnologies, more powerful energetics including those with insensitive munitions properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.556"
                                            },
                                            "Text": {
                                                "val": "Will solicit new innovative research proposals to conduct fundamental research for developing technologies for lighter structural materials, nano-materials, area denial technologies, more powerful explosives, more lethal compact warheads, efficient thermal batteries and material coating technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.417"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.417"
                                            },
                                            "Text": {
                                                "val": "Will perform basic research in light-weight thermoplastic composites, compact and more lethal warheads, synthesis and characterization of more powerful and less sensitive explosives, area denial technologies, advanced structural materials and new materials for electronic sensing devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tank-Automotive Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in ground vehicle technologies to include power, mobility, and unmanned systems.  Work in this project provides theoretical underpinnings for PE 0602601A (Combat Vehicle and Automotive Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.396"
                                            },
                                            "Text": {
                                                "val": "Conducted research in off-road mobility and terramechanics, materials for shock wave mitigation, nano-lubricants, analytical framework for autonomy-enabled systems, combustion for military logistics fuels, and modeling of cognitive burdens. In-house research efforts address several Army-identified major research efforts for the future including materials science and multiscale modeling, intelligent\/autonomous systems, and human sciences."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.350"
                                            },
                                            "Text": {
                                                "val": "Will solicit on a yearly basis new and continuing efforts to further basic research in Army-centric areas such as development of analytical methodologies for autonomous and autonomy-enabled systems such as latency compensation, shared control, modeling of human cognition, proprioception and perception, next-generation battery systems, advanced combustion, off-road mobility\/terramechanics, materials and joining research as pertaining to lightweighting, armor materials\/mechanisms, Big Data analytics, newtork security for autonomous systems, aeroacoustics computational fluid dynamics, bio-inspired approaches to waste-water treatment, multi-functional additives for fuels\/lubricants, and pulse power applications to vehicle protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.306"
                                            },
                                            "Text": {
                                                "val": "Will conduct efforts to further basic research in areas of strategic importance to Army ground vehicles such as increased control\/mobility of autonomy enabled-systems involving latency compensation using innovative numerical techniques, teleoperation in high-speed, long distance scenarios, anticipatory dynamic Bayesian network for intelligent navigation, methods for detection of high velocity projectiles, real-time panorama generation in tele-immersive combat vehicle operations, deep incremental learning and trust algorithms, novel computationally-efficient numerical modeling of vehicle interactions with deformable terrain, diesel engine heat transfer model development, machine learning, quantum modeling and computation, etc."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Natick Soldier Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in food sciences, textiles, and lightweight materials with potential for individual protection. Work in this project provides theoretical underpinnings for PE 0601102A (Defense Research Sciences), Project H52 (Equipment for the Soldier)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.298"
                                            },
                                            "Text": {
                                                "val": "Created a new two-dimensional (2D) computational modeling approach to enhance understanding of interactions between fluids (e.g., airflow) and structural forces to provide a foundation for design of parachutes and fabric shelters; examined novel approaches to tailor textile surface chemistry and\/or integration of advanced materials to allow creation of surfaces exhibiting true multifunctionality."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.246"
                                            },
                                            "Text": {
                                                "val": "Assess newly modeled microrectenna arrays for their response to infrared (IR) illumination; assess efficiency and adaptability of these microrectenna arrays for application in IR detectors, communication, and energy harvesting applications; explore the incorporation of bioactive peptides for increased stability of thin films."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.150"
                                            },
                                            "Text": {
                                                "val": "Will explore the feasibility of creating a conductive fibrous platform through the integration of iridium oxide nanoparticles; characterize the structure and electrochemical properties of the iridium oxide nanoparticles and explore applicability to wearable sensing and power; design frequency selective surface antenna arrays tailored for chemical detection; explore discrimination of surface antenna arrays through numerical electromagnetic simulations that explore parameters such as individual antenna element shape\/dimensions, spacing between antenna elements, choice of metal, and spectral shifts produced by metal oxides."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Missile Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in guided missile and rocket systems, directed energy weapons, unmanned vehicles, and related components.  Work in this project provides theoretical underpinnings for PE 0602303A (Missile Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.507"
                                            },
                                            "Text": {
                                                "val": "Continued experimental test of analytic density matrix models in precision pump-probe spectroscopy; demonstrated chaotic dynamics in hybrid and non-smooth systems; pioneered innovative THz imaging techniques by combining state-of-the-art coherent imaging hardware and computational imaging methodologies; and developed novel high performance signal processing techniques for chaotic waveforms in radar and communications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.483"
                                            },
                                            "Text": {
                                                "val": "Will explore ultraviolet photocatalytic splitting of molecular bonds using plasmonic metal nanoparticles; investigate homomorphic encryption schemes (for tamper-proof signal processing); study new electromagnetic pulse propagation models that include nonlocal and quantum tunneling effects (to explore novel propagation phenomena and dramatically modify\/enhance linear and nonlinear interactions with artificial, metal-based plasmonic materials and semiconductors); pioneer polarization-sensitive terahertz holographic imaging (for mapping strain in opaque materials); explore use of chaotic waveforms (for transformative high resolution radar and tactical data communications); develop microwave hyperbolic metamaterials (for subwavelength antennas and resonators); and study theoretically and experimentally linear and nonlinear optical properties of graphene-based layered and textured nanostructures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.439"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.439"
                                            },
                                            "Text": {
                                                "val": "Will investigate chaotic dynamics in linear and piecewise linear systems; publish new paradigm in continuum electrodynamics by deriving self-consistent treatment that includes relativity and conservation of momentum and energy; conclude demonstration of proof-of-concept ultraviolet photocatalytic splitting of molecular bonds using plasmonic metal nanoparticles; complete work on polarization-sensitive terahertz holographic imaging (for mapping strain in opaque materials); and explore efficient opto-electro-plasmonic devices through electromagnetic interactions at artificial surfaces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Aviation Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for aviation enabling technologies in the areas of aerodynamics, structural dynamics, and material science.  Work in this project provides theoretical underpinnings for PE 0602211A (Aviation Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.493"
                                            },
                                            "Text": {
                                                "val": "Explored novel approaches to increase flow control authority for rotating wing applications using plasma; developed experimental techniques to better measure and understand flow structures in the wake of multi-rotor configurations and their performance in hover; and explored novel control allocation strategies to optimize pilot work load for future vertical lift configurations with redundant controls."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.453"
                                            },
                                            "Text": {
                                                "val": "Will combine visualization and measurements of the flow features in the wake of a wing interacting with a passing vortex (to better understand the structure and evolution of the trailing wake, and its relation to the lift distribution on the generating wing); apply novel fluidic actuators for adverse force reduction; and develop novel computational algorithms to dramatically speed up computations on newly emerging exascale computer architectures using techniques such as parallelization in both time and space."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.411"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.411"
                                            },
                                            "Text": {
                                                "val": "Will conduct interactional aerodynamics investigations of the wake physics and inflow dynamics of multiple rotor configurations; will explorer improved design of fluidic control actuators through boundary layer flow control studies; will extend higher order unstructured grid solvers that leverage emerging exascale computer architecture to flow over complex geometries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications-Electronics Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for communication and network enabling technologies in the areas of antenna design, network management, power generation and storage, and sensors.  Work in this project provides theoretical underpinnings for PE 0602705A (Electronics and Electronic Devices)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.375"
                                            },
                                            "Text": {
                                                "val": "Conducted research in data flow analysis as a supplemental theory for use in Satisfiability Modulo Theory (SMT) solvers to improve vulnerability detection by utilizing data-flow graphs coupled with SMT solvers; investigated an analytic method to calculate the probability and efficiency of message transmission via dynamic opportunistic devices across an undefined and uncooperative network; researched the ability to perform signal processing by manipulating modes within a multi-mode optical fiber by utilizing the statistics of transmission properties and techniques for spatial division multiplexing to perform single and multi signal filtering within the optical fiber; investigated the performance of infrared detectors by researching high quantum efficiency Gallium-free long wave infrared nBn detectors grown on an aluminum antimonide (AlSb) lattice; researched liquid phase heat transfer as a function of flow instability and vorticity intensity in microchannels with microcylinders with tip clearances to determine the optimum micro cylinder design in microchannels in three dimensional (3D) stacked circuit architectures for electro-optics, radar, electronic warfare, communication and intelligence systems; investigated the fundamental electrochemical properties of applied composite solid electrolyte interface for lithium and divalent electrochemical cells; and investigated game theory based machine learning techniques to determine the feasibility of coordinating electronic warfare and tactical communications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.336"
                                            },
                                            "Text": {
                                                "val": "Will conduct research focusing on the mathematical foundations of a pre-processing technique to facilitate fully homomorphic cryptosystems; research designs of packaging material used in solid state and bipolar batteries; investigate novel architectures that utilize photonic detection and beam forming concepts in the design of a highly capable beam-former\/receiver (to alleviate the processing burden by exploring analog preprocessing and filtering techniques prior to digitization); create integratable thin film material heterostructures and explore novel process science techniques to enable high performance tunable filters for the next generation radar, electronic warfare and communications systems; research candidate target contrast metrics to improve parameters used in human vision model for high-contrast, low-contrast, and low-observable targets and investigate the psychophysics of noise in the Human Visual System (HVS) information processing chain by controlling “where” visual fusion takes place (e.g., temporal, left-right eye, or cognitive) to provide insight to how humans process fused image information and how the HVS filters information and noise; and research a planarization technique for infrared materials that yields a nearly flat surface with undamaged active layers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.290"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.290"
                                            },
                                            "Text": {
                                                "val": "Will conduct research on the intrinsic efficiencies of non-foster matching methods at radio frequencies with a focus on full stability analysis; splitting of radio network traffic over multipath to maximize throughput performance for traffic flows by using new fluid-flow models to support dynamic topology; research 3D printing of tunable coils and matching networks with precisely controlled impedance and resonant frequencies resulting in tunable structures that can be activated in a controlled manner to change the shape or configuration of the solid in response to an external stimulus; determine the most effective information visualization methods and\/or perspectives for commander understanding of the cyber domain and its relationship to mission command in the physical domain; research high performance, rechargeable, safe Lithium Sulphur (LiS) battery chemistry; experimentally confirm the performance of synthesized catalysts that can promote the production of synthesis gas (carbon monoxide (CO) and hydrogen (H2)) from carbon dioxide and hydrogen with high CO selectivity and high yield; research novel optical properties of retro-reflections, with an emphasis on polarization, to characterize and discriminate between different objects; research active and passive longwave infrared (LWIR) detection with a long term goal of produce focal plane arrays capable of passive longwave and active 3D imaging; research novel molecular beam epitaxy growth techniques that mitigate antimony (Sb) cross incorporation in Gallium-free superlattice detectors; research novel characterization techniques, investigate the inherent materials issues, and associated processes that limit the performance of LWIR focal plane arrays with diffraction-limited pixel-pitch."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F16"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-SMDC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.886"
                        },
                        "CurrentYear": {
                            "val": "0.924"
                        },
                        "BudgetYearOne": {
                            "val": "0.941"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.941"
                        },
                        "BudgetYearTwo": {
                            "val": "0.959"
                        },
                        "BudgetYearThree": {
                            "val": "0.979"
                        },
                        "BudgetYearFour": {
                            "val": "0.999"
                        },
                        "BudgetYearFive": {
                            "val": "1.020"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides In-house Laboratory Independent Research (ILIR) at the United States (U.S.) Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT), Technical Center.  This basic research on lasers and directed energy lays the foundation for future developmental efforts on high energy lasers and directed energy systems by identifying the fundamental principles governing various directed energy phenomena.  \n\nWork in this project is related to, and fully coordinated with, efforts in Program Element (PE) 0602307A (Advanced Weapons Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the USASMDC\/ARSTRAT, Technical Center, Huntsville, AL"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SMDC In-house Laboratory Independent Research"
                                    },
                                    "Description": {
                                        "val": "Funds basic research to investigate laser propagation phenomenology for application in modeling and simulation and future directed energy weapons design.  Activities in this proproject transition to High Energy Laser Technology in PE 0602307A (Advanced Weapons Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.886"
                                            },
                                            "Text": {
                                                "val": "Completed inductive radio frequency (RF) line widths, absorption, plasma control, and lifetimes investigations for an efficient Xenon laser; developed a Xenon high power laser scaling model; and completed comparison of different RF pumping mechanisms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.924"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to measure quenching of electron energy states of various buffer gas concentrations; investigate potential high power laser designs that use only efficient diode lasers without an additional laser gain media; and conduct experiments to measure effects of different innovative adaptive optics techniques for laser propagation in the presence of particulates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.941"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.941"
                                            },
                                            "Text": {
                                                "val": "Complete experiments to verify the feasibility of a diode pumped Xenon gas laser; conduct an experiment of a direct diode concept to measure efficiency and beam quality and see how the results compare to traditional solid state lasers; and complete analysis of the beaconless adaptive optics approach for correcting a laser beam for  propagation in the presence of particulates."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}