{
    "id": "2018-Army-PB-2040-JBOOK-3e91339aa28ec2881f9549044dc8a7daf4e287c1ca461095f2d8b42bf2f292b8-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603305A"
        },
        "ProgramElementTitle": {
            "val": "Army Missle Defense Systems Integration"
        },
        "R1LineNumber": {
            "val": "53"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "29.270"
            },
            "CurrentYear": {
                "val": "9.433"
            },
            "BudgetYearOne": {
                "val": "9.634"
            },
            "BudgetYearOneBase": {
                "val": "9.634"
            },
            "BudgetYearTwo": {
                "val": "11.046"
            },
            "BudgetYearThree": {
                "val": "12.301"
            },
            "BudgetYearFour": {
                "val": "12.400"
            },
            "BudgetYearFive": {
                "val": "12.925"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element funds missile defense systems integration efforts for both the US Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT).\n\nUSASMDC\/ARSTRAT:  Headquarters, Department of the Army General Order 37, dated 16 October 2006, designated USASMDC\/ARSTRAT as the Army proponent for space and ground-based midcourse defense (GMD), the Army integrator for global missile defense, and the Army Service Component Command (ASCC) of the U.S. Strategic Command (USSTRATCOM).  Army Regulation (AR) 10-87 Army Commands, Army Service Component Commands, and Direct Reporting Units, dated 4 September 2007 and AR 5-22 The Army Force Modernization Proponent System dated 19 August 2009 designates USASMDC\/ARSTRAT as the Army specified proponent for Global Missile Defense and Space\/High Altitude capabilities.  As the Army proponent for space, high altitude and GMD, USASMDC\/ARSTRAT is responsible for developing warfighting concepts, conduct warfighting experiments to validate those concepts, identify capabilities needed to implement the validated concepts, and develop Doctrine, Organizations, Training, Material, Leadership & Education, Personnel, Facilities and Policy (DOTMLPF-P) solutions to realize the GMD capabilities.  As the Army integrator for global missile defense, USASMDC\/ARSTRAT is responsible for reviewing programs managed by the Army, other Services, Defense agencies and National agencies to ensure that they are correctly synchronized and will ultimately provide the capabilities required by USSTRATCOM to execute its global missile defense responsibilities. \n\nProject TR5 funds United States Army Space and Missile Defense Command\/ Army Strategic Command (USASMDC\/ARSTRAT) efforts to develop the associated operational prototyping, experimentation, operational analysis, and modeling and simulation in support of current and future Forces."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "29.347"
                },
                "CurrentYear": {
                    "val": "9.433"
                },
                "BudgetYearOne": {
                    "val": "9.491"
                },
                "BudgetYearOneBase": {
                    "val": "9.491"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "29.270"
                },
                "CurrentYear": {
                    "val": "9.433"
                },
                "BudgetYearOne": {
                    "val": "9.634"
                },
                "BudgetYearOneBase": {
                    "val": "9.634"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.077"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.143"
                },
                "BudgetYearOneBase": {
                    "val": "0.143"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.077"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.143"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.143"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TR5"
                    },
                    "ProjectTitle": {
                        "val": "Missile Defense Battlelab"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.270"
                        },
                        "CurrentYear": {
                            "val": "9.433"
                        },
                        "BudgetYearOne": {
                            "val": "9.634"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.634"
                        },
                        "BudgetYearTwo": {
                            "val": "11.046"
                        },
                        "BudgetYearThree": {
                            "val": "12.301"
                        },
                        "BudgetYearFour": {
                            "val": "12.400"
                        },
                        "BudgetYearFive": {
                            "val": "12.925"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element funds missile defense systems integration efforts for both the US Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT).\n\nUSASMDC\/ARSTRAT:  Headquarters, Department of the Army General Order 37, dated 16 October 2006, designated USASMDC\/ARSTRAT as the Army proponent for space and ground-based midcourse defense (GMD), the Army integrator for global missile defense, and the Army Service Component Command (ASCC) of the U.S. Strategic Command (USSTRATCOM).  Army Regulation (AR) 10-87 Army Commands, Army Service Component Commands, and Direct Reporting Units, dated 4 September 2007 and AR 5-22 The Army Force Modernization Proponent System dated 19 August 2009 designates USASMDC\/ARSTRAT as the Army specified proponent for Global Missile Defense and Space\/High Altitude capabilities.  As the Army proponent for space, high altitude and GMD, USASMDC\/ARSTRAT is responsible for developing warfighting concepts, conduct warfighting experiments to validate those concepts, identify capabilities needed to implement the validated concepts, and develop Doctrine, Organizations, Training, Material, Leadership & Education, Personnel, Facilities and Policy (DOTMLPF-P) solutions to realize the GMD capabilities.  As the Army integrator for global missile defense, USASMDC\/ARSTRAT is responsible for reviewing programs managed by the Army, other Services, Defense agencies and National agencies to ensure that they are correctly synchronized and will ultimately provide the capabilities required by USSTRATCOM to execute its global missile defense responsibilities. \n\nProject TR5 funds United States Army Space and Missile Defense Command\/ Army Strategic Command (USASMDC\/ARSTRAT) efforts to develop the associated operational prototyping, experimentation, operational analysis, and modeling and simulation in support of current and future Forces."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Thermal Management Systems Prototypes"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "19.000"
                                        },
                                        "Text": {
                                            "val": "Continuous thermal loads:  Environmental Control Units (ECU) operating at two thousand BTUs were built and are currently being tested to address addressing enhanced packaging, reliability and certification.  These units have been integrated into a Patriot shelter in the GSIL testbed, an AM\/MSQ shelter IAMD TOC at SED, and at the test chamber at Rocky Research.  Additional ECU types at higher power capability & generator package have been designed and manufactured to address larger system needs.  These units are to designed to have  15% - 20% improved energy efficiency, reduced weight and operate at 12\/24\/48\/600 Volt-DC; 110, 220, 460 Volt AC at world-wide available frequencies of 50 Hz, 60 Hz or 400 Hz for compatibility.  A prototype of second generation fuel fired 100KW burst cooling for high energy lasers has been designed and tested."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Prototypes"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.160"
                                            },
                                            "Text": {
                                                "val": "Take the lessons learned from the FY15 efforts to continue to evaluate new technologies in realistic operating environments.  This is accomplished by participating in and providing support to Unified Quest wargames and experiments to analyze and integrate technology to identify the feasibility integration into Army space, missile defense, and high altitude systems. The Space and Missile Defense Command will participate and support biennial rewrites of Army Capstone, Operational and Functional Concepts. Continue to provide operational manager support to STRATCOM, NORTHCOM and SOCOM Joint Technical Capability Demonstrations to ensure Army space, missile defense, and high altitude equities are represented in advanced technology developments by demonstrating military utility when applied to military equipment and techniques. Examples include: supporting multi service experiments and capability development of the national-directed Phased Adaptive Approach (PAA) for Ballistic Missile Defense (BMD) as it is applied to each of the regional COCOMs; and experimenting with operationally responsive space, space control, and high altitude capabilities to ensure the broader Army enterprises can leverage the advantages of these platforms for communications, Intelligence Surveillance and Reconnaissance (ISR), position navigation, missile warning and command and control. Continue to develop mitigation strategies for Army forces to operate effectively in contested space, missile defense and cyber environments. Developing effective Integrated Missile Defense concepts for Army support to the Phased Adaptive Approach (PAA) being implemented within each regional COCOM. Will support TRADOC proponents with their responsibilities relative to doctrine, organization, training, material, leader development and education, personnel, and facilities (DOTMLPF) plus related matters to continue leveraging space, missile defense, and high altitude proponent input to Joint Capabilities Integration and Development System, Science and Technology, Concept Development, Capability Development for Rapid Transition, and Capability Gap Analysis Army We will sustain our core prototyping platforms, as outlined above.   Provided DOTMLPF integration for the Ground Based Midcourse Defense mission to NORTHCOM by coordinating support to the 100th MD Brigade and to the five Forward Based Mode Radar Sites deployed around the world to ensure the forces are capable of performing missions as directed by the combatant commanders.  Develop\/defend Army requirements development \/ documentation to MDA spiral\/block development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.635"
                                            },
                                            "Text": {
                                                "val": "Take the lessons learned from the FY16 efforts to continue to evaluate new technologies in realistic operating environments.  This is accomplished by participating in and providing support to Unified Quest wargames and experiments to analyze and integrate technology to identify the feasibility integration into Army space, missile defense, and high altitude systems.  The Space and Missile Defense Command will participate and support biennial rewrites of Army Capstone, Operational and Functional Concepts.  Continue to provide operational manager support to STRATCOM, NORTHCOM and SOCOM Joint Technical Capability Demonstrations to ensure Army space, missile defense, and high altitude equities are represented in advanced technology developments by demonstrating military utility when applied to military equipment and techniques.  Examples include: supporting multi service experiments and capability development of the national-directed Phased Adaptive Approach (PAA) for Ballistic Missile Defense (BMD) as it is applied to each of the regional COCOMs; and experimenting with operationally responsive space, space control, and high altitude capabilities to ensure the broader Army enterprises can leverage the advantages of these platforms for communications, Intelligence Surveillance and Reconnaissance (ISR), position navigation, missile warning and command and control.  Continue to develop mitigation strategies for Army forces to operate effectively in contested space, missile defense and cyber environments.  Developing effective Integrated Missile Defense concepts for Army support to the Phased Adaptive Approach (PAA) being implemented within each regional COCOM. Will support TRADOC proponents with their responsibilities relative to doctrine, organization, training, material, leader development and education, personnel, and facilities plus related matters to continue leveraging space, missile defense, and high altitude proponent input to Joint Capabilities Integration and Development System, Science and Technology, Concept Development, Capability Development for Rapid Transition, and Capability Gap Analysis Army  We will sustain our core prototyping platforms, as outlined above.  Battlespace Command and Control Center (BC3) will be upgraded to more realistically address information flows related to Close Air Support.  Support MDA to Army BMDS element transition and transfer efforts including BMDS sensor deployments.  Develop\/defend Army requirements development \/ documentation to MDA spiral\/block development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.776"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.776"
                                            },
                                            "Text": {
                                                "val": "\"Take the lessons learned from the FY16 efforts to continue to evaluate new technologies in realistic operating environments.  This is accomplished by participating in and providing support to Unified Quest wargames and experiments to analyze and integrate technology to identify the feasibility integration into Army space, missile defense, and high altitude systems. The Space and Missile Defense Command will participate and support biennial rewrites of Army Capstone, Operational and Functional Concepts. Continue to provide operational manager support to STRATCOM, NORTHCOM and SOCOM Joint Technical Capability Demonstrations to ensure Army space, missile defense, and high altitude equities are represented in advanced technology developments by demonstrating military utility when applied to military equipment and techniques. Examples include: supporting multi service experiments and capability development of the national-directed Phased Adaptive Approach (PAA) for Ballistic Missile Defense (BMD) as it is applied to each of the regional COCOMs; Developing effective Integrated Missile Defense concepts for Army support to the Phased Adaptive Approach (PAA) being implemented within each regional COCOM.  A focus area will be informing the Missile Defeat Integrated Capability Development Working Group with experimentation on improving the timeliness and effectiveness of counter ballistic missile time sensitive targeting. Another project is developing and implementing a training environment for cyber defenders to train on defense of the GMD fire control networks through innovative scenario based training environments.  Will support TRADOC proponents with their responsibilities relative to doctrine, organization, training, material, leader development and education, personnel, and facilities plus related matters to continue leveraging space, missile defense, and high altitude proponent input to Joint Capabilities Integration and Development System, Science and Technology, Concept Development, Capability Development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis, and Models and Simulations (M&S)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.110"
                                            },
                                            "Text": {
                                                "val": "Take the lessons learned from the FY15 efforts to continue to evaluate new technologies in realistic operating environments.  This will be accomplished by supporting ongoing efforts that provide the most realistic operating environment available to perform technology gap and cost reduction analysis of space, missile defense, and high altitude systems.  Realistic operating environments will be available to determine the ability of the specific technologies to fill capability gaps in terms of utility to the warfighter.  Support of technology demonstrations, Analysis and Demonstration Tools\/Test Beds for evolving space superiority and operationally responsive space concepts will address emerging needs and continue to be expanded to ensure that advanced technology development can adequately enhance space, missile defense and high altitude systems. The Future War Center (FWC) will continue to provide program management for maintenance, sustainment, and development for Extended Air Defense Simulation (EADSIM) delivering the required high fidelity synthetic operating environment to provide the capability to perform system and cost benefit analysis, operational planning, and exercise\/ experimentation support.  The FWC will continue to provide program management for maintenance, sustainment, and development for Reconfigurable Tactical Operations Simulator (RTOS) delivering operator in the loop capability for air and missile defense simulation in distributed exercises and experiments.  Worked closely with the document integrators (DI) at United States Army Force Management Support Agency (USAFMSA) to document the 100th and 49th GMD Brigade and Battalion TOEs to ensure the accuracy of the documentation of the associated Force Design Updates. The DI to review the TOEs that were developed and captured the personnel and equipment changes as directed by the approved FDU's.  This FDU confirmed the requirement for a non-standardized motor maintenance section, created additional operations officers within the GMD Brigade, and created a GMD master gunner\/operations NCO to provide oversight of GMD qualification\/certification within the Brigade S3.  Equipment shortfalls and gaps that were identified were validated as new requirements.  An ambulance was added to medical section to provide an organic medevac capability and the maintenance section received a much needed capability to self-recover their own vehicles and transport them to maintenance facilities over 350 miles away.  Proper documentation of the TOE will allow this homeland defense unit to maintain their supremacy over the threat forces they keep at bay.  By closely working with USAFMSA during the development of the TOEs, this ensured that the TOEs documented the results of the FDU accurately.    Proper documentation of the FDUs ensures the 100th MD BDE and 49th MD BN will execute their mission of preventing the use of weapons of mass destruction, reduce hazards to friendly forces, and civilian populations. Secured the approval of both FDU Jr's for the 100th and 49th Missile Defense Brigade and Battalion at HQDA. With the lapse in HQDA organizational integrators (OI), these FDU Jr's were in hold status until a replacement OI was assigned.  This caused a potential risk that the force structure changes would not be approved and have to be applied outside the original FY.  Within weeks of the new OI being assigned, I briefed the OI on the FDU Jrs, the reason for the FDU Jr's and capability gaps the FDUs were correcting, both personnel and equipment shortfalls.  This interaction with the OI allowed him to present these two FDU Jr's in an expeditious manner to the Army Staff at the 1-Star level.  The FDU Jr's were approved by HQDA, and in time to have the TOE and MTOEs created that met the original time lines required to affect these changes in FY 17, thus saving pending force structure reductions from occurring.  The changes to force structure and equipment capability gaps were resolved. Proper documentation of the FDUs ensures the 100th MD BDE and 49th MD BN will execute their mission of preventing the use of weapons of mass destruction, reduce hazards to friendly forces, and civilian populations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.798"
                                            },
                                            "Text": {
                                                "val": "Force Design Assessment of Army Forces TAA 20-24 (APR 2016-MAR 2017) will introduce missile defense capabilities into the force.  In order to bring those capabilities into the force development of new force design updates (FDUs) for FDU cycles 16-1, 16-2, 17-1 will be required.  Additionally during the TAA cycle new Rules of Allocation (ROA) will be developed to ensure missile defense units are properly accounted for in the future. Take the lessons learned from the FY16 efforts to continue to evaluate new technologies in realistic operating environments.  This will be accomplished by supporting ongoing efforts that provide the most realistic operating environment available to perform technology gap and cost reduction analysis of space, missile defense, and high altitude systems.  Realistic operating environments will be available to determine the ability of the specific technologies to fill capability gaps in terms of utility to the warfighter.  Support of technology demonstrations, Analysis and Demonstration Tools\/Test Beds for evolving space superiority, high altitude and operationally responsive space concepts will address emerging needs and continue to be expanded to ensure that advanced technology development can adequately enhance missile defense capabilities. The Future War Center (FWC) will continue to provide program management for maintenance, sustainment, and development for Extended Air Defense Simulation (EADSIM) delivering the required high fidelity synthetic operating environment to provide the capability to perform system and cost benefit analysis, operational planning, and exercise\/ experimentation support.  The FWC will continue to provide program management for maintenance, sustainment, and development for Reconfigurable Tactical Operations Simulator (RTOS) delivering operator in the loop capability for air and missile defense simulation in distributed exercises and experiments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.858"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.858"
                                            },
                                            "Text": {
                                                "val": "\"Support TAA 20-24 Resourcing Phase TAA is a phased force structure analysis process that defines the required Army force structure within end strength and accounts for the military and DA Civilian requirements and authorizations necessary to comply with DOD guidance. The TAA provides the basis for the Army’s POM development and establishment of the POM Force.  Resourcing and Approval, the determination must be made as to the level of acceptable risk to be taken for each capability. These capability demands are based on Army leadership directives, written guidance, risk analysis, the Army force generation approach and input from the Combatant Commander’s Daily Operational Requirements (CCDOR). TAA builds a POM Force with which the PEGs can develop their portion of the Army’s budget. The POM Force will also determine the OF enabler support force structure and define the Generating Force (GF) necessary to support and sustain the OF capabilities directed in strategic guidance. The determination\nof the composition of the Army force structure, or shape, is an iterative, risk-benefit, trade-off analysis process. Capability Demand Analysis is made up of two separate events: force guidance and quantitative analysis.\n\nParticpate in the Army's FDU process The FDU Includes capabilities development, capabilities determination, requirements approval, and implementation decisions.  Develops organizational design solutions to overcome identified capability shortfalls that cannot be accommodated by doctrine, training, leadership and education, facility, or policy solutions. As part of the solution development, TRADOC CoEs force modernization proponents and non-TRADOC force management proponents consider courses of action across DOTMLPF-P with the intent of deriving materiel, personnel and organizational solutions as a last resort. Once an organizatio nal solution becomes the recommendation, the force modernization proponent begins the integration process across the DOTMLPF-P domains.\n\nTake the lessons learned from the FY17 efforts to continue to evaluate new technologies in realistic operating environments.  This will be accomplished by supporting ongoing efforts that provide the most realistic operating environment available to perform technology gap and cost reduction analysis of space, missile defense, and high altitude systems.  Realistic operating environments will be available to determine the ability of the specific technologies to fill capability gaps in terms of utility to the warfighter.  Support of technology demonstrations, Analysis and Demonstration Tools\/Test Beds for evolving space superiority, high altitude and operationally responsive space concepts will address emerging needs and continue to be expanded to ensure that advanced technology development can adequately enhance missile defense capabilities. The Future War Center (FWC) will continue to provide program management for maintenance, sustainment, and development for Extended Air Defense Simulation (EADSIM) delivering the required high fidelity synthetic operating environment to provide the capability to perform system and cost benefit analysis, operational planning, and exercise\/ experimentation support.  The FWC will continue to provide program management for maintenance, sustainment, and development for Reconfigurable Tactical Operations Simulator (RTOS) delivering operator in the loop capability for air and missile defense simulation in distributed exercises and experiments.\""
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}