{
    "id": "2018-AirForce-PB-3600-JBOOK-857e7c42b5cd67f362a388822cdc6c6374be2f224d8defe4fb4e7b5bd4bdcb7c-11",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602605F"
        },
        "ProgramElementTitle": {
            "val": "Directed Energy Technology"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "122.835"
            },
            "CurrentYear": {
                "val": "127.163"
            },
            "BudgetYearOne": {
                "val": "132.993"
            },
            "BudgetYearOneBase": {
                "val": "132.993"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "128.039"
            },
            "BudgetYearThree": {
                "val": "125.076"
            },
            "BudgetYearFour": {
                "val": "126.207"
            },
            "BudgetYearFive": {
                "val": "128.448"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program covers research in directed energy (DE) technologies, primarily high energy lasers (HELs); including devices, optical beam control and integration; and high power electromagnetics (HPEM).  Laser research includes moderate to high power laser devices that are applicable to a wide range of Air Force applications, optical technologies to propagate laser beams from a device, and integration of these technologies.  In HPEM, this research examines technologies for applications such as counter-electronics and non-lethal weapons.  Research into other novel DE applications will be conducted.  DE vulnerability\/lethality assessments are conducted and protection technologies are developed.  Research into other advanced non-conventional\/innovative weapons will be conducted.  Tools are developed and used to compare solutions and to determine the most effective and efficient DE technologies to meet Air Force needs.  This program also performs ground-based optical research for space situational awareness (SSA).  In SSA, this research uses the Starfire Optical Range and the Maui Space Surveillance System to develop and implement technologies to identify visual characteristics such as status and health of orbiting space objects.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nIn FY 2018, a portion of HQ AFRL S&T civilian manpower in PE 0602605F, Directed Energy Technology, was transferred to PE 0602298F, Science and Technology Management - Major Headquarters Activities, to provide increased transparency to Congress on personnel in Major Headquarters Activities (MHA). \n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "115.105"
                },
                "CurrentYear": {
                    "val": "127.163"
                },
                "BudgetYearOne": {
                    "val": "120.059"
                },
                "BudgetYearOneBase": {
                    "val": "120.059"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "122.835"
                },
                "CurrentYear": {
                    "val": "127.163"
                },
                "BudgetYearOne": {
                    "val": "132.993"
                },
                "BudgetYearOneBase": {
                    "val": "132.993"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.730"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "12.934"
                },
                "BudgetYearOneBase": {
                    "val": "12.934"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "9.997"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.267"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "12.934"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.934"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2016 reflects reprogramming for Air Dominance activities and to support Research and Development Projects, 10 U.S.C. Section 2358.\n\nIncrease in FY 2018 due to realignment of funds for Laser Weapon System priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624866"
                    },
                    "ProjectTitle": {
                        "val": "Lasers & Imaging Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "83.718"
                        },
                        "CurrentYear": {
                            "val": "92.445"
                        },
                        "BudgetYearOne": {
                            "val": "99.946"
                        },
                        "BudgetYearOneBase": {
                            "val": "99.946"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "94.480"
                        },
                        "BudgetYearThree": {
                            "val": "90.704"
                        },
                        "BudgetYearFour": {
                            "val": "90.559"
                        },
                        "BudgetYearFive": {
                            "val": "90.876"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the technical feasibility of moderate to high power lasers, including beam control, for applications such as aircraft protection, force protection, and precision engagement from Air Force platforms.  This project investigates the effects of laser weapons on a wide range of systems and components as well as producing, modifying, validating and applying DE and non-DE concept development and assessment tools to determine which technology solutions to pursue.  Research supporting ground-based optical space situational awareness is conducted."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technologies and Directed Energy Assessments"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate HEL device technologies for Air Force applications.  Develop and demonstrate optical laser beam control technologies including atmospheric compensation and pointing and tracking.  Perform laser system level modeling and simulation validated by laser effects and vulnerability testing.  Develop tools and perform assessments which allow comparisons among DE concepts and tradeoffs between DE and non-DE solutions.  Integrate optical beam control technologies with laser device technologies and demonstrate the combined technologies.  Develop and use technologies to better understand the vulnerability of weapon systems to lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "55.635"
                                            },
                                            "Text": {
                                                "val": "Continued beam control and monolithic fiber amplifier integration and ground tests. Continued conducting effects testing to establish system requirements and validate modeling efforts. Performed airborne tests of turret beam control technologies. Began integration of beam control and low power laser technologies for aircraft self-protection.  Completed Integrated Weapons Environment for Analysis (IWEA) Build 1 and continued to conduct assessments of concepts for laser weapon systems to help users plan weapon investments.  Continued to model and characterize foreign HEL threats to blue systems and provide assessments to developers for hardening materials and designs. Completed research supporting the joint Air Force\/ DARPA ground HEL demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "65.056"
                                            },
                                            "Text": {
                                                "val": "Continue with beam control and scaling of monolithic fiber amplifier scaling using advanced fibers. Continue with the development of beam control aero-effects mitigating techniques. Continue with the conduct of effects tests to establish system requirements and validity models. Continue integration of beam control and low power laser system for future pod-mounted moderate power laser demonstration. Transition IWEA Build 1 to external users and complete IWEA Build 2. Conduct assessments of  DE and\/or synergistic DE\/Kinetic Energy (KE) weapon capabilities to help users plan weapon investments. Continue to model and characterize foreign HEL threats and provide information to develop mitigation techniques to protect blue assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "66.657"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "66.657"
                                            },
                                            "Text": {
                                                "val": "Continue with beam control and scaling of monolithic fiber amplifier scaling using advanced fibers. Continue with the development of beam control aero-effects mitigating techniques. Continue with the conduct of effects tests to establish system requirements and validity models. Continue integration of beam control and low power laser system for future pod-mounted moderate power laser demonstration. Transition IWEA Build 2 to external users and complete IWEA transition into an advanced framework to support Air Force Research Laboratory (AFRL)-wide Modeling, Simulation & Analysis (MS&A) environment. Conduct assessments of DE and\/or synergistic DE\/KE weapon capabilities to help users plan weapon investments. Continue to model and characterize foreign HEL threats, and provide information to develop mitigation techniques to protect blue assets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Space Situational Awareness and Satellite Vulnerability"
                                    },
                                    "Description": {
                                        "val": "Develop advanced, long-range, electro-optical technologies that support ground-based optical SSA.  Develop and use technologies to better understand the vulnerability of blue satellite systems to lasers.  Operate the Starfire Optical Range in support of internal and customer requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.083"
                                            },
                                            "Text": {
                                                "val": "Began integration of geosynchronous satellite characterization and local-space search as components of a dynamic telescope demonstration to keep track of potential threat objects in space. Initiated comparison of capabilities for extending telescope operation into daylight hours to provide Air Force Space Command programs with technology options for their requested products. Demonstrated techniques for persistent monitoring of space events and capability to detect threat objects in close proximity to our high-value satellite assets, including those in geosynchronous orbits."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.389"
                                            },
                                            "Text": {
                                                "val": "Complete integration of geosynchronous satellite characterization and local-space search for bright objects as components of a dynamic telescope demonstration to keep track of potential threat objects in space. Investigate daylight detection of geosynchronous satellites to address the long-duration gaps during daytime hours when satellites cannot normally be detected by our optical systems.  Explore techniques to detect smaller objects and characterize their relative orbits around our assets. Investigate through modeling and simulation the susceptibility of satellite optical systems to laser threats to support course of action decision-making for protection and design improvements for resilience."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.289"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.289"
                                            },
                                            "Text": {
                                                "val": "Complete integration of geosynchronous satellite characterization and local-space search for dim objects as a component of a dynamic telescope demonstration to keep track of potential threat objects in space. Mature daylight detection of geosynchronous satellites to allow custody through the long-duration gaps during daytime hours when satellites cannot normally be detected by our ground-based optical systems. Mature 24\/7 real-time optical imaging of near-earth satellites to allow characterization on tactical timelines. Investigate through modeling and simulation the susceptibility of satellite optical systems to laser threats to support course of action decision-making for protection and design improvements for resilience."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624867"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Weapons & Survivability Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.117"
                        },
                        "CurrentYear": {
                            "val": "34.718"
                        },
                        "BudgetYearOne": {
                            "val": "33.047"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.047"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "33.559"
                        },
                        "BudgetYearThree": {
                            "val": "34.372"
                        },
                        "BudgetYearFour": {
                            "val": "35.648"
                        },
                        "BudgetYearFive": {
                            "val": "37.572"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the use of HPEM and other unconventional\/innovative weapon concepts to support applications such as nonlethal counter-personnel and electronic warfare including disruption, degradation, and damage of electronic infrastructure on Air Force platforms.  This research includes weapon technology that can provide covert effects and\/or no collateral or human damage.  The project also investigates the effects of potential adversary HPEM weapons and how to mitigate those effects on US assets, as well as producing and applying DE and non-DE concept development and assessment tools to determine which technology solutions to pursue.  HPEM includes but is not limited to high power microwaves, plasmas, particle beams and millimeter waves."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HPEM and Unconventional  Weapon Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate technologies for HPEM components.  Investigate HPEM and other unconventional weapon concepts using innovative technologies.  Investigate advanced technologies that support force protection tactical applications, including non-lethal counter-personnel applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.038"
                                            },
                                            "Text": {
                                                "val": "Refined initial ultra-short pulsed laser atmospheric propagation studies. Conducted effects studies on electronics based on the assessments from FY15. Continued work on compact 50 kilovolt solid state switch. Completed preliminary designs for 100 megavolt test facility accelerator. Began design of smaller, higher power, source technology for the Next Generation High Power Microwaves(HPM) demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.120"
                                            },
                                            "Text": {
                                                "val": "Refine ultra-short pulsed laser atmospheric propagation studies. Conduct effects studies on electronics based on the assessments from FY15 and FY16. Continue compact 50 kilovolt solid state switch research. Complete research on smaller, higher power, source technology for joint Air Force-Navy HPM technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.598"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.598"
                                            },
                                            "Text": {
                                                "val": "Begin ultra-short pulsed laser atmospheric propagation studies in a density gradient. Conduct effects studies on electronics based on the assessments from FY16 and FY17 to support HIgh power Joint Electromagnetic Non-Kinetic Strike (HiJENKS). Complete compact 50 kilovolt solid state switch for a militarily relevant platform. Initiate design of smaller, higher power, source technology for the joint AF-Navy HiJENKS HPM demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HPEM Effects and Mitigation Research"
                                    },
                                    "Description": {
                                        "val": "Assess the effects\/lethality of HPEM technologies.  Develop and apply sophisticated models to enhance the development of HPEM and related technology.  Develop tools and perform assessments which allow comparisons among DE concepts and tradeoffs between DE and non-DE solutions.   Investigate technologies to counter the effects of HPEM."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.079"
                                            },
                                            "Text": {
                                                "val": "Completed source for effects testing that operates in three microwave bands. Tested and validated Phase 1 of DE High Performance Computing Software Applications Institute software, which allows modeling of DE sources and propagation that involves plasmas. Assessed potential improvements to US weapons systems from employing HPEM weapons technologies for platform protection and target prosecution. Conducted assessments of HPEM and kinetic energy (KE) weapon concepts in a common environment to help users plan weapons investments. Continued to model and characterize HPEM threats to blue systems and provide assessments developers for hardening materials and designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.598"
                                            },
                                            "Text": {
                                                "val": "Test and validate Phase 2 of DE High Performance Computing Software Applications Institute software, which allows modeling of DE sources and propagation that involves plasmas and laser DE weapons. Continue to assess potential improvements to US weapons systems from employing HPEM weapons technologies for platform protection and target prosecution. Continue further assessments of HPEM and KE weapon concepts in a common environment to help users plan weapons investments. Transition Modeling, Simulation & Analysis (MS&A) tools to the broader MS&A community. Continue to model and characterize current and projected HPEM threats to blue systems and provide assessments to developers for hardening materials and designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.449"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.449"
                                            },
                                            "Text": {
                                                "val": "Test and validate Phase 3 of DE High Performance Computing Software Applications Institute software, which allows modeling of DE sources and propagation that involves plasmas and laser DE weapons. Assess potential improvements to US weapons systems from employing HPEM weapons technologies for platform protection and target prosecution. Continue assessments of HPEM and synergistic\/KE weapon concept capabilities to help users plan weapons investments. Transition MS&A tools to the broader MS&A community."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}