{
    "id": "2018-AirForce-PB-3600-JBOOK-4677b7373ceb5a2af4f54ac9946d42727733735517b0c06be4cbaa3f97502e4b-57",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3B-U_RDTE_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0408011F"
        },
        "ProgramElementTitle": {
            "val": "Special Tactics \/ Combat Control"
        },
        "R1LineNumber": {
            "val": "288"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.665"
            },
            "CurrentYear": {
                "val": "7.164"
            },
            "BudgetYearOne": {
                "val": "8.090"
            },
            "BudgetYearOneBase": {
                "val": "8.090"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "8.119"
            },
            "BudgetYearThree": {
                "val": "8.271"
            },
            "BudgetYearFour": {
                "val": "8.415"
            },
            "BudgetYearFive": {
                "val": "8.588"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.929"
                },
                "CurrentYear": {
                    "val": "7.164"
                },
                "BudgetYearOne": {
                    "val": "8.067"
                },
                "BudgetYearOneBase": {
                    "val": "8.067"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.665"
                },
                "CurrentYear": {
                    "val": "7.164"
                },
                "BudgetYearOne": {
                    "val": "8.090"
                },
                "BudgetYearOneBase": {
                    "val": "8.090"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.264"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.023"
                },
                "BudgetYearOneBase": {
                    "val": "0.023"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.264"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.023"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.023"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675138"
                    },
                    "ProjectTitle": {
                        "val": "ST System Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.665"
                        },
                        "CurrentYear": {
                            "val": "7.164"
                        },
                        "BudgetYearOne": {
                            "val": "8.090"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.090"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.119"
                        },
                        "BudgetYearThree": {
                            "val": "8.271"
                        },
                        "BudgetYearFour": {
                            "val": "8.415"
                        },
                        "BudgetYearFive": {
                            "val": "8.588"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Special Tactics (ST) System Development project focuses on modernization development for the Battlefield Air Operations (BAO) Kit. The project is a program within the overarching Battlefield Airmen Modernization (BA-Mod) Program. BAO Kit will develop, test, train and modernize the existing and future System of Systems (SoS) that provide a state-of-the-art Command, Control, Communications, Computer, Intelligence, Surveillance and Reconnaissance (C4ISR) capability. It also provides a suite of systems for all Air Force Specialty Codes supporting the ST community within the Air Force Special Operations Command's (AFSOC's) Battlefield Airmen. Efforts in the ST System Development project focus on reducing the risk of fratricide and substantially reducing size and weight of the equipment carried through three core capabilities: Human Machine Interface (HMI), Line of Sight (LOS) targeting, and Machine to Machine (M2M) C4ISR System and all other ST capability needs.\n\nThis program will develop and enhance technologies for Battlefield Airmen ST operators to recognize, identify, range, nominate, and designate targets during both day and night operations. BAO Kit will also significantly reduce the time required to find, track, fix targets, and engage the enemy by providing highly accurate target grid coordinates in three dimensions, generating target imagery both pre and post-strike, and transmitting target data to Command and Control centers. All BAO Kit systems are light, compact, and portable for use by dismounted Battlefield Airmen. FY18 BAO Kit funding will provide significant improvements in operational capability, situational awareness, and precision lethality in the battle space and while continuing to build and enhance the BAO Kit system of systems. This may be conducted through industry technology demonstrations, prototypes, and associated engineering support to posture the BAO Kit for technology insertion.  These efforts will deliver enhanced capability for the for the dismounted soldier in terms of dramatic weight reduction and increase mission effectiveness across the conflict spectrum.  BAO also supports AFSOC TAC C2 programs to develop and enhance communication systems and equipment essential for ST combat controllers, pararescue, combat weather operators, and tactical air controller parties within AFSOC to perform their mission. The ST operators use this equipment to gather and transmit assault zone suitability and weather data and to perform tactical airfield\/assault landing\/drop zone operations.\n\nThe Special Tactics (ST) System Development activities also include studies and analysis to support both current and future program planning and execution.\n\nThis is in Budget Activity 7, Operational System Development because this budget activity includes development effort to upgrade systems that have been fielded or have received approval for full rate production funding in the current or subsequent fiscal years"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Machine Interface (HMI)"
                                    },
                                    "Description": {
                                        "val": "HMI is a system of systems that provides integrated operator interface between all the machine components by using unified visual and auditory displays and controls, such as head-mounted displays, tactical earplug connectivity with man pack or handheld communications, integrated tactical computing solution, and power generation and management systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.823"
                                            },
                                            "Text": {
                                                "val": "- Developed and implemented Mobile User Objective System (MUOS) compatibility waveform features, which allows the DoD to operate without the dependency of civilian SATCOM services. Upgraded 571 PRC-117G radios for MUOS compliance. \n-  Continued development of the handheld Link-16 receiver\/transmitter to enable the legacy waveform to be utilized by operators in the field. HH link-16 (PRC-161) development produced 15 prototype radios for test integration. \n-  Continued development effort for the Secure Personal Area Network (PAN): The PAN reduces Size, Weight, and Power (SWAP) by eliminating ancillary cables. The PAN requirement is to have secure wireless communication connections between the BAO Kit and items such as radios. Continued to track current SBIR program. \n-  Developed GPS technology. This effort was with the current radio vendor to develop and implement a radio software enhancement that pushes the internal GPS signal to the BAO Kit computer. Worked with Harris to develop GPS National Marine Electronics Association (NMEA) Echo location stream. The Echo stream allows the user to pull GPS signal from a radio into an end user device (EUD). \n- Explored wireless technology: exploration of future wireless Bluetooth\/Blacktooth encrypted data communication for the Special Tactics community. \n- Upgraded communications development: HMI efforts reduced the SWAP required to be carried by the Special Tactics Community."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.918"
                                            },
                                            "Text": {
                                                "val": "- Will focus on Handheld Link-16 receiver\/transmitter for the dismounted operator and interaction with next generation aircraft. Capability supports digitally aided combat air support operations. Plans for development and operational tests for certification. Continue to work on acquisition plan, to include a Source Selection Survey \/Request For Information (SSS\/RFI) for future procurement. \n- Will explore and define requirements for implementation of the Iridium waveform granting DoD dedicated airtime. \n- Will upgrade communications development: HMI efforts reduce the Size, Weight and Power (SWAP) required to be carried by the Special Tactics Community.  Specifically includes wireless technology. BAO Program office has a draft System Requirement Document (SRD) for future dismounted tactical communication procurement to include multi-channel hand-held, multi-channel manpack, and next generation High Frequency (HF) radios. Work on acquisition plan, to include a SSS\/RFI for future procurement.\n- Will Pursue MUOS licenses for Test & Integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.891"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.891"
                                            },
                                            "Text": {
                                                "val": "- Will continue to focus on Handheld Link-16 receiver\/transmitter for the dismounted operator and interaction with next generation aircraft. Capability will support digitally aided combat air support operations. Plan to develop and operate tests for full spectrum certification (Joint Interoperable Test Command (JITC), Air Force System Interoperability Test (AFSIT), and Authority to Operate (ATO)). \n-Will continue to explore and define requirements for implementation of the Iridium waveform granting DoD dedicated airtime. \n- Will continue communications development: will upgrade HMI efforts which reduced the Size, Weight, and Power (SWAP) required to be carried by the Special Tactics Community.  Specifically includes wireless technology. \n- Will require maturation of available technology for future dismounted communication contract in order to meet the requirements of the user."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Line of Sight"
                                    },
                                    "Description": {
                                        "val": "Line of Sight (LOS) targeting enables the ST Battlefield Airmen to find, fix, track, target and, engage the enemy at close range during day or night operations by providing highly accurate target coordinates in three dimensions. LOS generates vital imagery both pre and post-strike at a fraction of the weight and is more efficient than legacy equipment carried by the operator. Non Line of sight (XLOS) targeting device exploration and development will help capture future capabilities to the Special Tactics community. XLOS devices allow for a remote expendable reporting environmental sensor that enhances AFSOC Special Operation Weather Team's (SOWT) ability to provide timely, accurate, and critical deep battle space weather reconnaissance and intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.221"
                                            },
                                            "Text": {
                                                "val": "- Explored and developed Non Line of sight (XLOS) targeting device. Devices capture future capabilities for the Special Tactics community.\n- Started development, test, and evaluation of Microweather sensor (MWS) and Advanced MWS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "- Continue to explore and develop future Non Line of sight (XLOS) targeting device capabilities for Special Tactics community.\n- Continue to explore additional development of the Microweather Sensor (MWS). Look to upgrade design with acoustic sensor and Chemical Biological Radiological Nuclear Explosive (CBRNE) detectors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.273"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.273"
                                            },
                                            "Text": {
                                                "val": "- Will continue to explore and develop future Non Line of sight (XLOS) targeting device capabilities for Special Tactics community.\n- Will continue to explore additional development of the Microweather Sensor (MWS). Look to further upgrade acoustic sensor and Chemical Biological Radiological Nuclear Explosive (CBRNE) detectors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Machine-To-Machine (M2M) Software Development"
                                    },
                                    "Description": {
                                        "val": "A suite of map-centric software applications that enables M2M transfer of precision targeting, information management, C4ISR (Command, Control Communications, Computers, Intelligence, Surveillance, and Reconnaissance), and Situational Awareness (SA) information.  Provides the ST Battlefield Airmen the ability to find, fix, track, target and engage the enemy which greatly reduces the kill chain and drastically decreases the possibility of fratricide by enhancing the operator's situational awareness on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.621"
                                            },
                                            "Text": {
                                                "val": "-Developed and tested material prototypes of M2M interfaces for C4ISR; investigated alternate operating systems and application development.\n- Continued development of 5th Generation fighter integration, explored Net Enabled Weapons (NEW) employment, and explored wireless and Bluetooth technologies to reduce the Size, Weight and Power of the system reducing operator load. \n- Continued exploitation of two-way Video Data Link capability, increasing interoperability, incorporation of theatre level intelligence systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.996"
                                            },
                                            "Text": {
                                                "val": "- Develop and test material prototypes to include market survey of M2M graphical user interfaces (GUI) for C4ISR. \n- Investigate alternate operating systems (OS), such as Android OS, and application development as required by the user to support urgent combat mission needs and requirements; will continue 5th Generation fighter integration and exploration of Net Enabled Weapons (NEW) employment. \n- Explore and develop wireless technology to reduce the SWAP of the system reducing operator load. \n- Exploit two-way encrypted Video Data Link and Network capability, which will increase interoperability, by incorporating theater level intelligence systems by providing SA to the war fighter."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.926"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.926"
                                            },
                                            "Text": {
                                                "val": "- Will continue to improve development and test material prototypes to include market survey of M2M graphical user interfaces (GUI) for C4ISR. \n- Will begin to explore requirements to include future INC III capability gap; which includes but is not limited to, Air Field Seizure, personnel recovery, and special operations weapons teams.\n- Will perform DoD Mandatory Windows 10 upgrades, for Digital Air Strike Suite (DASS) system.\n- Will continue to support requirements for DASS & Small Bomb Diameter (SBD) II net enabled weapon."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line item  #837100"
                                    },
                                    "Title": {
                                        "val": "Tactical C-E Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "31.107"
                                        },
                                        "CurrentYear": {
                                            "val": "49.333"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.524"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.524"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.580"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.072"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.361"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.657"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "BAO Kit is executing an incremental development of Communications and Machine to Machine (M2M) Software.  Development will include system engineering, design, integration and fielding support for M2M and Indefinite Delivery Indefinite Quantity (Communications) upgrades. Wright Patterson AFB, OH manages the contract effort."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}