{
    "id": "2018-AirForce-PB-3600-JBOOK-857e7c42b5cd67f362a388822cdc6c6374be2f224d8defe4fb4e7b5bd4bdcb7c-9",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602601F"
        },
        "ProgramElementTitle": {
            "val": "Space Technology"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "107.442"
            },
            "CurrentYear": {
                "val": "117.915"
            },
            "BudgetYearOne": {
                "val": "116.503"
            },
            "BudgetYearOneBase": {
                "val": "116.503"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "114.683"
            },
            "BudgetYearThree": {
                "val": "123.420"
            },
            "BudgetYearFour": {
                "val": "126.098"
            },
            "BudgetYearFive": {
                "val": "130.414"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program focuses on four major areas.  First, space survivability and surveillance develops technologies to understand space weather and the geophysics environment for mitigation and exploitation of these effects to Air Force systems.  Second, spacecraft payload technologies improve satellite payload operations by developing advanced component and subsystem capabilities.  Third, spacecraft protection develops technologies for protecting U.S. space assets in potential hostile settings.  The last major area, spacecraft vehicles, focuses on spacecraft platform and control technologies, and their interactions.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  \n\nIn FY 2018, a portion of HQ AFRL S&T civilian manpower in PE 0602601F, Space Technology, was transferred to PE 0602298F, Science and Technology Management - Major Headquarters Activities, to provide increased transparency to Congress on personnel in Major Headquarters Activities (MHA).\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "109.122"
                },
                "CurrentYear": {
                    "val": "117.915"
                },
                "BudgetYearOne": {
                    "val": "121.663"
                },
                "BudgetYearOneBase": {
                    "val": "121.663"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "107.442"
                },
                "CurrentYear": {
                    "val": "117.915"
                },
                "BudgetYearOne": {
                    "val": "116.503"
                },
                "BudgetYearOneBase": {
                    "val": "116.503"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.680"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.160"
                },
                "BudgetYearOneBase": {
                    "val": "-5.160"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.680"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.160"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.160"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2018 due to realignment of funds for autonomy and Laser Weapon System priorities and transfer of some HQ AFRL civilian manpower to PE 0602298F, Science and Technology Management - Major Headquarters\nActivities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621010"
                    },
                    "ProjectTitle": {
                        "val": "Space Survivability & Surveillance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.872"
                        },
                        "CurrentYear": {
                            "val": "39.163"
                        },
                        "BudgetYearOne": {
                            "val": "39.100"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.100"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "29.280"
                        },
                        "BudgetYearThree": {
                            "val": "35.477"
                        },
                        "BudgetYearFour": {
                            "val": "36.236"
                        },
                        "BudgetYearFive": {
                            "val": "35.172"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies to understand and control the space environment for warfighter's future capabilities.  The focus is on characterizing and forecasting the battlespace environment for more realistic space system design, modeling, and simulation, as well as the battlespace environment's effect on space systems' performance.  This includes technologies to specify and forecast the space environment for planning operations, ensure uninterrupted system performance, optimize space-based surveillance operations, and provide capability to mitigate or exploit the space environment for both offensive and defensive operations.  Finally, this project includes the seismic research program that supports national requirements for monitoring nuclear explosions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Environment Research"
                                    },
                                    "Description": {
                                        "val": "Develop techniques, forecasting tools, sensors, and technologies for specifying, monitoring, predicting, and controlling space environmental conditions hazardous to DoD operational space and radar systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.417"
                                            },
                                            "Text": {
                                                "val": "Continued developing requirement recommendations for operational space environment sensors necessary for rapid anomaly attribution in contested space.  Continued developing predictive model for optical and dielectric spacecraft material property changes due to space environment aging.  Initiated evaluation of prototype solar particle event prediction model, began evaluation for suitability to support operational needs.  Continued exploitation of new on-orbit data sources to enhance energetic space environment models supporting spacecraft design and mission planning.  Developed a suite of codes that will be used for attribution of satellite communication interference.  Delivered block upgrades to address future needs of DoD satellite communication users.  Developed models for error corrections caused by ionospheric disturbances and provided upgrades to the state-of-the-art model currently used for those corrections.  Assessed future signature packages that should be added to the hypersonics flow solver.  Continued the assessment of new geometry and material impacts on mission success for strategic systems.\n  \nIn FY2016 and beyond, the Ionospheric Research effort has been combined with this effort in the same project to better align technical efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.606"
                                            },
                                            "Text": {
                                                "val": "Finalize requirement recommendations for operational space environment sensors.  Complete initial predictive model for optical and select dielectric spacecraft material property changes.  Select improved solar magnetic field and energetic particle models for further development as future spirals of anomaly attribution tools.  Begin analyzing and exploiting data from the on-orbit radiation remediation proof-of-concept experiment and other on-orbit spacecraft.  Assess impacts of the artic ionosphere on sensor systems.  Create environment impact on space-ground radio frequency links attribution tool.  Evaluate and refine Global Positioning System (GPS) radio frequency exploitation algorithms for global scintillation specification.  Improve state-of-the-art solar magnetic flux transport model for more reliable forecast of solar radio and extreme ultraviolet flux levels.  Derive an advanced ionosphere-thermosphere model using these parameters and evaluate the performance.  Couple optical and infrared signature codes to the hypersonic solver.  Support high temperature material on-orbit experiment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.460"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.460"
                                            },
                                            "Text": {
                                                "val": "Begin evaluation of next-generation solar particle event models for operational suitability.  Develop suitable trapped energetic particle specification model for inclusion in rapid anomaly resolution tool.  Begin chemical analysis of aged spacecraft materials for electrical and optical property changes.  Begin exploitation of unique internal charging sensor with respect to space material aging.  Continue analyzing and exploiting data from on-orbit assets.  Continue to assess impacts of the arctic ionosphere on sensor systems.  Continue to evaluate and refine GPS radio frequency exploitation algorithms for global scintillation specification.  Continue improvements of state-of-the-art solar magnetic flux transport model for more reliable forecast of solar radio and extreme ultraviolet flux levels.  Validate the advanced ionosphere-thermosphere model.  Continue work on hybrid hypersonic solvers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Surveillance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced target detection techniques, spectral signature libraries, and decision aids for space-based sensors and surveillance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.144"
                                            },
                                            "Text": {
                                                "val": "Expanded evaluation of hyper temporal imaging (HTI) data processing methods and target detection algorithms to wider range of real-world and simulated target-background missile warning scenarios as well as to space-based imagery data that is compressed to reduce satellite downlink problems.  Delivered detailed technical evaluation of potential HTI detection methods for concealed activity, including identification of technology gaps needing additional investigation for use in monitoring difficult threats.  Initiated development of HTI space-based data collection events and ground truth field campaigns for new HTI flight experiment investigating advanced concept for early missile warning and dim target detection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.990"
                                            },
                                            "Text": {
                                                "val": "Deliver algorithm testbed trade studies and benchmarked HTI target detection algorithms for improved detection of increasingly dim infrared target signatures commensurate with new and emerging space-based sensors having higher sensitivity for missile warning and battlespace awareness.  Conduct trade studies of computational methods for compressing large amounts of data from missile warning satellites while maximizing target detection probabilities, minimizing false alarms, and mitigating satellite downlink issues.  Provide final recommendations and complete study of the potential detection of concealed activity from space-based systems.  Continue development of HTI space-based data collection events and ground truth field campaigns for new HTI flight experiment. Initiate modeling and laboratory studies to establish performance baseline for HTI-dedicated space experiment for testing new capability option for early missile warning.  Develop and implement methods for processing and exploiting HTI data for dim target detection in complex environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.202"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.202"
                                            },
                                            "Text": {
                                                "val": "Complete assessment of target detection methodologies for HTI-based, missile warning concepts.  Continue evaluation of computational methods for reducing time-critical downlink of missile warning and surveillance data through state-of-the-art data compression capabilities.  Analyze missile-like events observed by HTI-dedicated space experiment to continue evaluation of HTI concept for early warning of theater ballistic missile launches.  Initiate study of analytic approaches to space-based sensing of new and emerging ballistic and non-ballistic threats in denied areas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ionospheric Research"
                                    },
                                    "Description": {
                                        "val": "Develop techniques, forecasting tools, and sensors for ionospheric specification and forecasting, space-based geolocation demonstrations, and determination of potential radar degradation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016 and beyond, this effort is combined with the Space Environment Research effort in the same project to better align technical efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radiation Remediation Research"
                                    },
                                    "Description": {
                                        "val": "Conduct Radiation Belt Remediation (RBR) research through developing and validating analytical performance models for remediation of Earth radiation belts following high altitude nuclear detonation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.634"
                                            },
                                            "Text": {
                                                "val": "Validated RBR end-to-end model version 3.0 using ground and space-based measurements with satellite and terrestrial experiments.  Conducted fielded RBR capability assessments to determine rough order fielded system requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.946"
                                            },
                                            "Text": {
                                                "val": "Complete fielded RBR capability assessments of ground and space based systems to determine rough order fielded system requirements.  Perform reduction and exploitation of science data from the on-orbit radiation remediation proof-of-concept experiment in support of validation of the final spiral of the RBR end-to-end model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.625"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.625"
                                            },
                                            "Text": {
                                                "val": "Complete reduction and exploitation of science data from the space experiments to finalize the validation of the end-to-end model.  Complete study to determine technical feasibility of a fielded ground or space-based system using the final validated end-to-end model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seismic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop seismic technologies to support national requirements for monitoring nuclear explosions with special focus on regional distances less than 2,000 kilometers from the sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.340"
                                            },
                                            "Text": {
                                                "val": "Delivered discrimination capabilities using full seismic waveforms based on three-dimensional models to fill critical capability gaps.  Used three-dimensional attenuation models to improve signal loss prediction for seismic signals used in discrimination.  Investigated the use of modern high speed computing capabilities and massive data archives to automate the detection, location, and discrimination of seismic events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.565"
                                            },
                                            "Text": {
                                                "val": "Advance signal and array processing methods to dramatically improve detection at target sites and increase automation of detection, location, and discrimination of other seismic events from nuclear explosions.  Improve mission-critical discrimination accuracy using source characterizations based on full seismic waveforms.  Develop, test, and apply methods to use surface wave travel times and amplitudes for greater location and discrimination accuracy.  Improve the resolution and accuracy of three-dimensional attenuation models to improve signal loss prediction for seismic signals used in discrimination."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.281"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.281"
                                            },
                                            "Text": {
                                                "val": "Implement high performance computing capabilities to automate the detection, location, and discrimination of seismic events.  Test and provide high-performance computing modeling and simulation codes to model full seismic waveforms for operational expert analysis of difficult-to-discriminate earthquakes and explosions.  Provide improved understanding of the behavior of discriminants for local and regional seismic events.  Explore the application of big-data heuristics to more quickly characterize seismic events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Navigation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies based on cold atom physics that provide autonomous jam-proof precision inertial navigation to augment GPS in case of GPS-denial. Develop atomic clocks based on new technologies to replace legacy GPS atomic clocks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.337"
                                            },
                                            "Text": {
                                                "val": "Continued to advance the development of compact atomic clocks with improved accuracy and stability to replace legacy atomic clocks. Continued construction of a free space, cold atom 3-axis gyroscope\/accelerometer that would enable GPS-free precision navigation. Completed further tests of free space, cold atom single-axis gyroscope\/accelerometer to learn about its strengths and limitations. Developed a confined cold atom gyroscope with reduced size and weight over free space cold atom gyroscopes to provide a GPS-free navigation system for DoD platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.056"
                                            },
                                            "Text": {
                                                "val": "Continue to advance the development of compact atomic clocks with improved accuracy and stability to replace legacy atomic clocks.  Begin testing of advanced clock from National Institute of Standards and Technology.  Complete development of free space, cold atom 3-axis gyroscope\/accelerometer that will enable GPS-free precision navigation.  Develop test plans for cold atom 3-axis gyroscope\/accelerometer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.532"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.532"
                                            },
                                            "Text": {
                                                "val": "Begin testing of advanced compact atomic clocks with improved accuracy and stability to replace legacy atomic clocks.  Complete testing of advanced clock from National Institute of Standards and Technology.  Package system for flight on experimental satellite system.  Begin testing of free-space, cold atom 3-axis gyroscope\/accelerometer that will enable GPS-free precision navigation.  Begin planning for packaging of system for test on aircraft flight experiment or other suitable platform."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624846"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Payload Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.128"
                        },
                        "CurrentYear": {
                            "val": "15.732"
                        },
                        "BudgetYearOne": {
                            "val": "15.841"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.841"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.021"
                        },
                        "BudgetYearThree": {
                            "val": "16.480"
                        },
                        "BudgetYearFour": {
                            "val": "16.770"
                        },
                        "BudgetYearFive": {
                            "val": "17.154"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops advanced technologies that enhance spacecraft payload operations by improving component and subsystem capabilities. The project focuses  on development of advanced, space-qualified, survivable electronics, and electronics packaging technologies; development of advanced space data generation and exploitation technologies, including infrared sensors; and development of high-fidelity space simulation models that support space-based surveillance and space asset protection research and development for the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space-Based Detector Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced infrared device technologies that enable hardened space detector arrays with improved detection to perform acquisition, tracking, and discrimination of space objects and missile warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.225"
                                            },
                                            "Text": {
                                                "val": "Continued alternative sensor material architecture development, focused on minimizing yield limitations and producing a lower cost detector that can perform the mission at more cost-effective operating temperatures.  Completed laboratory demonstration of tunable detector technology and validated basic functionality over a militarily significant range of wavelengths.  Initiated development of radiation tolerant detectors to achieve dim object tracking for next-generation space situational awareness systems.  Completed support for novel cloud-penetrating missile warning experiment.  Continued development of foundational sensor modeling and novel detector enhancement methodologies to leverage tactical infrared detector developments for use in space systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.379"
                                            },
                                            "Text": {
                                                "val": "Maintain alternative sensor material-based detector development for lowering noise and raising detector efficiency.  Characterize detector performance in both gamma and proton environments to develop full understanding of degradation mechanisms present. Iterate design, growth, and characterization as needed to achieve desired performance in space-radiation environment.  Characterize resiliency of detectors, read-out integrated circuits, and focal plane arrays to focused photons and other space phenomenology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.290"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.290"
                                            },
                                            "Text": {
                                                "val": "Focus on growing larger infrared detectors with emphasis on noise-equivalent operability reflective of space-based launch detection missile warning applications with derivative benefits for tactical applications.  Characterize detectors in a representative space environment to include surface charging, latch-up, and displacement damage.  Iterate upon design to ensure suitability for space operation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Situational Awareness Sensing (SSA) Research"
                                    },
                                    "Description": {
                                        "val": "Develop innovative means for measuring, modeling, and predicting phenomena for SSA and protection applications. Develop new methods to evaluate how well specific data contributes to identifying particular physical and functional information about a space-based object, and ultimately enable decision-makers to pursue courses of action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016, this effort will be combined with the Threat Warning Research effort in Project 625018, Spacecraft Protection Technology, to better align technical efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Electronics Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for space-based payload components such as radiation-hardened electronic devices, micro- electro-mechanical system devices, and advanced electronics packaging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.162"
                                            },
                                            "Text": {
                                                "val": "Continued research into advanced transistor types for use at ultra-submicron technology nodes.  Documented initial small-feature-size reliability findings and transitioned results to device development community to improve spacecraft electronic lifetime predictions.  Completed investigation of advanced electronic circuit technology and transitioned to development phase.  Initiated development of low-order benchmarking tools for quantifying and assessing the impact that emerging satellite electronics technologies have on component and system-level metrics, such as size, weight, power and cost.  Initiated development of path for trusted electronics as it applies to space electronics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.659"
                                            },
                                            "Text": {
                                                "val": "Continue advanced transistor efforts transitioning from single transistors into circuits on targeted fabrication nodes for digital applications and provide Gallium Nitride transistor radiation results to electronics manufacturing community.  Continue development of benchmarking tool suite, demonstrating capability across multiple user systems and applications.  Transition results to user for selection of technology path.  Continue development of trusted electronics path as it applies to space technology tools and fabrication.  Initiate development of three-dimensional electronics to extend technology node density."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.715"
                                            },
                                            "Text": {
                                                "val": "Continue advanced transistor efforts transitioning techniques to mainstream manufacturing.  Finalize Gallium Nitride transistor radiation mitigation results and techniques to the electronics manufacturing community.  Continue to transition benchmarking results to user for selection of technology path while updating capability to keep pace with state-of-the-art.  Continue development of trusted electronics path as it applies to space technology tools and fabrication.  Continue development of three-dimensional electronics to extend technology node density.  Investigate alternative memory approaches for high density memory."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling and Simulation Tools for Space Applications"
                                    },
                                    "Description": {
                                        "val": "Develop modeling and simulation tools for space-based ground surveillance systems, rendezvous and proximity operations, imaging of space systems, disaggregated satellite architecture, and space control payloads."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.013"
                                            },
                                            "Text": {
                                                "val": "Continued to develop spacecraft and mission simulations in close conjunction with customers across the DoD and other government agencies.  Continued to integrate state-of-the-art system performance and mission planning algorithms into modeling and simulation tools.  Revised flight tools based on recent flight program experience.  Supported technology maturation through capability and mission utility studies, size, weight, and power-cost trade studies, and wargaming activities.  Provided utility analysis to future flight experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.054"
                                            },
                                            "Text": {
                                                "val": "Explore mission-level military utility analyses of various space sensing, satellite navigation, and communication architecture approaches.  Develop initial guidelines and checkpoints to evaluate maturity and applicability of emerging space technologies to support various Air Force Research Laboratory (AFRL) technical programs, DoD customers, and wargame events.  Begin development of models and mission simulations enabling analysis of contested space environment and space enterprise capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.306"
                                            },
                                            "Text": {
                                                "val": "Define mission-level military utility analyses of various space sensing, satellite navigation and communication architecture approaches.  Refine guidelines and checkpoints to evaluate maturity and applicability of emerging space technologies to support various AFRL technical programs, DoD customers and wargame events. Continue development of models and mission simulations enabling analysis of contested space environment and space enterprise capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Positioning, Navigation, and Timing Technology"
                                    },
                                    "Description": {
                                        "val": "Identify and develop technologies that enable new, or enhance existing, U.S. positioning, navigation, and timing (PNT) satellite capabilities by increasing resiliency and availability of accuracy, and\/or increasing the affordability of providing current capabilities. Develop technologies to meet identified Air Force Space Command\/Space and Missile Systems Center PNT space payload technology needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.728"
                                            },
                                            "Text": {
                                                "val": "Initiated experiments establishing the sensitivity of various PNT payload units\/sub-units to off-nominal operating conditions and established laboratory readiness for incorporation of experimental hardware from other, on-going PNT technology developments.  Continued studies to identify alternative and innovative technologies that are viable for PNT payloads.  Initiated study of advanced signal concept to protect both military and civilian signals from adversary countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.640"
                                            },
                                            "Text": {
                                                "val": "Incorporate advanced amplifiers into in-house PNT payload laboratory testbed.  Establish the sensitivity of various PNT payload units\/sub-units to off-nominal operating conditions and establish laboratory readiness for incorporation of experimental hardware from other, on-going PNT technology developments.  Continue studies to identify alternative and innovative technologies that are viable for PNT payloads and investigate advanced signal concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.530"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.530"
                                            },
                                            "Text": {
                                                "val": "Complete in-house laboratory feasibility experiments on an advanced digital payload for future GPS application.  Conduct in-house experiment to prove the ability of at least two advanced signal concepts to overcome adversarial countermeasures.  Continue studies to identify alternative and innovative technologies that are viable for PNT payloads and to investigate advanced signal concepts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625018"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Protection Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.817"
                        },
                        "CurrentYear": {
                            "val": "19.411"
                        },
                        "BudgetYearOne": {
                            "val": "21.720"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.720"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "25.548"
                        },
                        "BudgetYearThree": {
                            "val": "26.818"
                        },
                        "BudgetYearFour": {
                            "val": "27.170"
                        },
                        "BudgetYearFive": {
                            "val": "27.323"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the technologies for protecting U.S. space assets in potentially hostile environments to assure continued space system operation without performance loss in support of warfighter requirements.  The project focuses on identifying and assessing spacecraft system vulnerabilities, developing threat warning technologies, and developing technologies to mitigate the effects of both intentional and unintentional threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Threat Warning Research"
                                    },
                                    "Description": {
                                        "val": "Develop satellite threat warning technologies and tools for space defense. Exploit on-board inherent satellite resources, satellite-as-a-sensor, and self-aware satellite technologies.  Develop technologies to detect, assess, and respond to threats and anomalies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.817"
                                            },
                                            "Text": {
                                                "val": "Completed experimental measurements of satellite components to verify and validate predictive modeling capabilities.  Continued analysis of next-generation sensing methods and phenomena to exploit for space protection.  Completed assessments of proximity sensor options and transitioned findings, as appropriate, to satellite system developers.  Began new SSA-focused data analysis methods including physics-based sensor model development for use in data filtering; advanced filtering techniques accommodating nonlinear dynamics and non-normal random variable distributions; and data-driven methods applicable where physical models are highly uncertain or altogether unknown.  Initiated development of advanced algorithms for satellite threat detection and response for both ground-based and space-based implementations.  Continued development of capabilities to increase satellite autonomy and perform closed loop demonstration showing threat detection and responsive courses of action. Initiated systems engineering studies on resilience augmentation of high value assets.  Continued development of bare-metal hypervisor for satellite cyber resilience."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.411"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced algorithms for sensor data fusion and satellite threat detections, assessment, and response.  Begin integrating results of advanced algorithm development with satellite autonomous operation demonstrating improved threat detection and response capabilities.  Continue SSA-focused data analysis methods including physics-based sensor model development for use in data filtering.  Continue advancing filtering techniques accommodating nonlinear dynamics and non-normal random variable distributions.  Complete data driven methods applicable where physical models are highly uncertain or altogether unknown.  Initiate analysis of new electro-optical and radio frequency sensor concepts for space object identification and characterization.  Continue development of closed loop sensor tasking prototype for space surveillance combining commercial and government sensor assets.  Complete demonstration of end-to-end threat detection, assessment, and course of action response system implemented within space operations environment.  Evaluate potential ability of commercial remote sensing data and information to fill gaps in coverage for monitoring and tracking ground and space objects.  Investigate potential sensor tasking, data management, and dissemination architectures for utilization of commercial global geospatial-referenced information for finding and maintaining custody of mobile ground targets.  Investigate potential engagements with commercial space data providers for testing new enabling technologies on commercial satellites.  Deliver initial spacecraft bare-metal hypervisor for cyber security evaluation and testing; and integrate security primitives and modules.  Begin development of hosted payload options for resilience spacecraft.  Develop ground test capability for evaluation of technology performance in contested space environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.720"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.720"
                                            },
                                            "Text": {
                                                "val": "Add satellite protection techniques to continued development of advanced algorithms for sensor data fusion and satellite threat detection, assessment, and response.  Expand SSA-focused data analysis methods including physics-based sensor model development for use in data filtering.  Develop additional advanced filtering techniques accommodating nonlinear dynamics and non-normal random variable distributions.  Mature concepts of new electro-optical and radio frequency sensors for space object identification and characterization.  Incorporate customer feedback into closed loop sensor tasking concept for space surveillance combining commercial and government sensor assets.  Continue assessment and development of commercial remote sensing data and information to fill gaps in coverage for monitoring and tracking ground and space objects.  Continue engagements with commercial space data providers for testing new enabling technologies on commercial satellites. Operate ground test facility to evaluate performance of integrated technology solutions in contested space, cyber, and radio frequency environment.  Conduct red-teaming to evaluate effectiveness of specific space cyber resiliency technologies.  Develop and refine bare-metal hypervisor and associated security modules and expand to multiple computer architectures.  Continue development of hosted payload options for enhanced satellite survivability and mission assurance in contested environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "628809"
                    },
                    "ProjectTitle": {
                        "val": "Spacecraft Vehicle Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.625"
                        },
                        "CurrentYear": {
                            "val": "43.609"
                        },
                        "BudgetYearOne": {
                            "val": "39.842"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.842"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "43.834"
                        },
                        "BudgetYearThree": {
                            "val": "44.645"
                        },
                        "BudgetYearFour": {
                            "val": "45.922"
                        },
                        "BudgetYearFive": {
                            "val": "50.765"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on spacecraft platforms (e.g., structures, power, and thermal management); satellite control (e.g., signal processing and control); and space experiments of maturing technologies for space qualification."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Power\/Thermal Research"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for advanced space platform subsystems such as cryocoolers, compact, high efficiency solar power cells and arrays, and innovative power generation concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.496"
                                            },
                                            "Text": {
                                                "val": "Completed solid state refrigeration research and documented low-temperature semiconductor materials findings.  Focused development of greater than 40% efficient solar cells by demonstrating increased photocurrent using nano-enhanced cells. Continued to investigate advanced photon management approaches to increase efficiency and radiation hardness.  Completed Flex-Array initial development for 60 kW\/m3 power density performance.  Initiated follow-on development for achieving 70-80 kW\/m3 array performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.933"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of nano-enhanced solar cell approaches.  Evaluate alternative cell and array approaches for greater than 40% solar cell efficiency.  Continue investigation of approaches, such as advanced photon management, to increase end-of-life array performance.  Continue development of advanced array technologies to meet 70-80 kW\/m3 array performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.547"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.547"
                                            },
                                            "Text": {
                                                "val": "Continue research into approaches for greater than 40% solar cell efficiency.  Complete initial investigation of photon management approaches for increased end-of-life performance.  Continue development of advanced array technologies to meet 70-80 kW\/m3 array performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Structures and Controls Research"
                                    },
                                    "Description": {
                                        "val": "Develop revolutionary and enabling technologies, including lighter weight, lower cost, high performance structures for space platforms; guidance, navigation, and controls hardware and software for next generation of space superiority systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.886"
                                            },
                                            "Text": {
                                                "val": "Continued advanced guidance and navigation algorithms integration into advanced autonomous spacecraft software.  Continued collaborative autonomous multi-spacecraft algorithms in laboratory and high-fidelity simulations\/breadboards including embedded processor implementations.  Began reactive maneuver strategies for spacecraft resiliency in laboratory simulation.  Developed alternative GPS technologies for contested environments.  Transitioned methods to improve the fabrication and manufacture of precision and high tolerance composite structures to spacecraft prime contractors.  Initiated development of technologies to increase the resiliency and affordability of spacecraft structures through the development and test of new, actively-controlled thermal technologies.  Continued core research in thermal technologies that increase high-power heat dissipation for high-energy density electronics and radio-frequency components currently slated for Air Force communications and GPS spacecraft.  Explored new meta-material technologies to improve the electromagnetic interaction characteristics of Air Force spacecraft structures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.911"
                                            },
                                            "Text": {
                                                "val": "Complete advanced guidance and navigation algorithms integration into advanced autonomous spacecraft software.  Continue collaborative autonomous multi-spacecraft control algorithms in laboratory and high-fidelity simulations\/breadboards including embedded processor implementations.  Continue reactive maneuver strategies for spacecraft resiliency in laboratory simulation.  Initiate research in verification and validation techniques for autonomous spacecraft flight software.  Begin development of technologies to increase protection for U.S. on-orbit assets through high-strain composites, actively-controlled thermal technologies, and local area sensing.  Complete and transition thermal technologies that enable high-energy density electronics and radio-frequency components currently slated for Air Force communications and GPS spacecraft.  Continue developing meta-material concepts and energy responsive technologies to improve the electromagnetic interaction characteristics of spacecraft structures.  Initiate advanced spacecraft production and assembly technologies to increase system performance and affordability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.527"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.527"
                                            },
                                            "Text": {
                                                "val": "Continue collaborative autonomous multi-spacecraft control algorithms in laboratory and high-fidelity simulations\/breadboards including embedded processor implementations. Continue reactive maneuver strategies for spacecraft resiliency in laboratory simulation and initiate high-fidelity simulations\/breadboards.  Continue research in verification and validation techniques for autonomous spacecraft flight software. Initiate improved estimation algorithms for on-orbit navigation software.  Complete development of energy responsive technologies to control electromagnetic interactions of spacecraft structures and antennas. Continue developing U.S. space asset protection technologies including deployable structures enabling affordable protection concepts, thermal technologies for threat identification and mitigation, and local area sensing concepts. Continue developing advanced, agile manufacturing and assembly technologies for satellite production to improve system performance and affordability. Initiate research in affordable, high-performance phased arrays and electrically steerable antennas for tactical communication and radar concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Experiments"
                                    },
                                    "Description": {
                                        "val": "Develop flight experiments to improve the capabilities of existing operational space systems and to enable new transformational space capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.208"
                                            },
                                            "Text": {
                                                "val": "Continued testing and integration of satellite experiment to investigate remediation techniques for enhanced space radiation.  Completed development and continued testing and verification of a fourth generation geosynchronous orbit (GEO) based missile warning payload to demonstrate hyper temporal imaging (HTI) capabilities to detect missile launches under sun-lit clouds, potentially enabling all weather early missile detection.  Continued testing and verification of an integrated, on-board sensing, assessment, and autonomy technology demonstration payload at GEO, demonstrating GEO asset resiliency to a specific set of on-orbit events enabling system mission assurance in a degraded space environment.  Assessed technology readiness and risks for a space based integrated demonstration of an advanced GPS payload for contested environments.  Developed mission science objectives and on-orbit data collection\/analysis requirements to support an integrated experiment in the FY2021-2023 timeframe."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.423"
                                            },
                                            "Text": {
                                                "val": "Complete final integration, test, and launch vehicle integration of satellite experiment to investigate remediation techniques for enhanced space radiation.  Train the operations team and conduct mission rehearsals.  Launch experimental satellite and conduct on-orbit checkout and begin one year experimental operations.  Complete ground testing and verification of a fourth GEO based missile warning payload to demonstrate hyper temporal imaging (HTI) capabilities to detect missile launches under sun-lit clouds, potentially enabling all weather early missile detection.  Complete ground testing and verification of an integrated, on-board sensing, assessment, and autonomy technology demonstration payload at GEO, demonstrating GEO asset resiliency to a specific set of on-orbit events enabling system mission assurance in a degraded space environment.  Develop and initiate test planning for next-generation small satellite space experiment.  Develop on-orbit experiment plan and refine mission objectives\/data requirements for space based integrated demonstration of an advanced GPS payload for contested environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.435"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.435"
                                            },
                                            "Text": {
                                                "val": "Complete on-orbit early checkout for radiation remediation proof-of-concept experiment and complete one year of experimental activities.  Initiate on-orbit testing and verification of a fourth generation GEO based missile warning payload to demonstrate hyper temporal imaging (HTI) capabilities to detect missile launches under sun-lit clouds, potentially enabling all weather early missile detection.  Begin on-orbit testing and verification of an integrated, on-board sensing, assessment, and autonomy technology demonstration payload at GEO, demonstrating GEO asset resiliency to a specific set of on-orbit events enabling system mission assurance in a degraded space environment.  Continue development and testing of next-generation small satellite space experiment.  Continue developing on-orbit experiment plan and mission objectives\/data requirements for space based integrated demonstration of an advanced GPS payload for contested environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Communication Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for next-generation space communications terminals and equipment and methods\/techniques to enable future space system operational command and control concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.035"
                                            },
                                            "Text": {
                                                "val": "Completed design phase of W and V frequency band flight experiment.  Initiated fabrication of the flight instrument and ground receiver.  Established an operational W\/V-band terrestrial link experiment for pre-launch testing of W and V frequency band data collection instruments and computer analysis tools.  Completed fabrication of a remotely controlled, deployable W and V frequency band ground terminal and shelter.  Completed spectrum filing for flight experiment.  Continued studies of cognitive satellite radio concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.342"
                                            },
                                            "Text": {
                                                "val": "Deliver W and V frequency band flight instrument to the host spacecraft provider for assembly, integration, test, and launch in FY2019.  Fabricate, test, and deploy the first two operational, remotely controlled W and V frequency band ground terminals and shelter units which provide environmental control, power, wireless broadband connectivity, and computer processing\/storage for entire sensor suite.  Initiate development of a laboratory testbed for a cognitive satellite radio network to assess strategies to mitigate impacts from spectrum congestion and interference.  Evaluate alternatives for a follow-on project that would demonstrate W and V frequency band satellite communications (bi-directional, modulated signals) and mitigate technology risks to facilitate transition to an operational system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.333"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.333"
                                            },
                                            "Text": {
                                                "val": "Support integration and test of the W and V frequency band flight instrument onto the host spacecraft.  Fabricate, test, and deploy the last three operational, remotely controlled W and V frequency band ground terminals and shelter units.  Establish and test network connections to remote ground terminals.  Establish W and V frequency band flight experiment operations center, prepare staff, and test data analysis tools.  Establish interface to host mission operations center for receiving telemetry.  Conduct initial design and breadboard testing of the W and V frequency band follow-on project.  Continue to support development of critical space and ground terminal technology, such as multi-beam antenna, high power amplifiers, low noise amplifiers, reconfigurable radios, and wideband modem and signal processing technology."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}