{
    "id": "2018-Army-PB-2040-JBOOK-4d642436f65ddc83c084fdb1d917f4809eff5a3f2d9cca01c78cf59a8dd3a26e-4",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.502"
            },
            "CurrentYear": {
                "val": "25.466"
            },
            "BudgetYearOne": {
                "val": "27.144"
            },
            "BudgetYearOneBase": {
                "val": "27.144"
            },
            "BudgetYearTwo": {
                "val": "26.575"
            },
            "BudgetYearThree": {
                "val": "26.513"
            },
            "BudgetYearFour": {
                "val": "26.954"
            },
            "BudgetYearFive": {
                "val": "27.372"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) designs and validates electronic warfare (EW) components, both hardware and software, that deny, disrupt, or degrade the enemy's use of the electromagnetic spectrum for offensive or defensive operations. This is accomplished through the investigation of electronic support measures (ESM); countermeasures against communications systems and networks; the design and fabrication of sensors used to identify and locate threat forces in an asymmetric environment; and threat warning and electronic countermeasures (ECM) against munitions sensors, missile guidance systems, targeting systems, and explosive hazards. Project 906 supports protection of high-value ground platforms, aircraft and the Soldier from threat surveillance and tracking systems, imaging systems, and advanced radio frequency (RF)\/electro-optical (EO)\/infrared (IR) guided missiles, artillery, and smart munitions. Information fusion research addresses sensor correlation and fusion, relationship discovery, and management services through use of automated processing, as well as software that applies higher level reasoning techniques to support automated combat assessment. Project 906 also supports research and application of key EW sensors, direction finders and jammers to intercept, locate, and disrupt current and emerging communications and non-communications threat emitters to provide vital quality combat information directly to users in a timely and actionable manner. It focuses on detection of threat sensors and emitters associated with weapon systems, targeting systems and command, control, communications, computers, and intelligence systems and networks. \n\nWork in this PE complements PE 0602120A (Sensors and Electronic Survivability), PE 0602782A (Command, Control, Communications Technology), PE 0603270A (Electronic Warfare Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology); and is coordinated with PE 0603710A (Night Vision Advanced Technology) and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research, Development and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.243"
                },
                "CurrentYear": {
                    "val": "25.466"
                },
                "BudgetYearOne": {
                    "val": "25.041"
                },
                "BudgetYearOneBase": {
                    "val": "25.041"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.502"
                },
                "CurrentYear": {
                    "val": "25.466"
                },
                "BudgetYearOne": {
                    "val": "27.144"
                },
                "BudgetYearOneBase": {
                    "val": "27.144"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.741"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.103"
                },
                "BudgetYearOneBase": {
                    "val": "2.103"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.741"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "2.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.103"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.103"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "906"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Electronic Warfare Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.502"
                        },
                        "CurrentYear": {
                            "val": "25.466"
                        },
                        "BudgetYearOne": {
                            "val": "27.144"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.144"
                        },
                        "BudgetYearTwo": {
                            "val": "26.575"
                        },
                        "BudgetYearThree": {
                            "val": "26.513"
                        },
                        "BudgetYearFour": {
                            "val": "26.954"
                        },
                        "BudgetYearFive": {
                            "val": "27.372"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs, fabricates, evaluates, and applies key electronic warfare (EW)\/information operations technologies to enhance platform survivability (to include ground combat vehicles, aircraft, and the dismounted Soldier) and to intercept, track and locate current and emerging threat munitions, communications and non-communications threat emitters. This project applies recent advances in radio frequency (RF), infrared (IR), and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and jam threats (to include radar directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), top attack weapons, and electronically fuzed munitions). This project also pursues the ability to neutralize improvised explosive devices. This project designs information systems to provide vital, quality combat information directly to users in a timely, actionable manner in accordance with concepts for future force intelligence operations. This Project investigates RF collection and mapping technologies to offer real time emitter detection, location, and identification. In addition, this project enables a remote capability to disrupt, deny, or destroy threat communication signals and enables fusion (automated assimilation and synthesis) of battlefield intelligence data to enable interpretation of current threats and future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Research, Development, and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Intelligence Data Fusion and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes advanced automated exploitation and fusion analysis tools, applications, and software services for the creation of improved intelligence products, common information management and information dissemination systems to facilitate collaboration between intelligence and mission command functions. This will provide relevant and timely information in support of command decisions, such as high value identification and targeting in an asymmetric environment. Work being accomplished under Program Element (PE) 0603772A\/Project 243 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.615"
                                            },
                                            "Text": {
                                                "val": "Designed biometric\/video architecture capable of pulling non-traditional biometric data from disparate video sources and integrate biometric extraction and analysis algorithms into this architecture; experimented with and evaluated software tools for biometric extraction from video sources to determine ability to perform biometric extraction and pull useful intelligence, surveillance and reconnaissance data from the video using the biometric\/video architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.720"
                                            },
                                            "Text": {
                                                "val": "Will assess techniques for identifying necessary patterns and behaviors based on the types of data accessible from pertinent data sources accessed via the intelligence enterprise; design and code algorithms and software predictive analysis tools that support analysis of big data on the intel enterprise to determine patterns, anomalies, and behavior based upon data from various sources; evaluate the performance of tools against defined measures of effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.780"
                                            },
                                            "Text": {
                                                "val": "Will mature predictive analyst tools to determine patterns, anomalies and behavior to correlate and exploit cyber big data sources; develop techniques and software tools to correlate dark web with clear web organizational personas; develop cyber threat indicators and ratios for identification of group patterns, tactics, techniques and procedures; and apply stylometry and authorship principles to cyber content to identify and group adversarial cyber themes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, codes and evaluates cyber architectures, software, tools and techniques that identify and capture data traversing targeted networks for the purpose of computer network operations (CNO) or otherwise countering adversary communications. Cyber capabilities include detection, identification, exploitation, direction finding (DF), geolocation, and denial of service. This effort leverages work being done under the Multi-function Intelligence, Surveillance and Reconnaissance (ISR) Technologies effort in this Project.  Work being accomplished under PE 0603270A\/Project K15 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.618"
                                            },
                                            "Text": {
                                                "val": "Investigated advanced techniques against next-generation signals of interest (SOIs); researched an architecture for resilient operations across cyber, EW and signal intelligence (SIGINT) assets; investigated extending cyber enabled operations to software defined radio platforms such as dismounted\/mounted radio and\/or next generation radar systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.857"
                                            },
                                            "Text": {
                                                "val": "Will investigate additional advanced techniques to perform various SIGINT missions against identified SOIs; begin analysis of requirements for commander to perform command & control functions across security domains; analyze data to determine necessary data models for the delivery of tactically collected cyber electromagnetic activities (CEMA) data to the intelligence enterprise; investigate analytic tools to enhance commander’s situational understanding by adding cyber data input; investigate next generation architecture requirements and research techniques to determine the current configuration state of the operational offensive cyber operations architecture to enable automated replication within a laboratory environment; conduct experiments to validate necessary hardware and software component fidelity within the future architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.984"
                                            },
                                            "Text": {
                                                "val": "Will validate advanced, software techniques to perform various cyber\/EW functions against identified SOIs and devices of interest (DOIs); conclude requirements investigation and analysis of software architecture to allow the tactical commander to direct and control cyber functions from EW and SIGINT platforms across\/within security domains and battlespace domain resources; incorporate the results of cyber laboratory experiments into the next generation architecture requirements and analysis of analytic tools that can inform the commander's situational understanding; and design and code the data models necessary for the delivery of CEMA data products to the intelligence enterprise."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multispectral Threat Warning"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates software and warning sensor\/countermeasure components to increase probability of detection and defeat of small arms and  man-portable air defense system (MANPADS) type threats for aviation platforms using modeling and simulation (M&S) and hardware in the loop (HIL) simulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.104"
                                            },
                                            "Text": {
                                                "val": "Investigated and developed hardware and software simulation environment to assess countermeasures with appropriate levels of simulation fidelity based on threat specifications and studies; explored ways to exploit a second class of emerging threats and assess baseline countermeasure techniques against this second class of emerging threat; developed holistic countermeasure approaches to protect aviation platforms and investigated application of additional technologies to support threat detection as well as optimization of countermeasure performance as part of the holistic approach."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.367"
                                            },
                                            "Text": {
                                                "val": "Will continue to perform threat characterization and countermeasure development for relevant threat targets; perform feasibility study on application of high energy lasers with improved laser technology and material development as countermeasures to existing and emerging threats; incorporate higher fidelity flare simulations into the simulation environment; collect and update data on advanced threats to update optical cross section database for use in simulation environment; incorporate threat characterization data into threat classifier software"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.605"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.605"
                                            },
                                            "Text": {
                                                "val": "Will investigate threat agnostic warning algorithms to increase probability of detection of threats and provide identification and position information to the countermeasure system for an increased probability of defeat; based upon feasibility study results, investigate novel techniques using lasers of higher energy than currently used to increase the probability of defeat of threats not previously encountered; use M&S to develop new threat scenarios and mature HIL simulations that sense the electro-magnetic environment to assess existing countermeasure capabilities against previously unknown threats; investigate higher fidelity countermeasures and incorporate them into the simulation environment; investigate threat agnostic countermeasure techniques against previously unknown threats and investigate the effects of combined EO\/IR\/RF technologies to defeat both multiple and multi-spectral threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Function Intelligence, Surveillance and Reconnaissance Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and codes software algorithms and techniques to intelligently integrate tactical Intelligence, Surveillance, and Reconnaissance (ISR) sensors, improve their individual performance and increase the effectiveness of battlespace awareness\/intelligence data in an area of operations. Efforts focus on networking of sensors and open, scalable common RF architectures for terrestrial and aerial sensors. Work being accomplished under PE 0603270A \/ Project K15 and PE 0603772A \/ Project 243, PE 0602709A\/project H95 and PE 0603701A \/ Project K70 complement this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.011"
                                            },
                                            "Text": {
                                                "val": "Investigated and defined operational\/technical requirements to design an open architecture RF front end for aerial and terrestrial platforms to allow multiple sensors access to platform antenna arrays to avoid redundancy; analyzed and determined specifications to standardize RF distribution networks on aerial and terrestrial platforms to facilitate modularity and the interoperability of RF systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.522"
                                            },
                                            "Text": {
                                                "val": "Will complete overall architecture design, module and processing specs and interfaces for the multi-function (defensive\/offensive electronic attack, electronic support, SIGINT) RF front-end receiver; mature designs of the electronic modules including the low-band and mid-band input modules, pre-selector, N channel receiver, and master control\/ computation\/communications\/power modules; investigate and design the low band circular antenna array and mid band antenna array for terrestrial and aerial applications; begin reference design and development of processing engines for basic direction finding set-on and scan applications; investigate operational and technical requirements to develop high frequency (HF) exploitation software solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.771"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.771"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments on reference design for multi-channel receiver architecture to assess baseline performance of commercial and Goverenment off the shelf (COTS\/GOTS) receivers to determine optimal size, weight, and power and cost for a variety of EW and SIGINT missions, including direction finding and beamforming functions; continue to mature and validate Open RF Architecture interface specifications to support advanced interference mitigation between RF functionalities (e.g., communications, SIGINT and blue force jamming); mature interface specifications of intermediate processing functions to enable multi mission EW and SIGINT operations; standardize application interfaces across cyber, EW and SIGINT mission spaces to enable coordinated command and control (C2) of these capabilities to better address emerging threat signal classes; and begin investigation of Next Generation Radar architecture for compatibility with EW and SIGINT missions and architectures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Architectures and Countermeasures"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates the technical specifications of a family of threats to develop non-kinetic countermeasures. Work being accomplished under PE 0603270A\/Project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.154"
                                            },
                                            "Text": {
                                                "val": "Analyzed modular open RF architecture interfaces to determine vulnerabilities that emerged as component interactions are standardized; continued the evaluation of emerging scheduling algorithms for use within the architecture to coordinate various mission functions (SIGINT, EW, Communications); designed software for automated classification, detection, identification and correlation algorithm to coordinate EW\/SIGINT\/Comms transmissions for real time communications across those mission functions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will complete open RF architecture interface vulnerability analysis; develop and mature robust information assurance vulnerability mitigation techniques for the open RF architecture; begin analysis to apply the open RF architecture to RF capabilities on manned and unmanned airborne platforms; coordinate mitigation strategies and develop mitigation techniques for RF architecture vulnerabilities discovered for emerging SIGINT, EW, Communications scheduling algorithms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi Function Electronic Warfare (MFEW) Technique Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops EW techniques critical to countering communications, such as networked C2 nodes or improvised explosive device threats. The techniques developed are system agnostic and applicable to a wide variety of EW and electronic countermeasure applications, and they can be used to improve the performance and expand the functionality of both current and future EW system capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.004"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "Will investigate and perform vulnerability analysis on emerging commercial communications capabilities and investigate\/develop EW techniques and methods (such as active, reactive, surgical and protocol based software) to defeat specific commercial communications systems while maximizing waveform jamming effectiveness, minimizing transmission time and reducing jamming power."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}