{
    "id": "2018-Army-PB-2040-JBOOK-3e91339aa28ec2881f9549044dc8a7daf4e287c1ca461095f2d8b42bf2f292b8-7",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603747A"
        },
        "ProgramElementTitle": {
            "val": "Soldier Support and Survivability"
        },
        "R1LineNumber": {
            "val": "60"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.035"
            },
            "CurrentYear": {
                "val": "10.506"
            },
            "BudgetYearOne": {
                "val": "13.157"
            },
            "BudgetYearOneBase": {
                "val": "10.157"
            },
            "BudgetYearOneOCO": {
                "val": "3.000"
            },
            "BudgetYearTwo": {
                "val": "8.640"
            },
            "BudgetYearThree": {
                "val": "7.662"
            },
            "BudgetYearFour": {
                "val": "8.519"
            },
            "BudgetYearFive": {
                "val": "8.646"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element supports component development and prototyping for organizational equipment, improved individual clothing and equipment that enhance Soldier battlefield effectiveness, survivability, and sustainment.  This program element also supports the component development and prototyping of joint service food and combat feeding equipment designed to reduce logistics burden."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.301"
                },
                "CurrentYear": {
                    "val": "10.506"
                },
                "BudgetYearOne": {
                    "val": "12.840"
                },
                "BudgetYearOneBase": {
                    "val": "12.840"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.035"
                },
                "CurrentYear": {
                    "val": "10.506"
                },
                "BudgetYearOne": {
                    "val": "13.157"
                },
                "BudgetYearOneBase": {
                    "val": "10.157"
                },
                "BudgetYearOneOCO": {
                    "val": "3.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.734"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.317"
                },
                "BudgetYearOneBase": {
                    "val": "-2.683"
                },
                "BudgetYearOneOCO": {
                    "val": "3.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.734"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.317"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.683"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "3.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2016 increase of $0.734M reflects adjustment to actuals \nFY2018  Base decrease of $2.683M - Rapid Equipping Force decrease of $2.683M (Program Evaluation Group Decision).\nFY2018 OCO Increase of $3.000M -  Army Rapid Equipping Force OCO requirement"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "610"
                    },
                    "ProjectTitle": {
                        "val": "Food Adv Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.020"
                        },
                        "CurrentYear": {
                            "val": "5.299"
                        },
                        "BudgetYearOne": {
                            "val": "6.548"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.548"
                        },
                        "BudgetYearTwo": {
                            "val": "4.648"
                        },
                        "BudgetYearThree": {
                            "val": "4.158"
                        },
                        "BudgetYearFour": {
                            "val": "4.273"
                        },
                        "BudgetYearFive": {
                            "val": "4.225"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for the advanced component development and prototyping of joint service food and combat feeding equipment designed to reduce the logistics burden and Operation and Support (O&S) costs of subsistence support to service personnel. Project supports development of rations and rapidly deployable field food service equipment.  Project conducts demonstration and validation of improved subsistence and subsistence support items used to enhance soldier effectiveness and quality of life in all four Services, as part of an integrated Department of Defense (DoD) Food Research, Development, Test, Evaluation and Engineering Program. The Program is reviewed and validated twice annually by the DoD Combat Feeding Research and Engineering Board (CFREB) as part of the Joint Service Food Program.  This project develops critical enablers that support the Joint Future Force Capabilities and the Joint expeditionary mindset by maintaining readiness through fielding and integrating new equipment. This equipment enhances the field soldier's well-being and provides the soldier with usable equipment, in addition to reducing sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, combat zone footprint, and costs for logistical support.\n\nThis PE\/Project supports Field Feeding Programs for all the services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fielded Individual Ration Improvement Project (FIRIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement of project for the Meal, Ready to Eat (MRE) through the advanced development of novel nutrition, processing and packaging technologies to improve operational effectiveness and improve logistics."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.895"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct in-house product development of food components and identify suitable COTS\/NDI candidate items for fielded individual operational rations (e.g. MRE 2020 date of pack) to enhance Warfighter acceptability, increase consumption and improve nutritional intake. Conduct pilot scale in-house production to support engineering design, technology insertion, and commercial producibility. Will develop, integrate and validate state-of-the art science and technology, food processing and primary\/secondary packaging innovations into individual ration platforms to increase operational effectiveness. Optimize food component processing and packaging to introduce targeted items\/capabilities into individual ration platforms for enhanced acceptability, nutrition and performance. Will transition to 6.5 for operational testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.663"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.663"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct in-house product development of food components and identify suitable COTS\/NDI candidate items for fielded individual operational rations (MRE 2021 date of pack) to enhance Warfighter acceptability, increase consumption and improve nutritional intake. Will conduct pilot scale in-house production to support engineering design, technology insertion, and commercial producibility. Will develop, integrate and validate state-of-the art science and technology, food processing and primary\/secondary packaging innovations into individual ration platforms to increase operational effectiveness. Will optimize food component processing and packaging to introduce targeted items\/capabilities into individual ration platforms for enhanced acceptability, nutrition and performance. Will transition to 6.5 for operational testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assault\/Special Purpose Ration Improvement Project (ASPIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement of special purpose rations through the advanced development of novel nutrition, processing and packaging technologies to improve operational effectiveness and improve logistics. Special purpose rations include the Meal, Cold Weather\/Long Range Patrol (MCW\/LRP), First Strike Ration (FSR), and Modular Operational Ration Enhancement (MORE)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.519"
                                            },
                                            "Text": {
                                                "val": "Continue to identify COTS\/NDI components for the MCW\/LRP, FSR and\/or MORE to enhance acceptability, variety, consumption and nutritional value of scenario-specific combat rations based on user feedback, focus groups, emerging products and technologies and user requirements. Conduct accelerated and long term storage studies on candidate components. Transition to 6.5 for operational testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.463"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.463"
                                            },
                                            "Text": {
                                                "val": "Will continue to identify COTS\/NDI components for the MCW\/LRP, FSR and\/or MORE to enhance acceptability, variety, consumption and nutritional value of scenario-specific combat rations based on user feedback, focus groups, emerging products and technologies and user requirements. Will conduct accelerated and long term storage studies on candidate components. Will transition to 6.5 for operational testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fielded Group Ration Improvement Project (FGRIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement project to update\/improve group ration components, menus, and packaging by integrating state-of-the-art military\/commercial packaging and technology base transitions. The family of Unitized Group Rations (UGRs) includes the Unitized Group Ration - Heat & Serve (UGR-H&S), Unitized Group Ration - Express (UGR-E), Unitized Group Ration - A (UGR-A), and Unitized Group Ration - M (UGR-M)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.831"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to update\/improve components, menus and packaging to increase consumption and overall nutritional intake of the family of Unitized Group Rations for UGR-A (FY19 menus), M, E and H&S (2018 date of pack). Identify COTS\/NDIs and\/or develop new food components in-house, conduct in-house testing, down-select items and develop test menus for Warfighter evaluation. Develop, integrate and validate state-of-the-art science and technology, food processing and primary\/secondary packaging innovations into group ration platforms to increase operational effectiveness, functionality and improve logistics. Transition to 6.5 for operational testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.062"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.062"
                                            },
                                            "Text": {
                                                "val": "Will continue efforts to update\/improve components, menus and packaging to increase consumption and overall nutritional intake of the family of Unitized Group Rations for UGR-A, M, E and H&S future year menus. Identify COTS\/NDIs and\/or develop new food components in-house, conduct in-house testing, down-select items and develop test menus for Warfighter evaluation. Will develop, integrate and validate state-of-the-art science and technology, food processing and primary\/secondary packaging innovations into group ration platforms to increase operational effectiveness, functionality and improve logistics. Will continue to transition to 6.5 for operational testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "US Navy Standard Core Menu (NSCM) Continuous Product Improvement Project"
                                    },
                                    "Description": {
                                        "val": "Provide recommendations to the Naval Supply Systems Command (NAVSUP) for upgrading\/improving Navy Standard Core Menu components by introducing new preparation techniques to enhance menu acceptance and effectiveness while reducing labor requirements."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.344"
                                            },
                                            "Text": {
                                                "val": "Continue to identify and validate COTS\/NDI candidate enhancements to the NSCM. Will test and evaluate new products and techniques using Navy Galley equipment. Provide recommendations for improving menu components by introducing new commercial items and state-of-the-art food preparation and feeding techniques to enhance menu acceptance and reduce labor requirements. Transition product summaries and results\/recommendation to NAVSUP for adoption and procurement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.463"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.463"
                                            },
                                            "Text": {
                                                "val": "Will continue to identify and validate COTS\/NDI candidate enhancements to the NSCM. Will test and evaluate new products and techniques using Navy Galley equipment. Will provide recommendations for improving menu components by introducing new commercial items and state-of-the-art food preparation and feeding techniques to enhance menu acceptance and reduce labor requirements. Will transition product summaries and results\/recommendation to NAVSUP for adoption and procurement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Block Upgrades and Operational Improvements for Expeditionary Field Feeding Equipment."
                                    },
                                    "Description": {
                                        "val": "Eliminate the sole sourcing of tray ration heater component parts. Reduce overall water consumption through the use of non-immersive cooking technologies and more efficient ware-washing equipment. Increase Kitchen flexibility through appliance upgrades. To reduce the overall fuel consumption of Expeditionary Field Feeding Equipment through enhanced combustion technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.351"
                                            },
                                            "Text": {
                                                "val": "Coordinate and conduct demonstration & validation (DV) of prototypes to support modification\/replacement of USMC field feeding equipment. Transition to 6.5."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Purpose Individual Heating Technology (MIT)"
                                    },
                                    "Description": {
                                        "val": "Develop a disposable, lightweight heating mechanism as a low-cost component of the Meal, Cold Weather\/Long Range Patrol (MCW\/LRP) to facilitate preparation of operational rations in extreme environments with reduced resource requirements and increased ease of use."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.315"
                                            },
                                            "Text": {
                                                "val": "Evaluate MIT prototypes transitioned to 6.4. Will conduct in-house test and evaluation (T&E), and transition results to 6.5."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.496"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.496"
                                            },
                                            "Text": {
                                                "val": "Will evaluate MIT prototypes transitioned to 6.4. Will conduct in-house test and evaluation (T&E), and transition results to 6.5 for Engineering and Manufacturing Development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Intuitive Multi-function Kitchen Equipment (JIMKE)"
                                    },
                                    "Description": {
                                        "val": "Reduce logistics burden associated with life cycle management of Navy (USN), Air Force (USAF) and Marine Corps (USMC) foodservice equipment. Integrate diagnostic technologies to predict maintenance, reduce labor associated with troubleshooting equipment in the field, and increase mean time between failures (MTBF)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.533"
                                            },
                                            "Text": {
                                                "val": "Develop required contract documentation to procure equipment prototypes with multi-functional capabilities for USN, USAF, and USMC. Award contracts based on specifications for each Service and begin in-house prototype test and evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.730"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.730"
                                            },
                                            "Text": {
                                                "val": "Will complete in-house prototype test and evaluation, and transition to 6.5 for operational testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Galley and Scullery Upgrades"
                                    },
                                    "Description": {
                                        "val": "Continuously modernize foodservice operations by adding capabilities to provide optimized feeding, standardizing foodservice equipment assets fleet-wide, improving space utilization, and facilitating the continued use of the NSCM. Design, processes and equipment insertions will be implemented on legacy platforms during overhaul periods and during the new construction process on future vessels."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.445"
                                            },
                                            "Text": {
                                                "val": "Identify advanced equipment technologies to support existing and new ship class designs to support the Galley and Scullery operations. Conduct in-house testing of equipment recommended by Navy subject matter experts. Transition T&E reports to USN."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.680"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.680"
                                            },
                                            "Text": {
                                                "val": "Will identify advanced equipment technologies to support existing and new ship class designs to support the Galley and Scullery operations. Conduct in-house testing of equipment recommended by Navy subject matter experts. Will transition T&E reports to USN."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Greywater Recycling for the Basic Expeditionary Airfield Resources (BEAR) Kitchen Systems"
                                    },
                                    "Description": {
                                        "val": "Leverage NDI and COTS greywater filtration technologies to reduce operating and support (O&S) costs for the BEAR kitchen system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.337"
                                            },
                                            "Text": {
                                                "val": "Review current Army science & technology efforts related to greywater recycling systems and conduct market research of existing commercial systems. Prepare Statements of Work (SOWs) and other required contract documents. Award contract to procure a greywater system to support Air Force BEAR kitchen and sanitation operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Integrated Kitchen System (MIKS)"
                                    },
                                    "Description": {
                                        "val": "Design a standardized mounting system for all Galley equipment to significantly reduce technical labor skills required to complete deck modifications. MIKS will standardize electrical and water requirements, enhance procurement options, decrease operating and support (O&S) costs, and increase the speed of installing new technologies into the Galley\/Scullery areas."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.319"
                                            },
                                            "Text": {
                                                "val": "Identify and evaluate potential NDI\/COTS solutions. Prepare SOWs and other required contract documents. Award contract to build integrated modular rail system to support integration of equipment into galley operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Logistics Agency (DLA)"
                                    },
                                    "Description": {
                                        "val": "Support management of the Department of Defense (DoD) Electronic Document Access (EDA) and Wide Area Workflow (WAWF) programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.020"
                                            },
                                            "Text": {
                                                "val": "Funded DLA Document Services to support management of the DoD EDA and WAWF programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.410"
                                            },
                                            "Text": {
                                                "val": "Fund DLA Document Services to support management of the DoD EDA and WAWF programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.586"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.586"
                                            },
                                            "Text": {
                                                "val": "Will fund DLA Document Services to support management of the DoD EDA and WAWF programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tray Ration Heater – Improved (TRH-I)"
                                    },
                                    "Description": {
                                        "val": "Develop an updated and compact Tray Ration Heater to meet the requirements of the smaller, up-armored HMMWV cargo beds.  Reduce the overall weight, improve man-portability, heat transfer efficiency, thermal storage efficiency, and reduce water consumption. Meet USMC approved Statement of Need requirement for a Modernized Tray Ration Heat System."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.495"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.495"
                                            },
                                            "Text": {
                                                "val": "Will develop TRH-I SOW and technical objectives. Will prepare contract documentation and award TRH-I development contract."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Inflatable Refrigerated Space (IRefS)"
                                    },
                                    "Description": {
                                        "val": "Develop a pallet sized, rapidly deployable, air deliverable field refrigeration system for safe storage of UGR-A rations to units located in austere environments with little to no ability to obtain rigid refrigerated containers."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.610"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.610"
                                            },
                                            "Text": {
                                                "val": "Will develop SOW with objective and threshold performance criteria and award contract to design and fabricate a high fidelity IRefS prototype."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Mobile Feeding Galley"
                                    },
                                    "Description": {
                                        "val": "Develop a mobile feeding system that is equipped with innovative cooking technology. The platform will have the capability to produce a rotating menu of fresh and healthy cuisine that will appeal to the millennial generation of sailors."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Will conduct market research to define equipment needs.  Will prepare SOW and contract documents for modified or prototype mobile system and award contract."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "06054713A .548"
                                    },
                                    "Title": {
                                        "val": "RDTE Combat Feeding, Clothing & Equip, Military Subsistence System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.374"
                                        },
                                        "CurrentYear": {
                                            "val": "0.759"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.700"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.700"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.962"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.786"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.828"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.705"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "06054713A EL2"
                                    },
                                    "Title": {
                                        "val": "RDTE Combat Feeding, Clothing & Equip, Army Field Feeding Equip"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.320"
                                        },
                                        "CurrentYear": {
                                            "val": "1.295"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.002"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.002"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.179"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.207"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.865"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.032"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "06043747A .EL1"
                                    },
                                    "Title": {
                                        "val": "RDTE Soldier Support & Survivability - Army Field Feeding Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.108"
                                        },
                                        "CurrentYear": {
                                            "val": "1.948"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.447"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.447"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.992"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.504"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.246"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.421"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "M65801"
                                    },
                                    "Title": {
                                        "val": "OPA Refrigerated Container Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.354"
                                        },
                                        "CurrentYear": {
                                            "val": "7.459"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.877"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.877"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.660"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.165"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.253"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.137"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Project development will transition to Engineering & Manufacturing Development and production."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C08"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Equipping Force"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.907"
                        },
                        "CurrentYear": {
                            "val": "3.259"
                        },
                        "BudgetYearOne": {
                            "val": "6.162"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.162"
                        },
                        "BudgetYearOneOCO": {
                            "val": "3.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.000"
                        },
                        "BudgetYearThree": {
                            "val": "3.000"
                        },
                        "BudgetYearFour": {
                            "val": "3.000"
                        },
                        "BudgetYearFive": {
                            "val": "3.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Equipment mix and configuration may change based on changes in operational environment and circumstances."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Rapid Equipping Force (REF) supports Combatant Command (COCOM)\/Army Service Component Command (ASCC) based on emerging rapid equipment requirements.  The REF is an enduring organization (Base funded) per Memorandum, Under Secretary of the Army, 30 Jan 2014, subject:  Implementation Plan for Stabilization of the Rapid Equipping Force (REF). \n\nThe REF is the Army’s Quick Reaction Capability (QRC) with the ability to acquire, integrate and sustain Commercial-Off-The Shelf (COTS), Government Off-The-Shelf (GOTS), Non-Developmental Item (NDI), and non-standard equipment solutions to meet urgent combat requirements for globally employed forces.  It inserts selected future force technologies, capabilities, and surrogate materiel solutions into deployed, deploying, select-prepared to deploy, and transformational forces for operational evaluation, assessment, and evolutionary development.   The REF assesses the provided capabilities to improve future solutions to inform materiel development for the future Army capability requirements and to potentially transition the capability to an Army acquisition program.\n\nThe REF bridges the gap between the Army’s traditional acquisition process and immediate equipping needs.  The REF pursues tangible solutions that can be equipped rapidly with a goal of 180 days.  The REF focuses on finding immediate and effective game-changing capabilities to increase Soldier Readiness, effectiveness, protection, and lethality in any operational environment.  The REF 10-Liner process provides the ability to react quickly to an ever-changing enemy who changes in days and months, not years in a complex world.  The REF coordinates with the COCOMs\/ASCCs in theater to fully understand their urgent needs, for which the REF acquisition capability may identify, procure, deliver, and sustain solutions to the deployed units.  Although the REF works directly with Operational Commanders at all levels, it focuses on Brigade level and below to equip solutions to identified capability gaps.\n\nThe Army Acquisition Executive designated Program Executive Office (PEO) Soldier as the Milestone Decision Authority (MDA) to institutionalize the acquisition authorities in support of the REF and to provide proper acquisition oversight while enhancing visibility of these efforts.  The MDA will ensure flexibility and speed focused on the Soldier’s needs serviced by the dedicated REF Program Management Office (PMO).  This establishes a formal acquisition reporting chain that leverages existing reporting venues to ensure appropriate ASA (ALT) visibility, oversight, and direction.  \n\nThe REF capabilities cross all Warfighter Functions:\n1.\tMission Command\n2.\tMovement and Maneuver\n3.\tIntelligence \n4.\tFires\n5.\tSustainment\n6.\tProtection \n\nThe REF FY18 RDT&E request is $3.162 million (Base) and $3.000 million (OCO) and is for system integration, testing, and evaluation to support project requirements.   \n\nThe RDT&E funding also provides the REF the flexibility to invest in near-term, and innovative solutions.  RDT&E funds are necessary in the majority of all REF projects.  Most importantly, REF requires RDT&E funds to conduct safety certification (testing) for non-standard equipment before it is equipped to the Soldier.  This critical requirement exists to ensure that REF-provided equipment is safe for Soldiers to use and that any risks are identified and documented.  The REF also requires RDT&E funds to integrate several different COTS\/GOTS and NDI technologies into one capability that solves the tougher and more complex problems.  RDT&E funds maybe used to further develop high (>6) Technology Readiness Level (TRL) systems or advanced technologies in conjunction with industry and Other Governmental Agencies (OGAs).  Frequently, these technologies only need small amounts of funding to help them achieve a maturity level that is suitable to solve deployed U.S. Army Forces problems.  \n\nThe REF requires RDT&E funds to modify, test, and evaluate existing technologies that were developed for one purpose, however may be suitable to solve another problem.  REF will also fund deliberate projects in support of technology-solution-scouting to meet anticipated Army needs and to mitigate operational gaps.  These efforts measure and identify current technologies, and provide information to better inform Army Training and Doctrine Command (TRADOC) and other communities of interest, with the intent of enlightening future Army requirements.  Example efforts that may require RDTE include the following projects:  Tactical Satellite Communications (SATCOM) and communications systems; tactical and small Combat Out Post\/Forward Operating Base (COP\/FOB) Intelligence, Surveillance, and Reconnaissance (ISR) and Force Protection systems; Counter Unmanned Aerial Systems (CUAS); Electronic Warfare (EW); Non-Tactical Vehicles (NTV); Persistent Duration UAS, and Subterranean (SubT) Operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapid Equipping Force"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.907"
                                            },
                                            "Text": {
                                                "val": "The demand for REF 10-liner requirements is based on the increased tempo of transitioning brigades in Operation Freedom Sentinel (OFS) with nine (9) month deployments; the expansion of brigades’ operational environments (OEs) that require units to operate in larger more isolated areas, and a new force structure and role in OFS.  Additionally, increased Army OPTEMPO requirements in other areas of responsibility, such as USAREUR, USARPAC, and USARAF, and support for the Global Response Force (GRF) have continued to generate increased demands for REF support.  At the end of FY16, the REF had 551 total requirements - 419 OCO requirement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.259"
                                            },
                                            "Text": {
                                                "val": "The REF partners with ASCCs forces and Army SOF community to perform DS to globally deployed Soldiers and regionally aligned BCTs.  The REF anticipates increased uncertainty regarding the future of OIR and other operations in the CENTCOM AOR requiring additional flexibility to develop technological solutions supporting the reduced numbers of Soldiers operating globally in order to fill force protection gaps in the face of a smaller and more lethal terrorism threat.  The REF expects to increase our engagement with the ASCCs in order to address capability gaps generated by geographical and environmental constraints and improve our understanding of evolving threats and operating conditions within the respective ASCC areas of operations.   The REF also expects to play a much more deliberate role in providing support to the Global Response Force as they prepare for a wider range of response missions.  In accordance with REF’s participation in the Office of Secretary of Defense (OSD) led quick reaction capability effort, the Army determined the REF would provide the Army’s warm base capability with ~590 (Base\/OCO) requirements in FY17 and beyond.\n\nFor FY17 the REF projects ~590 (Base\/OCO) requirements in the following REF Warfighter Functions:.\n\n1 – Mission Command (49K)\n2 – Movement and Maneuver (97K)\n3 – Intelligence  (39K)\n4 – Fires  (4K)\n5 – Sustainment (46K)\n6 – Protection  (91K)\n\nThe REF anticipates ATEC testing and evaluation cost of $2.933 million. The REF requires RDT&E funds to test technologies in order to ensure suitability and safety before equipping the Soldier – any modified COTS\/GOTS\/NDI items has to be tested."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.162"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.162"
                                            },
                                            "Text": {
                                                "val": "The REF partners with ASCC forces and Army SOF community to support globally deployed Soldiers and regionally aligned BCTs in all areas of responsibility.  The REF anticipates increased uncertainty regarding the future of OIR and other operations in the CENTCOM AOR requiring additional flexibility to develop technological solutions supporting the reduced numbers of Soldiers operating globally in order to fill force protection gaps in the face of a lethal terrorism threat.  The REF expects to increase its engagement with the ASCCs to address capability gaps generated by geographical and environmental constraints. Conversely, the REF will increase its understanding of evolving threats and operating conditions within the respective ASCC areas of operations.   The REF also expects to play a much more deliberate role in providing support to the GRF as they prepare for a wider range of response missions. In accordance with REF’s participation in the Office of Secretary of Defense (OSD) led quick reaction capability effort, the Army determined the REF would provide the Army’s warm base capability at ~600 (Base\/OCO) requirements in FY18 and beyond.\n\nFor FY18 the REF projects ~600 (Base\/OCO) requirements in the following REF Warfighter Functions:\n\n1.\tMission Command ($48K)\n2.\tMovement and Maneuver ($96K)\n3.\tIntelligence ($38K)\n4.\tFires ($3K)\n5.\tSustainment ($44K)\n6.\tProtection ($88K)\n\nThe REF anticipates ATEC testing and evaluation cost of $2.845million.  The REF requires RDT&E funds to test technologies in order to ensure suitability and safety before equipping the Soldier – any modified COTS\/GOTS\/NDI item has to be tested."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "The FY18 OCO funding is required to support emerging requirements to meet capability gaps in Operation Freedom Sentinel (OFS), Operation Inherent Resolve (OIR), Operation Atlantic Resolve (OAR), Horn of Africa (HOA), and all OCO funded operations\/regions.\n\nFor FY18 the REF projects ~600 (Base\/OCO) requirements in the following REF Warfighter Functions:  \n\n1.\tMission Command ($45K)\n2.\tMovement and Maneuver ($90K)\n3.\tIntelligence ($36K)\n4.\tFires ($3K)\n5.\tSustainment ($42K)\n6.\tProtection ($84K)\n\nThe REF anticipates ATEC testing and evaluation cost of $2.700million.  The REF requires RDT&E funds to test technologies in order to ensure suitability and safety before equipping the Soldier – any modified COTS\/GOTS\/NDI item has to be tested."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "M80101"
                                    },
                                    "Title": {
                                        "val": "Rapid Equipping Soldier Support Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.403"
                                        },
                                        "CurrentYear": {
                                            "val": "26.503"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.500"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "8.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "121018000"
                                    },
                                    "Title": {
                                        "val": "Operations and Maintenance, Army, 121018000"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "92.519"
                                        },
                                        "CurrentYear": {
                                            "val": "45.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.933"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "26.067"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.288"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.729"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.096"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.274"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The REF harnesses current and emerging technologies to provide rapid solutions to the urgently required capabilities of U.S. Army Forces employed globally.   The REF focus is on rapidly placing capabilities into Soldiers' hands.  This mission is accomplished in one of two ways: 1) rapidly adapting COTS\/GOTS\/NDI equipment to meet operational needs, and 2) developing emerging deployable capability via interaction with research and development organizations and academia.  All capabilities are safety tested prior to insertion into operational environments.  Training and sustainment are provided for every capability until it is transitioned to an approved acquisition program or terminated through an approved Army process.  Operational assessments are conducted to provide feedback in support of Army requirements generation and future capability development.  REF capabilities routinely serve as a bridge to specific ONS, JUONS, and JEONS gaps to meet urgent operational requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EL1"
                    },
                    "ProjectTitle": {
                        "val": "Army Field Feeding Programs"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.108"
                        },
                        "CurrentYear": {
                            "val": "1.948"
                        },
                        "BudgetYearOne": {
                            "val": "0.447"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.447"
                        },
                        "BudgetYearTwo": {
                            "val": "0.992"
                        },
                        "BudgetYearThree": {
                            "val": "0.504"
                        },
                        "BudgetYearFour": {
                            "val": "1.246"
                        },
                        "BudgetYearFive": {
                            "val": "1.421"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "2016 shall be the first funded year for the Army Field Feeding Programs Element."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the advanced component development and prototyping of Army food and combat feeding equipment designed to reduce the logistics burden and Operation and Support (O&S) costs of subsistence support to service personnel. Project supports development of rapidly deployable field food service equipment in coordination with ration development efforts. Project conducts demonstration and validation of improved subsistence support items used to enhance soldier effectiveness and quality of life in the Army and the other military services, as coordinated with the Department of Defense (DoD) Food Research, Development, Test, Evaluation and Engineering Program. This project develops critical enablers that support the Joint Future Force Capabilities and the Joint Expeditionary Mindset by maintaining readiness through fielding and integrating new equipment. This equipment enhances the field soldier's well-being and provides the soldier with usable equipment, in addition to reducing sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, combat zone footprint, and costs for logistical support.\n\nThis PE\/Project supports Field Feeding programs for the Army."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battlefield Kitchen (BK) technology development effort"
                                    },
                                    "Description": {
                                        "val": "Provide replacement of the obsolete Mobile Kitchen Trailer (MKT) system. The BK shall replace the MKT with a kitchen that provides fuel efficient, thermally controlled, closed combustion appliances within an environmentally controlled workspace. The BK shall provide rations for up to 300 Soldiers within 4 hours of setup. The BK provides refrigeration, running water and a heated serving line using the same off-road prime mover as the MKT as well as transportability by rail, sea, fixed and rotary wing aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.108"
                                            },
                                            "Text": {
                                                "val": "Completed evaluation of appliances integrated with Jet Propellant 8 (JP-8) fired burners developed in the Science and Technology (S&T) phase as culmination of technology transfer agreement. Obtained approval of milestone A\/B program documentation from MDA. Awarded development contract that includes options for production."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.948"
                                            },
                                            "Text": {
                                                "val": "Complete transition of BK into Engineering and Manufacturing Development (EMD) phase. Complete design and build of BK component and subsystems. Initiate Integrated Logistics Support (ILS) development through the development contract."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ethylene Control Device (ECD) for Multi Temperature Refrigerated Container System (MTRCS)"
                                    },
                                    "Description": {
                                        "val": "Develop a compact, low power, automated system that decomposes ethylene inside the MTRCS to extend the shelf life of fresh fruits and vegetables.  The 300-watt ECD provides an average two week shelf life extension of fresh produce and can be operated independently or in unison with the MTRCS refrigeration system and can be permanently or temporarily mounted with no negative impact to the MTRCS storage capacity. (MTRCS Operational Requirements Document (ORD) approved Apr 2002)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Transition mature ethylene control technology from the Navy and Army Science and Technology (S&T) into a functioning MTRCS. The MTRCS refrigeration system cycles on as needed and as such does not always supply power to the ECDs. The effectiveness of reduced ethylene control shall be evaluated by PM-FSS in a static setting without the use of actual rations. Parasitic power draw on the MTRCS electrical system, effects of added heat and weight shall be tested and evaluated for possible transition into the MTRCS Program of Record as an Engineering Change to fielded and newly produced MTRCS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deployable Sustainable Efficient Refrigeration Technology (DESERT)"
                                    },
                                    "Description": {
                                        "val": "Develop enhanced refrigeration unit that uses a lower Global Warming Potential (GWP) refrigerant than the current MTRCS. The DESERT makes use of R-134A as the working fluid. R-134A has a GWP of ~1300 as compared to the current MTRCS refrigerant R404A which has a GWP of ~3900. The redesigned refrigeration unit offers greater fuel efficiency, operation at real sun\/desert temperatures of 135F, increased reliability and the ability to make use of alternate power sources to augment efficiency. The DESERT refrigeration unit shall be backwards compatible to the MTRCS for continuing procurement and as a replacement. (MTRCS ORD approved Apr 2002)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.247"
                                            },
                                            "Text": {
                                                "val": "The DESERT shall be transitioned from Army S&T to the EMD phase of development through a technology transition agreement. Breadboard systems have been developed and shall complete preliminary testing in FY17. Mature prototypes shall be procured in FY18 and inserted into used MTRCS to verify compatibility and evaluate  initial performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDT&E 654713.EL2"
                                    },
                                    "Title": {
                                        "val": "Army Field Feeding Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.320"
                                        },
                                        "CurrentYear": {
                                            "val": "1.295"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.002"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.002"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.179"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.207"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.865"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.032"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPA M65806"
                                    },
                                    "Title": {
                                        "val": "Assault Kitchen, Field Feeding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.964"
                                        },
                                        "CurrentYear": {
                                            "val": "7.750"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.608"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.608"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.129"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.565"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.145"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.268"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPA M65801"
                                    },
                                    "Title": {
                                        "val": "Refrigerated Container System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.354"
                                        },
                                        "CurrentYear": {
                                            "val": "7.459"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.877"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.877"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.660"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.165"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.253"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.137"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Project development will transition to System Development & Demonstration and into production after thorough testing."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}