{
    "id": "2018-Army-PB-2040-JBOOK-8aa6116a07f4d60601a05c4a1332e7f28609a7e32c0f8c7666562466c33015eb-35",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0303140A"
        },
        "ProgramElementTitle": {
            "val": "Information Systems Security Program"
        },
        "R1LineNumber": {
            "val": "214"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "31.032"
            },
            "CurrentYear": {
                "val": "38.280"
            },
            "BudgetYearOne": {
                "val": "132.438"
            },
            "BudgetYearOneBase": {
                "val": "132.438"
            },
            "BudgetYearTwo": {
                "val": "90.008"
            },
            "BudgetYearThree": {
                "val": "53.033"
            },
            "BudgetYearFour": {
                "val": "22.848"
            },
            "BudgetYearFive": {
                "val": "20.752"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Information Assurance Development supports the implementation of the National Security Agency (NSA) developed Communications Security (COMSEC) technologies within the Army by providing COMSEC system capabilities through encryption, trusted software or standard operating procedures, and integrating these mechanisms into specific systems in support of securing the Army Tactical and Enterprise Networks.  This entails architecture studies, system integration and testing, developing installation kits, and certification and accreditation of Automation Information Systems. The program assesses, develops and integrates Cyber Security (CS)\/COMSEC tools (hardware and software) which provide protection for fixed infrastructure post, camp and station networks as well as tactical networks.  The cited work is consistent with Strategic Planning Guidance and the Army Modernization and Strategy Plan.\n\nInformation Assurance Development funding Implements and establishes functional and technical boundaries of cryptographic, key management and Information Assurance (IA) capabilities In Coordination With (ICW) the NSA, the Defense Information Systems Agency (DISA), and Joint Services, to secure National Security Systems (NSS), and National Security Information (NSI).  Technical evaluations assess the security, operational effectiveness and network interoperability of advanced concept technologies to develop policies, standards, and fundamental building blocks for Army COMSEC capabilities that reduce the risk of future material solutions that could underperform and disrupt classified operations. Develop and publish the Cryptographic Modernization strategy to identify, standardize, and govern the insertion of CS capabilities to bridge operational gaps and support the Department of Defense (DoD) and NSA mandated requirements to enhance network capacity while providing for secure information exchange of voice, video, and data IAW the Army Network Campaign Plan.  This will be accomplished by interoperability evaluation, standards testing, and CS , System of System Network Vulnerability Assessments (SoS NVA) for Army Capability Sets for CS\/COMSEC capabilities that provide protections for tactical and fixed infrastructure post, camp, and station networks. \n\nThe Defensive Cyberspace Operations (DCO) program provides initial capabilities that enable passive and active cyberspace defense operations to preserve friendly cyberspace capabilities and protect data, networks, net-centric capabilities, and other designated systems.  Big Data Pilot provides an advanced analytics capability capable of ingesting structured, semi-structured, and unstructured data from multiple data sources (e.g., Joint Regional Security Stacks (JRSS), intrusion detection systems, intrusion prevention systems, network device log files, trouble tickets, firewalls, proxies, web and applications server log files, etc) and proves situational awareness of cyberspace battlefield.  It provides the computer network defense provider with common analytic platform which informs and reduces risk associated with future material solutions and forms a blueprint for future Big Data Analytics.  Big Data (analysis-of-all DoD Information Network sensor data) provides two optimized and accredited clusters deployed in support of JRSS and Defense Research and Engineering Network (DREN) with a tools suite accessible to Cyber Mission Forces via secure remote access.  The Army's DCO activities are a construct of active cyberspace defenses which provide synchronized, real-time capability to discover, detect, analyze, and mitigate threats to and vulnerability of DoD networks and systems. \n\nThe Army Key Management System (AKMS) is the Army's implementation of the NSA Electronic Key Management System (EKMS) program automating the functions of COMSEC electronic key management, control, planning, and distribution.  AKMS supports the Army's ability to communicate and distribute data on the Army's tactical and strategic networks by limiting adversarial access to, and reducing the vulnerability of, Army Command, Control, Communications, Computers, Intelligence (C4I) systems.  The AKMS System of Systems (SoS) systems components are the Local COMSEC Management Software (LCMS), Automated Communications Engineering Software (ACES) and Simple Key Loader (SKL).  The NSA EKMS program is being replaced by the NSA Key Management Infrastructure (KMI) Program.  The transition of the legacy EKMS LCMS to the modern KMI Management Client (MGC) Nodes began in FY12 and must be completed by the EKMS Tier 2 sunset date of December 2017.  AKMS supports the transition to Army Key Management Infrastructure (AKMI). \n \nThe AKMI is the Army's implementation of the NSA KMI ACAT IAM program.  AKMI supports DoD Global Information Grid (GIG) Net Centric and Cryptographic Modernization Initiatives (CMI) and supports emerging requirements transitioned from the AKMS.  AKMI automates the functions of COMSEC electronic key management, control, planning, and distribution.  AKMI supports the Army's ability to communicate and distribute data on the Army's tactical and strategic networks by limiting adversarial access to, and reducing the vulnerability of, Army Command, Control, Communications, Computers, Intelligence (C4I) systems.  The AKMI Program includes the MGC nodes, ACES and Next Generation Load Device (NGLD) Family of devices to include the NGLD Small, Medium and Large.  AKMI provides an integrated, operational environment that brings essential key management functions in-band.  Objective AKMI will leverage NSA KMI program to provide secure software provisioning, will support legacy and modern ECU’s, simplifies all aspects of key provisioning and ECU management with traceability to individuals, expands operations to DoD unclassified networks, North Atlantic Treaty Organization (NATO) and Coalition users, automates manual business processes to increase Soldier efficiency, transforms key delivery from manual to an automate enterprise service and will provide an Over the Network Keying (OTNK) capability to support CMI. \n\nThe Crypto Modernization program supports using NSA developed COMSEC technologies within the Army providing encryption, trusted software, or standard operating procedures, and integrating these mechanisms into specified systems in support of securing the Army Tactical and Enterprise Network.  This entails architecture studies, system integration and testing, developing installation kits, and certification and accreditation of Automation Information Systems.  The program assesses, develops and integrates emerging CS\/COMSEC tools (hardware and software) which provide protection for fixed infrastructure post, camp, and station networks as well as tactical networks.  The cited work is consistent with Strategic Planning Guidance and the Army Modernization and Strategy Plan.\n\nEmbedded Cryptographic Modernization Initiative (ECMI) is an upgrade activity that will ensure enduring Army radios remain secure by operating with modern cryptographic algorithms and keys.  Tactical radios using embedded cryptographic systems will no longer be able to communicate securely after cease key dates documented in the Chairman of the Joint Chiefs Staff instruction (CJCSI) 6510. In order to ensure Warfighters continue to have secured communications (i.e., encrypted data and voice), Army tactical radios are required to modernize their cryptographic capabilities by implementing modern algorithms.  If cease key dates are not met, the Army will be forced to communicate at risk."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "31.154"
                },
                "CurrentYear": {
                    "val": "38.280"
                },
                "BudgetYearOne": {
                    "val": "70.554"
                },
                "BudgetYearOneBase": {
                    "val": "70.554"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "31.032"
                },
                "CurrentYear": {
                    "val": "38.280"
                },
                "BudgetYearOne": {
                    "val": "132.438"
                },
                "BudgetYearOneBase": {
                    "val": "132.438"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.122"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "61.884"
                },
                "BudgetYearOneBase": {
                    "val": "61.884"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.227"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "1.105"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "61.884"
                                },
                                "BudgetYearOneBase": {
                                    "val": "61.884"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY16 increase to project 491 supports Defensive Cyber Pilot efforts.\n\nIn FY18 the following net adjustments were made:\nCrypto Modernization (DV5):  Decrease of $1.390 million based on requirement adjustment. \nEmbedded Crypto Modernization (ET9):  Increase of $61.693 million for embedded crypto modernization in Army radios.\nInformation Assurance (491): Increase of $.102 million based on requirement adjustment. \nKey Management Infrastructure (DV4): Decrease of $.860 million based on requirement adjustment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "491"
                    },
                    "ProjectTitle": {
                        "val": "Information Assurance Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.401"
                        },
                        "CurrentYear": {
                            "val": "7.431"
                        },
                        "BudgetYearOne": {
                            "val": "10.194"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.194"
                        },
                        "BudgetYearTwo": {
                            "val": "8.872"
                        },
                        "BudgetYearThree": {
                            "val": "9.303"
                        },
                        "BudgetYearFour": {
                            "val": "9.884"
                        },
                        "BudgetYearFive": {
                            "val": "7.600"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "PE 0303140A, project 491 includes funding for the Army CIO\/G6, Project Lead (PL) Network Enablers (Net E), and Project Lead (PL) Enterprise Services (ES)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program supports the implementation of National Security Agency (NSA) developed Communications Security (COMSEC) technologies within the Army by providing COMSEC system capabilities through encryption, trusted software, or standard operating procedures; integrating these mechanisms into specified systems in support of securing the Army Tactical and Enterprise Network. \n\nThis entails architecture studies, system integration and testing, developing, installation kits, and certification and accreditation of Automation Information Systems. The program assesses, develops and integrates Cyber Security (CS)\/COMSEC tools (hardware and software) which provide protection for fixed infrastructure post, camps and station networks as well as tactical networks.  The cited work is consistent with Strategic Planning Guidance and the Army Modernization Strategy Plan. \n\nImplement, establish functional and technical boundaries of cryptographic, key management and Information Assurance (IA) capabilities In Coordination With (ICW) the NSA, the Defense Information Systems Agency (DISA), and Joint Services, to secure National Security Systems (NSS), and National Security Information (NSI).  Technical evaluations assess the security, operational effectiveness and network interoperability of advanced concept technologies to develop policies, standards, and fundamental building blocks for Army COMSEC capabilities that reduce the risk of future materiel solutions that could underperform and disrupt classified operations. \n\nDevelop and publish the Cryptographic Modernization strategy to identify, standardize, and govern the insertion of IA capabilities that will bridge operational gaps and support the DoD and NSA mandated requirements to enhance network capacity while providing secure information exchange of voice, video, and data IAW the Army Network Campaign Plan.  This will be accomplished by interoperability evaluation, standards testing, and CS System of System Network Vulnerability Assessments (SoS NVA) Army Capability Sets for CS\/COMSEC capabilities that provide protections for the tactical and fixed infrastructure post, camps, and station networks. \n\nThe Defensive Cyberspace Operations (DCO) program provides initial capabilities that enable passive and active cyberspace defense operations to preserve friendly cyberspace capabilities and protect data, networks, net-centric capabilities, and other designated systems.  Big Data Pilot provides an advanced analytics capability capable of ingesting structured, semi-structured, and unstructured data from multiple data sources (e.g., Joint Regional Security Stacks (JRSS), intrusion detection systems, intrusion prevention systems, network device log files, trouble tickets, firewalls, proxies, web and applications server log files, etc) and provides situational awareness of the cyberspace battlefield.  It provides the computer network defense provider with a common analytic platform which informs and reduces risk associated with future material solutions and forms a blueprint for future Big Data Analytics.  Big Data (analysis-of-all DoD Information Network sensor data) provides two optimized and accredited clusters deployed in support of JRSS and Defense Research and Engineering Network (DREN) with a tools suite accessible to Cyber Mission Forces via secure remote access.  The Army's DCO activities are a construct of active cyberspace defenses which provide synchronized, real-time capability to discover, detect, analyze, and mitigate threats to and vulnerability of DoD networks and systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assessing emerging COMSEC hardware and software systems and products (PL Net E)"
                                    },
                                    "Description": {
                                        "val": "Conduct research and analyses as well as basic testing for meeting specific focused goals that will enhance the functions and support of cryptographic systems improving the security and usability of the Army tactical and strategic networks. (PL Net E)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.074"
                                            },
                                            "Text": {
                                                "val": "Conducted testing of candidate small tactical In-line Network Encryption (INE) solutions and emerging secure wireless solutions. (PL Net E)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.170"
                                            },
                                            "Text": {
                                                "val": "As the Army implements new network technology, Secure Voice (SV) and In-line Network Encryption (INE) devices must be identified and tested for effectiveness and suitability. Key areas of investigation include cyber security, interoperability, and standards compliance. (PL Net E)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.466"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.466"
                                            },
                                            "Text": {
                                                "val": "As the Army implements new network technology, Secure Voice (SV) and In-line Network Encryption (INE) devices must continue to be identified and tested for effectiveness and suitability. Key areas of investigation include cyber security, interoperability, and standards compliance. (PL Net E)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "The Defensive Cyberspace Operations (DCO) - Big Data Pilot (PL ES-CYBER)"
                                    },
                                    "Description": {
                                        "val": "Bridge Big Data efforts into the DCO program and deploy additional Big Data Analytics platforms to FY15 JRSS sites. Assess alternative solution architecture\/design and Develop, Test, Accredit, and Implement Rapid Deployable Kit (RDK) 2.X. (PL ES-CYBER)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.725"
                                            },
                                            "Text": {
                                                "val": "Big Data Pilot cyber funding encompasses beta testing and a validation plan that will be incorporated with the pilot effort. Includes expanded DCO and Cyberspace Situational Awareness program requirements. Candidate deployment locations based on FY15 JRSS site activations. (PL ES-CYBER)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Oversight and implementation guidance of emerging Cryptographic and CS capabilities to ensure interoperability to maintain compliance with DoD, NSA, and Army policies and regulations. (CIO\/G6)"
                                    },
                                    "Description": {
                                        "val": "The program provides oversight and guidance for technical research and evaluation of Cryptographic Modernization (CM) and Key Management (KM) capabilities to ensure IA compliance and interoperability.  This effort improves operational effectiveness, ensures efficient implementation, and enhances network performance by deploying standardized COMSEC capabilities that are interoperable and supportable in Army, coalition and Joint operating environments. This program enables the Army to collaborate and participate in Joint and Army Capability Technology Demonstrations to define, improve, develop and publish Cyber Security (CS) standards for new\/modernized technology insertion to support the LWN 2025 and Beyond.  This effort assesses and defines risk mitigation of CS network vulnerabilities in end-to-end Army network operations and Common Operating Environment. (CIO\/G6)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.602"
                                            },
                                            "Text": {
                                                "val": "In support of Army and Combatant Commands world-wide, provided risk reduction lab tests to evaluate the maturity and security of new emerging technology which included trusted cyber sensor, Commercial Solutions for Classified (CSfC) and Cryptographic High Value Product (CHVP) Radio for unattended use to bridge operational gaps to enable secure communications between the tactical edge and DoD enterprise, and to align with the Army Network Campaign Plan and the DoD Joint Information Environment (JIE).  Reviewed and assessed operational needs, standardized software testing, recommended software releases and identified fundamental building blocks for Cyber solutions.  Provided policies and guidance for COMSEC programs and initiatives to ensure capabilities, interoperability, suitability remains synchronized with Army requirements. Provided security standards and technical input to the Army COMSEC Modernization Strategy.  Developed Army cryptographic technology roadmaps to integrate modern technology and to assist Army organizations with phasing out legacy Crypto components. Participated in the NSA, DoD CIO, Joint Staff and Army forums to identify baseline requirements for the next generation of Cryptographic devices and future applications.  Identified and submitted new Army security standards, performance and interoperability requirements for the upcoming NSA CryptoMod 2 Initial Capabilities Document (ICD) development.  Identified and recommended changes to Army Technical Bulletins, Army Regulations and NSA CNSS Instructions. (CIO\/G-6)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.261"
                                            },
                                            "Text": {
                                                "val": "Oversight and Implementation guidance that provides a framework for Army CM and KM through the evaluation of performance, operational effectiveness, and operational suitability of advanced technologies to meet mission capability needs. The core functions of this program are; to research and evaluate new emerging technology concepts for suitability and reliability and to participate in joint tests with NSA, DISA, and Services to establish functional and technical boundaries for CM, KM, and CS operations.  Collaborate with the NSA, DoD and Joint Staff to define new Advanced Cryptographic Capability (ACC) standards (security and interoperability) for the tactical and operational environment.  The program resources CS System of Systems Network Vulnerability Assessments (SoS NVA) to assess vulnerabilities and determine the operational risks resulting from disruption, unauthorized access, modification or exploitation of the network, information and information systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.728"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.728"
                                            },
                                            "Text": {
                                                "val": "Oversee execution of the Army's COMSEC Modernization initiative by identifying and developing new security baseline for implementation of Army CM and KM initiatives.  Assess, review and validate Army operational needs. Test and evaluate CM and KM technologies to determine the maturity and viability for Army use to protect and strengthen the Network posture. Identify fundamental building blocks for IA solutions, perform risk reduction testing of commercial products prior to insertion into Army for use to increase operational availability with documented operational value and rapid integration. Collaborate with the NSA, DoD and Joint Staff to define new ACC standards (security and interoperability) for the tactical and operational environment.  Provide continuous test and evaluate results to enable the Army to make sound investment strategic decisions and to reduce or eliminate duplications.  Participate in operational assessment of NSA, DoD, Joint Staff and Service led Joint Capability Technology Demonstrations to align new technologies to documented Army and Service capability gaps for protecting National Security Systems and National Information. Develop strategies and policies that leverage emerging cryptographic and key management tools and services. (CIO\/G6)"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "DV5"
                                    },
                                    "Title": {
                                        "val": "Crypto Modernization"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.850"
                                        },
                                        "CurrentYear": {
                                            "val": "21.565"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.047"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.047"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.847"
                                        },
                                        "BudgetYearThree": {
                                            "val": "24.843"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.599"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.666"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "ET9"
                                    },
                                    "Title": {
                                        "val": "Embedded Crypto Modernization"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "4.585"
                                        },
                                        "BudgetYearOne": {
                                            "val": "88.949"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "88.949"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "51.057"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.974"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "159.565"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96002"
                                    },
                                    "Title": {
                                        "val": "Cryptographic Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.206"
                                        },
                                        "CurrentYear": {
                                            "val": "66.692"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.441"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "49.441"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "40.276"
                                        },
                                        "BudgetYearThree": {
                                            "val": "86.306"
                                        },
                                        "BudgetYearFour": {
                                            "val": "98.519"
                                        },
                                        "BudgetYearFive": {
                                            "val": "102.302"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96006"
                                    },
                                    "Title": {
                                        "val": "Embedded Cryptographic Modernization"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "3.014"
                                        },
                                        "BudgetYearThree": {
                                            "val": "97.969"
                                        },
                                        "BudgetYearFour": {
                                            "val": "157.904"
                                        },
                                        "BudgetYearFive": {
                                            "val": "48.382"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BS9716"
                                    },
                                    "Title": {
                                        "val": "NON PEO-SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.170"
                                        },
                                        "CurrentYear": {
                                            "val": "2.545"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.635"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.635"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.170"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.917"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.961"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Line Item and Title: \nDV5 - Crypto Modernization - RDTE \nET9 - Embedded Crypto Modernization - RDTE \nB96002 - Cryptographic Systems - OPA2 \nB96006 - Embedded Cryptographic Modernization - OPA2\nBS9716 - NON PEO-SPARES - OPA4"
                        },
                        "AcquisitionStrategy": {
                            "val": "The objective of the Cryptographic Systems program is to provide adaptive, flexible, and programmable cryptographic solutions using best practices, lessons learned and programmatic management to meet the challenge of modernizing the Army's aging cryptographic systems. Associated documents include CDD, approved by CIO\/G6, 15 Jul 10; ICD, approved by JROC, 25 Mar 11; AAO; approved by G3, 15 Dec 11 and increased, 19 Jun 15."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Engineering (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM RDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "CECOM RDEC APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "78.116"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.031"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.170"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.466"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.466"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "81.783"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Big Data Pilot (PL ES-CYBER)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT BELVOIR, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.725"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.725"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Information Assurance System Engineering Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DSCI Consulting"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.106"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.106"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.018"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.018"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.408"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.408"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.448"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.448"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (CIO\/G6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.879"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.245"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.595"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.196"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.196"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Engineering (CIO\/G6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM RDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.698"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.073"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.086"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.496"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.496"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (CIO\/G6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.563"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.625"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.261"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.737"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.737"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support (CIO\/G6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AASKI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edgewood, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.032"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.079"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.316"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.813"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.813"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Service (CIO\/G6)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARL\/SLAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "White Sand Missile Range (WSMR)"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.346"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.623"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.003"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.486"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.486"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support (PL Net E)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.598"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.598"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160781-21.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "TEST OF INE AND WIRELESS  SOLUTION (PL Net E)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "BIG DATA PILOT (PD ES-CYBER)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TECHNOLOGY TEST & EVALUATION (CIO\/G6)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DEFINE SECURITY & INTEROPERABILITY STANDARDS (CIO\/G6)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "COMSEC STRATEGY & CRYPTO TECHNOLOGY ROADMAP (CIO\/G6)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "501"
                    },
                    "ProjectTitle": {
                        "val": "Army Key Mgt System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.851"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.851"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Army Key Management System (AKMS) (501) realigned to Key Management Infrastructure (KMI)PE\/Project (373140)(DV4) in FY17."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Army Key Management System (AKMS) is the Army's implementation of the National Security Agency's (NSA) Electronic Key Management System (EKMS) program automating the functions of Communications Security (COMSEC) electronic key management, control, planning, and distribution.  AKMS supports the Army's ability to communicate and distribute data on the Army's tactical and strategic networks by limiting adversarial access to, and reducing the vulnerability of, Army Command, Control, Communications, Computers, Intelligence (C4I) systems.  The AKMS System of Systems (SoS) components are the Local COMSEC Management Software (LCMS), Automated Communications Engineering Software (ACES) and Simple Key Loader (SKL).\n\nThe NSA EKMS program is being replaced by the NSA Key Management Infrastructure (KMI) Program.  The transition of the legacy EKMS LCMS to the modern KMI Management Client  (MGC) nodes began in FY12 and must be completed by the EKMS Tier 2 sunset date of December 2017.\n\nAKMS supports the transition to Army Key Management Infrastructure (AKMI).  Some components of the AKMS SoS will be replaced under AKMI while others will be modified or adapted to meet the new AKMI requirements.  Two critical components required for the transition include the development of the Mission Planning Management Support System (MPMSS) and the ability to support Over the Network Keying (OTNK).\n\nMP\/MSS creates a secure, highly automated interface enabling secure transparent provisioning of KMI products.  MP\/MSS service is being developed by NSA but each Service is responsible for interface development and final integration into their infrastructure.  ACES is the initial target for the interface to MPMSS.  NSA will be providing additional capabilities and updates to the MP\/MSS interface specification through technology insertions in the out years.  The Army must then adjust to these changes delivered by NSA.   \n\nOne of the major enhancement in the KMI architecture is the ability to leverage OTNK.  The end state for the Army is to leverage AKMI capabilities (OTNK, Mission Plan\/Mission Support System (MP\/MSS), Delivery Only Client (DOC), Client Host Only (CHO)) to increase automation, reduce soldier oversight, manage, and deliver key products to from the tactical edge up through strategic ECU's.  Within AKMS this capability will be focused on ACES and SKL platform.  ACES and SKL will act as an interim solution for all legacy ECUs to be recognized on the KMI network until they can be upgraded to be fully KMI aware.  OTNK developments began in FY2015.\n\nTo support this transition, a new KMI compliant cryptographic engine must be developed for the SKL platform.  The KOV-21 card used in current Army Tier 3 fill devices has hardware obsolescence issues and does not support the new capabilities being delivered by KMI.  Redesigning and developmental efforts using modern and readily available components for use in the Army's SKL devices have been initiated.  The redesign of the current KOV-21 card is referred to as the KOV-21 Replacement and is an extension of the KOV-21 card as a technology insertion.  AKMS RDT&E funding line 501 realigned to DV4 \/ KMI FY17 and out."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Planning Management Support System (MPMSS) Interface"
                                    },
                                    "Description": {
                                        "val": "The MPMSS creates a secure, highly automated interface to enable transparent provisioning of Key Management Infrastructure (KMI) products. The MPMSS system is to be used by both the KMI system developer and MPMSS developers to have a standard interface to electronically exchange information, enabling Warfighter Operations, achieving integration between provisioning. National Security Agency (NSA) plans to deliver the MPMSS capabilities in 4 releases; Spirals 1-4, through FY16."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.945"
                                            },
                                            "Text": {
                                                "val": "The second functional capability release of MPMSS will be completed in KMI Spiral 2 Spin 3 scheduled for delivery in July 2016.  This release will include the interface to support the initial certificate management services.  The Army Mission Planner software will be integrated and tested with the KMI MPMSS API Spin 3 capabilities.  These installments of the MPMSS effort are a continuing effort to the base capabilities developed in the Army Key Management System (AKMS) program and will ensure maximum use of KMI architecture by Army's legacy End Crypto Units (ECU)s.  This effort will commence after KMI MP\/MSS software code is completed and delivered to the Army."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Key Management Infrastructure (KMI) Awareness for Legacy Devices"
                                    },
                                    "Description": {
                                        "val": "KMI Awareness initiative creates a secure, highly automated interface in providing future Over the Network Keying (OTNK) capability to legacy ECUs.  This initiative will allow KMI aware ECUs to receive, authenticate, and decrypt OTNK messages and increases WarFighter survivability by minimizing the need for Soldiers to travel to obtain keys.  The current army inventory of ~1.5M ECUs are not currently KMI aware and cannot perform OTNK functionality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.906"
                                            },
                                            "Text": {
                                                "val": "KMI Awareness initiative provides OTNK like capability to legacy ECUs through the fill device.  Development of a Reprogrammable Single Chip Universal Encryptor (RESCUE) is necessary for the fill device to provide KMI aware services to the ECUs.  Developing this capability in the SKL will allow the ~1.5M legacy ECUs to be recognized on the KMI network until they can be upgraded to be KMI aware."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA1201"
                                    },
                                    "Title": {
                                        "val": "TSEC - AKMS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.373"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "10.373"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96004"
                                    },
                                    "Title": {
                                        "val": "Key Management Infrastructure"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.678"
                                        },
                                        "CurrentYear": {
                                            "val": "63.578"
                                        },
                                        "BudgetYearOne": {
                                            "val": "58.363"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "58.363"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "59.875"
                                        },
                                        "BudgetYearThree": {
                                            "val": "65.784"
                                        },
                                        "BudgetYearFour": {
                                            "val": "55.349"
                                        },
                                        "BudgetYearFive": {
                                            "val": "73.765"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DV4"
                                    },
                                    "Title": {
                                        "val": "Key Management Infrastructure"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.930"
                                        },
                                        "CurrentYear": {
                                            "val": "4.699"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.696"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.696"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.261"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.930"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.319"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.415"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "432140"
                                    },
                                    "Title": {
                                        "val": "ISSP (TSEC-AKMS) OMA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.380"
                                        },
                                        "CurrentYear": {
                                            "val": "8.006"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.316"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.316"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.678"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.945"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.043"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.119"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Line Item & Title: \nBA1201: TSEC-AKMS (OPA2)\nB96004: Key Management Infrastructure (OPA2)\nDV4: Key Management Infrastructure (RDTE)\n432140: ISSP (TSEC-AKMS) (OMA)"
                        },
                        "AcquisitionStrategy": {
                            "val": "Army Key Management System (AKMS) is an ACAT III Program of Record (POR) under PL Network Enablers (PL Net E).  It is the Army's implementation of the National Security Agency (NSA)'s Electronic Key Management System (EKMS).  The AKMS allows the Army to manage, control, plan, and distribute electronic key for the ~1.5M End Cryptographic Units (ECU)s necessary to communicate and distribute data on the Army's tactical and strategic networks. \n\nAKMS was initially approved for Milestone III in FY99.  The AKMS System of Systems originally included Local COMSEC Management Software (LCMS), Automated Communications Engineering Software (ACES) and Data Transfer Device (DTD) (AN-CYZ-10).  In 2QFY02, the PEO C3T Milestone Decision Authority approved the procurement of the Simple Key Loader (SKL) as the replacement for the DTD within the AKMS System of Systems (SoS) POR.  AKMS is a fully fielded POR that undergoes modifications to meet emerging operational needs.\n\nThe NSA EKMS program is being replaced by the NSA Key Management Infrastructure (KMI) Program.  As the DoD Key Management Lead, NSA is dictating the change from EKMS to KMI.  The Army's implementation of the NSA KMI is the Army Key Management Infrastructure (AKMI) program.  Some components of the AKMS SoS will be replaced under AKMI while others will be modified or adapted to meet the new AKMI requirements.  \n\nThe LCMS component of the AKMS SoS (AN\/GYK-49) is fully fielded.  The LCMS is assigned to the COMSEC Account Manager\/COMSEC Custodian.   LCMS most recent hardware refresh was completed in FY12.  The current software baseline is 5.1.0.5 with certain select accounts upgrading to v5.2 based on operational needs.  Further LCMS software releases are not anticipated.  LCMS workstations will be replaced by KMI Management Client (MGC) Nodes before the NSA mandated EKMS Tier 2 sunset of December 2017.  EKMS Common Tier 1 operations and Tier 1 operational support continues to be provided by CECOM.  LCMS hardware is sustained by CSLA until fully replaced by the KMI MGC.\n\nThe ACES component of the AKMS SoS (AN\/GYK-33) current hardware platform is a Dell E6500 non-ruggedized laptop fielded to S6, Spectrum Managers and some COMSEC Account Managers at Battalion level and above.  ACES is undergoing a hardware technology refresh and will be replacing 1\/5 quantity of laptops each year.  The current version of ACES is 3.4.  Software is released on an annual basis and coincides with the Capability Set delivery schedule.  PL Net E currently holds the software development contract.  As the Tier 2.5 component, ACES operates between the LCMS (Tier 2) and the SKL (Tier 3).  It links the key data from the LCMS with mission planning data for a single load by the SKL into the ECUs.  ACES will continue with modifications to support the AKMI System of Systems.  In order to support AKMI, ACES must be modified to seamlessly operate within the KMI architecture.\n\nThe SKL is the primary Army fill device and is the Tier 3 component of the AKMS SoS (AN\/PYQ-10).  The SKL is fully fielded to the Army.  Army holds the sole full rate production procurement contract for the SKL, which is heavily utilized by other DoD and civil services as well as FMS customers.  The SKL repair capability is with the Original Equipment Manufacturer but TYAD is developing an organic depot repair support.  The SKL and its cryptographic engine are facing hardware obsolescence issues. SKL v3.1 in combination with a new KMI compliant cryptographic engine resolves these issues and lays the foundation for the Army's Next Generation Load Device - Medium capability.  The SKL v3.1 modifications will be made to the Army's existing fleet of the fill devices via a modification kit starting in FY15.  The KMI cryptographic engine is reliant on the CERDEC led RESCUE RDT&E effort that began in FY14.\n\nAKMS RDT&E funding line 501 realigned to DV4 \/ KMI FY17 and out."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DV4"
                    },
                    "ProjectTitle": {
                        "val": "Key Management Infrastructure (KMI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.930"
                        },
                        "CurrentYear": {
                            "val": "4.699"
                        },
                        "BudgetYearOne": {
                            "val": "4.696"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.696"
                        },
                        "BudgetYearTwo": {
                            "val": "3.261"
                        },
                        "BudgetYearThree": {
                            "val": "2.930"
                        },
                        "BudgetYearFour": {
                            "val": "3.319"
                        },
                        "BudgetYearFive": {
                            "val": "3.415"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Key Management Infrastructure (KMI) funding line DV4 was established in FY2014.  Army Key Management System (AKMS) funding line 501 realigned to KMI funding line DV4 in FY2017.  AKMI supports infrastructure requirements in support of Key Management."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Army Key Management Infrastructure (AKMI) is the Army's implementation of the National Security Agency's (NSA) Key Management Infrastructure (KMI) ACAT IAM program.  AKMI supports Department of Defense (DoD) Global Information Grid (GIG) Net Centric and Cryptographic Modernization Initiatives (CMI) and supports emerging requirements transitioned from the Army Key Management System (AKMS).  AKMI automates the functions of Communications Security (COMSEC) electronic key management, control, planning, and distribution.  AKMI supports the Army's ability to communicate and distribute data on the Army's tactical and strategic networks by limiting adversarial access to, and reducing the vulnerability of, Army Command, Control, Communications, Computers, Intelligence (C4I) systems.  \n\nThe AKMI Program includes the Management Clients (MGC) nodes, Automated Communications Engineering Software (ACES) and Next Generation Load Device (NGLD) Family of devices to include the NGLD Small, Medium and Large.  AKMI provides an integrated, operational environment that brings essential key management functions in-band.  Objective AKMI will leverage NSA KMI program to provide secure software provisioning, will support legacy and modern End Crypto Units (ECU)s, simplifies all aspects of key provisioning and ECU management with traceability to individuals, expands operations to DoD unclassified networks, North Atlantic Treaty Organization (NATO) and Coalition users, automates manual business processes to increase Soldier efficiency, transforms key delivery from manual to an automate enterprise service and will provide an Over the Network Keying (OTNK) capability to support CMI. \n\nOne of the major enhancement in the AKMI architecture is the ability for to leverage the various capabilities and services from NSA KMI.  The end state for the Army is to leverage AKMI capabilities (OTNK, Mission Plan\/Mission Support System (MP\/MSS), Delivery Only Client (DOC), Client Host Only (CHO)) to increase automation, reduce soldier oversight, manage, and deliver key products to from the tactical edge up through strategic ECU’s.  The objective AKMI capabilities will be found in all of the products across the AKMI product line to include MGC, ACES and NGLD family of fill devices.  NGLD family will be an enduring solution to bridge the gap until legacy ECUs are fully modernized.  \n   \nThe NGLD Medium and Large are reliant on the Reprogrammable Single Chip Universal Encryptor (RESCUE), a new KMI compliant cryptographic engine that is currently being developed. The KOV-21 card currently used in Army Simple Key Loader (SKL) fill devices has hardware obsolescence issues and does not support OTNK. Redesign and developmental efforts using modern and readily available components for use in the Army's SKL devices have been initiated under the RESCUE program. The current KOV-21 card is referred to as the KOV-21 Replacement and is an extension of the RESCUE program as a technology insertion. The NGLD-Large technology development will start in FY2019.  The NGLD-Large development will provide the same capabilities as the NGLD-Medium, along with wireless (802.11) and additional memory (64 GB) requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Key Management Infrastructure (KMI) Awareness (RESCUE \/ KOV-21 Replacement Effort)"
                                    },
                                    "Description": {
                                        "val": "KMI Awareness initiative creates a secure, highly automated interface in providing future Over the Network Keying (OTNK) capability to legacy End Crypto Units (ECU)s.  This initiative will allow ECUs to receive, authenticate, and decrypt OTNK messages and increases WarFighter survivability by minimizing the need for Soldiers to travel to obtain keys. The KOV 21 card, previously in production through NSA for use in the Simple Key Loader (SKL) and the Secure DTD 2000 System (SDS), is nearing the end of life due to unavailability of parts. Redesigning and developmental efforts using modern and readily available components for use in the Army's SKL and Next Generation Load Devices (NGLDs) are currently underway. The redesign of the current KOV 21 card is referred to as the KOV 21 Replacement and is an extension of the KOV 21 card as a technology insertion. The KOV 21 Replacement will also address requirements codified in the NGLD CPD and the AKMI CPD that were technologically unachievable with the KOV 21 card."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.930"
                                            },
                                            "Text": {
                                                "val": "The RESCUE technology development will continue in FY2017. RESCUE development will provide the ability to upgrade legacy fill devices, enabling a KMI aware fully developed PDE-enabled NGLD family of devices. The RESCUE effort lays the foundation for AKMI capabilities that can be integrated into the SKL v3.1 to make it an NGLD Medium."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.699"
                                            },
                                            "Text": {
                                                "val": "The RESCUE technology development will continue in FY2017. RESCUE development will provide the ability to upgrade legacy ECUs, enabling a KMI aware fully developed PDE-enabled ECU fleet. The KOV-21 Replacement effort lays the foundation for AKMI capabilities that can be inserted into the SKL to make it an NGLD Medium."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.696"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.696"
                                            },
                                            "Text": {
                                                "val": "The RESCUE technology development will complete in FY2018. RESCUE development will provide the ability to upgrade legacy ECUs, enabling a KMI aware fully developed PDE-enabled ECU fleet. The KOV-21 Replacement effort lays the foundation for AKMI capabilities that can be inserted into the SKL to make it an NGLD Medium."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B96004"
                                    },
                                    "Title": {
                                        "val": "Key Management Infrastructure"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.678"
                                        },
                                        "CurrentYear": {
                                            "val": "63.578"
                                        },
                                        "BudgetYearOne": {
                                            "val": "58.363"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "58.363"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "59.875"
                                        },
                                        "BudgetYearThree": {
                                            "val": "65.784"
                                        },
                                        "BudgetYearFour": {
                                            "val": "55.349"
                                        },
                                        "BudgetYearFive": {
                                            "val": "73.765"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BA1201"
                                    },
                                    "Title": {
                                        "val": "TSEC - Army Key Mgt Sys (AKMS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.373"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "10.373"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "501"
                                    },
                                    "Title": {
                                        "val": "Army Key Management System (AKMS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.851"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "1.851"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "432140"
                                    },
                                    "Title": {
                                        "val": "ISSP (TSEC-AKMS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.385"
                                        },
                                        "CurrentYear": {
                                            "val": "8.006"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.316"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.316"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.678"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.945"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.043"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.119"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Line Item & Title:\nB96004: Key Management Infrastructure (OPA2)\nBA1201: TSEC-Army Key Mgt Sys (AKMS) (OPA2)\n501: Army Key Management System (AKMS) (RDTE)\n432140: ISSP (TSEC-AKMS) (OMA)"
                        },
                        "AcquisitionStrategy": {
                            "val": "Army Key Management Infrastructure (AKMI) is a Non Program of Record (POR) under Project Lead Network Enablers (PL Net E).  AKMI is the Army's implementation of the National Security Agency (NSA) Key Management Infrastructure (KMI) ACAT IAM Program of Record.  The AKMI will allow the Army to manage, control, plan, and distribute electronic key for the ~1.5M End Cryptographic Units (ECU)s necessary to communicate and distribute data on the Army's tactical and strategic networks. \n\nAKMI initial Army Acquisition Program Baseline (APB) was approved 2QFY12.  The AKMI Program will include the Management Clients (MGC) nodes, Automated Communications Engineering Software (ACES) and Next Generation Load Device (NGLD) Family. Each component of the AKMI Program is in a different phase of the acquisition cycle.  \n\nThe NSA KMI Program is replacing the NSA Electronic Key Management System (EKMS) program.  As the DoD Key Management Lead, NSA is dictating the change from EKMS to KMI by a sunset date of December 2017.  Components of the AKMI Program will be retained and adapted from the legacy AKMS program while others will be developed and fielded to meet AKMI requirements.  \n\nThe NGLD family of devices will become the primary Army fill devices and Tier 3 component of the AKMI Program. The NGLD Capability Production Document (CPD) was signed 4QFY13. The NGLD CPD calls for a family of 3 devices (small, medium, and large) to meet the AKMI requirements. The AKMI program has partnered with RDECOM CERDEC to develop a KMI compliant cryptographic engine, the Reprogrammable Single Chip Universal Encryptor (RESCUE). The Army will gain the NGLD Medium capability through the SKL v3.1 in combination with a new KMI compliant cryptographic engine, the RESCUE, the first iteration of the RESCUE being\nthe KOV-21 Replacement. The redesign of the current SKL cryptographic engine, the KOV-21 card, is required due to parts obsolescence and inability to be KMI Aware. The KOV-21 Replacement is an extension of the RESCUE program as a technology insertion into the SKL v3.1 which in turn meets the NGLD Medium CPD requirements. The NGLD Medium will be available in FY19. Additionally, the Army NGLD large strategy is highly reliant on the development of the RESCUE and will drive a materiel solution decision in FY19."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DV5"
                    },
                    "ProjectTitle": {
                        "val": "Crypto Modernization (Crypto Mod)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.850"
                        },
                        "CurrentYear": {
                            "val": "21.565"
                        },
                        "BudgetYearOne": {
                            "val": "27.047"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.047"
                        },
                        "BudgetYearTwo": {
                            "val": "25.847"
                        },
                        "BudgetYearThree": {
                            "val": "24.843"
                        },
                        "BudgetYearFour": {
                            "val": "8.599"
                        },
                        "BudgetYearFive": {
                            "val": "8.666"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "DV5 - The Crypto Modernization line was established in Sept 2012."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program supports using National Security Agency (NSA) developed Communications Security (COMSEC) technologies within the Army providing encryption, trusted software, or standard operating procedures, and integrating these mechanisms into specified systems in support of securing the Army Tactical and Enterprise Networks.  \n\nThis entails architecture studies, system integration and testing, developing installation kits, and certification and accreditation of Automation Information Systems.  The program assesses, develops and integrates emerging Information Assurance (IA)\/COMSEC tools (hardware and software) which provide protection for fixed infrastructure post, camp, and station networks as well as tactical networks.  The cited work is consistent with Strategic Planning Guidance and the Army Modernization and Strategy Plan.\n\nThe Embedded Cryptographic Modernization Initiative (ECMI) is designed to investigate Courses Of Action, conduct a Material Solution Analysis, and execute upgrade activities to ensure all enduring Army communications and data equipment that employ embedded cryptographic hardware will utilize modern cryptographic algorithms and keys."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "VINSON\/ANDVT (Advanced Narrowband Digital Voice Terminal) Cryptograph Modernization (VACM) program"
                                    },
                                    "Description": {
                                        "val": "This program researches, assesses, tests, plans and works to integrate VACM products for the Army.  The VACM program is a NSA mandated program established to replace legacy external cryptographic devices such as the KY-57, KY-99A, KY-58, KY-100 and CV- 3591 \/ KYV-5. In order to ensure the confidentiality, integrity and availability of classified communications, the cryptographic modules must be tested for interoperability and form fit to ensure a successful fielding.  Each software release will require testing to insure comparability and interoperability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "The program tested and evaluated engineering changes to Low Rate Initial Production (LRIP) of VACM devices to confirm continued capability and interoperability on Army networks and tactical systems and identified new risk areas for compliance with COMSEC regulations and procedures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "The program will continue to test and evaluate engineering changes to Full Rate Production (FRP) of VACM devices to confirm continued capability and interoperability on Army networks and tactical systems as well as identifying new risk areas for compliance with COMSEC regulations and procedures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "The program will continue to test and evaluate engineering changes to Full Rate Production (FRP) of VACM devices to confirm continued capability and interoperability on Army networks and tactical systems as well as identifying new risk areas for compliance with COMSEC regulations and procedures. Will begin fielding to Secret level users performing site surveys and installing at both CONUS and OCONUS locations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cryptographic Systems Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "This program supports the Army Cryptographic Modernization Transformational Initiative. This is accomplished by providing test and evaluation capabilities to the COMSEC community in order to assess emerging technologies before being released and approved for Army use; testing will be performed on hardware, software and network systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.120"
                                            },
                                            "Text": {
                                                "val": "The program tested and evaluated of COMSEC devices to confirm capability and interoperability on Army networks and tactical systems and identified risk areas for compliance with COMSEC regulations and procedures.  The program tested and evaluated Crypto Systems compliant devices, Suite B IPSec devices built on commercial standards, Cryptographic High Value Product (CHVP), Commercial Solutions for Classified (CSfC) Standards, and new software releases to High Assurance Internet Protocol Encryptor (HAIPE) 4.X devices in accordance with AR 700-142 Rapid Action Revision dated October 16, 2008.  The program tested interfaces and provided ways to insert Data At Rest (DAR) and Data In Transit (DIT) technology within the existing and future network infrastructure. Evaluated performance of technologies and provided direction to ensure the lowest impact on performance while providing the greatest protection from loss of sensitive data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.314"
                                            },
                                            "Text": {
                                                "val": "The program continues testing and evaluation of COMSEC devices to confirm capability and interoperability on Army networks and tactical systems as well as identifying risk areas for compliance with COMSEC regulations and procedures.  The program will test and evaluate Crypto Systems compliant devices, Suite B IPSec devices built on commercial standards, Cryptographic High Value Product (CHVP), Commercial Solutions for Classified (CSfC) Standards, and new software releases to HAIPE 4.X devices in accordance with AR 700-142 Rapid Action Revision dated October 16, 2008.  Tests interfaces and provides ways to insert Data At Rest (DAR) and Data In Transit (DIT) technology within the existing and future network infrastructure. Evaluates performance of technologies and provide direction to ensure the lowest impact on performance while providing the greatest protection from loss of sensitive data. Examples of common analysis to be performed are comparisons in encryption implementations, network initialization overhead, and comparison of emerging Commercial Solutions for Classified architectures with COMSEC architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.450"
                                            },
                                            "Text": {
                                                "val": "The program continues testing and evaluation of COMSEC devices to confirm capability and interoperability on Army networks and tactical systems as well as identifying risk areas for compliance with COMSEC regulations and procedures.  The program will test and evaluate Crypto Systems compliant devices, Suite B IPSec devices built on commercial standards, CHVP, CSfC Standards, and new software releases to HAIPE 4.X devices in accordance with AR 700-142 Rapid Action Revision dated October 16, 2008.  The program tests interfaces and provides ways to insert DAR and DIT technology within the existing and future network infrastructure. Evaluates performance of technologies and provides direction to ensure the lowest impact on performance while providing the greatest protection from loss of sensitive data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Assurance Internet Protocol Encryption (HAIPE) extension manager"
                                    },
                                    "Description": {
                                        "val": "A management tool to configure the new extensions to the HAIPE standard and process the resulting data to provide early indications of cyber attacks."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.503"
                                            },
                                            "Text": {
                                                "val": "Conduct a software development effort that will provide configuration and management of the HAIPE extensions and the user interface for collecting and analyzing the data that results from implementation of these HAIPE extensions. This will upgrade Army HAIPEs to include new cyber-sensor functionality for the tactical cyber cell."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.748"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.748"
                                            },
                                            "Text": {
                                                "val": "Continue a software development efforts that will provide configuration and management of the HAIPE extensions and the user interface for collecting and analyzing the data that results from implementation of these HAIPE extensions. This will facilitate the upgrade of the Army HAIPEs to include new cyber-sensor functionality for the tactical cyber cell."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Embedded Cryptographic Modernization Initiative (ECMI)"
                                    },
                                    "Description": {
                                        "val": "The ECMI is an upgrade activity that will ensure enduring Army radios remain secure by operating with modern cryptographic algorithms and keys.  Funding secured in DV5 line to support ECMI Non Recurring Engineering (NRE) efforts to comply with cease key dates mandated by CJCSI 6510."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.230"
                                            },
                                            "Text": {
                                                "val": "Determined optimal algorithms and engineering approaches to modernize various embedded cryptographic modules within Army communications systems and data links.  The analysis and resulting program plans used a complete life cycle approach and included fielding, training, and sustainment as well as the technical approach to ensure compliance with NSA mandated cease key dates, while minimizing cost.  Initiated contract for, the necessary non-recurring testing, engineering and development of hardware and software.  Preliminary fielding and training plans developed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.248"
                                            },
                                            "Text": {
                                                "val": "Software engineering and coding to upgrade the government purpose rights software code used in software defined radios to ensure these radios remain secure by employing algorithms and keys that comply with CJCSI 6510.  System engineering activities including detailed requirements decomposition, and functional allocation.  Design of modern reprogrammable cryptographic modules.  Detailed hardware design and software coding."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.349"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.349"
                                            },
                                            "Text": {
                                                "val": "Continue execution of NRE efforts to develop, design, test\/evaluate, and certify cryptographic hardware and software embedded in tactical radios to ensure these radios remain secure. System engineering activities including detailed requirements decomposition, and functional allocation.  Design of modern reprogrammable cryptographic modules.  Detailed hardware design and software coding."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "491"
                                    },
                                    "Title": {
                                        "val": "Information Assurance Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.401"
                                        },
                                        "CurrentYear": {
                                            "val": "7.431"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.194"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.194"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.872"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.303"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.884"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.600"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "ET9"
                                    },
                                    "Title": {
                                        "val": "Embedded Crypto Modernization"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "4.585"
                                        },
                                        "BudgetYearOne": {
                                            "val": "88.949"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "88.949"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "51.057"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.974"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "159.565"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96002"
                                    },
                                    "Title": {
                                        "val": "Cryptographic Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.206"
                                        },
                                        "CurrentYear": {
                                            "val": "66.692"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.441"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "49.441"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "40.276"
                                        },
                                        "BudgetYearThree": {
                                            "val": "86.306"
                                        },
                                        "BudgetYearFour": {
                                            "val": "98.519"
                                        },
                                        "BudgetYearFive": {
                                            "val": "102.302"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96006"
                                    },
                                    "Title": {
                                        "val": "Embedded Cryptographic Modernization"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "3.014"
                                        },
                                        "BudgetYearThree": {
                                            "val": "97.969"
                                        },
                                        "BudgetYearFour": {
                                            "val": "157.904"
                                        },
                                        "BudgetYearFive": {
                                            "val": "48.382"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BS9716"
                                    },
                                    "Title": {
                                        "val": "NON PEO-SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.170"
                                        },
                                        "CurrentYear": {
                                            "val": "2.545"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.635"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.635"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.170"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.917"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.961"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Line Item & Title:\n491 - Information Assurance Development - RDTE - funding executed by PL Net E, CIO\/G6 and PL ES-CYBER\nET9 - Embedded Crypto Modernization - RDTE   \nB96002 - Cryptographic Systems - OPA2 \nB96006 - Embedded Cryptographic Modernization - OPA2\nBS9716 - NON PEO-SPARES  - OPA4"
                        },
                        "AcquisitionStrategy": {
                            "val": "The objective of this program is to integrate and validate hardware and software solutions to provide COMSEC superiority in order to protect against threats, increase battlefield survivability\/lethality, and enable critical Mission Command activities. The objective of the Cryptographic Systems program is to provide adaptive, flexible, and programmable cryptographic systems using best practices, lessons learned and programmatic management to meet the challenge of modernizing the Army's aging cryptographic systems. The effort will support the network operations from end-to-end throughout the force and the Common Operating Environment (COE) thus mitigating networked vulnerabilities to Army information security systems.  CDD, approved by CIO\/G6, 15 Jul 10; ICD, approved by JROC, 25 Mar 11; AAO; approved by G3, 15 Dec 11 and increased, 19 Jun 15."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM RDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.272"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.965"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.682"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.133"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.133"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.937"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.646"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.515"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.600"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton (BAH)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.450"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.245"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.725"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.953"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.953"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AASKI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edgewood, Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.971"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.625"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.148"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.757"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.757"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Information Assurance System Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DSCI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, Maryland"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.243"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.139"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.247"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.255"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.255"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Embedded Crypto Modernization Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.230"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15.248"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "19.349"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "19.349"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160781-22.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "VACM INTEROPERABILITY"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TEST AND EVALUATION OF LINK\/TRUNK ENCRYPTORS SW"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TEST AND EVALUATION OF SECURE VOICE SW & HW"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "TEST AND EVALUATION OF INE SW & HW"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HAIPE EXTENSION MANAGER"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ECMI DEVELOPMENT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET9"
                    },
                    "ProjectTitle": {
                        "val": "Embedded Crypto Modernization (CRYPTO MOD)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.585"
                        },
                        "BudgetYearOne": {
                            "val": "88.949"
                        },
                        "BudgetYearOneBase": {
                            "val": "88.949"
                        },
                        "BudgetYearTwo": {
                            "val": "51.057"
                        },
                        "BudgetYearThree": {
                            "val": "14.974"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "159.565"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "ET9 – The Embedded Crypto Modernization Initiative (ECMI) line was established in July 2015"
                        },
                        "ProjectMissionDescription": {
                            "val": "Embedded Cryptographic Modernization Initiative (ECMI) is an upgrade activity that will ensure enduring Army radios remain secure by operating with modern cryptographic algorithms and keys.  Tactical radios using embedded cryptographic systems will no longer be able to communicate securely after cease key dates documented in the Chairman of the Joint Chiefs Staff instruction (CJCSI) 6510. In order to ensure Warfighters continue to have secured communications (i.e., encrypted data and voice), Army tactical radios are required to modernize their cryptographic capabilities by implementing the modern algorithms.  If cease key dates are not met, the Army will be forced to communicate at risk."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Embedded Cryptographic Modernization Initiative (ECMI) Development Contracts"
                                    },
                                    "Description": {
                                        "val": "ECMI Non Recurring Engineering (NRE) Contract Prep Work and Execution"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.585"
                                            },
                                            "Text": {
                                                "val": "Complete acquisition documentation and award contracts to develop, design, test\/evaluate, and certify cryptographic hardware and software embedded in tactical radios to ensure these radios remain secure. System engineering activities including detailed requirements decomposition, and functional allocation. Design of modern reprogrammable cryptographic modules. Detailed hardware design and software coding."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "88.949"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "88.949"
                                            },
                                            "Text": {
                                                "val": "Support NRE development of ECMI efforts for vendor developmental and production contracts which supports NSA mandated Cease Key Date IAW CJCSI 6510.02E.  This capability will ensure Army tactical radios possess the latest cryptographic solutions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "491"
                                    },
                                    "Title": {
                                        "val": "Information Assurance Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.401"
                                        },
                                        "CurrentYear": {
                                            "val": "7.431"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.194"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.194"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.872"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.303"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.884"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.600"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DV5"
                                    },
                                    "Title": {
                                        "val": "Crypto Modernization"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.850"
                                        },
                                        "CurrentYear": {
                                            "val": "21.565"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.047"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.047"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.847"
                                        },
                                        "BudgetYearThree": {
                                            "val": "24.843"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.599"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.666"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96002"
                                    },
                                    "Title": {
                                        "val": "Cryptographic Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.206"
                                        },
                                        "CurrentYear": {
                                            "val": "66.692"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.441"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "49.441"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "40.276"
                                        },
                                        "BudgetYearThree": {
                                            "val": "86.306"
                                        },
                                        "BudgetYearFour": {
                                            "val": "98.519"
                                        },
                                        "BudgetYearFive": {
                                            "val": "102.302"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B96006"
                                    },
                                    "Title": {
                                        "val": "Embedded Cryptographic Modernization"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "3.014"
                                        },
                                        "BudgetYearThree": {
                                            "val": "97.969"
                                        },
                                        "BudgetYearFour": {
                                            "val": "157.904"
                                        },
                                        "BudgetYearFive": {
                                            "val": "48.382"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BS9716"
                                    },
                                    "Title": {
                                        "val": "NON PEO-SPARES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.170"
                                        },
                                        "CurrentYear": {
                                            "val": "2.545"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.635"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.635"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.170"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.917"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.961"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Line Item & Title:\n491 - Information Assurance Development - RDTE - funding executed by PL Net E, CIO\/G6 and PL ES-CYBER\nDV5 - Crypto Modernization - RDTE\nB96002 - Cryptographic Systems - OPA2\nB96006 - Embedded Cryptographic Modernization - OPA2\nBS9716 - NON PEO-SPARES - OPA4"
                        },
                        "AcquisitionStrategy": {
                            "val": "The objective of the Cryptographic Systems program is to provide adaptive, flexible, and programmable embedded cryptographic solutions using best practices, lessons learned and programmatic management to meet the challenge of modernizing the Army's aging cryptographic systems. ECMI will design, develop, and execute upgrade activities to ensure all enduring Army tactical radios that employs embedded cryptographic hardware will be able to accept and utilize modern cryptographic keys.\n\nApplicable documents affecting Tactical Radio ONS, ORD, & CPDs requiring crypto:\nCDD for Cryptographic Equipment and Services Modernization, Increment 1, dated March 2010.\nCJCSI 6510.02E – “Cryptographic Modernization Planning”, 01 April 2014.\nCNSSP-15 – “National Information Assurance Policy on the Use of Public Standards for the Secure Sharing of Information Among National Security Systems”, 01 October 2012.\nNSA CSS 3-9 – “Cryptographic Modernization Initiative Requirements for Type 1 Cryptographic Products”, dated 28 March 2013.\nMemorandum from Army Acquisition Executive with subject “Management and Procurement of Communications Security (COMSEC) Capability, dated 28 Feb 2012."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PL NET E Program Mgmt Personnel"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.837"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.968"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.968"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PM TR Program Mgmt Personnel"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAH"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.424"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PM TR Program Mgmt Personnel"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.324"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ECMI Development Contracts"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "83.981"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "83.981"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160781-23.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "ECMI DEVELOPMENT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ECMI DEVELOPMENT CONTRACT AWARDS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FF8"
                    },
                    "ProjectTitle": {
                        "val": "Unit Activity Monitoring (UAM)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.552"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.552"
                        },
                        "BudgetYearTwo": {
                            "val": "0.971"
                        },
                        "BudgetYearThree": {
                            "val": "0.983"
                        },
                        "BudgetYearFour": {
                            "val": "1.046"
                        },
                        "BudgetYearFive": {
                            "val": "1.071"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.623"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "User activity monitoring (UAM) automation\/analytics will provide technical capability to enhance Army UAM analysis effectiveness and efficiency. The UAM mission is to observe and record the actions and activities of an individual, at any time, on any device accessing Army information on classified networks in order to detect insider threats and to support authorized investigations. Army UAM is a component of the Army Insider Threat (InT) Program. Army's InT Program and UAM are conducted in accordance with the National Defense Authorization Act for Fiscal Year 2012, section 922., Insider Threat Detection; Presidential Memorandum, National Insider Threat Policy and Minimum Standards for Executive Branch Insider Threat Programs, dated 21 November 2012; Executive Order 13587, Structural Reforms to Improve the Security of Classified Networks and the Responsible Sharing and Safeguarding of Classified Information, (Reference b) dated 7 October 2011, and Army Directive 2013-18 (Army Insider Threat Program), 31 July 2013. Innovative enhancements are required to improve UAM analysis productivity, data visualization, and workflow management. The analysis productivity objective is to develop and implement user behavior models that use UAM and other network data to identify anomalous user behavior over time, and to integrated new data sources into the UAM analytical data store and processing system. Data visualization advances will present UAM analysts behavior model processing results in an intuitive format that reduce the time required to review the results. Workflow management improvements will add new capabilities to the UAM workflow management system with the objective of enhancing analysis reporting productivity and metrics collection."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unit Activity Monitoring"
                                    },
                                    "Description": {
                                        "val": "FY 2018 marks the first UAM automation\/analytics program year. FY 2018 Base funds in the total amount of $1.552 million are provided for software engineering development and testing resources to enhance the Army’ UAM data processing, analysis, and data visualization capabilities, and its workflow management system, plus the integration of new data sources into the data processing component. All work is focused on the development of new capabilities.\n\nThe details of this program are reported in accordance with Title 10, United States Code, Section 119(a)(1)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.552"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.552"
                                            },
                                            "Text": {
                                                "val": "Unit Activity Monitoring"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "FY18: The planned acquisition strategy to acquire UAM Automation\/Analytics software engineering services is to award through the use of competitive acquisition,\na Base plus three-option year firm-fixed price contract.\n\nFY19: The planned acquisition is to exercise option year one of the software engineering services contract."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}