{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-27",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603826D8Z"
        },
        "ProgramElementTitle": {
            "val": "Quick Reactions Special Projects (QRSP)"
        },
        "R1LineNumber": {
            "val": "63"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "258.304"
            },
            "PriorYear": {
                "val": "69.506"
            },
            "CurrentYear": {
                "val": "74.943"
            },
            "BudgetYearOne": {
                "val": "69.203"
            },
            "BudgetYearOneBase": {
                "val": "69.203"
            },
            "BudgetYearTwo": {
                "val": "72.985"
            },
            "BudgetYearThree": {
                "val": "80.547"
            },
            "BudgetYearFour": {
                "val": "84.697"
            },
            "BudgetYearFive": {
                "val": "86.441"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The QRSP Program Element develops risk-reducing prototypes and conducts demonstrations designed to develop capabilities in anticipation of emerging adversary threats, while addressing immediate Combatant Commands (CCMD) needs.  QRSP efforts support the Department’s goal to provide a hedge against technical uncertainty by acting as an incubator for developing potentially game-changing capabilities and by fostering collaboration among other government agencies, DoD laboratories, academia, and the commercial sector.  DoD’s strategy recognizes a return to a more competitive environment with resurgence of near-peer competitors and adversaries who have studied and worked to counter U.S. technological capabilities.  QRSP provides an agile mechanism to affordably counter emerging technological threats and help maintain the United States’ competitive advantage.  Specifically, QRSP enables the Under Secretary of Defense for Acquisition, Technology, and Logistics (USD(AT&L)) and the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) to anticipate and respond to emergent DoD issues and time-sensitive threats by selecting projects within the year of execution.  Project selection is guided by Department-level strategies and priorities, such as the building blocks for the Third Offset Strategy, Reliance 21, the Long Range Research and Development Program Plan, and CCMD Integrated Priority Lists (IPLs).  QRSP efforts field new capabilities at low cost and in short time-frames, inform the requirements process, and inject innovative technologies into programs of record.  The QRSP Program supports four major project codes that expedite development and transition of new capabilities to the warfighter.  These project codes are:  1) Quick Reaction Fund (QRF), 2) Rapid Reaction Fund (RRF), 3) Joint Rapid Acquisition Cell (JRAC) support, and 4) Strategic Multi-Layered Assessment (SMA) Cell support.  Focus areas within these project codes align to DoD science and technology priorities, including counter anti-access\/area denial; counter weapons of mass destruction; target identification and tracking; surveillance, intelligence, and reconnaissance; low-cost precision engagement; counter-electronic warfare; and, autonomous systems.\n\nThe QRF Program objectives are to develop prototypes in response to emergent conventional warfare needs that take advantage of breakthroughs in rapidly evolving technologies.  The QRF is executed by the Rapid Reaction Technology Office (RRTO).  QRF projects focus on force protection to enhance anti-access and area denial capabilities, broad electronic warfare capabilities, mitigating hardware and software vulnerabilities, and autonomous learning systems for processing and analyzing intelligence streams.  QRF initiates projects during the execution year and focuses on maturing technologies critically needed for the CCMDs by producing prototypes for demonstration and evaluation.  QRF projects typically advance  Technology Readiness Level (TRL) four to five technologies to transition them to an end user or CCMD at a TRL of seven or higher with a total project duration of 12 months.  The QRF consistently exceeds the transition objective of 40 percent for demonstration programs (DoD Strategic Objective 3.5.2D).\n \nThe RRF Program objectives, executed by RRTO, are to develop proof-of-principle prototypes to counter emerging irregular warfare threats, anticipate adversaries’ exploitation of new technologies, and expedite delivery of effective, affordable, and critically needed capabilities to the warfighter.  RRF initiatives support the DoD Research and Engineering Enterprise mission to develop, demonstrate, assess, and rapidly field innovative concepts and technologies that supply critical capabilities to meet time-sensitive operational needs.  RRF leverages emerging capabilities, such as advanced algorithms and software intelligence, to enable virtual prototyping with agile capability delivery and technology insertion.  RRTO leverages our traditional industrial bases and non-traditional suppliers in the commercial sector, academia, international arenas, and small businesses to address DoD needs as identified by CCMD, Military Service organizations, other Defense organizations, and interagency partners.  Typical RRF programs are 6 to 18 months in duration and aim to mature a capability to demonstration.  The RRF consistently exceeds the transition objective of 40 percent for demonstration programs (DoD Strategic Objective 3.5.2D).       \n\nThe JRAC Program objectives focus on responding to Joint Urgent Operational Needs (JUONS) and Joint Emerging Operational Needs (JEONS) that have been submitted by CCMDs and validated by the Joint Staff.  In addition, the JRAC’s objectives are to manage the delivery of capabilities as requested by the CCMD in a timeframe acceptable to the CCMD.  Efforts, in most instances, use contingency and other rapid acquisition authorities.\n\nThe SMA Cell objective is to support all CCMDs, Joint Force Commanders, and other government agencies by assessing complex operational and technical challenges, which require collaborative multi-agency and multi-disciplinary approaches.  With input from across the United States Government, academia, and the private sector, the SMA Cell develops options to Joint Staff and CCMD-generated challenging problems that inform senior leadership.  Each assessment is initiated at the request of CCMD senior leadership.  Priorities for SMA Cell programs are set by the Joint Staff Deputy for Operations.  Products are typically generated within six months and directly contribute to the decision-making process of the Joint Staff and CCMD's senior leadership."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "70.320"
                },
                "CurrentYear": {
                    "val": "74.943"
                },
                "BudgetYearOne": {
                    "val": "69.442"
                },
                "BudgetYearOneBase": {
                    "val": "69.442"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "69.506"
                },
                "CurrentYear": {
                    "val": "74.943"
                },
                "BudgetYearOne": {
                    "val": "69.203"
                },
                "BudgetYearOneBase": {
                    "val": "69.203"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.814"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.239"
                },
                "BudgetYearOneBase": {
                    "val": "-0.239"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.400"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.214"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Internal Baseline Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.239"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.239"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 to FY 2018 funding profile decrease reflects adjustments for Departmental priorities and requirements.\n\nThe FY 2018 baseline funding decrease is being applied to fund higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P826"
                    },
                    "ProjectTitle": {
                        "val": "Quick Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "80.683"
                        },
                        "PriorYear": {
                            "val": "21.451"
                        },
                        "CurrentYear": {
                            "val": "23.675"
                        },
                        "BudgetYearOne": {
                            "val": "21.828"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.828"
                        },
                        "BudgetYearTwo": {
                            "val": "23.045"
                        },
                        "BudgetYearThree": {
                            "val": "25.618"
                        },
                        "BudgetYearFour": {
                            "val": "26.993"
                        },
                        "BudgetYearFive": {
                            "val": "27.441"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Special Projects (QSRP) Program supports four separate project codes that provide rapid funding to expedite development and transition of new prototypical technologies to the warfighter.  The QSRP Program provides the flexibility and agility to mitigate emerging threats and address needs that arise faster than the two-year budget cycle. \n\nThe Quick Reaction Fund (QRF) Program provides the Services, components, Combatant Commands (CCMDs), and force providers opportunities to capitalize on relatively mature technologies to rapidly develop and field-test promising new proof-of-principle prototypes that can have immediate impact on time-sensitive operational needs.  QRF initiatives typically deliver a prototype application within 12 months of being funded.\n\nThe QRF Program focuses on projects that have the potential to address conventional, disruptive, and asymmetric warfare needs through rapidly developed and fielded hardware.  More specifically, the QRF Program includes initiatives that serve to maintain a technical advantage over potential adversaries and reduce technical risk barriers in the following interest areas: counter anti-access and area denial capabilities; base protection; electromagnetic bandwidth and spectrum enhancement; persistent intelligence, surveillance, and reconnaissance; newly emerging national threats; human-machine collaborative decision making; and, counter-electronic warfare technologies.  \n\nIn FY 2017 and FY 2018, the QRF Program will continue to identify and fund new, rapidly developed prototypes and technology demonstrations that respond to critical operational needs and emerging threats.  Investments are made in the execution year for agile response to Department, CCMD, Service, and other government organization identified threats and opportunities.\n\nRecent success stories and significant transitions of note include:\n• Columbia:  This project is an electronic countermeasure system designed to address a specific threat to U.S. forces.  Details are classified.  The Columbia effort delivered a size, weight, and power (SWaP) assessment and laboratory electromagnetic interference\/electromagnetic compatibility (EMI\/EMC) analysis of a sustainable, maintainable, self-contained capability that will mitigate the effects of an attack by an overwhelming number of threats - individually or simultaneously.  Columbia transitioned to the Air Force in 2016. \n• Dark Storm:  This project successfully developed and fielded low-cost, innovative space situational awareness (SSA) capabilities.  Data collected from six remote sites was transferred and consolidated at a central site to provide increased SSA.  The full capability transitioned to a classified customer.\n• Deer Hunting:  As a follow-on to the initial prototype, this project automated a proven target discovery process that was demonstrated for the National Security Agency (NSA).  The automation allowed Deer Hunting to scale and transition to other projects using a target agnostic approach.  The classified capability transitioned to U.S. Central Command and other missions within the Department of Defense and Intelligence Community.  \n• Interruption of Wide-Area Sensing Capability (IWAS):  Persistent, wide-area surveillance capabilities threaten U.S. Navy open-ocean supremacy.  The IWAS project developed an electronic attack technique effective against wide-area surveillance sensors to disrupt their kill-chain.  The project successfully demonstrated the electronic attack capability before transitioning it to Defense Advanced Research Projects Agency (DARPA) to support development of specific applications.  Further details are classified."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "U.S. Central Command (USCENTCOM) Counter Islamic State of Iraq and the Levant (ISIL) Initiatives"
                                    },
                                    "Description": {
                                        "val": "This project, in anticipation of emerging needs, will include rapidly developing prototypes that enable the U.S., in coordination with coalition partners, to expeditiously defeat ISIL.  Efforts will support partnering with the military and other security forces of, or associated  with, the Government of Iraq, including Kurdish, tribal security, and other local security forces.  Prototypes will include defense articles, defense services, and related training to more effectively partner with the U.S. and other international coalition members to defeat ISIL.  In support of the Counter-ISIL strategy, QRF will fund prototypes in these areas that can be completed in 12 months and be rapidly deployed to the warfighter.  The RRTO will ensure the QRF efforts are not duplicative with other Counter-ISIL strategy efforts and will seek to leverage other such efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.739"
                                            },
                                            "Text": {
                                                "val": "This project identified, developed, and transitioned technical capabilities to support partnering with U.S. allies associated with the Government of Iraq, including Kurdish, tribal security, and other local security forces.  Prototypes included defense hardware, services, and training tools.  Specifically, this project developed a speech transcription prototype that can quickly identify, classify, and transcribe speech from multiple data channels.  These efforts increased coalition capabilities to expeditiously defeat ISIL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in Counter-ISIL strategy initiatives during the budget year will respond to Department, CCMD, Service, and other government organizations priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the DoD, Federally Funded Research and Development Centers (FFRDCs), other government agencies, industry, and academia will help identify areas critical to counter-electronic warfare efforts.  QRF anticipates funding four to five projects in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robust Automatic Transcription of Speech"
                                    },
                                    "Description": {
                                        "val": "Robust Automatic Transcription of Speech (RATS) technology was designed to determine if and when there is speech in a captured signal to dramatically increase the efficiency and speed of communications intelligence (COMINT) signals analysis.  Once speech has been detected, the technology can identify speakers, languages, and keywords in real time across multiple channels.  The focus of this effort is to support counter Islamic State of Iraq and the Levant (ISIL) missions.  Transition partner applications integrate RATS technology with digital receiver platforms to automatically alert an analyst to new channels of interest, determine if a channel should be transmitted to the ground, scan other frequencies for desired signals, and control a digital receiver to dwell on the given channel.  This project is a collaboration with Naval Air Systems Command Maritime Patrol and Reconnaissance Aircraft Program Office (PMA-290), focusing on near-term deployment and follow-on integration on Navy signals intelligence platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "The RATS project integrated the RATS algorithms with digital receivers to automatically identify and triage speech signals of interest.  RATS significantly increases analyst effectiveness while reducing the load on personnel analyzing incoming signals, allowing them to focus on the most relevant data and not the discovery of new speech signals that are difficult to manually find.  There are currently not enough personnel, bandwidth, or aircraft to manually process all signals of interest for relevant speech, leading to important information being lost or ignored.  In FY 2017, RATS will operationally deploy in support of U.S. Central Command and transition to Naval Air Systems Command Maritime Patrol and Reconnaissance Aircraft Program Office."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CyberPhantom"
                                    },
                                    "Description": {
                                        "val": "The effort is focused on the development of fully customizable cyber tools for open network exploitation.  The solution leverages best practices of the U.S. Government’s cyber workforce and expands the capability of the DoD to operate in cyber space with a unique blend of commercial-off-the-shelf (COTS) software integrated with new customized tools.  Further details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Text": {
                                                "val": "CyberPhantom is designed to enhance the Combatant Commands (CCMDs) capability to operate and exploit cyber information in near real-time.  This capability provides the Warfighter with tools designed for open network exploitation for a fraction of the cost of existing programs.  CyberPhantom was executed in coordination with the broader cyber community of interest and enhances the CCMDs' ability to conduct advanced open network exploitation within cyber space to support emerging mission requirements.  This capability will transition to Cyber Command for a classified mission."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hammerhead"
                                    },
                                    "Description": {
                                        "val": "The Office of the Secretary of Defense, Acquisition, Technology, and Logistics is responding to the need for more available courses of action (COAs) in the event of certain space systems contingencies.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "This program developed and demonstrated a prototype capability that can trigger a tailorable COA on demand.  Details are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "This project will continue development efforts and support multiple demonstrations.  Details are classified."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "This project will conduct field testing and prototype improvements in FY 2018.  Transition to the end user is expected in FY 2018.  Details are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dark Storm"
                                    },
                                    "Description": {
                                        "val": "The program provides advanced Space Situational Awareness (SSA) capabilities.  Dark Storm successfully addressed important knowledge gaps to further protect U.S. interests in space.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "The program deployed Dark Storm hardware to six test sites and proved data transfer processes to transmit data to a central site.  The central site included software to enable processing and integration of the data.  The field equipment was hardened against weather and tampering.  The Dark Storm capability transitioned to a classified customer in FY 2016."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hardware\/Software (HW\/SW) Assurance and Integrity Analysis"
                                    },
                                    "Description": {
                                        "val": "The Department of Defense (DoD) has developed a trusted systems strategy that is based upon mission assurance, comprehensive protection planning, industry standards and advancing DoD's capability to identify and mitigate HW\/SW vulnerabilities through automated techniques and tools.  This project supports research and development focus to coordinate and improve capabilities to current and future programs in acquisition, operational systems and infrastructure to improve availability.\n\nThese HW\/SW Assurance projects directly support all elements in the 2014 National Defense Authorization Act (NDAA) Section 937.  It provides funding for the Department's capabilities to federate existing HW\/SW assurance expertise, capabilities and facilities within the Services and Agencies, to address existing gaps, as well as emerging threats and vulnerabilities.  The Federation detects, assesses, and prioritizes critical mission vulnerabilities to malicious software attacks and supply chain exploitation vulnerabilities, promulgate findings, and mitigate critical vulnerabilities in both SW and HW.\n\nThis program established the Joint Federated Assurance Center (JFAC) which provides federation of hardware and software assurance expertise and capabilities to support program needs.  Capabilities developed and demonstrated are transitioned in the Trusted and Microelectronics Program Elements 0604294D8Z BA4 and 0605294D8Z BA5, and enhance the hardware assurance capabilities of the JFAC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "The Joint Federated Assurance Center (JFAC), established to achieve the above objectives, achieved IOC.  The JFAC NIPR website which contains information and training about assurance and assurance services across the Department became operational.  The Concept of Operations (CONOPS) was completed and signed by all stakeholders.  Draft standard operating procedures (SOPS) were developed and are in maintenance.  The pilot central buy of SW assurance (SwA) tools was completed.  The pilot direct distribution of SwA tools directly to requesting engineers is in operation.  Major DoD  labs are mutually coordinating for prioritized support to DoD programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Achieve plan for JFAC full operational capability (FOC) by conducting the Department-wide assurance capability and capacity gap analyses for software, hardware, and firmware assurance; update the JFAC SOPs to support programs; serve assurance needs of programs; expand upon and maintain software, hardware, and firmware assurance capability maps; survey software and hardware assurance needs of programs and other organizations; coordinate, automate, and implement enterprise licensing for DoD-wide automated distribution and management of SwA engineering tools; and implement outreach to programs and organizations for assurance planning, training, contracting, best practices, and vulnerability and defect remediation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "This program will continue development, assessment, recommendation and promulgation of software test tools and techniques to programs.  It will continue maturation of a federated approach to ensuring HW\/SW tools, techniques, expertise, and R&D transition and support to acquisition and sustainment programs, and continue HW\/SW capability identification, gap identification, assessment, prioritization and remediation.  The program will continue SW assurance tool license acquisition, and using centralized inventory and operational management, promulgate licenses and tools directly to engineers in programs at the time needed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robust Tactical Data Link Modernization"
                                    },
                                    "Description": {
                                        "val": "This project developed new Link 16 improvements for increased anti-jam communication performance.  This project also includes design for a real-time processor that fits into existing radio circuit card slots.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.688"
                                            },
                                            "Text": {
                                                "val": "In an operational demonstration this project validated significant anti-jam performance improvements for Link 16 and developed hardware to fit existing radio designs on tactical aircraft.  The capability transitioned to the Air Force Program Executive Office for Command, Control, Communications, Intelligence, and Networks and the Navy Multi-Functional Information Distribution System (MIDS) program office."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project 419"
                                    },
                                    "Description": {
                                        "val": "This project delivered a specific operational capability that addresses information needs.  Using existing assets, Project 419 provides initial operations collection with a unique sensor system.  The project provided the Combatant Commands and intelligence agencies an advanced capability with the potential to characterize critical undiscovered signals of interest.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.650"
                                            },
                                            "Text": {
                                                "val": "This project demonstrated use of collected sensor data and information streams to develop and execute advanced algorithms to detect and prosecute high value signals of interest.  This capability transitioned to a classified customer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects (Projects Less Than One Million Dollars Each)"
                                    },
                                    "Description": {
                                        "val": "Selected, executed, and transitioned three low cost projects.  These projects delivered proof-of-principle prototypes for evaluation and assessment by warfighters and interagency users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.674"
                                            },
                                            "Text": {
                                                "val": "• Deer Hunting:  A classified project to automate proven hard-target discovery processes and scale them for use across multiple agencies.  These processes and techniques are target agnostic and therefore can be applied to any target set (hard targets or otherwise).  The capability transitioned to U.S. Central Command and the intelligence community.\n• Activity-Based Intelligence:  A classified project to correlate geospatial intelligence, human intelligence, signals intelligence, and other datasets based on geo-temporal and unique-attribute metadata.  The capability transitioned to U.S. Strategic Command and the National Security Agency.\n• Multi-Agency Bioinformatics Platform:  This project developed a user interface and analytics platform to support rapid ingestion and analysis of bioinformatics data and provide actionable reports.  The platform is an open ended architecture to allow for interoperability within and outside the DoD.  The initial prototype transitioned to the Defense Intelligence Agency, Defense Health Agency, and the Army Criminal Investigation Command."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Access\/Area Denial Focus Area"
                                    },
                                    "Description": {
                                        "val": "In FY 2017 and FY 2018, this Quick Reaction Fund (QRF) focus area will support projects to develop capabilities and countermeasures for emerging needs to monitor and, as needed, gain access to geographical areas that have been strategically denied by adversarial forces and technologies.  The Rapid Reaction Technology Office (RRTO) will seek to leverage existing capabilities and ensure QRF efforts are not duplicative with other work within the Defense Department or with outside agencies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.230"
                                            },
                                            "Text": {
                                                "val": "Anti-access\/area denial investment decisions during the budget year will respond to Department, Combatant Command (CCMD), Service, and other government organization priorities to address increasing capabilities of near peer adversaries.  Through coordination with the Department of Defense (DoD), Federally Funded Research and Development Centers (FFRDCs), other government agencies, industry, and academia, this focus area will help identify critical areas to address the dual challenges of getting into theater (the anti-access challenge) and operating under guided munitions threat (or the area-denial problem).  QRF anticipates funding two to three prototypes in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.382"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.382"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, QRF will continue efforts to identify and invest in capabilities that address anti-access\/area denial challenges.  These investments will be conducted to support, and in coordination with, DoD, CCMDs, Service, and other government organizations.  QRF anticipates funding three to four prototypes in FY 2018."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Emerging Electronic Warfare (EW) Technologies Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area, in anticipation of emerging needs, will include the maturation of proof-of-principle prototypes that advance countermeasures against electronic warfare (EW) components and systems to protect forces and achieve electromagnetic spectrum agility.  Operating in complex EW environments is critical to the success of the Third Offset Strategy.  Through this focus area RRTO will identify, mature, and demonstrate capabilities that anticipate adversaries’ EW technologies and enable advanced weapon systems hardened for complex EW threat environments.  The Rapid Reaction Technology Office will ensure QRF efforts are not duplicative with other counter-electronic warfare efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.197"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in counter-electronic warfare technologies during the budget year will respond to Department, CCMD, Service, and other government organizations' priorities as new opportunities and new threats emerge.  Planned investments will help local communication and coordination to increase weapon systems’ and forces’ effectiveness in contested environments.  RRTO will coordinate with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia to help identify critical areas to counter emerging electronic warfare threats.  QRF anticipates funding three to four projects in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.297"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, QRF will continue efforts to identify and invest counter-electronic warfare technologies that respond to DoD, CCMD, Service, and other government organizations priorities as new threats emerge or new opportunities are presented.  QRF anticipates funding three to four projects in FY 2018."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Machine Collaborative Decision Making Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area for FY 2017 and FY 2018, in anticipation of emerging needs, will include the development and advancement of rapidly developed proof-of-principle prototype technologies that focus on improving the indications and warning (I&W) for a variety of mission areas to include weapons of mass destruction and theater ballistic missiles.  Projects may include techniques and methodologies that improve detection sensitivities, data-to-decision tools, and global situational awareness.  The Rapid Reaction Technology Office (RRTO) will ensure the Quick Reaction Fund (QRF) efforts are not duplicative with other human-machine collaborative decision efforts and will seek to leverage other such efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.727"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in human-machine collaborative decision making efforts during the budget year will respond to Department of Defense (DoD), CCMD, Service, and other government organization priorities.  RRTO will consider new projects as new threats emerge or new opportunities are presented.  To help identify areas critical to human-machine collaborative decision making, RRTO will leverage research and coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia.  QRF anticipates funding two to three projects in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.871"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.871"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in human-machine collaborative decision making efforts during the budget year will respond to DoD, CCMD, Service, and other government organization priorities.  RRTO will consider new projects as new threats emerge or new opportunities are presented.  To help identify areas critical to human-machine collaborative decision making, RRTO will leverage research and coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia.  QRF anticipates funding two to three projects in FY 2018."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Intelligence, Surveillance, and Reconnaissance (ISR) Focus Area"
                                    },
                                    "Description": {
                                        "val": "In anticipation of emerging needs, this focus area for FY 2017 and FY 2018 will include developing ISR capabilities to improve ground, air, sea, and space situational awareness.  Projects will develop prototypes and may explore new or improved methods for surveillance sensors to persistently operate within denied areas.  This focus area also explores more effective and agile ISR architectures for rapidly processing, exploiting, and disseminating situational awareness intelligence, including in denied areas.  QRF will leverage existing efforts and ensure projects are not duplicative with on-going persistent ISR work within the Defense Department or with outside agencies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.921"
                                            },
                                            "Text": {
                                                "val": "Persistent ISR investment decisions during the budget year will respond to Department, CCMD, Service, and other government organization priorities.  Projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the government, industry, and academia will help identify areas critical to developing future ISR payloads.  QRF anticipates funding two to three projects in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.978"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.978"
                                            },
                                            "Text": {
                                                "val": "Persistent ISR investment decisions during the budget year will respond to Department, CCMD, Service, and other government organization priorities.  Projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the government, industry, and academia will help identify areas critical to developing future ISR payloads.  QRF anticipates funding two to three projects in FY 2018."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-throughput Deoxyribonucleic Acid (DNA) Sequencing (HTS) Technology Focus Area"
                                    },
                                    "Description": {
                                        "val": "The High-throughput DNA Sequencing (HTS) Technology Focus Area will leverage technological advances in gene sequencing and bioinformatics to fundamentally change the way DNA is used to support forensics.  These projects will employ current hardware coupled with custom chemistries, data analysis algorithms, software, databases, and information transmission pipelines to enable more comprehensive analysis of trace, degraded, and mixed DNA samples.  This comprehensive data analysis allows for correlating individual activities and histories; the ability to determine biogeographical ancestry; increasing confidence in assigning extended kinship identifications; and, greater accuracy in predicting phenotypic attributes such as facial characteristics, eye colors, skin tones\/variations, or physical deformities.  This focus area also includes support for HTS databases that are designed to ingest large DNA data flows efficiently, use processing power for searching and analyzing big data, and employ big data analytics to make predictive assessments that would otherwise go unnoticed.  This focus area will encourage collaboration on biometrics and forensics projects within the DoD, with interagency partners, with our partners in industry and academia, and with international partners where applicable.  This collaboration will help maximize shared investment and prevent redundant research.  Deliverables are shared throughout the biometrics and forensics communities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.600"
                                            },
                                            "Text": {
                                                "val": "This focus area will build upon prior work on mixture deconvolution, analysis of low-copy (degraded or trace) DNA, and the development of bioinformatics platforms that are device agnostic and allow analysis of DNA for multiple HTS applications.  The goal of the mixture deconvolution is to allow for the identification of individual profiles from mixed samples with up to eight contributors.  It will also explore the ability to identify common contributors across multiple mixtures.  The low-copy project will attempt to extend the sensitivity of current sequencing technologies from a minimum sample size of over 100 picograms (approximately 12 human cells) down to less than 50 picograms.  It will also work on protocols to analyze environmentally degraded samples.  The bioinformatics platform will provide a comprehensive user interface to current HTS platforms.  Finally, the program will initiate two feasibility studies.  The first will assess the potential costs and pitfalls in investing in efforts to determine appearance (notably head and face shape) through DNA.  The second will investigate how to identify if a DNA sample was modified or ‘spoofed’ to help ensure database integrity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "The HTS Program will leverage its on-going work to identify promising lines of HTS research that are feasible, cost effective, and meet the specific requirements of the end user.  Based on the outcomes of FY 2017, additional investments are expected in chemistry optimization, statistical refinement, and results interpretation.  Future investments will include database development and optimizations designed to integrate appropriate analysis software tools as they are developed or modified.  Transmission pipelines to access data, submit data, run analysis programs, and generate custom reports will be further defined based on needs of the community.  As more research becomes available to the life science community, the HTS program will work to identify new avenues of exploration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2018, performance metrics applicable to the Quick Reaction Fund (QRF) include attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a Strong Technical Foundation Within the Department's Science and Technology (S&T) Program\" and the metric for this objective is to transition 40 percent of completing demonstrations per year.  Each QRF project typically has a period of performance of 12 months.  All QRF projects are monitored for schedule deviation, transition outcome, and deliverables such as test reports, components, and equipment.  For projects that were completed in FY 2016, the QRF achieved a transition rate of approximately 50 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P828"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "164.854"
                        },
                        "PriorYear": {
                            "val": "44.348"
                        },
                        "CurrentYear": {
                            "val": "47.350"
                        },
                        "BudgetYearOne": {
                            "val": "43.418"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.418"
                        },
                        "BudgetYearTwo": {
                            "val": "45.943"
                        },
                        "BudgetYearThree": {
                            "val": "50.892"
                        },
                        "BudgetYearFour": {
                            "val": "53.626"
                        },
                        "BudgetYearFive": {
                            "val": "54.881"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Special Projects (QRSP) Program supports four separate project codes that provide rapid funding to expedite development and transition of needed capabilities to the warfighter.  The QRSP Program provides the flexibility and agility to mitigate emerging threats and support current operations, including counter terrorism, by addressing needs that arise faster than the two-year budget cycle.  \n\nThe Rapid Reaction Fund (RRF) is fully executed through the Rapid Reaction Technology Office (RRTO).  RRTO was established to accelerate the development and transition of high-potential science and technology (S&T) projects through operationally useful virtual and proof-of-principle prototypes within the execution year of an identified need.  The RRTO leverages the Department of Defense (DoD) S&T base and those of the other federal agencies, academia, and industry.  The office also stimulates interagency coordination and cooperation, expedites delivery of prototype capabilities and concepts to counter anticipated and emerging threats, and provides feedback to the S&T community to guide long term development strategies.  RRTO achieves this by anticipating adversaries' exploitation of technology, including available and emerging commercial capabilities, and rapidly responding to new threats and opportunities.  Projects support high level Department strategies and objectives, such as the building blocks for the Third Offset Strategy, the Defense Innovation Initiative, and geographic Combatant Command (CCMD) priorities.  Prototypes delivered and transitioned to operational users by RRTO demonstrate the feasibility of new technologies, enable integration into larger systems, and increase ‘speed to market’ by providing cost effective capabilities faster than typical acquisition cycles.\n\nIn prior years, RRTO, through RRF, explored novel methods and new approaches for persistent surveillance for counter-insurgency; developed alternate power sources for sensors and systems; provided low-cost capabilities for small-footprint operations; expanded human, social, and cultural knowledge relevant to military decision making; increased small unit situational awareness; advanced the interface between law enforcement and military operations; developed advanced biometrics and forensics capabilities; performed strategic multi-layer assessments; and, established a prototyping through non-traditional pathways outreach effort that facilitates better interactions with small, non-traditional companies developing emerging technologies.   \n\nIn FY 2017 and FY 2018, RRF will continue to provide a hedge against technology risk by identifying and developing near-term capabilities to support irregular warfare operations.  RRF projects support goals from the Under Secretary of Defense (Acquisition, Technology, & Logistics), the Assistant Secretary of Defense (Research and Engineering), and the Deputy Assistant Secretary of Defense (Emerging Capability & Prototyping).  With project selection occurring during the execution year, the RRF’s current focus areas include: open source data analysis; autonomous systems and behaviors; urban characterization; prototypes for intelligence, surveillance, and reconnaissance; additive manufacturing to rapidly field prototypes; maritime technologies; and, wargaming for emerging threats and capabilities.   \n\nThe typical length of an RRTO project falls within a 6 to 18 month range to more effectively respond to Warfighter needs.\n\nRecent success stories and significant transitions of note include:\n• Next Generation Sequencing for Personnel Accounting Applications:  This project successfully developed, demonstrated, and made operational a new DNA analysis process and supporting analytic software to conduct mitochondrial DNA analysis on highly degraded samples.  This process allows familial matching on remains degraded by environmental conditions or contaminants that are recovered in support of the personnel accounting mission, or for the identification of high value individuals. \n• Biometric Enabled Watchlist (BEWL) Dissemination Management Server (BMDS):  This project successfully developed and demonstrated an automated BEWL dissemination prototype that improved the speed of delivering customized biometric watch lists by 38 times, while also significantly reducing errors.  The Army Program Manager for Biometrics will incorporate this tool into the Automated Biometric Identification System architecture.\n• Large Displacement Unmanned Underwater Vehicle (LDUUV) Common Control System (CCS):  LDUUV CCS successfully developed and demonstrated initial integration of the common control system software with a representative LDUUV to inform future acquisition activities.  This effort demonstrated command and control of LDUUVs from an unmanned air system workstation.  The technical data package and final report have been delivered to the Navy’s Unmanned Maritime Systems (UMS) Program Office (PMS 406) to inform acquisition activities. \n• Flume:  The final phase of the Flume software project provided assured delivery of data over existing networks used by U.S. Special Operations Command (USSOCOM).  The final phase of development consisted of tailoring the software to U.S. Air Force Special Operations Command (AFSOC) missions.  The system demonstrated automated data transport, accelerated throughput, and high reliability through intermittent connections.  Flume has transitioned to AFSOC and other USSOCOM users.\n• Forward Firing Flare:  The Forward Firing Flare project delivered two ALE-47 chaff\/flare launchers in the forward firing configuration for nonstandard aircraft.  The products transitioned to assets deployed in support of U.S. Central Command (USCENTCOM).\n• Intelligent Materials Sensor System (IMSS):  The IMSS prototype uses a unique phosphorescent nanomaterial to provide target identification information when illuminated.  Following a successful demonstration of this optically-transparent tagging mechanism USSOCOM and the U.S. Army contracted for procurement of the IMSS tags. \n• Laser Threat Detection and Defeat:  The project completed development of a phase one prototype system and demonstrated the ability to detect and locate indoor threats.  Subsequent demonstrations at Trident Spector 16 validated detection outdoors and the system transitioned to defense criminal investigative organizations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects (Projects Less Than One Million Dollars Each)"
                                    },
                                    "Description": {
                                        "val": "Selected, executed, and transitioned multiple low cost projects in the areas of: unmanned autonomous vehicles, electromagnetic spectrum agility, space resiliency, detection of explosives and weapons of mass destruction, deterrence of violent extremism, exploitation of commercial off-the-shelf technology, exploitation of communications technologies, small footprint operations, and other emerging technology areas.  These projects delivered proof-of-principle prototypes for evaluation or assessment by warfighters and interagency users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.298"
                                            },
                                            "Text": {
                                                "val": "• Mesmer:  The Mesmer project developed a software framework for detecting, redirecting, denying, or taking control of various unmanned aerial systems (UAS).  Mesmer exploits digital radio protocols used by UASs.  The technology transitioned to the U.S. Special Operations Command (USSOCOM) for integration into existing force protection systems. \n• Orthos:  The project developed customizable, concealable field-sets that communicate position, brief messages, or code words to multiple, multi-purpose cross-connected receiver platforms in challenging threat or degraded communications environments.  Orthos transitioned to Special Operations Forces (SOF) warfighters from multiple components.\n• Vital Infrared Sensor Technology Acceleration (VISTA):  This project developed a novel focal plane array sensor with a cryogenic cooler and electronics.  The sensor package was demonstrated and transitioned to the Javelin’s Lightweight Command Launch Unit (LW-CLU) and the F-35’s Electro-Optics Distributed Aperture System (EODAS).\n• Optical System Protection:  This project developed a prototype optical system that protected imaging sensors against high intensity lasers using a custom-designed phase mask to mitigate laser damage.  A field unit was built and successfully tested to demonstrate the optical system’s capabilities at visible wavelengths.  This project transitioned to the Dahlgren Naval Surface Warfare Center High Energy Lasers.  \n• Dragonfly:  The project demonstrated automatic queuing and on-the-move processing in a small 360-degree infrared persistent surveillance prototype.  The Dragonfly system can be incorporated aboard small unmanned aerial systems to provide detection and tracking of vehicle and dismount activity within a five kilometer radius.  The Dragonfly capability transitioned to the Naval Special Warfare Groups (NSWG) and the Department of Homeland Security (DHS).\n• Passive Foliage Penetration (FOPEN):  Passive FOPEN developed a capability to image targets under foliage using passive sensors on airborne platforms.  Novel data-processing algorithms generate FOPEN products that were validated through simulations and real airborne data.  After a successful operational demonstration, the real-time hardware and software were made available to U.S. Southern Command transition partners. \n• Solid State Neutron Detector (SSND):  The project leveraged the single solid state neutron detector previously developed by the National Aeronautics and Space Administration (NASA) and the Department of Energy (DoE) to design, fabricate, and test a two neutron detector package with associated electronics.  This technology, which reduces material cost and false alarm rate while providing a 10-fold increase in detection sensitivity, has met all objectives for success.  The capability transitioned to the Joint Service Explosive Ordnance Disposal.\n• Project Viper:  The project delivered a classified method for high priority underwater capabilities.  The initial proof of concept was a success, proven using two undersea platforms.  Viper enabled initiation of a follow-on phase of work.  The capability transitioned to an operational user.  Details of this project are classified. \n• Airborne Computer Vision: This project provides a vision-enabled autonomous flight management system.  Airborne Computer Vision products transitioned to the U.S. Pacific Command for a classified mission and were evaluated for integration with V-22 Osprey, P-8A Poseidon, RQ-21 Blackjack, and Lockheed Stalker programs.\n• Advanced Inflatable Material Structures (AIMS):  The AIMS project rapidly developed an inflatable material capable of providing unique performance characteristics, structural rigidity, and compatibility with specialty coatings, while maintaining lightweight, collapsible, and durable properties.  This technology transitioned to the Naval Special Warfare Groups Three and Four for transition to multiple maritime platforms.\n• Ajax:  The Ajax project produced a comprehensive survey and lab demonstration of Fifth Generation (5G) wireless technologies.  The survey will assist the DoD in identifying the technical challenges that it will face when 5G technologies are commercially deployed.  The survey and lab demonstration results were provided to the Defense Threat Reduction Agency to be used as a technology roadmap.\n• Argonaut:  The Argonaut project produced a complete survey of N-Channel receiver architectures and individual offerings from industry and various labs around the country to benchmark a receiver’s performance for direction finding accuracy and price point.  The effort significantly reduced the price for a target solution by identifying low cost N-Channel receivers with increased performance through signal processing.  The architecture transitioned to the Army Intelligence Information Warfare Directorate.\n• Analytic Tools for the Objective Monitoring of Human Performance (ATOM-HP):  The project integrated a series of commercial wearable sensors to objectively monitor an individual's level of fatigue and corresponding mission readiness based on mathematical models developed through the evaluation of clinical trials.  The effort transitioned to the Office of Naval Research, Air Force Research Laboratory, Naval Health Research Center, and National Institutes of Health (NIH) for follow-on development of a more integrated sensor suite.\n• High Accuracy Video Object Classification (HAVOC):  HAVOC developed an inexpensive, customizable, and highly accurate real-time automatic target recognition (ATR) system for rapid exploitation of full motion video (FMV).  This technology transitioned to multiple Special Operations Forces (SOF) components and follow-on development resulted in a low size, weight, and power (SWAP) variant.\n• Model Enhanced Analysis, Design, & Execution (MEADE) predictive control system: MEADE successfully prototyped a software system and concept of operations that improved our ability to conduct analysis and planning at the operational level.  The effort transitioned to the Joint Special Operations Command (JSOC) and three Theater Special Operations Commands (TSOCs) for immediate support to the counter-Islamic State of Iraq and the Levant effort.\n• Radio Frequency (RF) Interference Phase One:  This project successfully developed and tested various millimeter-scale microwatt-class devices for RF interference purposes.  The results of the initial phase were positive and work continues to field a prototype system.  Details of this project are classified.\n• Scalable Effects Expeditionary Vehicle Interdiction (SEVI):  This project successfully developed an expeditionary, custom-built, multi-rotor personal reconnaissance device and payload capable of autonomously interdicting a moving target.  The prototype transitioned to the Naval Surface Warfare Command.  Details of this project are classified.\n• Vanilla:  This project successfully demonstrated the capability in an unmanned air vehicle (UAV) for a ten-day persistent flight with a 30 pound payload.  The payload demonstrated was a radio repeater but it can be customized for the end user’s needs.  This technology transitioned to the Naval Special Warfare Development Group for immediate use.\n• Bugeyes:  This project developed a three dimensional (3D), 360-degree filming and immersive training kit to support training for complex environments and dangerous missions.  Bugeyes brings the realm of mixed reality full immersion into the classroom training experience.  Bugeyes transitioned to U.S. Navy Special Warfare Command for use by Navy SEALs and was evaluated by the U.S. Army and Marine Corps Training Commands for integration into training.\n• Mobile Enabled Networks (MEN) for Rapid Integrated Strategic Assessment (RISA):  The project developed a field data collection capability for the RISA Water Security network.  It used a mobile device network to upload timely user-generated data from a mobile device software application.  MENRISA transitioned to the U.S. Army Geospatial Center.\n• The Event Notification System (TENS):  The project developed a near-term emerging technology to enhance capabilities for recovery and protection of abducted personnel.  TENS transitioned to the U.S. Northern Command.  Details of this project are classified.\n• Directed Laser Focus:  The project applied Optical Phase Conjugation (OPC) via digital holography, to tailor a laser beam’s spatial energy distribution and optimize overall system performance when transmitting long distances through the atmosphere.  This project was presented to the U.S. Special Operations Command (USSOCOM) users who confirmed the concept was highly relevant to various mission and began transition.  \n• Swift Vision:  The project developed a vision-enabled unmanned aerial system that facilitates a classified maritime mission.  The capability transitioned to the U.S. Pacific Command.\n• Arctivate:  The project successfully implemented the three-phase Arctivate operational model in select Middle East and North African countries to gather deeper insights about how local populations, especially cultural nodes such as youth, celebrities, and media, consume and exchange information.  This project transitioned to the U.S. Africa Command and U.S. Central Command.\n• Threat Detection and Tracking on Social Media:  The project developed analytical tools for detecting radicalization trajectories and linguistic markers for radical violence in social media.  These tools help analysts identify individuals susceptible to radicalization.  This project transitioned to the Joint Improvised Threat Defeat Agency (JIDA) and the National Security Agency (NSA).\n• Flexible Buoyant Body Armor:  The project developed a flexible and buoyant body armor system.  Within this effort multiple experiments were conducted to achieve National Institute of Justice ballistic protection levels three and four.  This capability transitioned to the Air Force Research Laboratory.\n• Sea Ice Detection:  The project successfully developed algorithms within the Rapid Image Exploitation Resource (RAPIER) framework to automatically detect and characterize ice in satellite synthetic aperture radar (SAR) data.  The system allows processing of large numbers of SAR images to produce maps of ice with key ice properties including thickness, surface area, edges, age (multi-year, first year, etc.), and discrimination between ships and icebergs.  The project transitioned to the U.S. Northern Command, U.S. European Command, and the U.S. Coast Guard.\n• Integrated Water Purification:  The project developed a solar powered, high efficiency, low maintenance pumping system that can support austere forward operating bases, humanitarian assistance, and disaster response.  The technology transitioned to the U.S. Army Geospatial Center and the U.S. Army Corps of Engineers.\n• Protocol Independent Networking:  The project developed a network interface capable of spanning a rack of equipment to provide an extremely low latency and high data rate network within the system.  The technology transitioned to the U.S. Navy for integration into submarine electronic warfare systems.\n• Black Ink:  The project developed a classified submarine warfare enabling technology.  The technology transitioned to the U.S. Navy for implementation in submarine sensor systems.\n• Illicit Networks Courseware:  The project developed a platform for wargaming global security challenges presented by illicit networks.  The technology transitioned to the National Defense University for collaboration with Service component professional military education.\n• Spyglass:  The project developed a graph database that can enhance the detection and monitoring of illicit transshipments via containers.  The technology transitioned to the Joint Interagency Task Force – South to help understand the cargo container threat vector and increase the probability of inspecting containers associated with illicit contraband.\n• Advanced Airlift Airship Technology:  The project fulfilled a congressional requirement to identify and assess key airship technologies, and to estimate the costs and time required for airship technology demonstrations.  \n• Life Cycle Cost Assessment Review of Alternative Satellite Constellation Space Systems Architecture:  The project provided an independent assessment of the credibility of program life cycle cost (LCC) estimates for acquiring, launching, operating, and sustaining a small satellite constellation.  The results of this assessment are informing satellite development and procurement activities.  Details are classified.\n• Bluebolt:  The project demonstrated an integrated proof-of-principal prototype electronic warfare (EW) technique against targets of interest in the Pacific Theatre.  The effort transitioned to the U.S. Pacific Command (USPACOM).  Details are classified.\n• Project Firefly:  This effort delivered the aero-body and rocket engine designs for a transonic (speed of Mach 0.8) micro-Unmanned Aerial Vehicle (UAV).  The developed prototype transitioned to the Air Force for flight control hardware integration and testing.\n• Geo-Enhanced Network Intelligence Environment (GENIE):  The project enabled estimation of geolocation from location-indicative terms and metadata features through the capabilities of the GENIE suite of automated machine learning algorithms.  The effort transitioned to the Defense Intelligence Agency (DIA) for integration into the Department of Defense (DoD) Intelligence Information System (DODIIS).\n• Jungle and Urban Non-Global Positioning System (GPS) Orientation (JUNO):  The project incorporated bionic power leg brace sensors into dead reckoning algorithms developed for navigation in GPS denied and degraded environments.  The prototype transitioned to the Space and Naval Warfare (SPAWAR) Systems Center Pacific (SSC Pacific) for integration into the Pacific’s Battlefield Objective Navigation Display (BOND) application for dismounted infantry.\n• Telemetry Buoy Undersea Communications System (TBUCS):  This effort prototyped a redesigned sonobuoy to communicate below water via a Hydro-Acoustic Information Link (HAIL) and above water via Ultra High Frequency (UHF) line of sight or Iridium satellite.  This allows submersibles, surface craft, and aircraft to communicate with each other in real time.  The prototype transitioned to the U.S. Special Operations Command (USSOCOM) Naval Special Warfare Command (NSW).\n• Ultra Wideband Soldier Radio:  This project developed a miniature ultra-wideband radio front-end capable of operating over a range from very high frequency (VHF) to 6 GHz.  The range provided by this front-end allows for multiple radios to be replaced by a single software defined radio. \n• Solid State X-Ray:  This effort developed a compact solid-state pulsed X-Ray generator for use by Explosive Ordnance Disposal (EOD) personnel.  The prototype improves the current capability available to EOD technicians by providing improved X-Ray pulse efficiency, battery performance, and image quality.  This effort transitioned to the Joint Service Explosive Ordnance Disposal (JSEOD).\n• Black Urchin:  The project delivered a maritime ruggedization, collection, and exfiltration (EXFIL) system designed for close-in access to targets of interest.  This technology transitioned to the Naval Special Warfare Command (NSW) and two members of the Intelligence Community.  The details of this project are classified.\n• Special Operations Forces (SOF) Combat Diver Communications:  The project developed and demonstrated an underwater non-detectable communications system for integration into the Naval Special Warfare Command (NSW) Surface vehicles, SEAL Delivery Vehicles (SDVs), Diver Propulsion Vehicles (DPV), and Unmanned Underwater Vehicles (UUVs).  The UUVs act as a communications node between SDVs and Combat Diving elements to provide near real-time communications and situational awareness (SA).  This technology transitioned to the Naval Special Warfare Command."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA) Cell"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell provides planning support to Combatant Commands (CCMDs) and U.S. Government agencies; and, provides actionable assessments for complex operational and technical challenges to help maintain our competitive advantage in an increasingly complex global environment.  SMA efforts leverage multi-agency, multi-disciplinary approaches to address requirements that are not within the customer organization’s core competency.  SMA assessments are framed during the execution years and are in response to specific tasking from senior leadership in the CCMDs.  The SMA Cell identifies options from across the U.S. Government, academia, and the private sector.  SMA efforts are facilitated by the Joint Chiefs of Staff\/J3 Operations and are executed by the Rapid Reaction Technology Office."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Text": {
                                                "val": "Support for the Commander of the U.S. Army Special Operations Command Central continued in FY 2016 with a short term ‘proof-of-concept’ effort to evaluate and assess options that include the ‘Cognitive Spaces’ along with narrative-based Information Operations (IO).  The IO objectives were to disrupt the Islamic State of Iraq and the Levant (ISIL) leadership’s ability to command and control forces; neutralize their ability to maintain or increase moral, political, and financial support; prevent recruitment of foreign fighters; and, ultimately, to psychologically isolate ISIL leadership.  The effort assessed the value of ‘integrated neuro-cognitive-narrative maneuver’ approaches to produce messages that are more likely to have intended effects and less likely to have undesirable, unintended, or collateral effects.  The effort also sought to deliver messages more effectively and efficiently by developing campaigns that undercut adversary effects (e.g. leadership fragmentation, organizational fracture, separating population from the organization) and achieve positive coalition effects.  The results of the ‘proof-of-concept’ were presented to the Army Strategic Land Power Task Force.  The task force is continuing to expand options identified by SMA.\n\nAt the request of the Commander of the U.S. Central Command (CENTCOM), the SMA stood up a reach back support cell to respond to questions generated by the Command.  The SMA efforts are designed to respond rapidly (days to weeks) to population focused requests from Commanders in the region, provide feedback regarding the impact from potential options, and provide inputs on messaging and counter-messaging options.  This will entail maintaining the current subject matter expert and technical teams as part of a reach back cell.  Options will be evaluated by qualitative assessments including subject matter expert elicitation and quantitative assessments, including modeling and simulation.  Annually, the reach back cell will respond to 10-15 questions from the senior Combatant Command leadership."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue to work with the Commander of the U.S. Central Command via the reach back cell to support ongoing operations in the region.  The SMA Cell will also continue to actively work with the CCMDs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of CCMD senior leadership and may include areas such as:  counter terrorism, transnational criminal organizations, counter weapons of mass destruction (state and non-state), counter global or regional social and cultural assessments, regional stability assessments, and individual state or national level deterrence studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue to actively work with the CCMDs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of CCMD senior leadership and may include areas such as:  counter terrorism, transnational criminal organizations, counter weapons of mass destruction (state and non-state), counter global or regional social and cultural assessments, regional stability assessments, and individual state or national level deterrence studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biometrics and Forensics Science and Technology for Identity Dominance"
                                    },
                                    "Description": {
                                        "val": "Biometrics and Forensics Science and Technology projects field prototypes to address emerging technology gaps that limit our ability to quickly and accurately identify anonymous individuals who threaten our physical and virtual assets.  The overall goal of these projects is to reduce future operational risk to warfighters.  New technologies demonstrated through this program will allow warfighters to identify bad actors or counter adversaries’ attempts to mitigate our current technologies.  These projects leverage techniques such as proof-of-principle prototyping, increased use of small businesses, and increased competition between vendors.  Biometrics and forensics projects will mature emerging technologies that support identity operations and forensic capabilities required by Commanders and warfighters in ongoing and future military activities.  These efforts leverage the Reliance 21 model to encourage collaboration on biometrics and forensics projects within the DoD, with interagency partners, with our partners in industry and academia, and with international partners where applicable.  This model will help maximize collaborative investment and prevent redundant research.  Deliverables are shared throughout the biometrics and forensics communities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Text": {
                                                "val": "The biometric and forensics portfolio continued to mitigate gaps identified by commanders and operational users.  Biometrics and forensics efforts improved capabilities in the areas of increasing standoff distance for collection of biometric data, collection of biometric data from non-cooperative subjects, improving the matching accuracy of non-ideal biometric data, accelerating collection speed of forensic data through the ongoing development of the advanced file carving system, increasing accuracy of forensic analysis, and shifting analysis to the field from a laboratory environment.  \n\nThe biometric portfolio successfully demonstrated and transitioned three prototypes in FY 2016.  Biometric successes include a pilot capability of the first-ever rules-based classified biometric matching system; The Victim Identification for Disaster Assistance (VIDA) tool, a mobile phone application to support DoD and partner nations’ post-disaster activities such as helping to reunite displaced personnel and families, tracking emergency medical and humanitarian services, and identifying victims; and, the final phases of technology transfer for the Biometric Enabled Watch List (BEWL) Dissemination Management Server, which improved the speed of delivering customized biometric watchlists by 38 times while also significantly reducing errors.  These prototypes transitioned to DoD and other partners including the Army’s Program Manager-Biometrics and the Services through the Pacific Disaster Fund.\n\nThe forensics portfolio developed two successful prototypes.  In FY 2016, RRTO demonstrated a new capability to identify the make and model of an imaging device (camera, video recorder, etc.) from the digital image it produced.  The portfolio also developed a new mitochondrial Deoxyribonucleic Acid (DNA) prototype that greatly increased the ability to perform kinship analysis on extremely degraded DNA samples, facilitating identification of over 1,200 remains of fallen Service members from prior conflicts.  These prototypes transitioned to DoD and other partners including the Army’s Defense Forensics Science Center, Armed Forces Medical Examiner System, Federal Bureau of Investigation, and other agencies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "This portfolio will complete and deliver three new capabilities in FY 2017.  The first capability will be a handheld, rapid, automatic explosive detector called ExploDisk.  This device will not only check for the presence of seven common explosives, its novel use of cellphone camera technology will mitigate human error in color determination; a common weakness with current technologies.  This capability can also support the identification of illegal drugs by using different disposable analysis ‘chips’.  The second capability is a novel DNA analysis protocol that will extend kinship analysis from the current limit of second generation (grandparents or siblings) to the fourth generation (great-great grandparents or cousins).  This capability is critical to support the identification of remains lost from World War II and Korea as their direct relations may die before the service members’ remains are located.  The final effort leverages FY 2016 funds to finish development and deliver an advanced file carving system.  This system will accelerate the extraction and categorization of files of interest from large data stores while simultaneously screening out useless junk files.  Depending on the file types, this carver will accelerate the process 25 percent to 80 percent over prior carving systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.300"
                                            },
                                            "Text": {
                                                "val": "The biometrics and forensics science and technology portfolio will continue to mitigate gaps identified by commanders and operational users and improve capabilities in the areas of biometrics and forensics.  The portfolio will continue work on four projects schedule for FY 2018 delivery.  The program’s Face Acquisition Recognition of IDentities (FAR-ID) project will work toward developing technologies that can accurately perform unconstrained face matching out to 800 meters, greatly expanding the ability to detect and categorize potential threats before they can do harm to U.S. Forces.  The portfolio is also co-funding three digital forensic projects.  The first project will develop and demonstrate a software prototype that will allow analysts to identify linkages to related data on other devices or cloud servers used by the devices’ owner.  The Forensic Acquisition Tool for Cloud-Based Data software prototype will allow analysts to extract data from cloud-based service providers in a forensically sound manner.  This tool will help analysts maintain data validity prior to analysis.  The third project will develop a prototype to identify hand writing on scanned documents containing background images or text.  This tool is the first step in developing an automated method of analyzing handwritten documents.  Projects for biometrics and forensics portfolios will be selected after coordination throughout DoD and across other U.S. Government departments and agencies to maximize collaborative investment and prevent unnecessary redundant research."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Faster Short Tandem Repeat (FaSTR) Human Deoxyribonucleic Acid (DNA) Profiling System"
                                    },
                                    "Description": {
                                        "val": "To date, rapid DNA analysis systems have relied on pneumatics and mechanical valves for microfluidic movement which results in bulky hardware and assay times greater than 60 minutes.  The FaSTR DNA instrument exploits centrifugally-driven microfluidics to eliminate mechanical valves and pressure-driven flow, and allows commercial off the shelf electronics to facilitate sample preparation, polymerase chain reaction, and integration with electrophoresis (the movement of charged particles in a fluid or gel under the influence of an electric field).  This paradigm shift for microfluidic technology radically reduces the form factor, analysis time, and cost of the system.  The FaSTR project will produce the first truly portable, rapid DNA analysis instrument capable of generating DNA profiles from “sample in” to “answer out” in less than 30 minutes and provide a match probability of 1 in 55 billion people."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "The FaSTR project continued work to deliver fully integrated operational prototypes in FY 2018 that will demonstrate the full feasibility of the technology.  During FY 2016, the project optimized nine Short Tandem Repeat DNA panels (selected from the Federal Bureau Investigation (FBI) Combined DNA Index System (CODIS) Core Loci) and associated chemistries capable of generating a profile with random match probabilities of one in 55 billion people, significantly exceeding the initial goal of one in five million people.  Additionally, the project combined all three DNA processing steps onto the integrated analysis chip and demonstrated the device’s ability to produce an accurate DNA profile in less than 60 minutes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "During FY 2017, the FaSTR project will continue the development of three FaSTR prototypes leading to operational testing in FY 2018.  The final prototypes will weigh less than 10 pounds, have a total size less than 600 cubic inches, and have a low rate production cost below $10,000 for the unit and $50 for per sample consumables.  These metrics represent substantial improvement over current rapid DNA technologies in terms size and weight (>90 percent reduction), analysis speed (67 percent reduction), and cost (>90 percent reduction)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The FaSTR project will complete development and initial testing to allow the devices to transition to the U.S. Special Operations Command for operational testing.  Test results, technical and training materials, and initial low rate production manufacturing technical specifications will be included in the deliverables."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototyping Through Non-Traditional Pathways"
                                    },
                                    "Description": {
                                        "val": "Prototyping Through Non-Traditional Pathways leverages technology and emerging products developed by small, innovative businesses in the commercial sector.  Ideas from non-traditional emerging technology companies are matched against Department of Defense (DoD), Combatant Commands (CCMDs), Service, and other government organizations' priorities.  Promising solutions are selected for further test and evaluation and, if successful, rapid prototyping or fielding to transition commercial ideas with military utility.  These efforts support the Department's objectives of promoting effective competition, increasing speed to market, implementing technological and organizational innovation, and fielding affordable capabilities through innovation from commercial research and development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.650"
                                            },
                                            "Text": {
                                                "val": "During FY 2016, the Prototyping Through Non-Traditional Pathways conducted three reviews.  Each review focused on identifying ideas in a specific topic area that can transition to meet joint operational needs through rapid prototyping.  Government organizations help identify driving needs for each review and in FY 2016 the program supported Deputy Assistant Secretary of Defense, Emerging Capability & Prototyping DASD(EC&P); Special Operations Forces Acquisition, Technology, & Logistics; and, DoD Cyber Strategy.  Through these efforts the Rapid Reaction Technology Office demonstrated an advanced 32-bit microcontroller on a silicon flexible substrate.  The microcontroller leverages flexible hybrid electronics manufacturing to provide a multi-use technology for a variety of applications including machine assisted human operations, advanced unmanned systems, and network-enabled autonomous weapons.  This proof-of-principle prototype transitioned to Air Force Research Laboratory for adaption in multiple future rapid prototyping efforts.  In addition to flexible electronics, ideas from ten other companies were selected for further testing and evaluation including technologies to rapidly close wounds with biological compatible glue, a predictive natural language processing tool, machine learning and data analytics platform, and a geospatial intelligence tool."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Prototyping Through Non-Traditional Pathways investment decisions are made during execution years in response to emerging needs from DoD, CCMDs, Service, and other government organizations, and opportunities presented by non-traditional commercial companies.  Innovative ideas are considered through the filter of Assistant Secretary of Defense for Research and Engineering’s (ASD(R&E)) focus areas and other DoD priorities.  In FY 2017, the program anticipates proposals to address challenges for autonomous learning systems, information flow and data analysis, virtual prototyping, exploitation of communications technologies, advanced electronic sensors, machine assisted human operations, capabilities to respond to future electric warfare threats, and other emerging technology areas.  RRTO will support three to four need-focused reviews and anticipates 10 to 15 subsequent evaluations with the potential for prototyping efforts.  These reviews will be executed with DoD users and interagency partners including DASD(EC&P), ASD(R&E) Cyber Strategy, Army Night Vision Sensors Directorate, and Defense Threat Reduction Agency’s Joint Improvised-Threat Defeat Organization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Prototyping Through Non-Traditional Pathways anticipates four to six reviews in FY 2018, and 15 to 20 resulting tests and evaluations with potential for future prototypes.  Focus areas will be informed by DoD users and interagency partners based on priorities identified in the execution year.  These reviews will be executed with DoD users and interagency partners including DASD(EC&P), U.S. Army Maneuver Support Center of Excellence, U.S. Special Operations Command Science & Technology (S&T), and the U.S. Marine Corps."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Source Data Analysis and Applications Focus Area"
                                    },
                                    "Description": {
                                        "val": "Open Source Data Analysis and Applications projects include the development of capabilities, software, and tools to analyze open source information.  The data can be structured or unstructured and will include inputs from a broad spectrum of sources.  Where possible these projects will exploit advanced learning systems and commercial technologies to provide solutions to emerging challenges in tracking targets, big data analytics, and extracting indications and warnings.  Technologies developed within this focus area will reduce cost and analyst requirements to provide meaningful intelligence in support of the counter Islamic State of Iraq and the Levant (ISIL), counter weapons of mass destruction, and counter improvised explosive device missions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.925"
                                            },
                                            "Text": {
                                                "val": "The Rapid Reaction Fund (RRF) investment decisions for Open Source Data Analysis and Applications projects are made during the execution years in response to the Department of Defense (DoD), Combatant Commands (CCMDs), Service, and other government organizations' priorities.  RRF will support development of virtual prototypes and new open source data analysis tools and applications to provide a hedge against emerging, irregular, and asymmetric threats.  The program anticipates supporting eight to ten projects in FY 2017.  Deliverables will leverage emerging technologies, such as autonomous learning systems, to exploit open source information and reduce analyst requirements to provide actionable intelligence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.235"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.235"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to DoD, CCMDs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  The program anticipates supporting six to eight projects in FY 2018.  Deliverables will leverage emerging technologies to exploit open source information and reduce analyst requirements to provide actionable intelligence."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Systems and Behaviors Focus Area"
                                    },
                                    "Description": {
                                        "val": "Autonomous Systems and Behaviors projects demonstrate capabilities to enhance joint forces, reduce the time to make critical decisions, and protect warfighters through increased use of autonomous and human-machine collaborative systems.  Example projects include power systems to facilitate increased performance of unmanned systems, enhanced capabilities for multiple autonomous systems to cooperatively interact, autonomous operation in complex terrain, development of sensors for integration aboard unmanned platforms, improvements to data ex-filtration from unmanned sensors, human-machine collaborative decision making, and ‘red teaming’ to counter emerging unmanned threats from potential adversaries.  These projects will also examine common software platforms to reduce development cost, increase collaboration among manned and unmanned vehicles, increase agility through rapid customization of autonomous systems’ architectures, and inform requirement decisions for the autonomy community of interest to design affordable systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.525"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for Autonomous Systems and Behaviors are made during the execution years in response to DoD, CCMDs, Service, and other government organizations' priorities.  Selected projects will support development of components, payloads, and autonomous aerial, surface, and subsurface systems.  RRF anticipates supporting four to six projects in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.135"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.135"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for Autonomous Systems and Behaviors are made during the execution years in response to DoD, CCMDs, Service, and other government organizations' priorities.  Selected projects will support development of components, payloads, and autonomous aerial, surface, and subsurface systems.  RRF anticipates supporting four to six projects in FY 2018."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Urban Characterization Focus Areas"
                                    },
                                    "Description": {
                                        "val": "Future military operations will likely occur in a broad range of urban environments with complex radio frequency (RF), topological, situational awareness, and mobility challenges.  Urban Characterization Focus Area projects will identify, analyze, and describe typical urban areas for modeling, simulation, and planning purposes.  These efforts will inform and enable development of intelligence, surveillance, and reconnaissance (ISR); electronic warfare and cyber; kinetic and non-kinetic effects; and, other capabilities needed for future military operations in a wide range of urban areas."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.328"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions for urban characterization projects are made during the execution years in response to DoD, CCMDs, Service, and other government organizations' priorities.  As new threats emerge and new opportunities are presented RRF will select projects to demonstrate capabilities for Urban Characterization.  RRF anticipates supporting four to six projects in FY 2017.  Deliverables will include virtual prototypes, modeling, and simulations to support planning efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.788"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.788"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions for Urban Characterization projects are made during the execution years in response to DoD, CCMDs, Service, and other government organizations' priorities.  As new threats emerge and new opportunities are presented RRF will select projects to demonstrate capabilities for Urban Characterization.  RRF anticipates supporting three to five projects in FY 2018.  Deliverables will include virtual prototypes, modeling, and simulations to support planning efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Prototyping for Intelligence, Surveillance, and Reconnaissance (ISR) Focus Area"
                                    },
                                    "Description": {
                                        "val": "ISR sensors are critical for providing asymmetric compensation against larger, near-peer adversaries.  However, ISR systems span a wide range of sensing modalities and generally produce very large data sets that are difficult to analyze, which challenges rapid innovation in response to emerging threats.  Efforts in this focus area will increase speed to market for better sensors and tools to more effectively analyze or visualize ISR data.  Projects include improved surveillance sensors, tools to facilitate analysis of large data sets, methods to harvest meaningful intelligence from open and classified sources, and establishment of more effective processing, exploitation, and dissemination capabilities.  RRF sponsored prototypes will facilitate integration of advance ISR capabilities into new and existing systems.  These prototypes will help increase the effectiveness of ISR architectures and reduce the human analyst requirements to produce actionable intelligence."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.942"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for ISR prototypes are made during the execution years in response to Department, CCMDs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future ISR capabilities.  RRF anticipates supporting five to seven projects in FY 2017.  Deliverables will include prototype systems and software for a variety of platforms, as well as analytical capabilities developed to reduce the analyst burden needed to process large sets of ISR data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.542"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.542"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for ISR prototypes are made during the execution years in response to Department, CCMDs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  RRF anticipates supporting five to seven projects in FY 2018.  Deliverables will include prototype systems, analytical capabilities, and software for a variety of platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area will develop the enabling capabilities and key technologies required to advance additive manufacturing technology to meet specific warfighter needs.  Additive manufacturing projects are those that use processes in which successive layers of material are laid down under computer control to create functional three dimensional products.  Additive manufacturing allows for rapid prototyping and iterative innovation, removing barriers for technology insertion.  Due to increased speed from design to prototype, reduced cost, and reduced waste additive manufacturing provides a unique supporting capability for the Third Offset Strategy.  Additive manufacturing capabilities are rapidly developing in industry and other government agencies.  The Rapid Reaction Technology Office will leverage commercial innovation and emerging capabilities of the Federally Funded Research and Development Centers (FFRDCs), government laboratories, and academia to develop proof-of-principle prototypes focused on warfighter needs.  Projects include spare part replacement, jet engine repair, custom hardware enclosures, and three-dimensional (3-D) models.  Projects have the potential to significantly reduce the supply chain inefficiencies by storing parts as software and manufacturing on demand, and using rapid prototyping to reduce time and cost of design.  Projects can also reduce amount of labor required to produce functioning prototypes.  Deliverables will inform enhancement decisions and concept of operations development."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.345"
                                            },
                                            "Text": {
                                                "val": "Rapid Reaction Fund (RRF) investment decisions are made during the execution years in response to Department, Combatant Commands (CCMDs), Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  For additive manufacturing projects this agility allows RRTO to leverage new capabilities developed by commercial industry.  Research and coordination with organizations throughout Department of Defense (DoD) and other government agencies will help identify needs that could be addressed by future capabilities within the additive manufacturing field.  RRF anticipates supporting six to eight projects in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.019"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.019"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years in response to Department, CCMDs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  RRTO will select future additive manufacturing projects based on priorities throughout DoD and other government agencies, and new opportunities for additive manufacturing.  RRF anticipates supporting six to eight projects in FY 2018."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Dominance Technology Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area will develop the enabling capabilities and key technologies required to maintain maritime dominance, drawing on the recommendations of the Long-Range Research and Development Program Plan under the Defense Innovation Initiative and previous Future Year Defense Plan.  Major drivers in the maritime domain include the development of extra-large, large, and small families of multi-mission unmanned undersea vehicles (UUVs), and the rapid growth of commercial undersea activity.  The DoD is exploring emerging concepts for ubiquitous undersea communications, command and control, and large-scale UUV capabilities.  To enable these concepts, RRF will focus on developing capabilities and technologies such as undersea power production, storage, and distribution; enhanced signal processing; autonomy; undersea situational awareness, and navigation; sensors; undersea communications; and, advanced materials development and production."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.819"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions for Maritime Dominance Technology focus area are made during the execution years in response to Department, CCMDs, Service, and other government organizations' priorities.  As new threats emerge or new opportunities are presented RRF will select projects to demonstrate new payloads, better sensors, and new undersea systems to enhance deterrence.  RRF anticipates supporting eight to ten projects in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.291"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.291"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions for Maritime Dominance Technology focus area are made during the execution years in response to Department, CCMDs, Service, and other government organizations' priorities.  As new threats emerge or new opportunities are presented RRF will select projects to demonstrate new payloads, better sensors, and new undersea systems to enhance deterrence.  RRF anticipates supporting six to eight projects in FY 2018."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wargaming in Support of Emerging Capabilities Focus Area"
                                    },
                                    "Description": {
                                        "val": "To support wargaming for assessing the susceptibility and vulnerability of emerging capabilities, The Rapid Reaction Technology Office (RRTO) funds efforts to explore new capabilities in a competitive environment.  RRTO will leverage the innovative capabilities of the Federally Funded Research and Development Centers (FFRDCs), government laboratories, academia, and industry to develop a construct that current or future systems can be gamed against in a distributed table-top environment employing traditional and non-traditional players.  Deliverables will inform enhancement decisions and concept of operations development."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.266"
                                            },
                                            "Text": {
                                                "val": "The Rapid Reaction Fund (RRF) investment decisions for wargaming are made during the execution years in response to Department, CCMD, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Projects will include wargame efforts employing government laboratory scientists, subject matter experts, and students of science, technology, engineering, and math (STEM) disciplines to explore unconventional approaches to counter DoD technologies.  Deliverables will include recommendations on system operational employment, potential vulnerabilities, and likely countermeasures taken by the threat as well as potential counter-countermeasures to increase functionality or operational effectiveness of the system.  RRF anticipate supporting five to six projects in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.008"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.008"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for wargaming are made during the execution years in response to Department, CCMDs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Deliverables will include recommendations on system operational employment, potential vulnerabilities, and likely countermeasures taken by the threat as well as potential counter-countermeasures to increase functionality or operational effectiveness of the system.  RRF anticipates supporting five to six projects in FY 2018."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2018, performance metrics applicable to the Rapid Reaction Fund (RRF) include attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology program\" and the metric for this objective is the transition of 40 percent of completed projects per year.  In addition, project performance metrics are specific to each effort and include measures identified in each specific project plans.  Project completions and successes are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target milestone dates, specific performance measures, fielding dates, and demonstration goals.  For projects completed in FY 2016, the RRF achieved a transition rate of approximately 70 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P831"
                    },
                    "ProjectTitle": {
                        "val": "Joint Rapid Acquisition Cell Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "6.413"
                        },
                        "PriorYear": {
                            "val": "1.565"
                        },
                        "CurrentYear": {
                            "val": "1.636"
                        },
                        "BudgetYearOne": {
                            "val": "1.652"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.652"
                        },
                        "BudgetYearTwo": {
                            "val": "1.669"
                        },
                        "BudgetYearThree": {
                            "val": "1.686"
                        },
                        "BudgetYearFour": {
                            "val": "1.703"
                        },
                        "BudgetYearFive": {
                            "val": "1.720"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This funding includes support for the Joint Rapid Acquisition Cell (JRAC) to enable management and tracking of Combatant Command (CCMD) identified and Joint Staff validated immediate warfighter needs.  The JRAC is responsible to: \n(1)  Coordinate review of validated Joint Urgent Operational Needs (JUON) and Joint Emergent Operational Needs (JEON) and assign responsibility to appropriate DoD Components for timely funding and resolution. \n(2)  Serve as the review and approval authority for the DoD Components’ strategy to fund and mitigate the identified JUON\/JEON capability gap. \n(3)  Continually assess actions taken by the DoD Components to resolve JUONs\/JEONs and recommend to the Under Secretary of Defense for Acquisition, Technology, and Logistics any changes determined appropriate to improve their responsiveness to JUONs\/JEONs.\n(4)  Provide periodic reports to the Secretary of Defense on new and outstanding JUONs\/JEONs.   \n(5)  In coordination with Under Secretary of Defense Comptroller (USD(C)), manage the Rapid Acquisition Fund (RAF) to allocate resources to priority unfunded JUONs\/JEONs.\n(6)  In coordination with the Office of the Chairman of the Joint Chiefs of Staff and the USD(C), make programmatic, budget, and acquisition recommendations for JUONs and identify capability gaps to the Secretary of Defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Rapid Acquisition Cell (JRAC) Management Support"
                                    },
                                    "Description": {
                                        "val": "This funding is utilized to support the staff manning of the JRAC to enable management and tracking of CCMD identified and Joint Staff validated immediate warfighter needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.565"
                                            },
                                            "Text": {
                                                "val": "Supported the JRAC to enable management and tracking of immediate CCMD warfighter requirements.  Warfighter needs were validated by the Joint Staff."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.636"
                                            },
                                            "Text": {
                                                "val": "Continue support for the JRAC management and tracking of CCMD initiatives.  Continue validation of the warfighter needs by the Joint Staff."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.652"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.652"
                                            },
                                            "Text": {
                                                "val": "Continue support for the JRAC management and tracking of CCMD initiatives.  Continue validation of the warfighter needs by the Joint Staff."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NA – Capabilities acquired to fulfill Joint Urgent Operational Needs (JUON) and Joint Emergent Operational Needs (JEON) are provided by other DoD components."
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Rapid Acquisition Cell performance metrics are specific to each JUON\/JEON and include measures identified in the management approach for each action.  In addition, JUON\/JEON completions and successes are monitored against schedules and deliverables stated in the management approach.  The metrics to which JRAC support correlates is to the number of full time personnel identified in the JRAC support contract with associated pay rates and shall not exceed the specified amounts or hourly rates and\/or firm fixed price."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P833"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Multi-Layered Assessment (SMA) Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "6.354"
                        },
                        "PriorYear": {
                            "val": "2.142"
                        },
                        "CurrentYear": {
                            "val": "2.282"
                        },
                        "BudgetYearOne": {
                            "val": "2.305"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.305"
                        },
                        "BudgetYearTwo": {
                            "val": "2.328"
                        },
                        "BudgetYearThree": {
                            "val": "2.351"
                        },
                        "BudgetYearFour": {
                            "val": "2.375"
                        },
                        "BudgetYearFive": {
                            "val": "2.399"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Strategic Multi-Layered Assessment (SMA) Cell supports all Combatant Commands (CCMDs), Joint Force Commanders, and other government agencies by assessing complex operational and technical challenges, which require collaborative multi-agency and multi-disciplinary approaches.  With input from across the U.S. Government, academia, and the private sector, the SMA Cell develops options to CCMD-generated challenging problems and informs the command's senior leadership.  Each SMA effort is initiated at the request of senior CCMDleadership.  Priorities for SMA problems are set by the Joint Staff Deputy Director for Global Operations.  Products are typically produced within six months and directly contribute to the decision making process of CCMD's senior leaders.  SMA is also supported by the Rapid Reaction Fund (RRF)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assessing ‘Gray Zone’ Conflicts for the U.S. Security Coordinator (USSC), U.S. European Command (USEUCOM), and U.S. Special Operations Command (USSOCOM)"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell started a strategic analysis effort in FY 2015 at the request of the USSC for Israel and the Palestinian Authority.  The effort evaluates strategic risks and identifies knowledge gaps to provide an increased understanding of potential security environments and their implications for Palestinian security sector reform.  USEUCOM subsequently asked SMA to apply the same methodology to identify emerging Russian threats and opportunities in Eurasia.  Collectively, these two efforts focus on developing strategies and responses for ‘Gray Zone’ conflicts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.142"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell, at the request of the Commander of the U.S. Special Operations Command, continued an effort to assess how the U.S. Government can diagnose, identify, and assess indirect strategies, and develop responses against associated types of ‘Gray Zone’ conflicts.  Specifically, if the U.S. Government is to respond effectively to the threats and opportunities presented in the increasingly gray security environment, it requires a more detailed map of the space between peace and war than it currently possesses.  The project provided a more rigorous and comprehensive articulation of the space between militarized conflict and peace.  The project team conducted a quantitative analysis of historical examples of gray conflicts and contemporary manifestations and geopolitical drivers.  The team assessed specific U.S. experience with ‘Gray Zone’ conflicts and what strategies and tactics have been most and least successful as instruments of U.S. policy.  The team also explored conceptual, procedural, and physical capabilities necessary for navigating this gray space.  The SMA team identified how the various elements of power need to be coordinated to effectively respond to ‘Gray Zone’ conflicts.  For example, by examining the interests, resources, and capabilities of violent extremist organizations and transnational criminal organizations in ‘Gray Zone’ regions.  The SMA team also investigated how violent non-state actors (VNSAs)\/violent extremist organizations (VEOs) and state actors create ‘Gray Zones’ differently.  The SMA team employed a variety of empirical approaches to this effort, involving simulation, geospatial, case-study, and statistical methodologies.  Products from the effort have been provided to USSOCOM, and all other CCMDs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.282"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue its efforts to assess and respond to ‘Gray Zone’ conflicts in FY 2017 and transition the products to the USSOCOM Commander.  The cell will continue to actively collaborate with CCMD senior leadership and the Joint Staff leadership to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will help increase our understanding of ‘Gray Zone’ conflicts and identify potential responses.  USSOCOM is leveraging these efforts to support a senior leader forum on ‘Gray Zone’ indications and warnings and USEUCOM has established a Russian deterrence effort that benefits from SMA’s work.  Additional products will directly support other CCMDs and government agencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA) Cell"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell provides planning support to Combatant Commands (CCMDs) and U.S. Government agencies and provides actionable assessments for complex operational and technical challenges to help maintain our competitive advantage in an increasingly complex global environment.  SMA efforts require multi-agency, multi-disciplinary approaches to address requirements that are not within the customer organization’s core competency.  The SMA Cell identifies options from across the U.S. Government, academia, and the private sector.  SMA efforts are facilitated by the Joint Chiefs of Staff\/J3 Operations and are executed by the Rapid Reaction Technology Office."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.305"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.305"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue to actively work with the CCMDs and the Joint Chiefs of Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of CCMD senior leadership and may include areas such as:  counter terrorism, transnational criminal organizations, counter weapons of mass destruction (state and non-state), counter global or regional social and cultural assessments, regional stability assessments, and individual state or national level deterrence studies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "SMA performance metrics are specific to each effort and include measures identified in the specific project plans.  In addition, project completions and successes are monitored against schedules and deliverables stated in the execution documents.  Each project’s results are reviewed by a senior review group that is comprised with representatives from the Office of the Secretary of Defense, the Joint Chiefs of Staff, the Combatant Commands, and outside subject matter experts.  The ultimate measure of success is adoption and transition of SMA products by the CCMD and supporting entities.  In FY 2016, SMA products transitioned to U.S. Special Operations Command Commander and U.S. European Command."
                        }
                    }
                }
            ]
        }
    }
}