{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-7",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604604A"
        },
        "ProgramElementTitle": {
            "val": "Medium Tactical Vehicles"
        },
        "R1LineNumber": {
            "val": "87"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "6.039"
            },
            "BudgetYearOneBase": {
                "val": "6.039"
            },
            "BudgetYearTwo": {
                "val": "3.744"
            },
            "BudgetYearThree": {
                "val": "2.177"
            },
            "BudgetYearFour": {
                "val": "3.364"
            },
            "BudgetYearFive": {
                "val": "3.400"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports continued modernization of the Army's medium truck and trailer fleet and the Armored Security Vehicle (ASV).\n\nThe Family of Medium Tactical Vehicles (FMTV) fills 2 1\/2-ton Light Medium Tactical Vehicle (LMTV) and 5-ton Medium Tactical Vehicle (MTV) truck requirements and associated companion trailers. FMTV trucks perform over 55 percent of the Army's local haul, line haul, and unit resupply missions.  It operates throughout theater as multi-purpose transportation vehicles in combat, combat support, and combat service support units.\n\nThe ASV is an all-wheel drive armored vehicle that provides ballistic protection, overhead protection, and protection against landmines. It is used by the Military Police to perform missions of area security, maneuver, and mobility support. \n\nFunding from this Program Element will be used to support the continued evolution of the future FMTV fleet as well as tech insertion opportunities to keep the current FMTV fleet relevant on today’s battlefield.  This includes upgrades in survivability and crew protection, improved safety by leveraging advancements in commercial active safety technologies, modernizing the aging Low Velocity Air Drop (LVAD) fleet of vehicles, improved utilization through modularity, integration of advanced high efficiency powertrains and fuel saving technologies, and insertion of autonomous vehicle capabilities that will change the way transportation missions are conducted around the world.\n\nFY 2018 Project H07 Base funds in the amount of $6.039 million will be used for the procurement of FMTVA2 Live Fire Test assets, development and testing of the FMTVA1P2 Underbody Armor Kit, analysis to support configuration options for the next generation LVAD model, development and integration of active safety improvements, and Analysis of Alternative engine and Material Handling Equipment (MHE) options to address future obsolescence issues."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.039"
                },
                "BudgetYearOneBase": {
                    "val": "6.039"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.039"
                },
                "BudgetYearOneBase": {
                    "val": "6.039"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "6.039"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.039"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 Project H07 Base funds in the amount of $6.039 million will be used for the procurement of FMTVA2 Live Fire Test assets, development and testing of the FMTVA1P2 Underbody Armor Kit, analysis to support configuration options for the next generation LVAD model, development and integration of active safety improvements, and Analysis of Alternative engine and Material Handling Equipment (MHE) options to address future obsolescence issues."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H07"
                    },
                    "ProjectTitle": {
                        "val": "Family Of Med Tac Veh"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.039"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.039"
                        },
                        "BudgetYearTwo": {
                            "val": "3.744"
                        },
                        "BudgetYearThree": {
                            "val": "2.177"
                        },
                        "BudgetYearFour": {
                            "val": "3.364"
                        },
                        "BudgetYearFive": {
                            "val": "3.400"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The FMTVA2 production and Engineering Change Proposal (ECP) modernization effort restores vehicle performance that was lost due to the addition of armor protection kits as the threat to tactical vehicles and the FMTV has increased.  The FMTVA2 also addresses Space, Weight, Power, and Cooling (SWaP-C) constraints from having to host an increasing amount of Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Counter-Incendiary Explosive Device (IED) equipment.  Program Management Office (PMO) Medium Tactical Vehicles (MTV) is executing the FMTVA2 effort documented in a signed Acquisition Decision Memorandum (ADM) by the Army Acquisition Executive (AAE) on 16 November 2015. FY 2018 Project H07 Base funds in the amount of $1.900 million will be used for the procurement of FMTVA2 Live Fire Test assets to support Live Fire Testing required per Chapter 139, Title 10 USC.\n\nThe FMTVA1P2 represents the FMTV model currently in production with over 38,000 vehicles fielded to date.  The FMTVA1P2 will remain in the tactical vehicle fleet until 2040 and beyond.  To keep the A1P2 fleet viable into the future and able to perform its mission in austere environments, upgrades to Survivability and Crew Protection Kits will be required as the threat on the battlefield evolves. FY 2018 Project H07 Base funds in the amount of $1.800 million will be used for development and testing of improvements to the FMTVA1P2 Underbody Armor Kit that simplifies the design and reduces installation cost and complexity.  \n\nThe three FMTV LVAD models (M1081, M1093, M1094) ended production in 2009 and represent the oldest vehicles in the FMTV fleet.  Updates to the LVAD are needed to address obsolescence issues and bring the configuration up to today’s standards. FY 2018 Project H07 Base funds in the amount of $0.500 million will be used for analysis to support configuration options for the next generation LVAD model.\n\nImproved vehicle safety technologies are now available commercially that can reduce the number and severity of motor vehicle accidents, including Electronic Stability Control, collision mitigation, lane keeping assist, and rollover prevention. FY 2018 Project H07 Base funds in the amount of $1.339 million will be used for development and integration of active safety improvements.\n\nTo ensure supportability of the FMTVA1P2 through 2040 and beyond, the PMO MTV, as lifecycle managers for the system, shall address potential obsolescence issues with the powertrain and Material Handling Equipment used on the FMTV. FY 2018 Project H07 Base funds in the amount of $0.450 million will be used for Analysis of Alternative engine and MHE options to address future obsolescence issues.\n\nFY 2018 Project H07 Base funds in the amount of $0.050 million will be used for Systems Engineering\/Program Management (SEPM) support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Procurement of FMTVA2 Live Fire Test Assets"
                                    },
                                    "Description": {
                                        "val": "Live Fire test assets are needed to support Live Fire Testing required per Chapter 139, Title 10 USC."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Text": {
                                                "val": "Funding will be used to procure four M1078A2 vehicles for Live Fire testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FMTVA1P2 Underbody Armor Kit Improvement"
                                    },
                                    "Description": {
                                        "val": "Development and testing of improvements to the FMTVA1P2 Underbody Armor Kit that simplifies the design and reduces installation cost and complexity."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "Funding will be used for development and testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Configuration Options Next Generation LVAD Model"
                                    },
                                    "Description": {
                                        "val": "Updates to the LVAD are needed to address obsolescence issues and bring the configuration up to today’s standards."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Funding will be used for analysis to support configuration options for the next generation LVAD model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Vehicle Safety Technologies"
                                    },
                                    "Description": {
                                        "val": "Improved vehicle safety technologies are now available commercially that can reduce the number and severity of motor vehicle accidents"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.339"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.339"
                                            },
                                            "Text": {
                                                "val": "Funding will be used for development and integration of active safety improvements on the FMTVA1P2."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FMTV Obsolescence Concerns"
                                    },
                                    "Description": {
                                        "val": "Address potential obsolescence issues with the powertrain and Material Handling Equipment (MHE) used on the FMTV."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "Funding will be used for Analysis of Alternative engine and MHE options to address future obsolescence issues."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Engineering\/Program Management"
                                    },
                                    "Description": {
                                        "val": "SEPM includes System Engineering and Program Management oversight required to manage the program and provide contractor oversight. Salaries, Benefits, Travel, Personnel Training and other Government costs are included for retaining a professional acquisition workforce."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "Includes Program Management, Engineering and Budget support for FMTVA1P2 and FMTVA2."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA 1 D15500"
                                    },
                                    "Title": {
                                        "val": "Family of Medium Tactical Vehicles D15500"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "334.038"
                                        },
                                        "CurrentYear": {
                                            "val": "352.769"
                                        },
                                        "BudgetYearOne": {
                                            "val": "78.650"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "78.650"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "98.231"
                                        },
                                        "BudgetYearThree": {
                                            "val": "198.312"
                                        },
                                        "BudgetYearFour": {
                                            "val": "193.404"
                                        },
                                        "BudgetYearFive": {
                                            "val": "182.838"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Procurement of FMTVA2 Live Fire test assets:  This is a separate line item on the FMTVA2 production contract.\n\nFMTVA1P2 Underbody Armor Kit Improvement:  This effort will utilize the existing System Technical Support contract with the current FMTV Original Equipment Manufacturer (OEM) as well as Government testing facilities.\n\nConfiguration options for the next generation LVAD model:  This effort will utilize the System Technical Support contract with the FMTVA2 OEM.\n\nImproved vehicle safety technologies:  This effort will utilize development resources at the Tank Automotive Research, Development and Engineering Center (TARDEC) as well as Government and private integration and test facilities.\n\nAddress FMTV obsolescence concerns:  This effort will utilize Government and private integration and test facilities."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}