{
    "id": "2018-Navy-PB-1319-MJBOOK-2-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-7",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604230N"
        },
        "ProgramElementTitle": {
            "val": "Warfare Support System"
        },
        "R1LineNumber": {
            "val": "103"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "65.067"
            },
            "PriorYear": {
                "val": "5.740"
            },
            "CurrentYear": {
                "val": "13.237"
            },
            "BudgetYearOne": {
                "val": "14.167"
            },
            "BudgetYearOneBase": {
                "val": "14.167"
            },
            "BudgetYearTwo": {
                "val": "11.699"
            },
            "BudgetYearThree": {
                "val": "9.963"
            },
            "BudgetYearFour": {
                "val": "10.159"
            },
            "BudgetYearFive": {
                "val": "10.356"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Rapid Capabilities Development (RCD) project supports the Naval Special Warfare Branch to identify and assess available technologies that confront current and future irregular and expeditionary challenges.  The program's development efforts are focused on the enhancement\/advancement of existing technologies to fill urgent and emergent capability gaps for Naval Special Warfare (NSW).  Program funding provides for the development, integration, testing, validation and combat demonstration of identified technologies and\/or packages of technologies to meet: Overseas Contingency Operations (OCO) goals, service common and NSW program technology challenges, and technology obsolescence issues of developed capabilities.  The goal of the RCD project is to develop expeditionary\/operational capabilities for NSW that enable its force to conduct cross-domain special reconnaissance, counterterrorism, direct action, irregular warfare, and foreign internal defense; and fulfill urgent\/emergent needs within a 6-24 month timeframe.  \n\nAs part of the Naval Coastal Warfare Surveillance program, Identity Dominance System (IDS) supports the Joint Personnel Identity (JPI) program. MESF forces have a mobile security mission that requires methodologies, procedures, equipment and the communications capacity to identify individuals who represent a potential threat as a means to deter and eliminate individuals from conducting asymmetric\/non-traditional attacks upon friendly forces, high value assets and coastal areas that NCW is charged with protecting. The Visit, Board, Search and Seizure (VBSS) teams conducting Expanded Maritime Interception Operations also have a similar requirement to identify individuals. The development of a device to support identity functions is captured in the Identity Dominance System Capability Development Document (IDS CDD) and implemented in the Identity Dominance System Capability Production Document (IDS CPD). IDS units are used in the following environments: aboard ship and ashore in ports, the littorals and extended inland field environments worldwide. IDS is employed in maritime and very austere ashore environments and carried by individuals who are part of ship boarding parties and dismounted patrols. These mission and environmental demands dictate a portable, lightweight, rugged, and reliable system with intuitive and user friendly features. IDS biometric modalities may differ by mission profile, requiring the authoritative response to the On-Scene Commander\/Boarding Officer on whether to detain or further investigate an individual of interest.\n\nThe Navy Expeditionary C4I project supports the Navy Expeditionary Combat Command (NECC) mission to detect, deter or interdict potential threats to DoN assets using agile, modular and scalable technology. NECC units have a number of current and future Command, Control, Communications, Computers & Intelligence (C4I) technological requirements for Tactical\/Command Operations Center, tactical vehicles, combatant craft, and dismounted personnel. NECC operations require units to maintain effective command and control, develop and display a common tactical picture, and share intelligence and current operational information with higher headquarters, subordinate units, joint forces and coalition allies. Small, Medium, and Large Scale Communication Systems (LSCS) are the C4I hub for the NECC; Navy Enterprise Tactical Command and Control (NETC2) is the converged LSCS baseline. Future C4I research and development include enhanced information transport, network cyber security posture, assured communications in denied environments along with agility and mobility. Funding is required for  testing and evaluation of cyber security issue associated with obsolescence of network items and if not addressed will impact the ability of the Program Office to maintain system accreditation under Risk Management Framework (RMF) revoking multiple LSCS assets authority to connectivity on the Department of Defense Information Network (DoDIN). Efforts are in alignment with NECC's strategic Expeditionary Warfare Improvement Program (EXWIP) Integrated Priority Capability List (IPCL) priorities and maintain alignment with greater DoD initiatives, such as Joint Information Environment (JIE), Mission Partner Environment (MPE) in order to maintain interoperability and drive down DoN enterprise costs.\n\nCombatant Craft Replacement will provide second generation Riverine Multi Mission Craft that will replace in-service Riverine Patrol Boats (RPBs) and Riverine Assault Boats (RABs). Combatant Craft replacements will: conduct inland waterway patrol and interdiction to preserve the rivers for friendly use as lines of communications; deny the use of rivers and waterways to waterborne and immediate shore sited hostile forces by barrier and interdiction operations;  and, with augmentation of ground and air forces, locate and destroy hostile forces within a riparian area. Specific mission and capabilities will be identified in an Initial Capabilities Document (ICD). RDT&E funding will fund feasibility studies and procurement of mock-ups and prototype craft to demonstrate capabilities prior to production craft procurement."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.875"
                },
                "CurrentYear": {
                    "val": "13.237"
                },
                "BudgetYearOne": {
                    "val": "12.251"
                },
                "BudgetYearOneBase": {
                    "val": "12.251"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.740"
                },
                "CurrentYear": {
                    "val": "13.237"
                },
                "BudgetYearOne": {
                    "val": "14.167"
                },
                "BudgetYearOneBase": {
                    "val": "14.167"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.135"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.916"
                },
                "BudgetYearOneBase": {
                    "val": "1.916"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.135"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.003"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.919"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.919"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 + 1.916 to identify, assess, integrate and test prototype technologies focused on Counter Unmanned Aerial Systems (CUAS)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3326"
                    },
                    "ProjectTitle": {
                        "val": "NSW Rapid Capabilities Development for CIEC"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.942"
                        },
                        "PriorYear": {
                            "val": "2.303"
                        },
                        "CurrentYear": {
                            "val": "6.708"
                        },
                        "BudgetYearOne": {
                            "val": "8.173"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.173"
                        },
                        "BudgetYearTwo": {
                            "val": "6.624"
                        },
                        "BudgetYearThree": {
                            "val": "5.430"
                        },
                        "BudgetYearFour": {
                            "val": "5.532"
                        },
                        "BudgetYearFive": {
                            "val": "5.636"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Rapid Capabilities Development (RCD) project supports the Naval Special Warfare Branch to identify and assess available technologies that confront current and future irregular and expeditionary challenges.  The program's development efforts are focused on the enhancement\/advancement of existing technologies to fill urgent and emergent capability gaps for Naval Special Warfare (NSW).  Program funding provides for the development, integration, testing, validation and combat demonstration of identified technologies and\/or packages of technologies to meet: Contingency Operations goals, service common and NSW program technology challenges, and technology obsolescence issues of developed capabilities.  \n\nThe goal of the RCD project is to develop expeditionary\/operational capabilities for NSW that enable its force to conduct cross-domain special reconnaissance, counterterrorism, direct action, irregular warfare, and foreign internal defense; and fulfill urgent\/emergent needs within a 6-24 month timeframe.  \n\nIn addition to supporting NSW the program also provides support for irregular warfare and expeditionary related urgent\/emergent technology requirements as outlined in Joint Urgent Operational Needs (JUON), Navy Urgent Operational Needs (UON), and\/or support rapid insertion into a Department of Navy (DoN) Program of Record (PoR) or other acquisition programs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Irregular Warfare"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.303"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In FY 2016 prototypes were rapidly developed and fielded for niche capability gaps articulated by NSW, EOD, and the Intelligence Community. The primary focus of efforts was on undersea technologies, ultimately yielding advancements in new underwater communications, threat detection, and render-safe capabilities.  Four different prototypes delivered by FY-16 investments have been operationally employed or delivered for end-user evaluation in support of expeditionary special operations interests. Other FY 16 efforts included: \n\n- Mk18 FoS: Mine Warfare project designed to enhance an existing Mobile Gateway Buoy developed via Small Business Innovative Research (SBIR) funding that expands the data transfer capability collected by an Unmanned Underwater Vehicle through the buoy to a base station to shorten the time required to prosecute mine fields in support of EOD operations. Project underway.\n- Magnetically Coupled Antenna: Prototype UHF magnetic antenna designed to address low angle Satellite Communications capability gap aboard fleet mobility assets was delivered and tested.  Technology did not prove to markedly improve the current capability and the effort was terminated.  \n- iPUMA: Forward engineering of existing SONAR components to modernize the obstacle avoidance system used by Naval Special Warfare (NSW). Obsolescence engineering completed and updated serval electronic components; improved iPUMA now prepped to deliver in early FY18.\n- Dynamic Crane Study: Completed the engineering study to develop a dynamically stabilized crane aboard the Joint High Speed Vessel for small boat\/craft\/vehicle launch and recovery in support of expeditionary and special operations forces. Effort achieved an \"Agreement in Principal\" from the American Bureau of Shipping (the governing certification authority for at sea crane operations) to continue the development.  Effort expected to transition to Navy N4 for execution.  \n- Additive Manufacturing: Delivered Additive Manufactured Mission Optimized propellers designed to rapidly provide man-portable Unmanned Underwater Vehicles with the capability to choose propellers based on mission need: propellers undergoing government verification testing.  Completed two acoustic studies of additive manufactured material properties to assess feasibility of use in the undersea environment: results demonstrated promise in certain frequency ranges and informed developers on capabilities and limitations of additive for undersea applications.  Delivered a medium area additive manufacturing printer that has already been leveraged to accelerate prototyping in support of NSW capability gaps."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.708"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "i.External Personnel Pods: Leverages additive manufacturing to rapidly prototype external personnel pods for special operations undersea mobility assets to provide additional capacity for the end-user. The pod resembles a sidecar strapped to the SEAL Delivery Vehicle (SDV), delivering more operators to the fight. This effort increases operational flexibility and reach for theater commanders when they employ undersea SOF.\n\nii. Lithium-ion Fault Tolerant for Semi-Autonomous Hydrographic Reconnaissance Vehicle: Retrofit the Semi-Autonomous Hydrographic Reconnaissance Vehicles (man-portable Unmanned Underwater Vehicle (UUV) systems used to prosecute mines and conduct hydrographic surveys) with the General Atomics Lithium-ion Fault Tolerant battery system to improve the overall safety of a UUV; and potentially lower total ownership costs of power and energy systems for mobility and support assets for the Naval Special Warfare and Explosive Ordinance Demolition communities.  This project leverages U.S. Special Operations Command (USSOCOM) investment in this technology (>$10M) and aligns systems for Joint use.\n\niii. Critical Battery Management System: Develop a safety certified battery management system for use with the General Atomics configurable Lithium-ion Fault Tolerant battery that enables management and control of battery systems to maximize mission performance and minimize battery risks.  This project leverages USSOCOM investment in this technology; and sets the stage for lowering the risk of lithium-ion battery use for U.S. Navy systems that have to date been unable to be approved for use aboard ships and submarines.\n  \niv. Flex Fuel Generator: Develop a compact, man-portable modified COTS 500W multi-fuel generator capable of powering devices at 28VDC through the implementation of proprietary cold start, and fuel \/ thermal management hardware and control protocols.  This technology enables ground and maritime units the operational flexibility to maintain their power and energy systems charged while in the field; offering increased operational flexibility on the battlefield.\n\nv. Active Diver Thermal: Develop a simple insulated over-garment that traps the heated seawater, created by a tailored exothermic reaction between aluminum-alloy and water, next to the body.  This system is power independent and reliable due to the simplicity of the heat-producing chemical reaction. The exothermic reaction is analogous to the chemical reaction that occurs in a Meal-Ready-to Eat (MRE) heater packet.   To date, neither the U.S. Navy nor USSOCOM have a non-powered solution to meet the requirement for diver thermal protection in extreme cold water conditions.  Thermal balance allows for increased dexterity and cognitive response of U.S. Navy and SOF divers; reducing risk to mission and force.\n\nvi. Sea Stalker: Maritime variant of the Spectral Sieve technology to bring Electronic Warfare Support (ES) capability to the undersea environment; allowing operators to search for, intercept, and identify sources of intentional or unintentional radiated electromagnetic energy for immediate threat recognition, targeting, planning, and intelligence and operational preparation of the battlefield; which directly impacts operational effectiveness.   This effort brings a new capability to undersea mobility platforms; which can also be transitioned to other surface mobility assets. \n\nvii. NAUTICAS \/ Mini Neutron Generator:  Effort supports on-going project work designed to provide explosives detection of underwater mines buried into sea floor.  Initial prototype proved successful during \"blind\" testing with a 90% probability of detection. This neutron generator technology has the ability to detect explosives onboard a ship from subsurface positions external to a ship's hull."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.173"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.173"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2018 provides funding to identify, assess, integrate and test prototype technologies focused on Counter Unmanned Aerial Systems (CUAS) for the Joint Urgent\/Emergent Operational Needs (JUON\/JEON) to support NSW.  Investments will focus on immediate NSW requirements; while leveraging existing efforts across DoD to accelerate a solution to the field.  \n\nProgram will also support rapid innovation to solve new problems plaguing ongoing operations.  The most notable forecasted effort is Maritime Precision Engagement (MPE).  A fielded MPE capability will address two operational gaps: precision strike from a small surface craft within a contested environment; and a land-based, organic stand-off weapon launched from a light, tactical vehicle with considerable range, precision, terminal control, and loiter capability. Such capabilities would counter multiple documented threats associated with both peer adversaries and VEOs.\n\nAdditionally the program will continue to identify, assess, integrate and test technologies focused on close-in expeditionary ISR, power and energy, diver thermal, sensor integration (EO\/IR, Acoustic, RF), signature management, and navigation and communications in denied environments.  \n\nThe Broad Area Announcement process for the identification of technologies that enhance and\/or accelerate expeditionary and irregular capabilities in support of NSW capability challenges remains open.  Currently there are 15 proposals in the review process for potential award in FY 2018.  Once selected, those projects will be submitted to contracts for execution."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Identify the requirements necessary to meet immediate and future warfighter needs; integrate existing unique and\/or related capabilities that can best meet those warfighter needs; test those integrated capabilities; and then demonstrate in real time and\/or during planned deployments within a 6-24 month period.  Endeavor to leverage existing mature technologies to take advantage of investments already made to reduce cost and time to market; and seek out cost-sharing opportunities with other resource sponsors to make program funding more effective for the expeditionary end-user."
                        },
                        "PerformanceMetrics": {
                            "val": "Test, verify and validate developed system parameters against approved threshold and objective operational requirements established by the intended expeditionary end-user within the established budget and schedule.  Transition the developed technologies to the respective Program Managers or end-users for operational evaluation."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "4011"
                    },
                    "ProjectTitle": {
                        "val": "Naval Coastal Warfare Surv and C4I Sys"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "42.043"
                        },
                        "PriorYear": {
                            "val": "2.879"
                        },
                        "CurrentYear": {
                            "val": "3.406"
                        },
                        "BudgetYearOne": {
                            "val": "3.886"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.886"
                        },
                        "BudgetYearTwo": {
                            "val": "3.735"
                        },
                        "BudgetYearThree": {
                            "val": "3.670"
                        },
                        "BudgetYearFour": {
                            "val": "3.743"
                        },
                        "BudgetYearFive": {
                            "val": "3.818"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Navy Expeditionary project supports the Navy Expeditionary Combat Command (NECC) mission to detect, deter or interdict potential threats to DoN assets using agile, modular and scalable technology. NECC units have a number of current and future Command, Control, Communications, Computers & Intelligence (C4I) technological requirements for Tactical\/Command Operations Center, tactical vehicles, combatant craft, and dismounted personnel. NECC operations require units to maintain effective command and control, develop and display a common tactical picture, and share intelligence and current operational information with higher headquarters, subordinate units, joint forces and coalition allies. Small, Medium, and Large Scale Communication Systems (LSCS) are the C4I hub for the NECC; Navy Enterprise Tactical Command and Control (NETC2) is the converged LSCS baseline. Future C4I research and development include enhanced information transport, network cyber security posture, assured communications in denied environments along with agility and mobility. Funding is required for  testing and evaluation of cyber security issue associated with obsolescence of network items and if not addressed will impact the ability of the Program Office to maintain system accreditation under Risk Management Framework (RMF) revoking multiple LSCS assets authority to connectivity on the Department of Defense Information Network (DoDIN). Efforts are in alignment with NECC's strategic Expeditionary Warfare Improvement Program (EXWIP) Integrated Priority Capability List (IPCL) priorities and maintain alignment with greater DoD initiatives, such as Joint Information Environment (JIE), Mission Partner Environment (MPE) in order to maintain interoperability and drive down DoN enterprise costs.\n\nThe future of large scale communications assets such as Mobile Ashore Support Terminal (MAST), Ruggedized Deployable Satellite\/Tactical Data Network (RDSAT\/TDN) and Deployable Expeditionary Network-Medium (DEXNet-M) supporting Surveillance Control Central, Expeditionary (ESCC) formerly Radar Sonar Surveillance Center (RSSC) will be converging to a common baseline, the Navy Enterprise Tactical Command and Control (NETC2). Next generation air, surface and subsurface surveillance systems, as well as enhanced C4I capabilities, are required to meet operational objectives. Future technologies are being evaluated as enabling capabilities to expand situational awareness, providing additional tactical decision aids to the local area commander. Future C4I research and development efforts will be identified within NECC strategic Expeditionary Warfare Improvement Program (EXWIP) Integrated Priority Capability List (IPCL) priorities to increase agility, mobility and network security posture. Additional efforts will be driven by greater DoD initiatives, such as Joint Information Environment (JIE) Inc II, in order to maintain interoperability and drive down DoN enterprise costs. \n\nIdentity Dominance System (IDS) supports the Navy's Visit, Board, Search and Seizure (VBSS) teams conducting Expanded Maritime Interception Operations with a biometric capability. IDS provides the Navy with a means to collect and process identity information in the conduct of maritime and expeditionary operations.  There are three key aspects of this capability: 1) enable forces to rapidly identify unknown individuals encountered in the conduct of operations; 2) verify an unknown individual's claimed identity; and 3) enable forces to update, manage, and share identity information on friendly, neutral, and enemy individuals in support of identity operations (IdOps). To support IdOps and achieve identity dominance for expeditionary and naval forces, the future biometrics collection and processing equipment needs to be smaller, lighter, and more efficient with respect to computing power and speed when compared against the current system.  The equipment needs to take advantage of enhanced communications capabilities, be able to store the appropriate amount of data to collect biometric samples, match the samples against an internal database and reach near real time operations with connectivity to the DoD biometrics database. In addition to Navy VBSS Maritime Interception Operations (MIO), IDS also supports the Expeditionary Exploitation Unit One (EXU-1) expeditionary missions. IDS must continue to mature and adapt to the changing threat environment and emerging requirements to support these missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NECC C4ISR Modernization"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.642"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Aligned NETC2 efforts to emerging DoD technologies in order to enhance capabilities provided to the warfighter and incorporated technologies in NETC2 test efforts in order to facilitate virtualization. Began moving Expeditionary common services to a Joint Information Environment (JIE) Core Data Center node using cloud infrastructure and inclusion of unique requirements into cloud generation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.377"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop common baseline load to streamline production and reduce cyber maintenance timelines from development through implementation. Further orientation to a multi-program baseline architecture while converging to the Joint Information Environment (JIE). Continue to incorporate Joint, DoD, and industry developed technologies in order to enhance NETC2 capabilities provided at the tactical edge while reducing system size, weight, power, and logistics infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.639"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.639"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Enhancing Assured Command and Control (AC2) in a compromised communication environments encompassing Joint Information Environment (JIE), Coalition, and Mission Partner Environment (MPE) data integration, and on-the-move tactical data exfiltration and sharing. As well as enabling Tactical Hosting Environment Security Enhancements by adopting Virtual Secure Enclave (VSE) hosting and data protection\/prioritization concepts, and expansion of Mission Support Center (MSC) capabilities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Identity Dominance System"
                                    },
                                    "Description": {
                                        "val": "The Identity Dominance System (IDS) is facing obsolescence and is scheduled for a technology refresh in FY19 to field a sustainable system, reduce maintenance and sustainment costs, improve system capabilities, and eliminate performance shortfalls."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.237"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The migration of IDS to Windows 7 was completed in FY16. IDS is in the process of retrofitting currently fielded Windows XP systems with Windows 7 systems. The IDS team has initiated technology review in support of the FY19 technology refresh. In collaboration with the USMC, IDS released a Request for Information (RFI), reviewed and ranked vendor submissions, scheduled and executed technology demonstrations and evaluations, and continued development of the IDS technology refresh roadmap. Additionally, IDS initiated a performance engineering change proposal (ECP) to improve the operator experience, maintain IA compliance and provide additional system enhancements that will increase system performance. Documentation updates were performed based on the system changes incorporated by the ECPs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.029"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "IDS will complete fielding and retrofit of the Windows 7 baseline. The IDS team will continue technology assessment in support of technology refresh and begin reviewing and revising necessary documentation as required. Technology assessment will consist of vendor documentation review and testing IDS for interoperability with the ISNS and CANES shipboard networks. Additionally, IDS will initiate a performance ECP to provide capability enhancement and maintain IA compliance. Pursuant to IDS tech refresh strategy, efforts toward software development will begin."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.247"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.247"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Starting in Q1FY18, IDS will release the RFP for IDS tech refresh and conduct source selection. IDS will continue to perform IA updates every quarter along with all other testing that will be needed for IDS tech refresh. In FY18, IDS will be fully into the operations and lifecycle maintenance phase; Research, Development, Testing and Evaluation (RDT&E) efforts will continue to develop and assess upgrades and modifications to keep IDS relevant and effective through follow-on Engineering Change Proposals (ECPs). IDS will mature and develop new technologies to meet emerging requirements in support of Counter IED and Force Protection Efforts to those deployed. US Central Command UONs currently exist for biometrics collection capabilities, and requirements continue to grow. Additionally, biometrics was ranked as the number one priority amongst Combatant Commands for current and future efforts. Due to the changing threat environment, the need for an enhanced capability has increased. The ability to rapidly collect and identify persons of interest (POIs) has become a high priority in order to effectively identify threats and improve combat operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/8120"
                                    },
                                    "Title": {
                                        "val": "Maritime Expeditionary Security Force"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.929"
                                        },
                                        "CurrentYear": {
                                            "val": "9.073"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.010"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.010"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.670"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.800"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.662"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.835"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Funding supports an evolutionary acquisition strategy supporting the dynamically evolving rapid action mission of Navy Expeditionary Forces. Large Scale Communication Systems (LSCS) funding will align LSCS to the Deployable Joint Command and Control (DJC2) product baseline. The project will continuously analyze operational utilization of the systems and will roll analysis results into periodic system upgrades to address cyber security vulnerabilities, obsolescence, and maximize operational effectiveness. The intent of this strategy is to: drive down development, production, and logistics costs, while leveraging technologies developed for other agencies to increase the capabilities of Navy Expeditionary Forces. The baseline configuration for Large Scale Communication Systems (LSCS) is the Navy Enterprise Tactical Command and Control (NETC2), a system scalable to Adaptive Force Package (AFP) levels. Efforts include development of capabilities based on emergent requirements, operational feedback, alignment with Dept. of Defense initiatives such as Joint Information Environment (JIE) \/ Mission Partner Environment, and identification through strategic Expeditionary and Warfare Improvement Program (EXWIP) Integrated Priority Capability List (IPCL) priorities to include reach back for tactical vehicles and craft, blue force tracking, tactical data link capability, and sensor technologies in support of surveillance and reconnaissance missions.\n\nIdentity Dominance System (IDS) will continue to provide a biometric capability to the Navy's expeditionary\/forward deployed forces through system upgrades and further collaboration with other biometric stakeholders. The funding supports development and integration of new capabilities designed to enhance the overall performance of IDS and improve our Nation's security posture abroad and INCONUS. The program continually assesses the threat environment, security posture, operational requirements, and DoD and Navy policies related to Identity Operations and Force Protection. As DOD biometrics requirements continue to grow, new lower cost, more capable technologies are emerging. The program will evaluate, integrate, and field these new capabilities to Maritime and Expeditionary Forces."
                        },
                        "PerformanceMetrics": {
                            "val": "The Navy Expeditionary program continues to identify, evaluate and test a minimum of 3-5 new technologies or configurations per year for potential insertion into the Technical Refresh Plan, to be demonstrated at Fleet Demonstrations"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9C86"
                    },
                    "ProjectTitle": {
                        "val": "Combatant Craft Replacement"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.082"
                        },
                        "PriorYear": {
                            "val": "0.558"
                        },
                        "CurrentYear": {
                            "val": "3.123"
                        },
                        "BudgetYearOne": {
                            "val": "2.108"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.108"
                        },
                        "BudgetYearTwo": {
                            "val": "1.340"
                        },
                        "BudgetYearThree": {
                            "val": "0.863"
                        },
                        "BudgetYearFour": {
                            "val": "0.884"
                        },
                        "BudgetYearFive": {
                            "val": "0.902"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Navy Expeditionary Combat patrol boat, Fleet Expeditionary Security combatant craft, Underwater Construction and Explosive Ordnance Disposal (EOD) replacements will provide second generation Multi Mission Craft that will replace in-service Force Protection Large, Force Protection Small, Riverine Patrol Boats (RPBs), Riverine Assault Boats (RABs), Underwater Construction and EOD craft. Boat and craft replacements will: conduct Maritime Security Operations across the full spectrum of naval, joint, and combined operations enabling access and freedom of action throughout the sea-to-shore and inland operating environments as well as conduct maritime Mine Countermeasures (MCM), counter Improvised Explosive Devices (IEDs), Weapons of Mass Destruction (WMD), and all other types of weaponry, for protection of naval and joint assets required for sea control and power projection.  Specific mission and capabilities will be identified in an Initial Capabilities Document (ICD), Analysis of Alternatives (AoA), Capabilities Production Document (CPD) and required milestone documentation. RDT&E funding will fund procurement and material solution studies, advanced technology development and studies, design development and test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combatant Craft Replacement"
                                    },
                                    "Description": {
                                        "val": "The boats and craft in the Navy Expeditionary Combat Command (NECC) fleet are reaching the end of their service lives and will create a capability gap if not replaced. Funding supports design\/development and testing of NECC's next generation Patrol Boat (PB-X) and other NECC craft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.558"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed design studies to replace and improve capabilities of legacy 33' Riverine Assault Boats, 33' Special Operations Craft Riverine, 34' Patrol Boats, and 39' Riverine Patrol Boats with a common combatant craft hull, PB(X).   Continued to support MK VI PB Fleet Introduction, system familiarization, testing and training efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.123"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct planning, research, analysis, design and development and operational testing for PB-X in support of NECC craft recapitalization.  Continue science and technology development work to optimize material solutions to fill critical NECC capability gaps. Continue to support boat system development and demonstration, operational testing and crew familiarization for the MK VI Patrol Boat program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.108"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.108"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commence phased approach to recapitalize EOD Craft and other NECC Craft through material solution analysis and advanced technology development studies.  Continue science and technology development work to optimize material solutions to fill critical NECC capability gaps."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/1210"
                                    },
                                    "Title": {
                                        "val": "Standard Boats (NECC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.059"
                                        },
                                        "CurrentYear": {
                                            "val": "8.235"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.382"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.382"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "18.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.204"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.312"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.420"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.624"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Acquisition of RDT&E developed craft material solution and technology to be accomplished using \"tailored\" commercial  procurements in accordance with a PMS325G approved\/OPNAV N95 endorsed NECC Craft Replacement Acquisition Strategy."
                        },
                        "PerformanceMetrics": {
                            "val": "Successfully demonstrate system functionality to support approved requirements and Initial Capabilities Document (ICD)."
                        }
                    }
                }
            ]
        }
    }
}