{
    "id": "2018-Army-PB-2040-JBOOK-6496f983e90d3a98760d6d2aa09bce01c6733fe7e60bc4ee6b3adbaad3baa8ce-13",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineNumber": {
            "val": "42"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "31.810"
            },
            "CurrentYear": {
                "val": "27.893"
            },
            "BudgetYearOne": {
                "val": "31.296"
            },
            "BudgetYearOneBase": {
                "val": "31.296"
            },
            "BudgetYearTwo": {
                "val": "34.241"
            },
            "BudgetYearThree": {
                "val": "36.859"
            },
            "BudgetYearFour": {
                "val": "37.484"
            },
            "BudgetYearFive": {
                "val": "38.541"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates electronic warfare (EW) sensors and software intended to deny, disrupt, locate or destroy the enemy's command, control and communications (C3) systems and intelligence, surveillance and reconnaissance assets. This PE matures both countermeasures (CM) and counter-countermeasures (CCM) to deny the enemy the use of their systems while protecting United States (U.S.) assets from enemy deception and jamming. Project K15 matures and demonstrates capabilities to locate and exploit enemy communication systems including computer networks. Project K16 matures and demonstrates multifunctional EW capabilities (jamming) to enhance platform survivability and provide near real-time situational awareness to the Commander through the detection, identification and geo-location of emitters of interest.\n\nWork in this PE complements PE 0602120A (Sensors and Electronic Survivability), PE 0602782A (Command, Control, Communications Technology), PE 0602270A (Electronic Warfare Technology), PE 0603772A (Advanced Tactical Computer Science) and PE 0603794A (Command, Control and Communications Advanced Technology), and is coordinated with PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602618A (Ballistics Technology), PE 0603003A (Aviation Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603313A (Missile and Rocket Advanced Technology) and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.874"
                },
                "CurrentYear": {
                    "val": "27.893"
                },
                "BudgetYearOne": {
                    "val": "25.767"
                },
                "BudgetYearOneBase": {
                    "val": "25.767"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "31.810"
                },
                "CurrentYear": {
                    "val": "27.893"
                },
                "BudgetYearOne": {
                    "val": "31.296"
                },
                "BudgetYearOneBase": {
                    "val": "31.296"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.064"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.529"
                },
                "BudgetYearOneBase": {
                    "val": "5.529"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.064"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "5.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.029"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.029"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In Fiscal Year 2018 funding increased to support needed aircraft survivability and Multifunction Electronic Warfare efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "K12"
                    },
                    "ProjectTitle": {
                        "val": "EW Demonstrations (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Electronic Warfare Demonstrations."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.000"
                                        },
                                        "Text": {
                                            "val": "Program Increase"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K15"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Comm Ecm Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.141"
                        },
                        "CurrentYear": {
                            "val": "8.103"
                        },
                        "BudgetYearOne": {
                            "val": "9.288"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.288"
                        },
                        "BudgetYearTwo": {
                            "val": "10.922"
                        },
                        "BudgetYearThree": {
                            "val": "11.623"
                        },
                        "BudgetYearFour": {
                            "val": "11.824"
                        },
                        "BudgetYearFive": {
                            "val": "12.078"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates sensor and software technologies to locate and identify modern tactical enemy and blue force (friendly) radio frequency (RF) communications, radars and computer networks and nodes. This Project enables uninterrupted air and ground based intelligence collection and long range targeting operations in a hostile electromagnetic and cyber environment, and enables communications countermeasures (CM) and counter-countermeasures (CCM) to first intercept, identify and locate tactical communications; then degrade threat-computer networks and their components.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Communications - Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Offensive Operations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates integrated electronic attack (EA) and computer network operations (CNO) hardware and software to execute force protection (FP), EA, electronic surveillance (ES), signals intelligence (SIGINT), electronic warfare (EW) and cyber missions in a dynamic, distributed and coordinated fashion. This results in the capability to engage a multitude of diverse multi-node, multi-waveform, multi-platform and cyber (internetworked computers) targets while maximizing overall network efficiency and effectiveness, and preserving blue force and non-combatant communications. Work being accomplished under Program Element (PE) 0603270A\/project K16 and PE 0602270\/project 906 complement this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.801"
                                            },
                                            "Text": {
                                                "val": "Used representative blue force systems to conduct exploitation of emerging signals of interest (SOI) to determine potential cyber\/EW\/collection applications for each signal; matured and integrated advanced techniques to enable new mission capabilities to exploit emerging target SOI; and utilized emerging software defined radios as platforms to implement and demonstrate these techniques in an open and modular framework for potential porting into candidate existing and emerging acquisition programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.575"
                                            },
                                            "Text": {
                                                "val": "Will mature interface definitions and data transfer protocol for the inclusion of tactical cyber capability on a single board computer in a common RF chassis as part of an open, modular converged RF architecture to employ multiple electronic support and electronic attack techniques simultaneously; continue to mature and integrate advanced techniques against SOIs onto representative software defined radio platforms and demonstrate the effectiveness of tactical cyber capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.177"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.177"
                                            },
                                            "Text": {
                                                "val": "Will finalize interface definitions for advanced techniques to perform various Cyber and EW functions (locate, degrade, disrupt,deny) against identified SOIs; mature and demonstrate techniques to perform command & control (C2) cyber functions from EW and SIGINT platforms across\/within security domains; mature data models (structure and method for ingest and relational analysis of data) necessary for the delivery of data products to the intelligence enterprise that provide the tactical commander with a better cyber electromagnetic activities (CEMA) situational awareness (SA) and understanding (SU); mature and conduct modeling and simulation within the laboratory to replicate next generation CEMA architecture and mature analytic tools to inform\/develop the commander's SU; and replicate the current offensive cyber operation (OCO) operational state within a simulated laboratory environment to facilitate an EW\/Cyber tactical rehearsal and training capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stand-off Non-Cooperative Multi-Intelligence (Multi-INT) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware and software to conduct standoff EW intelligence, surveillance reconnaissance, planning and effects in a three dimensional urban battlespace."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.340"
                                            },
                                            "Text": {
                                                "val": "Matured, assessed and demonstrated multi-intelligence and EW techniques and effects on emerging threats, such as unmanned aerial systems (UAS), to identify potential vulnerabilities; and integrated, assessed and demonstrated advanced EW techniques and effects to use against identified target UAS to determine their effectiveness and potential portability to address other threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.528"
                                            },
                                            "Text": {
                                                "val": "Will design, mature, fabricate and program a circuit card to employ viable EW techniques to counter identified UAS threats and integrate it into an open, modular converged RF architecture and demonstrate the effectiveness of the capability in a laboratory environment; assess requirement to coordinate data exchange between national and tactical assets to achieve desired, coordinated effects on designated threat systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.111"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.111"
                                            },
                                            "Text": {
                                                "val": "Will mature and develop techniques focused on executing ES (sense\/detect\/identify\/geolocate) and EA (deny\/degrade\/disrupt) capabilities against peer\/near peer threat systems and networks operating within congested and contested environments; begin identification of measurable characteristics for EW system effects (i.e. battle damage assessment) commensurate with and to be integrated with kinetic effect characteristics in support of mission planning and employment capabilities; and extend and demonstrate EW Planning and Management Tool (EWPMT) Program of Record (POR) interfaces supporting data fusion and analysis for the Distributed Common Ground Station – Army (DCGS-A) POR and remote C2\/coordination of EW assets and effects for the Multi-Function EW (MFEW) POR  and defensive electronic attack (DEA) capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K16"
                    },
                    "ProjectTitle": {
                        "val": "Non-Commo Ecm Tech Dem"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.669"
                        },
                        "CurrentYear": {
                            "val": "19.790"
                        },
                        "BudgetYearOne": {
                            "val": "22.008"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.008"
                        },
                        "BudgetYearTwo": {
                            "val": "23.319"
                        },
                        "BudgetYearThree": {
                            "val": "25.236"
                        },
                        "BudgetYearFour": {
                            "val": "25.660"
                        },
                        "BudgetYearFive": {
                            "val": "26.463"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates non-communication, multi-functional electronic warfare (EW) capabilities that enhance the survivability of Army air and ground platforms and dismounted Soldiers. This Project matures and demonstrates radio frequency (RF), infrared (IR) and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and neutralize (jam) booby traps, radar-directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), and top-attack and electronically-fuzed munitions. This Project also enables electronic support (ES) hardware and software to detect, identify and geolocate emitters of interest from an effective standoff distance to provide near real-time situational awareness.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Communications-Electronic Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multispectral Threat Detection and Countermeasures  Technologies (formerly titled Distributed Aperture Infrared Countermeasures Technologies (DAIRCM))"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates countermeasure technologies that provide platform protection and integrated cueing against EO,  IR and RF guided threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.150"
                                            },
                                            "Text": {
                                                "val": "Continued to mature wideband RF warning sensor and integrate RF warning sensor into representative hardware suite; and conducted sensor performance assessment to demonstrate the performance and readiness of the RF warning system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.326"
                                            },
                                            "Text": {
                                                "val": "Will finish requirements and interface definitions for integration of a 2 channel digital RF receiver on a single circuit card assembly for use in modern radar warning receivers, capable of identifying advanced radar threat systems into an open, modular, converged RF architecture; demonstrate system functionality in a representative hardware platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.447"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.447"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate cognitive and adaptive threat agnostic (functional against unknown threats to the area) detection and countermeasure algorithms using statistics-based machine learning techniques as part of an integrated survivability suite; use modeling and simulation to ensure the modular architecture framework supports rapid updates for algorithm maturation and assessment; design, code and integrate a new class of warning algorithms to operate against unknown\/unexploited low signature and emerging threats; mature and fabricate digital readout integrated circuit specifically for threat warning applications; and mature and validate an integrated software framework that utilizes cognitive controls to select the best countermeasure given the information the integrated survivability suite provides."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Tactical EW Countermeasure Technologies (formerly titled Advanced Tactical Radio Frequency Countermeasures Technologies (ATRFCM))"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates integrated EW\/direction finding technologies that provide protection of air, ground and dismounts from emerging RF threats at standoff distances. Work accomplished under Program Element (PE) 0602270A\/Project 906 and PE 0603270A\/Project K15 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.716"
                                            },
                                            "Text": {
                                                "val": "Integrated and demonstrated signals intelligence (SIGINT) and cyber enabling capabilities into a common chassis utilizing a set of standards-based hardware and software open modular architectures to improve capability and interoperability, and reduce platform size, weight, power and costs; and demonstrated the maturity of a multi-function architecture that integrates defensive electronic attack, active electronic support, SIGINT, and cyber enabling capabilities to evaluate the combined capability performance over-the-air in an anechoic chamber."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.964"
                                            },
                                            "Text": {
                                                "val": "Will use converged RF architecture to mature and integrate EW techniques to determine the utility of sharing data between components, such as software defined radios, sensors, electronic support and countermeasures to identify, geo-locate and neutralize RF threats for platform survivability, and demonstrate in a relevant environment; assess types of data that can be collected from different components to improve platform survivability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.056"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.056"
                                            },
                                            "Text": {
                                                "val": "Will mature processing and learning algorithms that go beyond traditional detection and countermeasure for ground based threats by exploiting unused embedded features within sensor data sets to increase the probability of neutralizing the threat through improved identification,  classification, direction finding and countermeasure effectiveness; use modeling and simulation to assess the ability of learning algorithms to improve platform survivability; and demonstrate capability in a relevant environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW Counter Countermeasures"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware and software to counter emerging electronic warfare threats to command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) platforms.  Work being accomplished under PE 0603772\/Project 243 and 0602270A\/Project 906 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.361"
                                            },
                                            "Text": {
                                                "val": "Analyzed previously conducted testing of counter EW techniques to determine effectiveness against identified threats; developed and documented standard EW technique assessment protocols to enable independent validation to be conducted of all results; and continued to demonstrate hardware in the loop testing to provide robust assessments and measurements using realistic threat and blue force systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Will utilize current capability to simulate real world effects of red force jamming in complex (multi-path) environments; conduct hardware in the loop analysis of prioritized emerging threat interference techniques; replicate potential interactions on emerging blue force systems, (i.e. communication, radar) to understand and mitigate the electromagnetic interference caused by these effects; develop, mature and assess advanced signal\/data processing algorithms and cancellation techniques to mitigate the effects of the threat; begin hardware in the loop analysis of the effectiveness of these techniques against red force jamming."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.502"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.502"
                                            },
                                            "Text": {
                                                "val": "Will mature and integrate electronic protection (EP) software and algorithms in an open standards and open architecture design; conduct hardware in the loop analysis of prioritized emerging threat interference techniques; assess potential interactions on emerging blue force systems, (i.e. communication, radar) and apply EP algorithms to mitigate the electromagnetic interference caused by these effects; mature EP algorithms for detection, localization and neutralization of electronic interference, and demonstrate their performance; and enhance hardware in the loop testing capabilities to support a future threat analysis to achieve full closed loop capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection System (APS) Soft Kill (SK)\/Hard Kill (HK) Sensors (formerly titled Active Protection System (APS) Soft Kill)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware, software and techniques to provide an EW soft kill, and cueing\/tracking capability to the APS suite. This effort supports the Army's APS program to mature and demonstrate technologies to reduce vehicle weight by reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats.  Work being accomplished under PE 0602601A\/Project C05, PE 0602618A\/Project H80, PE 0603004A\/Project 232, PE 0603005A\/Project 221 and PE 0603313A\/Project 263 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.722"
                                            },
                                            "Text": {
                                                "val": "Investigated and matured sensor framework to facilitate integration of cueing sensors and EW soft kill into the Modular Active Protection System (MAPS) architecture; matured algorithm to utilize a cueing sensor to enable threat detection and determine threat angle of arrival; matured tracking sensor to improve capability to provide accurate threat tracking and false alarm reduction, characterize threats, provided warning and fire control functions and confirm effective countermeasure performance; and matured and conducted initial integration testing and demonstration to assess cueing sensor performance when integrated into the MAPS framework."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.250"
                                            },
                                            "Text": {
                                                "val": "Will complete sensor design, fabrication, and physical interface designs and begin integration onto a demonstration platform; conduct live fire data collection utilizing the sensor that has been integrated into the MAPS framework; characterize data collected to assess sensor performance within the MAPS framework; continue to assist in the development of MAPS framework interface definitions, protocols and requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.251"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.251"
                                            },
                                            "Text": {
                                                "val": "Will complete SK demonstration and system analysis of sensors, SK countermeasure (SKCM) and brassboard controller on MAPS platform demonstrator; verify sensor interface designs with modular active protection framework by demonstrating real time cueing and handoff of the threat message to the SKCM; continue integration of cueing sensor into the HK demonstration, as well as integrating new SK techniques into the SKCM demonstration hardware to address a wider list of current and emerging threats; continue tracking sensor development, demonstrate the integration and threat message pass through of multiple subsystems (cueing and tracking sensors, controller and SKCM); and integrate tracking sensor into the controller to prepare for the HK\/SK demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling Simulation and Technique Maturation for Integrated RF Operations (formerly titled Integrated RF Operations)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates a capability to perform modeling and simulation (M&S) of geographically dispersed RF systems to provide a coordinated, collaborative and interoperable suite of EW capabilities. A modular software architecture will allow for rapid, cost effective technique development and integration of new EW capabilities, target signals of interest and environmental simulations. Work being accomplished under PE 0602270A\/Project 906 and PE 0603794A\/Project EL4 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.720"
                                            },
                                            "Text": {
                                                "val": "Developed improvements to RF M&S capabilities that increase M&S fidelity of blue force system performance and interactions with various signals of interest (SOI) to enable the evaluation of advanced, emerging EW techniques; and assessed requirements to extend SOI models to improve fidelity and provide an accurate and consistent modeling environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Will continue to improve RF M&S capabilities to accurately model complex urban environments, system performance in those environments and interactions with relevant SOIs common to urban environment; optimize methods to conduct M&S of complex environments with multiple geographically dispersed SOIs and blue force systems in a timely manner with sufficient fidelity to provide validated performance estimates to system developers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.751"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.751"
                                            },
                                            "Text": {
                                                "val": "Will continue to evolve the M&S environment capable of assessing the expected performance and tradeoffs of employing EW effects in a coordinated operation; mature analysis tools to assess and validate employment scenarios in conjunction with the Cyber Center of Excellence using one or more remotely managed EW assets against one or more threat categories (i.e., communications, radar, electronic countermeasure) systems; and develop M&S software tools and mature EW techniques and waveforms against specific SOIs (i.e., point-to-point, network devices, emerging modern communications) to allow manipulation of both EW asset and threat network characteristics and parameters (i.e., density, placement, terrain, transmit power levels, and receive power thresholds) for the development of concept of operations (CONOPs) and EW techniques supporting the emerging Army Integrated Electronic Warfare System concept."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence Processing and Architecture Modernization"
                                    },
                                    "Description": {
                                        "val": "This effort will leverage Intelligence Community investments in software frameworks and exploits against threat SOIs to develop a library of open, modular, and scalable software solutions to address identified capability gaps and to provide the commander with electronic situational awareness while at the same time protecting his assets from enemy deception and jamming. Work accomplished under PE 0602270A\/Project 906 and PE 0603772A\/Project 243 complements this effort. In Fiscal Year (FY) 18 this effort continues work previously reported under PE 0603772A\/Project243 Intelligence Processing and Architecture Modernization."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.001"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.001"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a reference design of a multi-channel electronic support receiver designed according to the Modular Open Radio Frequency Architecture to conduct access and effects operations against regional threats to blue force Programs of Record; and develop and demonstrate an open architecture transmit capability that supports multiple mission spaces."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}