{
    "id": "2018-Navy-PB-1319-MJBOOK-1-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-13",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603542N"
        },
        "ProgramElementTitle": {
            "val": "Radiological Control"
        },
        "R1LineNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "16.707"
            },
            "PriorYear": {
                "val": "0.709"
            },
            "CurrentYear": {
                "val": "0.702"
            },
            "BudgetYearOne": {
                "val": "0.745"
            },
            "BudgetYearOneBase": {
                "val": "0.745"
            },
            "BudgetYearTwo": {
                "val": "0.762"
            },
            "BudgetYearThree": {
                "val": "0.775"
            },
            "BudgetYearFour": {
                "val": "0.790"
            },
            "BudgetYearFive": {
                "val": "0.805"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Mission Description:  The Radiation Detection, Indication and Computation (RADIAC) Program is responsible for providing radiation monitoring instruments that detect and measure ionizing radiation.  These instruments are used on all Navy, Coast Guard and Military Sealift Command vessels, and at every Navy shore installation, in order to ensure the safety of personnel, continuity of operations in radiological contingencies, and protection of the environment.\n\nJustification:  Title 10 of the Code of Federal Regulations, Part 20 (10 CFR 20) requires RADIAC instruments be used to ensure the safety of personnel who work with or are exposed to radioactive materials in their work.  Additionally, the Navy's mission requires personnel and ships to have the ability to operate in radiological environments and the ability to identify and interdict radiological Weapons of Mass Destruction (WMD).  Navy programs that require RADIAC instruments for Occupational Safety & Health (OSH) reasons under the provisions of 10 CFR 20 include Naval Nuclear Propulsion, Nuclear Weapons, Medical, and Radiological Affairs Support.  Non-OSH programs include Radiological Defense, Consequence Management, Training, Technical (RADIAC calibration, shielding evaluation, research, etc.) and Radiological Search (maritime interdiction and radiological search missions to locate or intercept WMD).\n\nThis budget item develops, tests and evaluates new, highly reliable, more easily calibrated, easy to care and maintain, light weight and modern RADIAC instruments in order to improve the effectiveness of radiation safety, to make instruments simpler to use, and to reduce life cycle costs.  The ultimate goal is to replace old, bulky, costly to maintain and repair, unreliable and obsolete instrumentation with multifunction equipment that can be automatically calibrated at greatly reduced cost.\n\nThis budget item also provides for improvement to nuclear weapons intrinsic radiation (gamma and neutron) shielding calculations, mixed field (neutron and gamma) dosimetry, and in neutron measurement.  The objective is to develop less costly and more effective integral shielding for better personnel protection and safety.  Improvement in personnel dosimetry and neutron measurement is also a major emphasis."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.710"
                },
                "CurrentYear": {
                    "val": "0.702"
                },
                "BudgetYearOne": {
                    "val": "0.737"
                },
                "BudgetYearOneBase": {
                    "val": "0.737"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.709"
                },
                "CurrentYear": {
                    "val": "0.702"
                },
                "BudgetYearOne": {
                    "val": "0.745"
                },
                "BudgetYearOneBase": {
                    "val": "0.745"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.001"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.008"
                },
                "BudgetYearOneBase": {
                    "val": "0.008"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.001"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.008"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.008"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1830"
                    },
                    "ProjectTitle": {
                        "val": "RADIAC Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.707"
                        },
                        "PriorYear": {
                            "val": "0.709"
                        },
                        "CurrentYear": {
                            "val": "0.702"
                        },
                        "BudgetYearOne": {
                            "val": "0.745"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.745"
                        },
                        "BudgetYearTwo": {
                            "val": "0.762"
                        },
                        "BudgetYearThree": {
                            "val": "0.775"
                        },
                        "BudgetYearFour": {
                            "val": "0.790"
                        },
                        "BudgetYearFive": {
                            "val": "0.805"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission: The Radiation Detection, Indication and Computation (RADIAC) Program is responsible for providing radiation monitoring instruments that detect and measure radiation in accordance with the provisions of Title 10 of the Code of Federal Regulations (10 CFR).  These instruments are used on all vessels afloat and at every shore installation in order to ensure the safety of personnel and the environment.  RADIACs are also required after an act of terrorism or war that involves nuclear material in order to enable continuing warfighting ability.\n\nJustification: Many RADIAC instruments and dosimetry systems are decades old and approaching the end of their useful lives.  In some cases the equipment and replacement parts are no longer manufactured, making the equipment logistically unsupportable.  In other cases increasing failure rates due to age make replacements an economic efficiency\nimprovement.  In all cases a technology refresh will make both economic sense in terms of lowering the total ownership costs, and will also provide increased operational capabilities.\n  \nNaval Nuclear Propulsion Program (NNPP):  Instruments are developed to support the safe operation and maintenance of nuclear powered vessels and at nuclear maintenance facilities.\n\nNon-NNPP: Instruments are developed to support other than NNPP end users, such as Explosive Ordnance Disposal, Nuclear Weapons, Medical, Industrial Radiography, Radiological Defense and Training.\n \nVisit, Board, Search & Seizure (VBSS): The Navy has been tasked to intercept and board vessels at sea to search for nuclear or radiological materials that could be used for terrorist attacks. These instruments would have different characteristics than those used for NNPP and non-NNPP purposes and prototypes must be developed and\/or tested and evaluated.  \n\nThe AN\/PDR-65 Ship Board Monitoring System is obsolete and will be replaced.  The IM-239\/WDQ Air Particle Detector (APD) and the HD-732, HD-1150 and HD-1151 Air Particle Samplers (APS) are obsolete and will be replaced."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Calibrators"
                                    },
                                    "Description": {
                                        "val": "Calibrators (also called irradiators) are the basic tool used to calibrate all Navy radiological detection equipment.  Essentially they consist of a high energy radiological source (e.g., Cs-137) in a shielded container that is located in a specially constructed room, or \"range.\"  A technician places the instrument to be calibrated at a specific calibration point in the range and remotely operates the calibrator by raising the source out of its container so that it irradiates the object instrument.  The instrument's response to the radiation is measured so that it can be calibrated to specific tolerances.  The current suite of AN\/UDM-1B calibrators is over 20 years old and the natural decay of the strength of the radioactive source over time restricts calibration effectiveness by limiting the scale of calibration points below American National Standards Institute (ANSI) requirements that are followed in accordance with Navy policy.  Also due to the age of the calibrators, there are several parts no longer supported by the manufacturer, and a malfunctioning calibrator poses a very high safety risk.  COTS equipment will be surveyed to find the best solution with which to equip the Navy's seven RADIAC Calibration Laboratories with modern calibrators."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.063"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In addition to making site visits to NSWCCD, the RCSP visited Hopewell Designs, Inc. to gain a detailed engineering understanding of the GC-60 irradiator.  The information obtained during the site visits aided in determining the feasibility of the GC-60 as a suitable irradiator for RADIAC calibration purposes.  The RCSP submitted a technical memorandum detailing the work performed to date and recommended follow-on actions and\/or procurement options.\n\nThis project completed ahead of schedule in FY16 and the project moved into the acquisition phase."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tritium Monitor"
                                    },
                                    "Description": {
                                        "val": "The AN\/PDR-73 Tritium Monitor is used at nuclear weapons storage facilities and research laboratories to sample the air for the presence of Tritium.  The current instrument is 30 years old and cannot be repaired due to obsolete components.  At the current loss rate due to normal wear and tear there will be insufficient assets to meet operational requirements, so a replacement must be found."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.059"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Gathered end user feedback and worked with NAVSEA engineer staff to develop specification for procurement.  Submitted the specification to NAVSEA 04ND and Strategic Systems Program end user for concurrence.  \n\nThis project moved into the acquisition phase."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Particle Detector"
                                    },
                                    "Description": {
                                        "val": "The Surface Warfare Enterprise has requested an air sampling system be developed subsequent to the lessons learned from the Japanese Fukishima nuclear reactor accident.  U.S. Navy ships sailed unknowingly into plumes of radioactive material released from the damaged nuclear reactors.  The ships were widely contaminated and personnel were exposed to radioactive material.  The Air Particle Detector (APD) would continuously monitor for airborne radioactive contaminants and provide a real-time measurement at designated locations on the ship with appropriate alarm indications when safe exposure thresholds have been surpassed."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.069"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Based on the information obtained during the discussions with OPNAV and ship visits, NSWCCD formulated a preliminary air sampling system that meets the key performance parameters.  The preliminary plan, along with retrofitting information, was circulated to NAVSEA 04ND, OPNAV and end users for feedback.  \n\nUpon receipt of feedback, the project was determined to be unsuitable for further development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Academy Midshipman Summer Internship"
                                    },
                                    "Description": {
                                        "val": "Every summer a Midshipman is selected to conduct laboratory studies in support of the Naval Dosimetry System to research various responses and issues with thermoluminescent dosimetry.  Funds pay for materials and Midshipman's travel expenses to present his\/her findings to the annual Health Physics Society conference."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.015"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Accomplished study assigned by Naval Academy instructor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.015"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Accomplish study assigned by Naval Academy instructor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.015"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.015"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Accomplish study assigned by Naval Academy instructor."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Primary Dosimetry"
                                    },
                                    "Description": {
                                        "val": "The need for primary dosimetry is inherent due to the Navy's operation of nuclear reactors and their emission of ionizing radiation.  Title 10 of the Code of Federal Regulations, Part 20.1502, states \"Each licensee shall monitor exposures to radiation and radioactive material at levels sufficient to demonstrate compliance with the occupational dose limits.\"  A primary dosimeter must pass accreditation proficiency testing, allowing the reading obtained to become a part of an individual's permanent health record.  This permanent record is used to protect the individual radiation worker's health, and also the Navy from future liability.  The Navy's current primary device is the DT-702\/PD, a Thermo Luminescence Dosimeter (TLD).  Existing TLD and newer technologies, such as Optically Stimulated Luminescence (OSL), must be continually researched to determine on-going performance parameters, cost to field and cost to maintain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.164"
                                            },
                                            "Articles": {
                                                "val": "20"
                                            },
                                            "Text": {
                                                "val": "Acquired 10 Instadose II Dosimeters and Reader. The Instadose II is the newest version of the Direct Ion Storage (DIS) Dosimeter that has the capability of detecting shallow dose and deep dose from photon (possibly neutrons). Tested this system to the ANSI-N13.11 Standard. The Instadose II under went proficiency-type tests utilizing the sources located at NSWCCD. A Technical Memorandum was developed and provided as a deliverable."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.288"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "NSWCCD and the Naval Dosimetry Center (NDC) will complete the pilot study with Landauer dosimetry and submit a Technical Memorandum summarizing the results to SEA 04ND.  NSWCCD and NDC will then plan and conduct a repeat of the study using BeO dosimetry.  The BeO system will be proficiency tested to the ANSI-N13.11 Standard using radiation sources at NSWCCD, and a similar field evaluation will be conducted at one or more Navy medical facilities.  NSWCCD will submit a Test Plan to SEA 04ND for approval.  The Test Plan will cover not only all of the specification testing  but the dual badging studies as well.  Also, NSWCCD will submit a contract package for and procure a Freiberg Lexsyg research imaging TL-OSL-RF system for additional dosimeter material analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.092"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.092"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "NSWCCD and NDC will complete reporting on the pilot study with BeO dosimetry.  Additionally, NSWCCD will perform environmental testing, guided by the ANSI N13.11 requirements for normal environmental conditions, on both OSL systems. When all tests are complete, NSWCCD and NDC will submit a comprehensive Technical Report on both OSL systems to SEA 04ND.  NSWCCD will also remain up to date on advances of the BeO system and submit a contract package for the FY18 procurement of BeO neutron dosimeters. Finally, NSWCCD will utilize the Freiberg Lexsyg reserach imaging TL-OSL-RF system to characterize existing and future primary dosimeters' luminescent properties to ensure quality and check material weakness prior to adopting these systems into the US Navy.  Findings will be summarized in a Technical Memorandum to SEA 04ND."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Secondary Dosimetry"
                                    },
                                    "Description": {
                                        "val": "A secondary dosimeter provides an accurate, real-time readout of the radiation exposure being obtained in operational environments, and is utilized in conjunction with a primary dosimeter.  The primary dosimeter does not provide real-time exposure information, so the secondary dosimeter is worn for that purpose.  The Navy's secondary dosimeter is the Mk2 Electronic Personal Dosimeter (EPD).  Research is required to find a secondary dosimeter that can measure the type of radiation encountered with pulsed X-ray machines, and to see if this new capability can be incorporated into one device such as the existing Mk2."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.074"
                                            },
                                            "Articles": {
                                                "val": "18"
                                            },
                                            "Text": {
                                                "val": "Initiated and completed testing of extremity and lens secondary dosimetry.  Researched applications and end-users of this type of secondary dosimetry within the Navy.  Tested acquired dosimetry for dose accuracy, precision and energy dependence.  Analyzed applicability to Navy operations and the potential to militarize this type of dosimetry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.219"
                                            },
                                            "Articles": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "NSWCCD will submit a Test Plan to Naval Sea Systems Command (NAVSEA 04ND) for evaluation of the extremity secondary dosimetry units, with focus on dose accuracy, precision and energy dependence, in accordance with the American National Standards Institute (ANSI) N13.32 standard.  NSWCCD will report on the test results through a Technical Memorandum to NAVSEA 04ND. NSWCCD will also utilize a 3D scanner to evaluate, model and build, using additive manufacturing, components of active dosimeters to meet fleet requirements. The scanner will also be used to develop and deploy a mock-up of the Electronic Personal Dosimeter (EPD-Mk2) to serve as a caddy for the battlefield dosimeter during exposures in the EPD neutron irradiator.  Neutron exposures will be a part of acceptance testing quality control.  NSWCCD will prepare and submit a contract package to purchase additional extremity dosimetry articles, as well as commercial criticality dosimeters for test and evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.125"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.125"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NSWCCD will continue analyzing Navy user feedback and desired specifications on current pulsed X-ray and electronic dosimetry.  Additional market research and testing will be performed as appropriate.  NSWCCD will continue analyzing Navy requirements and desired specifications for extremity\/lens dosimetry.  Testing for the FY17 purchase of extremity dosimetry  and criticality dosimetry units will be performed.  NSWCCD will submit a Test Plan to SEA 04ND for approval.  Additional market research and testing may be performed as appropriate.  NSWCCD will submit a Technical Memorandum to SEA 04ND updating commercial capabilities and evaluations with respect to Navy requirements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radiological Detection System"
                                    },
                                    "Description": {
                                        "val": "The Radiological Detection System (RDS) is a survey meter, its associated probes for detecting the various types of radiation, and ancillary equipment.  This type of survey meter system has many applications and is the single most prevalent RADIAC instrument in the Navy inventory, utilized for every Navy end use but predominantly in the Naval Nuclear Propulsion Program (NNPP) and Radiological Defense (RD) end uses. The Joint Program Executive Office for Chemical, Biological and Nuclear Defense (JPEO-CBND) is currently developing an RDS for use by all the Services.  If all the Services could agree on a single system, it would lower the procurement cost for all the Services, and even more importantly enable Joint interoperability in the warfighter Radiological Defense arena, a capability that is currently lacking.  However, the NNPP end use is unique amongst the Services, and while the RDS solution should prove to be sufficient for all the Services for most end uses, Navy must ensure the performance and specifications of a Joint solution would be sufficient for Naval Reactors and the NNPP application."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.119"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued evaluating the RDS for Navy end uses.  Additional product demonstrations were provided as needed.  Potential fielding strategies were investigated for Radiological Affairs Support Office (RASO) and Radiological Defense (RD) end users.  Additional research was performed in assessing the RDS capability in meeting NNPP requirements.  Site visits to the Corporate Radiation Health Branch at the Norfolk Naval Shipyard were conducted to aid in the NNPP assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NSWCCD will continue coordinating with JPEO-CBND in RDS related activities to represent Navy interests.  NSWCCD will stay up to date on the JPEO-CBND  acquisition status and relay information to NAVSEA 04ND as appropriate."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.140"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.140"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NSWCCD will continue coordinating with JPEO-CBND in RDS related activities.  NSWCCD will stay up to date on the JPEO acquisition status and relay information to NAVSEA 04ND as appropriate.  NSWCCD may assist with product sample testing, if required.  Potential fielding strategies will be investigated for some Navy end users."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radiological Shipboard Defense Monitor"
                                    },
                                    "Description": {
                                        "val": "All surface combatants require an instrument to detect and measure radiological activity in the event of a nuclear detonation in order for the ship to avoid the radiological danger and continue its mission.   The AN\/PDR-65, at over 40 years of age, was the instrument used for this purpose, but it is obsolete and has been de-fielded.  An interim replacement has been fielded while OPNAV finalizes updating the Cold War requirements under which the AN\/PDR-65 was designed in order to include radiological (terrorist \"dirty bomb\") threats.  The interim replacement is the IM-265 Survey Meter, which is already in the Navy inventory, but was not designed for this requirement and cannot measure radiation external to the ship and is therefore not suitable as the permanent replacement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.069"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Based on the information obtained during the discussions with OPNAV and ship visits, NSWCCD formulated a preliminary system that meets the key requirements.  The preliminary plan was circulated to NAVSEA 04ND, OPNAV and end users for feedback.  A technical specification and implementation plan was developed based on comments on the preliminary system.  Market research was performed as requirements were provided by OPNAV and end users."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.080"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NSWCCD will assist in documenting the RSDM requirement.  Market research will be continuously performed as requirements are provided by OPNAV and end users.  NSWCCD, with NAVSEA 04ND, will initiate discussions with OPNAV to determine the necessary detection capabilities, types of radiation to be detected, locations to be monitored and shipboard networking capabilities.  NSWCCD, in conjunction with OPNAV, may coordinate and conduct two FY17 ship visits to witness the existing infrastructure and obtain end-user input on installing a new system.  Additionally, NSWCCD will perform ongoing market research based on updated requirements from OPNAV and end users.  NSWCCD will submit a Technical Memorandum (TM) to the Program Office, summarizing current commercial technical capabilities in relation to end user requirements and limitations.  The TM will be coupled with a letter to SEA 04ND, recommending next actions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.076"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.076"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NSWCCD will continue to assist in documenting the RSDM requirement.  Based on the information obtained during the discussions with OPNAV and ship visits, NSWCCD will formulate a preliminary system that meets the key requirements and features.  The preliminary plan will be circulated to SEA 04ND, OPNAV and end users for feedback.  Additional ship visits may be necessary to clarify aspects of the preliminary system.  A technical specification and implementation plan will be developed based on comments on the preliminary system.  NSWCCD will compile all technical requirements, limitations and end-user feedback to date.  NSWCCD will then solicit updated feedback from OPNAV and end-users regarding the planned RSDM."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visit, Board, Search & Seizure"
                                    },
                                    "Description": {
                                        "val": "The Visit, Board, Search & Seizure (VBSS) mission of the Navy includes the requirement to be able to board ships and be able to detect and identify potential radiological or nuclear Weapons of Mass Destruction (WMD).  Such a sensitive mission requires leading edge technology and capabilities to ensure success.  The AN\/PDX-1 RADIAC Set was fielded in response to a Joint Urgent Operational Needs Statement to meet this requirement.  It contains three instruments that serve different purposes:  (1) a Handheld Radiation Monitor (HRM)that searches for radiological materials; (2) a Radioisotope Identifier (RID) that identifies the type of radiological material located; and (3) a Personal Radiation Detector (PRD) that displays the radiological dose the VBSS team members may be receiving to ensure they are not being exposed to dangerous levels of radioactivity.  Current technology dictates that the sensitivity of the detectors is directly proportional to the size of the detector element; i.e., the larger the detector, the more sensitive and capable it is.  However, in VBSS there must be a tradeoff between size\/weight and capability, since it is difficult and hazardous for boarding parties to carry a backpack-sized detector, along with their weapons and other gear, up a rope ladder to board a vessel on the high seas.  This will be a continuing effort to find smaller, lighter instruments with enhanced sensitivity, reach-back capability, and other enhancements to provide the Navy the best and most cost effective equipment possible for this critical mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.077"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued testing of previously purchased units.  Continued market research on evolving technology applicable to VBSS, particularly in radioisotope identification.  Developed a Technical Report on the latest VBSS technology based on the results from testing and evaluation to keep the Navy abreast of technological evolution in this area."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NSWCCD, in conjunction with the RADIAC In Service Engineering Agent, will complete a survey of end-users of the AN\/PDX-1 Set regarding the status of the Set components.  NSWCCD will compile feedback on any existing or foreseen technical issues, including life cycle data, with these components.  This information will be used to begin market research into updated commercial capabilities and to develop a Test Plan.  NSWCCD will use all information collected to develop a specification for purchasing commercial PRDs and HRMs suitable for VBSS applications, for test and evaluation.  A procurement package will be prepared for FY18 solicitation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.112"
                                            },
                                            "Articles": {
                                                "val": "6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.112"
                                            },
                                            "Articles": {
                                                "val": "6"
                                            },
                                            "Text": {
                                                "val": "NSWCCD will purchase new PRDs and HRMs for test and evaluation.  The Test Plan developed in FY17 will be finalized and submitted to SEA 04ND, so that evaluation of new units can begin upon delivery.  NSWCCD will complete test and evaluation of the commercial units, summarize the results and submit the findings in a Technical Report to SEA 04ND.  Simultaneously, NSWCCD will internally review all VBSS RID Technical Report data to date, so as to analyze development of the technology over time.  Recurring issues and other trends will be noted in order to create a more detailed plan for the next round of test and evaluation.  Additional test data from other sources, such as the Defense Threat Reduction Agency (DTRA), will be researched to aid in developing the next Test Plan.  NSWCCD will also perform market research into new commercial RID products and capabilities by surveying industry and other technical contacts.  NSWCCD will then develop a specification for the next purchase of RIDs and prepare a procurement package for FY19 solicitation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Telescoping Rate Meter"
                                    },
                                    "Description": {
                                        "val": "Telescoping rate meters play a vital role in the practice of radiation safety in the Naval Nuclear Propulsion Program. The detector is attached to the end of an extendable, telescoping pole, thus allowing the operator to maintain a safe distance from high exposure areas. This allows the Navy to comply with federal regulations, which mandate that radioactive doses received by operators are As Low As Reasonably Achievable (ALARA).  The current instrument is 30 years old and approaching obsolescence due to the unavailability of repair parts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.185"
                                            },
                                            "Articles": {
                                                "val": "9"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.185"
                                            },
                                            "Articles": {
                                                "val": "9"
                                            },
                                            "Text": {
                                                "val": "NSWCCD will perform market research into commercial versions of this instrument as used in commercial nuclear power applications.  Published specifications wil be compared against the performance of the Navy's current IM-260.  End-user feedback regarding desired performance will be collected.  NSWCCD will prepare and submit a contract package for the procurement of several telescoping rate meters  units for evaluation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN 2920"
                                    },
                                    "Title": {
                                        "val": "RADIAC"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.294"
                                        },
                                        "CurrentYear": {
                                            "val": "9.558"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.177"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.177"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Development efforts are focused on evaluation, modification (as required to meet operational requirements) and adaptation of commercial-off-the-shelf (COTS) technology in order to minimize total ownership costs.  To the maximum extent possible new contracts are targeted for fixed price efforts to control development cost."
                        },
                        "PerformanceMetrics": {
                            "val": "Program Reviews"
                        }
                    }
                }
            ]
        }
    }
}