{
    "id": "2018-DefenseInformationSystemsAgency-PB-0400-MJBOOK-0-2-098212f3abb250f23e5fa42591c94c4328a6a93ca6a251dc354a1358630db0b8-19",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "1203610K"
        },
        "ProgramElementTitle": {
            "val": "Teleport Program"
        },
        "R1LineNumber": {
            "val": "261"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.642"
            },
            "BudgetYearOneBase": {
                "val": "0.642"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "2.334"
            },
            "BudgetYearThree": {
                "val": "2.333"
            },
            "BudgetYearFour": {
                "val": "2.403"
            },
            "BudgetYearFive": {
                "val": "2.445"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Department of Defense (DoD) Teleport system is a satellite communications (SATCOM) gateway that links the deployed warfighter to the Global Information Grid.  The DoD Teleport program has fielded system capabilities incrementally using a multi-generational approach with Generation 1 and 2 Full Deployment authorized by DoD Chief Information Officer on February 18, 2011. DoD Teleport Generation 3 consists of three phases; Phases 1 and 2 are in Production and Deployment while Phase 3 is in Engineering and Manufacturing Development. Each DoD Teleport investment increases the warfighter’s ability to communicate with a world-wide, net-centric set of information capabilities, which is vital for the DoD to maintain a persistent presence among its adversaries.\n\nCurrently, the Teleport system operates as an upgrade of SATCOM capabilities at selected DoD SATCOM gateways. This system provides deployed warfighters with seamless worldwide multi-band SATCOM connectivity to the Defense Information System Network (DISN) Service Delivery Nodes and legacy tactical command, control, communications, computers, and intelligence systems. It also provides centralized integration capabilities, contingency capacity, and common interfaces to access the DISN.\n\nDoD Teleport's goal is to provide secure, seamless, interoperable, and economical upgrades to DoD SATCOM Gateways and meet the growing throughput requirements of the deployed warfighter.\n\nThe primary beneficiaries of the DoD Teleport investment are the DoD Combatant Commanders, Military Departments, Defense Agencies, and the warfighter. DoD Teleport Generation 3 is designed to meet the growing demands of the warfighter through the execution of the following phases:\n\nPhase 1: Gateway Advanced Extremely High Frequency [Extended Data Rate] terminals provides tactical users with a 350% bandwidth increase in survivable, antijam communications through all peacetime and combat operations by installing Navy Multiband Terminals (NMT) at select Teleport sites. In addition to enhanced throughput, the NMT maintains compatibility with legacy waveforms and current tactical terminals.\n\nPhase 2: Gateway Wideband Global SATCOM X\/Ka-band terminals provide enhanced Wideband Global System (WGS) X\/Ka capability to warfighters worldwide by installing terminals from the Modernization of Enterprise Terminal (MET) program at DoD Teleport and other gateway sites. This gateway enhancement allows Teleport to replace end-of-life Defense Satellite Communications System (DSCS) terminals while remaining interoperable with tactical WGS X\/Ka-band users. The MET enhancement provides a 300% Ka-band capacity increase and an 1100% X-band capacity increase to current enterprise terminal X\/Ka capabilities. Additionally, it enables the DoD Teleport system to maintain operational availability consistent with Generation 2 requirements and reduce the overall life-cycle cost of X\/Ka capabilities across the DoD.\n\nPhase 3: Mobile User Objective System (MUOS) to Legacy Ultra High Frequency (UHF) systems interoperability will provide interoperability between MUOS users and legacy UHF users by installing MUOS-to-Legacy UHF SATCOM Gateway Component (MLGC) suites of equipment at DoD Teleport sites. MUOS is the next generation DoD UHF SATCOM system that will provide the warfighter with modern worldwide mobile communication services, utilizing the Wideband Code Division Multiple Access waveform for use in the military UHF SATCOM band. MLGC suites will provide critical continuity and interoperability as DoD tactical satellite users transition from legacy waveforms and radios to the Joint Tactical Radio System."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.708"
                },
                "BudgetYearOneBase": {
                    "val": "0.708"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.642"
                },
                "BudgetYearOneBase": {
                    "val": "0.642"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.066"
                },
                "BudgetYearOneBase": {
                    "val": "-0.066"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.066"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.066"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease of -$0.066 in FY 2018 is due to a reduction in testing requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "NS01"
                    },
                    "ProjectTitle": {
                        "val": "Teleport Generation 1\/2"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.642"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.642"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.334"
                        },
                        "BudgetYearThree": {
                            "val": "2.333"
                        },
                        "BudgetYearFour": {
                            "val": "2.403"
                        },
                        "BudgetYearFive": {
                            "val": "2.445"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Teleport program will implement an integrated test approach that will combine the objectives from multiple testing disciplines (e.g., developmental test, operational test, interoperability, and information assurance) throughout the testing lifecycle to support needed system evaluations. The Teleport program executes its own test events to achieve this integrated approach, but will partner with each phase’s respective program office generated test activities to leverage the data needed to satisfy Teleport program test objectives. An approach summary for Teleport Gen 1\/2 follows:\n\nGeneration 1\/2 Technology Refresh\/Technology Insertion: Funding will be used to maintain the Joint Interoperability Certification of the DoD Teleport System as the system is upgraded and refreshed with new components."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Teleport Program"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.642"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.642"
                                            },
                                            "Text": {
                                                "val": "Funding will be used to support the Joint Interoperability Certification of the DoD Teleport System.\n\nThe increase of $0.642 from FY 2017 to FY 2018 is attributed to the funding be moved from program element 0303610K for Teleport."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M, DW\/PE0303610K"
                                    },
                                    "Title": {
                                        "val": "O&M, DW"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.498"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.498"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.828"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.846"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.913"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.986"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Procurement, DW\/PE0303610K"
                                    },
                                    "Title": {
                                        "val": "Procurement, DW"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.927"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.927"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.387"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.582"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.012"
                                        },
                                        "BudgetYearFive": {
                                            "val": "22.408"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Teleport Program Office (TPO) uses the DoD preferred evolutionary acquisition approach to acquire Commercial off the Shelf (COTS) and modified COTS equipment when possible. The three TPO procuring agencies, Program Manager Defense Communications and Army Transmission Systems, the Space and Naval Warfare Systems Command, and Defense Information Technology Contracting Organization (DITCO) provide direct contracting support. Assistance from other Departments including Army, Navy, and Air Force is acquired via Military Interdepartmental Purchase Request for both organic and contracted support. The TPO maximizes the use of performance-based contracts and requires contractors to establish and manage specific earned value data to mitigate risk and monitor deviations from cost, schedule, and performance objectives. Performance is evaluated thorough post-award contract reviews, performance assessment during quarterly program reviews. The MLGC program will use various contract types to employ the vendor best suited to deliver the program’s capabilities to the warfighter."
                        },
                        "PerformanceMetrics": {
                            "val": "Teleport Cost and Schedule Performance Metrics:\n\nTeleport manages and tracks its cost and schedule performance parameters using a tailored Earned Value Management System (EVMS) process, integrating the program plan, the program schedule, Work Breakdown Structure (WBS), and financial data. Progress is monitored\/documented monthly showing percentages complete for schedule and cost. Formal updates with changes to the schedule are documented against the program baseline.\n\nTeleport Program Metrics:\n\nRDT&E funds will be used to maintain an interoperability certification of the fielded DoD Teleport system in light of required\/desired system changes. These changes are certified in standalone test events or as part of DoD Interoperability Communications Exercises (DICE). Percentage will be computed by dividing the number of changes under test by the number deemed DoD Interoperable.\n\nPerformance metrics have been established in four measurement areas: 1) customer results, 2) mission and business results, 3) processes and activities, and 4) technology. Specific measurement indicators and units of measure vary by measurement area, and metrics in each of the aforementioned areas are measured annually. Teleport will use the same measurement areas for performance metrics in FY 2016, FY 2017 and FY 2018.\n\nGeneration 1\/2 Metric:\n\nPercentage of system changes resulting in interoperability certification\n\nFY 2016 Actual: 100%\nFY 2017 Target: 100%\nFY 2018 Target: 100%"
                        }
                    }
                }
            ]
        }
    }
}