{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-6",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602251D8Z"
        },
        "ProgramElementTitle": {
            "val": "Applied Research for the Advancement of S&T Priorities"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "46.750"
            },
            "CurrentYear": {
                "val": "42.206"
            },
            "BudgetYearOne": {
                "val": "49.226"
            },
            "BudgetYearOneBase": {
                "val": "49.226"
            },
            "BudgetYearTwo": {
                "val": "53.060"
            },
            "BudgetYearThree": {
                "val": "53.662"
            },
            "BudgetYearFour": {
                "val": "54.770"
            },
            "BudgetYearFive": {
                "val": "55.895"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Applied Research for the Advancement of Science and Technology (S&T) Priorities program element (PE) enables the early launch of S&T applied research projects to shape Components' investments.  The PE focuses on the design, development, and improvement of prototypes and new processes to achieve general mission requirements and to decipher promising research solutions for military needs.  Additionally, this PE enables concept exploration efforts and studies of alternative concepts.  The research projects are part of the Department of Defense (DoD) S&T priorities and designated focus areas that will include non-system specific technology efforts and feasibility assessments and are formulated and managed by teams of subject matter experts drawn from the Office of the Secretary of Defense, the Military Services, and the Defense Agencies.  The PE also provides support to the S&T Communities of Interest (CoI)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "48.131"
                },
                "CurrentYear": {
                    "val": "42.206"
                },
                "BudgetYearOne": {
                    "val": "49.271"
                },
                "BudgetYearOneBase": {
                    "val": "49.271"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "46.750"
                },
                "CurrentYear": {
                    "val": "42.206"
                },
                "BudgetYearOne": {
                    "val": "49.226"
                },
                "BudgetYearOneBase": {
                    "val": "49.226"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.381"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.045"
                },
                "BudgetYearOneBase": {
                    "val": "-0.045"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.381"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.045"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.045"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P227"
                    },
                    "ProjectTitle": {
                        "val": "Applied Research for the Advancement of S&T Priorities"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "46.750"
                        },
                        "CurrentYear": {
                            "val": "42.206"
                        },
                        "BudgetYearOne": {
                            "val": "49.226"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.226"
                        },
                        "BudgetYearTwo": {
                            "val": "53.060"
                        },
                        "BudgetYearThree": {
                            "val": "53.662"
                        },
                        "BudgetYearFour": {
                            "val": "54.770"
                        },
                        "BudgetYearFive": {
                            "val": "55.895"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Applied Research for the Advancement of Science and Technology (S&T) Priorities program element (PE) enables the early launch of S&T applied research projects to shape Components' investments.  The PE is oriented toward the design, development, and improvement of prototypes and new processes to meet general mission area requirements and to translate promising research into solutions for military needs.  Efforts are situated within the DoD S&T priorities and focus areas and will include feasibility evaluations and non-system specific technology efforts.  Investigations conducted in this PE facilitate concept exploration efforts and studies of alternative concepts.  Efforts are formulated and managed by teams of subject matter experts drawn from the Office of the Secretary of Defense, the Military Services, and the Defense Agencies.  The PE also provides support to the S&T Communities of Interest (CoI)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Research for the Advancement of S&T Priorities"
                                    },
                                    "Description": {
                                        "val": "The Applied Research for the Advancement of S&T Priorities PE focuses on fostering Joint-Service research areas of common elements of cross-cutting S&T efforts.  This enables the early launch of applied research projects to shape Components' investments and facilitates concept exploration efforts and studies of alternative concepts.  The cross-cutting S&T efforts include the DoD S&T Priorities, such as Electronic Warfare, Human Systems, Autonomy, and Cyber, as well other focus areas, such as Advanced Materials, Biomedical, Weapons, Quantum, and Command, Control, Communications, Computers and Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.831"
                                            },
                                            "Text": {
                                                "val": "Continued concept exploration efforts that focus on the S&T priority areas.  The accomplishments include:\n\nAutonomy ($15.500 million):\n–\tEnabling superior tactical-level cooperation between warfighters and machines\n–\tTranslating military goals into specific plans for using human and machine assets\n–\tScaling how information is handled to ensure fast, accurate top-level decisions\n–\tScaling to manage very large numbers of assets, without overloading humans\n–\tComplex planning and re-planning of human and machine assets under duress\n–\tRapid insertion of support capabilities into disaster areas\n–\tRapid recovery of basic infrastructure in disaster areas\n–\tIncreasing robustness to enable broader use of autonomy\n\nQuantum Science and Engineering Program (QSEP) ($13.300 million):\n−\tEstablished solid state lab for studying entanglement and optical control of spins in Silicon Carbide (SiC)-based quantum bits and memories\n−\tEstablished ion trap clean room facility and bake-out station for ultra-high vacuum preparation and ion trap installation; established basic trapped-ion lab infrastructure \n−\tDeveloped fiber-based entanglement distribution testbed and characterized entanglement swapping\n−\tIntegrated single quantum dots (QDs) into mechanical resonators; measured the sensitivity of optical and spin transitions to motion-induced strain, finding the hole spin to have a higher sensitivity than electron spins\n−\tProduced optical lattice in an atomic cloud\n−\tCompleted initial test for Aluminum Nitride (AlN) devices and demonstrated high power handling in infrared\n\nSynthetic Biology for Military Environments (SBME) ($1.000 million):\n−\tLaunched a tri-Service effort to expand and integrate existing capabilities in synthetic biology\n−\tOutlined plans for building a comprehensive DoD pipeline wherein synthetic biology-based innovation can be supported from conception to testing in a relevant environment; targeted capabilities include gene network modeling and simulation, genome editing, and circuit optimization and characterization"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.000"
                                            },
                                            "Text": {
                                                "val": "Continue concept exploration efforts that focus on the S&T priority areas.  The challenge areas within the priorities include:\n\nQuantum Science and Engineering Program (QSEP) ($15.000 million):\n−\tPlan to entangle  electron and nuclear spin ensembles and setup Silicon Carbide chemical vapor deposition reactor to grow low-strain, high purity samples for use as quantum memories\n−\tPlan to demo e-beam pumped lasing in Ultraviolet (UV) for Vertical External Cavity Surface Emitting Laser (VECSEL) structure\n−\tPlan to finalize cavity design with integrated thermal management \n−\tPlan to fabricate photonic cavities with integrated defect qubits; measure the spin and optical properties, including enhancement of photon emission\n−\tPlan to measure memory time, readout efficiency, and second order correlation in optical lattice\n−\tEstablish trapped ion capability and prepare ultra-high vacuum chambers for quantum node tests; trap ions in two independent ultra-high vacuum chamber for remote entanglement demo \n−\tOptimize Aluminum Nitride devices for singlemode operation; design\/simulate experiment for out-coupling of Ytterbium (Yb) ion\n−\tConduct Initial quantum frequency conversion (QFC) experiments; demonstrate initial coupling; conduct loss measurements\/characterization\/testing \n\nSynthetic Biology for Military Environments (SBME) ($14.000 million):\n-       Continue efforts to establish a biological open system architecture and “chassis” relevant to military environments and to create a cell-free system for gene network optimization \n-       Plan to develop Genetic manipulation tools for the nine chassis candidates, and the Genetic parts will be identified computationally and validated experimentally; the final selections will be made using potential applications and the maturity of genetic and characterization tools\n\nInitiation of new Applied Research for the Advancement of S&T Priority Project ($1.000 million)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.000"
                                            },
                                            "Text": {
                                                "val": "Continue concept exploration efforts that focus on the S&T priority areas.  The challenge areas within the priorities include:\n\nQuantum Science and Engineering Program (QSEP) ($15.000 million):\n−\tDemonstrate spin-photon entanglement and grow isotopically purified Silicon Carbide quantum memories with enhanced performance\n−\tDemonstrate breadboard UV VECSEL laser and entanglement teleportation over telecom fiber \n−\tContinue efforts on scalable, integrated quantum memory nodes with emphasis on photons at telecom wavelengths; demonstrate quantum repeater with four memory system\n−\tImprove quantum dots material properties to enhance indistinguishably of photons; improve sensitivity using a system of coupled quantum dots for enhanced strain coupling\n−\tPlan to analyze ion-photon interface to swap entanglement for long-distance communication; demonstrate remote entanglement \n−\tConduct experiment for out-coupling\n−\tConduct single and dual stage quantum frequency conversion; conduct quantum frequency conversion experiments for photon-based entangled state creation and manipulation \n\nSynthetic Biology for Military Environments (SBME) ($15.000 million):\n−\tContinue efforts to establish a biological open system architecture and “chassis” relevant to military environments and to create a cell-free system for gene network optimization \n−\tDevelop transcriptomic, proteomic and metabolomic tools; the tools will be applied to identify chassis network architectures, measure compensatory changes, and determine circuit yields\n−\tDesign complex circuit, and initiate the synthesis, incorporation, and testing of the circuit\n−\tInitiate the validation and optimization of the circuits in both cell-based and cell-free platforms\n−\tExplore ruggedization of the cell-free platform to improve stability for storage and field use\n−\tContinue iterations of in silico predictions, test bed optimization and in vivo validation; these testing scenarios will be used to establish “calibration transfer” between systems\n−\tComplete baseline measurements of the simple circuits in chassis organisms and extend the circuit designs to produce modulating output\n\nContinuation of FY 2017 Applied Research for the Advancement of S&T Priority Project ($12.000 million)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "S&T Communities of Interest"
                                    },
                                    "Description": {
                                        "val": "The S&T Communities of Interest effort facilitates cooperation and collaboration among Components; it optimizes the development of critical S&T efforts across the DoD enterprise.  The efforts include the development of technology roadmaps and the integration of technology planning.  The Communities of Interest select\/examine critical technology areas to address gaps or opportunities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.919"
                                            },
                                            "Text": {
                                                "val": "Continued to provide technical support to the Communities of Interest.  Concluded projects initiated in FY 2015, and initiated a new set of projects to address gaps identified by the Communities of Interest.\n\nThe completed projects include:\n–\tAdaptive Technologies for Language Training\n–\tFoundations for Context-Aware Info Retrieval for Proactive Decision Support\n–\tBiomarkers & Acute Radiation Sickness\n–\tDoD-wide Cloud-Based Collaborative Silicon Microelectronics Design\n–\tHypersonic Flight Experiments\n–\tSmoke Screen in Cyberspace\n–\tUnmanned Air Vehicle Countermeasures (SQUAD)\n\nThe new projects include: \n−\tDevelopment of a Prototype Cryogenic Optical Interconnect Demonstrator\n−\tElectromagnetic Battle Management in Heterogonous Disconnected Electromagnetic Environment\n−\tJoint-Service Universal Materials Data Fusion and Visualization Structures"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.206"
                                            },
                                            "Text": {
                                                "val": "Continued to provide technical support to the Communities of Interest.  Conclude projects initiated in FY 2016, and select a new set of projects to address gaps identified by the Communities of Interest.\n\nThe completed projects include:\n−\tDevelopment of a Prototype Cryogenic Optical Interconnect Demonstrator\n−\tElectromagnetic Battle Management in Heterogonous Disconnected Electromagnetic Environment\n−\tJoint-Service Universal Materials Data Fusion and Visualization Structures\n\nThe Communities of Interest will select a set of new two-year projects in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.226"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.226"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical support to Communities of Interest.  Conclude projects initiated in FY 2017, and select a new set of projects to address gaps identified by the Communities of Interest."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance metrics specific to each effort are identified in the project plans established by the program leads and the Communities of Interest.  Individual project success will be monitored through these metrics."
                        }
                    }
                }
            ]
        }
    }
}