{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c43fbf6cbb750060d4e843075183a8e999b0dddb3a2f8fae77d834880adb92d8-8",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602751D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI) Applied Research"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.945"
            },
            "CurrentYear": {
                "val": "8.420"
            },
            "BudgetYearOne": {
                "val": "8.955"
            },
            "BudgetYearOneBase": {
                "val": "8.955"
            },
            "BudgetYearTwo": {
                "val": "9.365"
            },
            "BudgetYearThree": {
                "val": "9.664"
            },
            "BudgetYearFour": {
                "val": "9.558"
            },
            "BudgetYearFive": {
                "val": "9.762"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Software is a key to meeting the Department of Defense's (DoD) increasing demand for high-quality, affordable, and timely national defense systems.  With growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.  To assist the DoD in retaining a long-term differential advantage over potential adversaries, the Software Engineering Institute (SEI) Applied Research program element (PE) develops and evaluates the feasibility and practicality of software and computer science concepts, with the potential to improve future DoD systems.  The SEI’s program of work is coordinated across the DoD through Reliance 21, the overarching framework of the DoD’s Science & Technology (S&T) joint planning and coordination process.  This PE benefits every Community of Interest due to the ubiquitous nature of software, but particularly benefits: Command, Control, Communications, Computers, and Intelligence (C4I) which includes a computing and software sub-panel; Autonomy; Cyber; and Engineered Resilient Systems.  \n\nWork conducted under this PE will enable resilient mission assurance in heterogeneous and contested environments through the verification and validation of system performance and architecture. The program will also assist the DoD in retaining a long-term differential advantage in the areas of software-intensive systems and cybersecurity by enhancing assurance, exploiting automation, and understanding human-computer interaction."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.807"
                },
                "CurrentYear": {
                    "val": "8.420"
                },
                "BudgetYearOne": {
                    "val": "9.343"
                },
                "BudgetYearOneBase": {
                    "val": "9.343"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.945"
                },
                "CurrentYear": {
                    "val": "8.420"
                },
                "BudgetYearOne": {
                    "val": "8.955"
                },
                "BudgetYearOneBase": {
                    "val": "8.955"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.862"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.388"
                },
                "BudgetYearOneBase": {
                    "val": "-0.388"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.564"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.298"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.388"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.388"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P278"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI) Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.945"
                        },
                        "CurrentYear": {
                            "val": "8.420"
                        },
                        "BudgetYearOne": {
                            "val": "8.955"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.955"
                        },
                        "BudgetYearTwo": {
                            "val": "9.365"
                        },
                        "BudgetYearThree": {
                            "val": "9.664"
                        },
                        "BudgetYearFour": {
                            "val": "9.558"
                        },
                        "BudgetYearFive": {
                            "val": "9.762"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Software is a key to meeting the Department of Defense’s (DoD’s) increasing demand for high-quality, affordable, and timely national defense systems.  With growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.  To assist the DoD in retaining a long-term differential advantage over potential adversaries, the Software Engineering Institute (SEI) Applied Research PE seeks to establish a program of applied research that will develop and evaluate the feasibility and practicality of software and computer science concepts with the potential to improve current and future DoD systems. \n\nWork conducted under this PE will enable resilient mission assurance in heterogeneous and contested environments through the verification and validation of system performance and architecture.  The program will also assist the DoD in retaining a long-term differential advantage in the areas of software-intensive systems and cybersecurity by enhancing assurance, exploiting automation, and understanding human-computer interaction. \n\nThe SEI Applied Research PE has two main research thrusts with known military applications: 1) Software Engineering, Systems Verification and Validation, and Mission Assurance (formerly Mission Assurance) and 2) Information Assurance and Cyber Security."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SEI Applied Research in the Area of Software Engineering, Systems Verification and Validation, and Mission Assurance (formerly Mission Assurance)"
                                    },
                                    "Description": {
                                        "val": "This thrust seeks to develop verification techniques for requirements identification, systems of systems architectures, and virtual integration of components.  Additionally, research in this area will enable requirements verification for software assurance, analysis and control of unverified code, and automated repair of damaged code.  Software production and code analysis methods developed through this program will also improve the accuracy of behavior prediction of complex software system in untested environments.  Increasingly numerous lines of code will require a commensurate increase in sophistication of verification and validation mechanisms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.245"
                                            },
                                            "Text": {
                                                "val": "• Created techniques to assist analysts in determining anomalies and outliers in data analytics processing. These techniques are best applied to software system acquisition and tactical intelligence, surveillance, and reconnaissance (ISR).\n• Produced guidance, quantitative methods, and software tools for expressing requirements and assessing the performance, scalability, and security behavior of systems.\n• Researched, developed, and piloted techniques to enhance and assure acquisition-related aspects of software-reliant systems.  These efforts were focused on cost-effectiveness and lifecycle assurance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.557"
                                            },
                                            "Text": {
                                                "val": "• Develop tools and techniques to validate software’s operational reliability through cost-effective model checking.\n• Develop machine learning and static analysis tools and techniques to identify and characterize technical debt in software systems.  Additionally, develop documentation templates and software technical debt management methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.781"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.781"
                                            },
                                            "Text": {
                                                "val": "• Create tools for formal verification of time-sensitive behavior in safety-critical systems.\n• Develop early stage statistical model checking tools and techniques for to validate the reliability and robustness of safety-critical systems.\n• Create and prototype containment technology which allows software systems to continue to function when partially compromised."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEI Applied Research in the areas of Information Assurance (IA) and Cyber Security"
                                    },
                                    "Description": {
                                        "val": "Information assurance ensures the integrity of information and data produced by software.  Software developed from an unknown supply chain may include intentionally or unintentionally introduced vulnerabilities.  This thrust seeks to develop scalable automated methods to locate, understand, and mitigate the effects of these vulnerabilities.  Automated tools developed through this thrust will be used to discover vulnerabilities in system software (including binary only) and to generate proofs.  Additionally, they will be used to model and simulate operational environments to support software and cyber tactics, techniques, and procedures (TTP) testing. \n\nWarfighting in the cyber domain often operates at sub-second timescales and across multiple domains of authority.  Methods used to accomplish many tasks (e.g., malware analysis, coordinating multiple agents) demand large amounts of time, attention, and special skills and are not scalable.  This thrust seeks to develop and increase the use of automation to simplify the completion of these tasks.  Example activities include automation of moving target defenses, code artifact reverse engineering, analysis of network flows at enterprise scale, and development and assessment of workforce skills."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Text": {
                                                "val": "• Reviewed DoD information technology gaps and challenges as expressed by the RDA Task Force, Defense Science Board, and Cyber Strategy plans to restructure SEI’s mid- and long-term software and cyber R&D portfolio.\n• Studied and developed techniques and tools for automated detection and mitigation of cyber vulnerabilities in available source code.\n• Studied and developed techniques and tools for automated detection and reduction of cyber vulnerabilities in existing software artifacts where source code is available.\n• Enhanced the scalability and automation of cyber and software forensic analysis tools.\n• Developed methods and tools for repeatable and automated assessment of cyber workforce performance in DoD cyber training.\n• Work in this thrust area was transitioned to the Air Force and the Intelligence Community."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.863"
                                            },
                                            "Text": {
                                                "val": "• Create and transition new, scalable techniques, algorithms, and tools for understanding the behavior of programs in binary form, including malware and other software of unknown provenance. \n• Automate the security evaluation of network-facing applications without requiring source code. \n• Research and create tools and techniques for automatic detection and semi-automatic mitigation of potential security vulnerabilities introduced by configuration and software development errors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.174"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.174"
                                            },
                                            "Text": {
                                                "val": "• Develop and transition tools to increase resilience facing malicious intent to manipulate data or information.  This includes improvement in data analytics development and deployment, including scalability, data bias control and mitigation.\n• Research and create tools and techniques for automatic detection and semi-automatic mitigation of potential security vulnerabilities introduced by configuration and software development errors.  Includes developing design methodologies and tools that prevent vulnerabilities from being introduced into software systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 3, PE# 0603781D8Z"
                                    },
                                    "Title": {
                                        "val": "Software Engineering Institute (SEI)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.173"
                                        },
                                        "CurrentYear": {
                                            "val": "14.264"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.441"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.441"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.909"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.130"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.447"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The SEI Applied Research PE represents a pivot toward more fundamental research that enables the DoD to address longer-term challenges in software technology and engineering.  The SEI Applied Research PE bolsters the organic research at the SEI Federally Funded Research and Development Center (FFRDC), enables stronger collaborations between the SEI FFRDC and academia, attracts top researchers to the SEI, gives the DoD access to top experts in information science, and generally enhances the DoD’s ability to benefit from the military applications of research in software and computer science."
                        },
                        "PerformanceMetrics": {
                            "val": "• Transition of tools, methods, and practices for use in DoD technology development programs and programs of record.  \n• Transition of tools, methods, and practices to the Defense Industrial Base to support DoD technology development programs and programs of record.\n• Number of citations in peer reviewed journals and reports.\n• Number of external research collaborations and interactions with the broader software and computer science community."
                        }
                    }
                }
            ]
        }
    }
}