{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-36",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605013A"
        },
        "ProgramElementTitle": {
            "val": "Information Technology Development"
        },
        "R1LineNumber": {
            "val": "116"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "48.028"
            },
            "CurrentYear": {
                "val": "74.236"
            },
            "BudgetYearOne": {
                "val": "81.776"
            },
            "BudgetYearOneBase": {
                "val": "81.776"
            },
            "BudgetYearTwo": {
                "val": "116.915"
            },
            "BudgetYearThree": {
                "val": "99.026"
            },
            "BudgetYearFour": {
                "val": "79.008"
            },
            "BudgetYearFive": {
                "val": "74.120"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Army Safety Management Information System - Revised (ASMIS-R) funding was realigned from PE 0605013, Project T05 to PE 0605013, Project VR3 for greater transparency in FY 2018.\nALTESS (P&R Forms) funding was realigned from PE 0605013, Project 738 to PE 0605013, Project FE9 for greater transparency in FY2018."
        },
        "ProgramElementMissionDescription": {
            "val": "This program supports efforts to plan, design, develop, and test information technology solutions to fulfill the Army's Warfighter Support Mission and accommodate changing Army requirements while fulfilling future Army needs.  Provides for development and acquisition of Combat Service Support (CSS) and business information technology solutions to help arm, sustain, fix, move, train and man the force.  Completed development\/acquisition efforts will also enhance sustaining base functions and power projection capabilities and facilitate global messaging and electronic data interchange (EDI).  Ongoing development efforts support multiple functional areas including logistics, personnel, transportation, training, medical\/health protection, and the sustaining base."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.358"
                },
                "CurrentYear": {
                    "val": "74.236"
                },
                "BudgetYearOne": {
                    "val": "76.906"
                },
                "BudgetYearOneBase": {
                    "val": "76.906"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.028"
                },
                "CurrentYear": {
                    "val": "74.236"
                },
                "BudgetYearOne": {
                    "val": "81.776"
                },
                "BudgetYearOneBase": {
                    "val": "81.776"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-12.330"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.870"
                },
                "BudgetYearOneBase": {
                    "val": "4.870"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.331"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-9.999"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "1.272"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.272"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 3"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "3.598"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.598"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016 funding adjustment in the amount of (2.331) reflects transfer to SBIR\/STTR.  \nFY 2016 funding adjustment in the amount of (9.999) reflects Below Threshold Reprogramming in support of higher priority Army requirement.\n\nFY 2018 additional funding in the amount of $3.598 million supports Project VR3 ASMIS-R (REPORTIT) and additional $1.272 million supports increased Army priorities and inflation among all projects."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "099"
                    },
                    "ProjectTitle": {
                        "val": "Army Human Resource System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.603"
                        },
                        "CurrentYear": {
                            "val": "5.180"
                        },
                        "BudgetYearOne": {
                            "val": "16.607"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.607"
                        },
                        "BudgetYearTwo": {
                            "val": "4.050"
                        },
                        "BudgetYearThree": {
                            "val": "0.315"
                        },
                        "BudgetYearFour": {
                            "val": "1.321"
                        },
                        "BudgetYearFive": {
                            "val": "1.171"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 2018 Base funding in the amount 16.607 million in support of Army Human Resource Systems (AHRS) continues to provide the Warfighter with state of art standardized systems that assist the Combatant Commander sustain, train, equip, deploy and account for personnel in and out of Theater.  Systems include the emerging Commanders' Risk Reduction Dashboard, Deployed Theater Accountability System, Range Facility Maintenance Support System and the electronic Military Personnel System."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the Personnel Transformation - Enterprise Service Bus and GoArmyEd.\n - Personnel Transformation (PT) - Enterprise Service Bus (ESB) - The Army's Enterprise Service Bus (ESB) provides a data integration service in which data can be extracted from the legacy human resource systems and transferred to DIMHRS.  The ESB will be a middleware application which will  provide a single interface to and from DIMHRS from the Army Legacy Systems.  The ESB will provide the infrastructure for the integration of new and existing applications by allowing systems and applications to easily exchange information across different environments and platforms.  It will also form the information bridge between IPPS-A, the Army Legacy Systems, and external systems to create more streamlined systems in support of the military mission and personnel transformation goals. \n\n - GoArmyEd is an Army Continuing Education System (ACES) program that provides the virtual gateway for soldiers to request Tuition Assistance (TA) and Department of the Army (DA) civilians to request training funds online, anytime for classroom, distance learning, and online college courses.  GoArmyEd is a dynamic online portal that automates many of the paper-based processes historically conducted in-person at Army Education Centers.  GoArmyEd includes automated registration tools that enforce TA policies and procedures.  GoArmyEd is used by authorized users to pursue their post secondary educational goals: Army Education Counselors to provide educational guidance; CPMS and TMs to manage civilian training and Colleges to deliver degree and course offerings and to report user progress.\n\nModernization initiatives address continued improvements related to the integration of new users and decreasing reliance on the help desk. GoArmyEd is the Army's enterprise education solution. GoArmyEd has integrated the Reserve Component (USAR and National Guard) and the Department of the Army Civilians. In addition, GoArmyEd is working to add a new data warehouse for HQ data retrieval and user self help tools. Education benefits are paramount to recruiting and retention of quality Soldiers, Civilians and Families.\n\nFY 2018 Base funding in the amount 16.607 million in support of Army Human Resource Systems (AHRS) continues to provide the Warfighter with state of art standardized systems that assist the Combatant Commander sustain, train, equip, deploy and account for personnel in and out of Theater.  Systems include the emerging Commanders' Risk Reduction Dashboard, Deployed Theater Accountability System, Range Facility Maintenance Support System and the electronic Military Personnel System."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Human Resource System (AHRS)"
                                    },
                                    "Description": {
                                        "val": "Funding will support continued enhancement\/automation of the software functionality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.289"
                                            },
                                            "Text": {
                                                "val": "GoArmy Ed will add functionality, continue automation of manual business processes, and add a virtual self help tool."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.730"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.730"
                                            },
                                            "Text": {
                                                "val": "GoArmy Ed will add functionality, continue automation of manual business processes, and add a virtual self help tool, data hosting of GoArmy Ed at HRC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Commanders Risk Reduction Dashboard (CRRD)"
                                    },
                                    "Description": {
                                        "val": "Commanders Risk Reduction Dashboard will consolidate information from multiple Army databases and present to commanders a concise report about which soldiers in their units have been involved with at-risk behaviors, some of which may be associated with suicide, and when those instances occurred."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.676"
                                            },
                                            "Text": {
                                                "val": "Commanders Risk Reduction Dashboard will consolidate information from multiple Army databases and present to commanders a concise report about which soldiers in their units have been involved with at-risk behaviors, some of which may be associated with suicide, and when those instances occurred."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.320"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.320"
                                            },
                                            "Text": {
                                                "val": "During FY 2018 CRRD will complete development, conduct developmental testing, user experience experiments, system integration testing, performance testing, operational testing, interoperability certification testing, and cybersecurity testing and accreditation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "VACE"
                                    },
                                    "Description": {
                                        "val": "VACE"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.314"
                                            },
                                            "Text": {
                                                "val": "blank"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.504"
                                            },
                                            "Text": {
                                                "val": "VACE"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.557"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.557"
                                            },
                                            "Text": {
                                                "val": "Funding will initiate the modernization\/development and data hosting of Go Army Ed at Human Resources Command (HRC).  Obtain a flexible, real-time system that is adaptable and responsive to the Army’s financial assistance needs, i.e., TA Program, funding for civilian training and education, and SROTC Scholarship Program to replace\nthe current 16-year old GoArmyEd system.  The software and platforms upon which GoArmyEd was built in 2000, have been outmoded by present day software and platforms offering\nefficiency, agility, and configurability that should be used to update GoArmyEd.  These improvements will enable expeditious modifications to the system to accommodate changes in the operating environment that ensure the post-secondary education needs and professional development of all eligible Army personnel are met.  The Army needs a system that is flexible,\nresponsive to changes in policy, and requires fewer manual fixes than the current 16-year old GoArmyEd system provides."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "GCSS-A Inc 1"
                                    },
                                    "Title": {
                                        "val": "SSN W00800"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "143.262"
                                        },
                                        "CurrentYear": {
                                            "val": "152.965"
                                        },
                                        "BudgetYearOne": {
                                            "val": "30.637"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "30.637"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.394"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.316"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.069"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.025"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "GoArmyEd - The program manager makes extensive use of Integrated Product Teams (IPTs).  Sub-elements of the acquisition (engineering and design, logistics planning, testing, etc.) are intensively managed by integrated teams of government and contractor personnel.  Task performance is tracked against the Work Breakdown Structure (WBS) and resources allocated to each task are adjusted based on performance against the WBS.  GoArmyEd contractual efforts are acquired on a firm fixed price basis on existing contractual vehicles."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Acquisition Contract Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rock Island, Il"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.519"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.519"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "AHRS Software Development contract for CRRD FY17 is TBD; estimated value is $4.900 million, contract method is Firm Fixed Price (FFP). Commanders Risk Reduction Dashboard will consolidate information from multiple Army databases and present to commanders a concise report about which soldiers in their units have been involved with at-risk behaviors, some of which may be associated with suicide, and when those instances occurred."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AHRS - ECPs\/SCPs\/ICPs"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Hewlitt Packard"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "89.251"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "89.251"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AHRS - Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Hewlitt Packard"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "51.723"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "51.723"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GoArmyEd"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "IBM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.959"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.289"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.504"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CRRD"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO EIS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT Belvoir VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.314"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.676"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "16.607"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "16.607"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "22.597"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-74.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "GoArmyEd Support\/Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Commanders Risk Reduction Dashboard (CRRD) Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Commanders Risk Reduction Dashboard (CRRD) Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "184"
                    },
                    "ProjectTitle": {
                        "val": "Installation Support Modules"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.871"
                        },
                        "CurrentYear": {
                            "val": "1.254"
                        },
                        "BudgetYearOne": {
                            "val": "1.520"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.520"
                        },
                        "BudgetYearTwo": {
                            "val": "1.521"
                        },
                        "BudgetYearThree": {
                            "val": "1.520"
                        },
                        "BudgetYearFour": {
                            "val": "1.428"
                        },
                        "BudgetYearFive": {
                            "val": "1.293"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 2018 Base funding in the amount of 1.520 million will continue to facilitate Coalition Force interoperability research and development Coalition Warfighter Interoperability Demonstration (CWID) and will continue development of the Army Behavioral Health Integrated Data Environment (ABHIDE) system."
                        },
                        "ProjectMissionDescription": {
                            "val": "Installation Support Modules (ISM) consists of four standardized, web based, custom-developed enterprise wide applications that integrate essential installation business practices and processes throughout the Army, to meet Army Force Generation (ARFORGEN) Brigade Combat Team readiness and deployment requirements.  Three modules support human resources business functions (In\/Out-Processing, Transition Processing, and Personnel Locator); the fourth module, Central Issue Facility (CIF) supports management of over $9 billion combatant Organizational Clothing and Individual Equipment inventory.  The web server architecture is fully internet protocol capable and allows soldiers ready access to their records and commanders and logisticians access to information affecting readiness of combat organizations. \n  \nCoalition Warfighter Interoperability Demonstration (CWID) is a mandated Joint program that requires participation by the US Army to explore near-term technologies that support Joint and Coalition Warfare Interoperability.  Funding is to facilitate Coalition Force interoperability research and development and to comply with CJCSI 6230.2 date 30 April 05.  \n\nArmy Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry.  Data relating to suicides and suicide attempts are collected and stored in disparate, non-related databases that cross the domains of medical, personnel and law enforcement.   ABHIDE will provide the capability of integrating the non-related and dispersed data from the separate sources into a single comprehensive database to support both retrospective and predictive analysis.  The information obtained will be used to conduct epidemiological surveillance, identify trends in behavior patterns and identify potential indicators for suicidal tendencies supporting the mitigation of future suicide attempts across all phases of Army service.\n\nISM Core funding is essential for supporting demands to research and develop improved systems to provide for soldier safety and inventory reduction without risking readiness. Funding supports research and development to comply with Department of Defense Instruction 8320.4 Serialized Item Management.  Applications to use commercial off the shelf wireless bar code equipment to ensure inventory accuracy throughout 154 warehouses in worldwide locations potentially reduces operating costs by $500.0 million. \n\nFY 2018 Base funding in the amount of 1.520 million will continue to facilitate Coalition Force interoperability research and development Coalition Warfighter Interoperability Demonstration (CWID) and will continue development of the Army Behavioral Health Integrated Data Environment (ABHIDE) system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Behavioral Health Integrated Data Environment"
                                    },
                                    "Description": {
                                        "val": "Army Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.871"
                                            },
                                            "Text": {
                                                "val": "Army Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry.  Data relating to suicides and suicide attempts are collected and stored in disparate, non-related databases that cross the domains of medical, personnel and law enforcement.  ABHIDE will provide the capability of integrating the non-related and dispersed data from the separate sources into a single comprehensive database to support both retrospective and predictive analysis.  The information obtained will be used to conduct epidemiological surveillance, identify trends in behavior patterns and identify potential indicators for suicidal tendencies supporting the mitigation of future suicide attempts across all phases of Army service."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.254"
                                            },
                                            "Text": {
                                                "val": "Army Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry.  Data relating to suicides and suicides attempts are collected and stored in a in disparate, non-related databases that cross the domains of medical, personnel and law enforcement.  ABHIDE will provide the capability of integrating the non-related and dispersed data from the separate sources into a single comprehensive database to support both retrospective and predictive analysis.  The information obtained will be used to conduct epidemiological surveillance, identify trends in behavior patterns and identify potential indicators for suicidal tendencies supporting the mitigation of future suicide attempts across all phases of Army service."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.520"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.520"
                                            },
                                            "Text": {
                                                "val": "Army Behavioral Health Integrated Data Environment (ABHIDE) will be the U.S. Army Center for Health Promotion and Preventive Medicine (CHPPM) Suicide Registry.  Data relating to suicides and suicides attempts are collected and stored in a in disparate, non-related databases that cross the domains of medical, personnel and law enforcement.  ABHIDE will provide the capability of integrating the non-related and dispersed data from the separate sources into a single comprehensive database to support both retrospective and predictive analysis.  The information obtained will be used to conduct epidemiological surveillance, identify trends in behavior patterns and identify potential indicators for suicidal tendencies supporting the mitigation of future suicide attempts across all phases of Army service."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BE4162"
                                    },
                                    "Title": {
                                        "val": "MACOM AUTOMATION SYSTEMS (BE4162)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "31.967"
                                        },
                                        "CurrentYear": {
                                            "val": "57.427"
                                        },
                                        "BudgetYearOne": {
                                            "val": "43.069"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "43.069"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "70.067"
                                        },
                                        "BudgetYearThree": {
                                            "val": "119.465"
                                        },
                                        "BudgetYearFour": {
                                            "val": "78.315"
                                        },
                                        "BudgetYearFive": {
                                            "val": "101.288"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Installation Support Modules is in Post Deployment Software Support (PDSS).  The present concept calls for the use of full and open competition to implement enhancements as defined by the Functional Proponent, Army Chief Information Officer (CIO)\/G-6.  Current emphasis is to bring the ISM systems to functional readiness for transfer to an Army Data Center and virtualize the ISM systems."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "193"
                    },
                    "ProjectTitle": {
                        "val": "Medical Communications For Combat Casualty"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.380"
                        },
                        "CurrentYear": {
                            "val": "1.207"
                        },
                        "BudgetYearOne": {
                            "val": "0.390"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.390"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "2.390"
                        },
                        "BudgetYearFour": {
                            "val": "1.551"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.918"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 2018 Base funding in the amount of $.390 million will be used for the engineering effort required to evaluate initiatives that improve the performance of the Defense Health Medical Systems (DHMS) Theater Medical Information Program-Joint (TMIP-J) software on the Army platform, as well as the engineering effort for other Army unique capabilities.  Activities include:\n--Research of technologies to integrate software into Army future information infrastructure and meet common operating environment requirements\n--Evaluation of hardware technology obsolescence and solutions"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Medical Communications for Combat Casualty Care (MC4) System interfaces Force Health Protection and medical surveillance information with Army Mission Command information technology systems.  The MC4 System fulfills the requirements highlighted in United States Code: Title 10, Subtitle A, Part II, Chapter 55, Section 1074f, mandating the proper documentation of deployed Service members' medical treatment to include pre- and post-deployment screening and its associated medical surveillance.  The MC4 System supports other Soldier protection initiatives by providing data for analyses which can be used for identification and development of critical soldier support systems such as body armor, improved helmets, traumatic brain injury protection and trauma reduction.  Current MC4 Program efforts are focused on system engineering, testing, integration, and fielding automation infrastructure for Army users of the Theater Medical Information Program-Joint (TMIP-J) suite of software.  Effort has also been initiated to integrate MC4 with the Army Chief Information Office (CIO) Network 2020 and Common Operating Environment (COE) and as a program of record in the Mobile\/Handheld Computing Environment Working Group.  Funding provides engineering, developmental testing, and integration of information management\/information technology to support Force Health Protection in accordance with the Army Equipment Modernization Plan.\n\nFY 2018 Base funding in the amount of $.390 million will be used for the engineering effort required to evaluate initiatives that improve the performance of the Defense Health Medical Systems (DHMS) Theater Medical Information Program-Joint (TMIP-J) software on the Army platform, as well as the engineering effort for other Army unique capabilities.  Activities include:\n--Research of technologies to integrate software into Army future information infrastructure and meet common operating environment requirements\n--Evaluation of hardware technology obsolescence and solutions"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Technical Support"
                                    },
                                    "Description": {
                                        "val": "Engineering and Technical Support for Preplanned Program Improvements and System Upgrades, Systems Integration, Software Support and other new initiatives to improve system performance and effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.526"
                                            },
                                            "Text": {
                                                "val": "Completed initial evaluation and development of virtualization, interface\/integration with Common Operating Environment, Cloud Computing Environment, and Mobile Handheld Computing Environment. Supported C4ISR and participated in E16 exercise (Fort Dix) to demonstrate the MC4 system capability.  Completed upgrade to Health Assessment Lite Operations software application (HALO)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.207"
                                            },
                                            "Text": {
                                                "val": "Continued evaluation and development of virtualization, interface\/integration with Common Operating Environment.  Evaluation of Army standard mobile handheld device as hardware solution for MC4 mobile system requirement.  Development of mobile handheld software application for MC4 requirement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.390"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.390"
                                            },
                                            "Text": {
                                                "val": "Continued evaluation and development of virtualization, interface\/integration with Common Operating Environment as relevant to MC4 system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PMO Testing Support"
                                    },
                                    "Description": {
                                        "val": "Test augmentation by outside agencies to include test efforts for DHMS\/TMIP-J and other Army unique software capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Test augmentation for DHMS\/TMIP-J and MC4 Operational Test and Evaluation by outside agencies, in support of TMIP Increment 2 Release 3 software version.  Also outside agency support, to include ATEC, CECOM Safety Board, and AMEDD Board,  for documentation of testing results required for fielding decision."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MC4\/TMIP Integration and Testing"
                                    },
                                    "Description": {
                                        "val": "Development testing of DHMS\/TMIP-J Increment 2 (all releases) and Increment 3; Lab site studies with technology and scenarios; Integration testing of software systems on the MC4 baseline system; test and evaluation of new capabilities for combat theater functionality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.654"
                                            },
                                            "Text": {
                                                "val": "Completed planned Multi Service Operational Test and Evaluation (MOTE) and test documentation for DHMS\/TMIP-J Software.  Completed x3 Software Integration Tests (SIT) and continued integration and test of DHMS\/TMIP-J Increment 2 Release 3 (TMIP-J I2R3 -- MC4 version 2310) on the MC4 baseline system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA SSN MA8046"
                                    },
                                    "Title": {
                                        "val": "OPA MA8046"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.388"
                                        },
                                        "CurrentYear": {
                                            "val": "19.893"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.964"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.964"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "17.124"
                                        },
                                        "BudgetYearThree": {
                                            "val": "27.946"
                                        },
                                        "BudgetYearFour": {
                                            "val": "23.837"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA PE 432612"
                                    },
                                    "Title": {
                                        "val": "OMA PE 432612"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.412"
                                        },
                                        "CurrentYear": {
                                            "val": "3.467"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.464"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.464"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.359"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.917"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.396"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.522"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The MC4 Program supports a number of Army Medical Information Technology\/Communications initiatives. The near and mid-term focus of the MC4 program is to engineer, design, integrate, test, acquire and field the Army automation infrastructure capabilities supporting fielding of the Theater Medical Information Program-Joint (TMIP-J) integrated software application suite and other Army requirements.  The MC4 hardware is procured as Commercial-off-the-Shelf (COTS) components.  Since TMIP software is a major component of the MC4 System and being developed in increments, the MC4 Program will deliver capabilities in increments, recognizing the need for future system updates and planned upgrades.  The MC4 Program works with the user community to continually define and refine additional requirements and match them with available technologies to provide the user enhanced capabilities.  These enhanced capabilities will be provided to the user at the earliest possible date.  This approach yields the most operationally useful and supportable capability in the shortest time possible with Cost As an Independent Variable.  Moreover, this approach provides an initial capability with the explicit intent of delivering improved and updated capability in subsequent updates and planned upgrades.  This evolutionary development approach will be accomplished through a rapid prototyping process that will progress the system from its current functional capabilities to fully integrated objective capabilities.  Appropriate commercial technology enhancements (e.g. advances in operating systems, voice activated technology, etc) will be incorporated into MC4 products and systems as they become available.  Each MC4 System component will undergo a full range of developmental testing to include software unit testing, integration testing, interoperability testing and software qualification testing. The MC4 system updates and planned upgrades will continue to undergo follow-on testing."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "738"
                    },
                    "ProjectTitle": {
                        "val": "AcqBiz"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.313"
                        },
                        "CurrentYear": {
                            "val": "8.737"
                        },
                        "BudgetYearOne": {
                            "val": "9.118"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.118"
                        },
                        "BudgetYearTwo": {
                            "val": "43.782"
                        },
                        "BudgetYearThree": {
                            "val": "35.240"
                        },
                        "BudgetYearFour": {
                            "val": "23.232"
                        },
                        "BudgetYearFive": {
                            "val": "20.100"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "PM AcqBusiness provides acquisition-centric enterprise solutions. Delivers innovative and adaptive solutions that streamline the collection and analysis of data to support powerful decisions across the Army acquisition enterprise.  PM AcqBusiness will be the premier source of information technology solutions that enable information dominance at all levels of the Army acquisition enterprise. PM AcqBusiness provides Army Acquisition practitioners with a consistent set of unique business tools, web services, and decision support tools integrated through a common architecture, which provide visibility of authoritative data, consistency in business process, and more timely support to acquisition decisions. The enterprise tools provided via PM AcqBusiness enable the reduction and eventual elimination of stovepipe and redundant tools that exist in the domain today. PM AcqBusiness provides an environment that enables centralized, role-based access to trusted and authoritative data from disparate Acquisition Domain data sources. In addition, PM AcqBusiness provides a framework for information providers to publish their data and provide their services to authorized users.\nThe funding in this program element also funds the development requirements for the Human Resources Command, U.S. Army Accessioning Integrated Automation Architecture which provides the Information Technology solution necessary to accomplish the Army's Accessioning mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "This effort provides program management in support of the U.S. Army Accessioning Integrated Automation Architecture mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.790"
                                            },
                                            "Text": {
                                                "val": "Program Management\n\nThe funding in this program element also resources the development requirements for the Human Resources Command, U.S. Army Accessioning Integrated Automation Architecture which provides the Information Technology solution necessary to accomplish the Army's Accessioning mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.008"
                                            },
                                            "Text": {
                                                "val": "Program Management\n\nThe funding in this program element also resources the development requirements for the Human Resources Command, U.S. Army Accessioning Integrated Automation Architecture which provides the Information Technology solution necessary to accomplish the Army's Accessioning mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.957"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.957"
                                            },
                                            "Text": {
                                                "val": "Program Management\n\nThe funding in this program element also resources the development requirements for the Human Resources Command, U.S. Army Accessioning Integrated Automation Architecture which provides the Information Technology solution necessary to accomplish the Army's Accessioning mission."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Design, Development, and Test"
                                    },
                                    "Description": {
                                        "val": "This effort supports the ultimate integration of the AcqBusiness Portfolio."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.523"
                                            },
                                            "Text": {
                                                "val": "PdM AcqBusiness staff executed funds supporting the functional proponent, Assistant Secretary of the Army for Acquisition, Logistics, and Technology (ASA (ALT)), leaning forward on initial draft Business Requirements Document (BRD) providing an expanded scope of actionable information that maintains data integrity across the entire acquisition lifecycle for acquisition programs; a set of data collection, data storage, & analytic capabilities that integrates data from multiple authoritative\/trusted enterprise sources and provides executive decision makers a clear, accurate & deep understanding of programs of record; enterprise access to data & provide decision makers at all levels with a common operation procedure (COP) that displays programmatic\/funding metrics for programs of record; & a data visualization\/analysis environment that helps ASA(ALT) reduce cost\/mitigate risks.\n\nHuman Resources Command completed Financial Audit Readiness Requirements for CCIMM and JCIMS and Phase II of Reception Module."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.729"
                                            },
                                            "Text": {
                                                "val": "PdM AcqBusiness funds will support the integration of COTS SW solutions (tentatively referred to as PM Tools) that provide authoritative, visible, accessible, understandable, trusted, and interoperable data in an Acquisition Data Warehouse (ADW) down to the ACAT III program level through the optimization of Product\/Project Manager business processes.  Increment 1 of the new Army Acquisition Domain Data Management (AADDM) capability will focus on programmatic information such as Integrated Master Schedules (IMS), cost and budget, industrial base and contractor information.  Increment II will then begin the connection of live, authoritative Army databases to the Acquisition data warehouse.  Once the business processes and external data sources are providing the data: visualization tools can be utilized to provide key charts\/views that support Army Staff (ARSTAFF) processes such as Program Objective Memorandum (POM), Weapon System Review (WSR), Strategic Portfolio Analysis and Review (SPAR), and budget execution drills. Supporting efforts include business process evaluation and definition to maximize efficiency of the Software integration process. Completion of Increment I PM Tools software integration, demonstration and evaluation of the PM Tools in a 6-9 month pilot event within a minimum of one PEO.  Funding also supports further acquisition integration of external data sources as required.  Further focus will concentrate on delivering more common data views and analytical capabilities to support decision making at Product Manager (PdM), Program Manager (PM), Program Executive Officer (PEO), ASA (ALT), and at ARSTAFF levels. Key events include the PM Tool pilot evaluation and a FP Tool deployment decision by the Milestone Decision Authority (MDA).\n\nHuman Resources Command (HRC) will continue effort for CCIMM and JCIMS for Financial Audit Readiness Requirement and technical requirements gathering, analysis and documentation to allow TRADOC to conduct the Analysis of Alternatives for the RIE."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.161"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.161"
                                            },
                                            "Text": {
                                                "val": "PdM AcqBusiness funds will support the integration of COTS SW solutions (tentatively referred to as PM Tools) that provide authoritative, visible, accessible, understandable, trusted, and interoperable data in an Acquisition Data Warehouse (ADW) down to the ACAT III program level through the optimization of Product\/Project Manager business processes.  Increment 1 of the new Army Acquisition Domain Data Management (AADDM) capability will focus on programmatic information such as Integrated Master Schedules (IMS), cost and budget, industrial base and contractor information.  Increment II will then begin the connection of live, authoritative Army databases to the Acquisition data warehouse.  Once the business processes and external data sources are providing the data: visualization tools can be utilized to provide key charts\/views that support Army Staff (ARSTAFF) processes such as Program Objective Memorandum (POM), Weapon System Review (WSR), Strategic Portfolio Analysis and Review (SPAR), and budget execution drills. Supporting efforts include business process evaluation and definition to maximize efficiency of the Software integration process. Completion of Increment I PM Tools software integration, demonstration and evaluation of the PM Tools in a 6-9 month pilot event within a minimum of one PEO.  Funding also supports further acquisition integration of external data sources as required.  Further focus will concentrate on delivering more common data views and analytical capabilities to support decision making at Product Manager (PdM), Program Manager (PM), Program Executive Officer (PEO), ASA (ALT), and at ARSTAFF levels. Key events include the PM Tool pilot evaluation and a FP Tool deployment decision by the Milestone Decision Authority (MDA).\n\nHuman Resources Command will continue effort for CCIMM and JCIMS for Financial Audit Readiness Requirement and technical requirements gathering, analysis and documentation to allow TRADOC to conduct the Analysis of Alternatives for the RIE."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "432615000"
                                    },
                                    "Title": {
                                        "val": "Operations and Maintenance"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.889"
                                        },
                                        "CurrentYear": {
                                            "val": "10.542"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.294"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.294"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.511"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.738"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.977"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.224"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "65.175"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "PM AcqBusiness was established to acquire a centrally managed and funded suite of standard net-centric business capabilities to provide Army acquisition practitioners the data visibility necessary to optimize the acquisition of materiel, supplies, and services for the Warfighter.  PM AcqBusiness is using an evolutionary acquisition strategy, incorporating the use of COTS hardware and software, when practicable, in order to realize benefits early and reduce risk.  The AcqBusiness acquisition approach embraces the tenets of Subtitle III of Title 40, U.S.C. (formerly the Clinger-Cohen Act of 1996).\n\nPM AcqBusiness leverages existing DoD and Army enterprise capabilities to fulfill Acquisition Domain business needs whenever possible.  When no Army enterprise systems satisfy approved requirements, priority is given to existing acquisition business systems or services where they are scalable and in conformance with technical architecture standards.  In the event neither of these options is available to satisfy a business need, capabilities are acquired as commercial off-the-shelf (COTS) products. PM AcqBusiness maximizes use of COTS technology by implementing an architecture and infrastructure based on services and virtualization.  If there are no available COTS solutions, PM AcqBusiness will develop the capability, leveraging an incremental approach to enable: (1) consistent and phased definition of requirements, (2) mature technologies, and (3) collaboration among user, tester and developer.  \n\nAs such, PM AcqBusiness is:\n\n- collaborating with the ASA(ALT) community to facilitate Business Process Reengineering in advance of development of AcqBusiness capabilities.  \n\n- encouraging the purchase of commercial products and innovations from private industry.\n\n- involving potential suppliers early in the requirements generation process. \n\n- employing outsourcing wherever possible, and\n\n- acquiring AcqBusiness capabilities in interoperable modules, minimizing the time required to deliver new capabilities to users."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FE9"
                    },
                    "ProjectTitle": {
                        "val": "ALTESS (P&R Forms)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.110"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.110"
                        },
                        "BudgetYearTwo": {
                            "val": "0.120"
                        },
                        "BudgetYearThree": {
                            "val": "0.120"
                        },
                        "BudgetYearFour": {
                            "val": "0.120"
                        },
                        "BudgetYearFive": {
                            "val": "0.130"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is not a New Start.  Funds were previously requested in project 738 and have been realigned for greater transparency."
                        },
                        "ProjectMissionDescription": {
                            "val": "The P&R Forms application supports the creation and production of the Committee Staff Procurement Backup Book (P-Forms), as well as Research, Development, Test and Evaluation Descriptive Summaries (RDTE, or R-Forms). Using P&R Forms, budgetary forms and data can be quickly and efficiently submitted, coordinated, and approved.\n\nThis is not a new start.  Project breaks out previously requested funds from project 738."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continued development of the Army's Budget System"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.110"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.110"
                                            },
                                            "Text": {
                                                "val": "Continued development of the Army's Budget System"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T04"
                    },
                    "ProjectTitle": {
                        "val": "USMEPCOM TRANSFORMTION - IT MODERNIZATION"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.733"
                        },
                        "CurrentYear": {
                            "val": "29.281"
                        },
                        "BudgetYearOne": {
                            "val": "11.217"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.217"
                        },
                        "BudgetYearTwo": {
                            "val": "30.030"
                        },
                        "BudgetYearThree": {
                            "val": "23.712"
                        },
                        "BudgetYearFour": {
                            "val": "8.311"
                        },
                        "BudgetYearFive": {
                            "val": "8.391"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "US Military Entrance Processing Command Integrated Resource System (MIRS) provides automation and communications capability to meet peacetime, mobilization and wartime military manpower accession mission for the Armed Services.  MIRS interfaces with recruiting capabilities for the services, incorporating the concept of electronic data sharing using standard DoD data elements between USMEPCOM and all Armed Services recruiting commands.  This project includes Computerized Adaptive Testing-Armed Services Vocational Aptitude Battery (CAT-ASVAB), automated Armed Services Vocational Aptitude Battery is given to determine applicants' mental abilities. Data Services mission consists of automatic data processing in support of USMEPCOM, the Selective Service System (SSS) and other external agencies for both peacetime and mobilization requirements. MIRS directly supports mobilization in the event of a military draft, through electronic links with the SSS and its ability to process and ship. USMEPCOM\/MIRS is the only DoD organization legally authorized to collect civilian, medical and testing data for purposes of processing into military services and is the only DoD joint support system used to enforce congressional, DoD and Armed Forces qualification criteria for enlistment.  USMEPCOM has established interfaces with US Citizenship and Immigration Services to verify citizenship status for applicants of military service to screen out undesired or security threat and Federal Bureau of Investigation for background screening using digital fingerprints to eliminate people with criminal records from entering military service. USMEPCOM's IT sustainment effort will maintain MIRS and the associated network certification and accreditation until the end of system lifecycle.  MIRS was scheduled to be replaced by the Virtual Interactive Processing System (VIPS).   VIPS program cancellation has placed USMEPCOMs legacy IT infrastructure at high risk. The resultant system leaves a non-compliant and non-networthy accession system with processing gaps that need to be addressed for secure, compliant, sustainable, and reliable capabilities to meet DoD and Service requirements.  USMEPCOM must continue toward security and data integrity regulatory\/security compliance (PII and HIPAA) or lose Authority to Operate.\n\nCustomers\/beneficiaries of this investment include the Accessions Community of Interest (ACOI) including components of the Army, Navy, Air Force, Marines, Coast Guard, USMEPCOM and OSD (P&R). \nStakeholders include: All Uniformed Services, Assistant Secretary of Defense (Health Affairs), Defense Transportation Management Office, USD P&R, USD Intel, Defense Manpower Data Center and Department of Veterans Affairs.\nRequested funding mitigates inefficient system sustainability and scalability through an update of the applications underlying database, operating system and middleware software.  The current legacy system requires time consuming and expensive efforts to make operational changes (even minor ones) to military accessions processing to meet DoD and individual Services requirements. MIRS operational processes exist in a system where business rules and workflow are hard coded throughout the system.  Any changes require extensive review and analysis of the code to see what is impacted before a change can be made, then extensive testing afterwards to make sure it works correctly throughout the accession process.  Currently there are over 600 Problem Reports (PR) and System Change Requests (SCRs) pending. \n\nRequested funding also provides for a follow-on acquisition plan that will be informed by the recent DCMO initiated Technical Demonstration. The acquisition will provide future enhancements and additional capabilities like those to be proven through the currently evolving Tech Demo.  These efforts will culminate in new USMEPCOM business process vision of an anytime, anywhere accession processing capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Phase 3 Application update"
                                    },
                                    "Description": {
                                        "val": "Initiate update of MIRS and associated Applicant Processing applications to secure applicant data"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.733"
                                            },
                                            "Text": {
                                                "val": "Completed update of MIRS and associated Applicant Processing applications to secure applicant data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.089"
                                            },
                                            "Text": {
                                                "val": "Initiate update of MIRS and associated Applicant Processing applications to secure applicant data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.717"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.717"
                                            },
                                            "Text": {
                                                "val": "continue update of MIRS and associated Applicant Processing applications to secure applicant data"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project Support"
                                    },
                                    "Description": {
                                        "val": "Funding will support Information Technology"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.192"
                                            },
                                            "Text": {
                                                "val": "Update of MIRS and associated Applicant Processing Applications to facilitate DoDAF 2.0 and BEA compliant architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Continue Update of MIRS and associated Applicant Processing Applications to facilitate DoDAF 2.0 and BEA compliant architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contractor PM Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.134"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.511"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.474"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.474"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.119"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "MEPCOM Jnt Comp Ctr(JCC) & Integ Resource Sys(IRR). This RDT&E will be used by USMEPCOM for continued project transformation support of VIPS."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MIRS Phase 3 & eSecurity\/Biometircs Replacement"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.840"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.222"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "29.281"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.743"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.743"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-75.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "PRODUCT DEVELOPMENT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T05"
                    },
                    "ProjectTitle": {
                        "val": "Army Business System Modernization Initiatives"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.128"
                        },
                        "CurrentYear": {
                            "val": "28.577"
                        },
                        "BudgetYearOne": {
                            "val": "39.216"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.216"
                        },
                        "BudgetYearTwo": {
                            "val": "34.385"
                        },
                        "BudgetYearThree": {
                            "val": "32.630"
                        },
                        "BudgetYearFour": {
                            "val": "39.883"
                        },
                        "BudgetYearFive": {
                            "val": "39.775"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Army Training Information System (ATIS) will provide a common operational picture (COP) of the training environment through integrated, interoperable training development, management, scheduling, and delivery capabilities. Existing training information systems do not provide Commanders, leaders, Soldiers, and civilians a centralized COP of the training environment that enables persistent, consistent access to the Training and Education information and products necessary to support readiness to meet emerging threats. Without ATIS, Army organizations will continue to develop and maintain a multitude of TIS that are not part of an enterprise, thus inhibiting visualization, understanding, and informed decision making.  \n\nThe Army Contract Writing System (ACWS) was realigned to PE 0605047 beginning FY17 for increased program transparency.\n\nCommander's Risk Reduction Dashboard (CRRD) will consolidate information from multiple Army databases and present to commanders a concise report about which Soldiers in their unit have been involved with at-risk behaviors, some of which may be associated with suicide, and when those instances occurred. The dashboard will be able to generate multiple reports, including one that highlights just Soldiers with risk factors within a certain time period; another that focuses only on newly assigned Soldiers; and another that allows commanders to look at a specific Soldier's history with at-risk behaviors.\n\nThe Army Safety and Health Management System (ASHMS) initiative provides a framework of people, processes and technology to synchronize, integrate and optimize Army Safety and Occupational Health (SOH) capabilities to preserve war fighting capabilities and enhance the force by providing a safe and healthy environment for Soldiers, Families, Civilians, and contractors. An analysis of Army SOH Doctrine, Organization, Training, Materiel, Leadership and education, Personnel, Facilities and Policies (DOTMLPF-P) determined that the Army Safety Management Information System – Revised (ASMIS-R), a Defense Business System, is currently not able to satisfy current and emerging ASHMS capability requirements without modernization to resolve these capability gaps. Changes in requirements for the Army Safety and Health Management System (Programmatic) related to DoDI 6055.01, AR 385-10, Information Assurance requirements and direct feedback from the Safety professionals within the DoD and the Army have resulted in the need for changes in associated business processes. Additionally, a business gap analysis performed by the DASA(ESOH) revealed a deficiency in the system's requirements that would support Army Commands in identifying hazards in the work place, determining hazard mitigation strategies and controls, employing these strategies and controls, and measuring their potential for reducing mishaps. Addressing these problems will have an immediate and direct impact on meeting regulatory requirements, improving data integrity, improving information assurance posture (compliance), increasing the Army's ability to reduce mishaps across the force structure, and promoting Army Force Generation (ARFORGEN) capabilities.\n\nThe Army Human Resources Command (HRC) has several efforts for which RDT&E will be applied.  One is to prepare those systems for subsumption into the Integrated Personnel and Pay System(IPPS-A).  The other is to disconnect and upgrade those systems not being subsumed by IPPS-A. Systems that will be targeted by HRC to prepare for IPPS-A subsumption or upgrade are the Automated Orders and resources System (AORS), Army Selection Board System (ASBS), Data Base Administration Suite of System (DBA), Enlisted Distribution and Assignment system (EDAS), Enlisted Promotion Model (EPM), Enterprise Service Bus (ESB), Human Resource Command Identity Management System (HIMS), Integrated Total Army Personnel Database (ITAPDB), Officer Selection Support System (OSSS), Reserve Statistics Accounting System\/Reserve Component Common Personnel Data System (RSAS\/RCCPDS), Senior Enlisted Promotions Model (SEPM), Single Evaluation Processing System (SEPS), Soldier Management System Webified Suite of System (SMSWEB), Total Army Personnel Data Base - Active Enlisted (TAPDB-AE), Total Army Personnel Data Base - Active Officer (TAPDB-AO), Total Army Personnel Data Base - Active Reserve (TAPDB-AR), Total Officer Personnel Management Information System (TOPMIS), Total Officer Personnel Management Information System II (TOPMIS II), Keystone Request\/Retain System, and the Interactive Personnel Electronic Records Management System (iPERMS).\n\nThe Defense Language Software Upgrade will perform a major modification to the Universal Course Authoring Tool (UCAT).  The modification will enable the tool to allow the curriculum development department to author new curricula without having to know a programming language, such as HTML. Currently, the tool has limited authoring templets and doesn’t support the higher language levels or contain testing templets.  The tool will do the programming automatically in the proper format for online viewing regardless of the mobile device used to view the material.  This will enable the author to input the content in a predetermined way and the program will convert it into the proper online format. There will also be programming support to develop and convert existing online material into the current formats for use with all mobile devices regardless of the operating system used. Our current online material does not support all mobile devices and it needs to be reprogrammed to support all current mobile devices regardless of the Operating System (OS) used (Android, Apple, Microsoft).  The Defense Language Institute (DLI) doesn’t have the capability to do any programming modifications to existing programs. The programs are in need of modifications to meet DLI’s new graduation standards of 2+\/2+.\n      \nThe Program Planning Budget (PPB)- Business Operating System (BOS) will standardize and better integrate the transactional automated information systems used in the HQDA level programming and budgeting processes.  These systems are core to the PPBE business processes of the HQ for gathering programmatic requirements, balancing resources and delivering the Army's program budget to OSD.  This project is streamlining programming and budgeting processes and significantly improving strategic analysis capabilities.  The project is architecting, reengineering, streamlining and consolidating HQDA systems, feeder data base systems, and streamlining the associated processes.  These improvements will improve capability, eliminate redundancies and reduce overall cost of operations.  The PPB BOS project is complementary to the Army's General Fund Enterprise Business System (GFEBS) program.   It includes a new effort in FY14, the Army Contract Writing System, a replacement for the DoD Standard Procurement System (SPS).\n\nArmy Career Tracker (ACT) is a leader development tool created to change significantly the way training, education, and experiential learning support is provided to Army enlisted, officers, civilians, and their leaders\/supervisors.  Users can search multiple education and training resources, monitor career development, and receive advice from their leadership.  ACT provides single-site, easy access, and offers a complete and personalized career picture not available until now.  ACT allows users to manage career objectives and monitor progress towards career requirements and goals.  ACT provides an integrated approach to supporting military and civilian personnel's personal and professional development which capitalizes on the mutual (personnel and Army) need for life-long learning.  The unique inter-relationship between the user's personal growth and development, and the Army's need for Soldiers to be continuously developing, building and cultivating a culture of life-long learning is critical for the Soldier's and the Army's success.  ACT comprises over 780,000 users with an adoption rate of 4,000 users per week.  HQDA EXORD 054-12 ISO Army Transition mandates that leaders utilize roles in ACT to promote life-long learning and development opportunities throughout the Soldier's lifecycle of service (hire to retire).\n\nThe Defense Language Software Upgrade will perform a major modification to the Universal Course Authoring Tool (UCAT).  The modification will enable the tool to allow the curriculum development department to author new curricula without having to know a programming language, such as HTML. Currently, the tool has limited authoring templets and doesn’t support the higher language levels or contain testing templets.  The tool will do the programming automatically in the proper format for online viewing regardless of the mobile device used to view the material.  This will enable the author to input the content in a predetermined way and the program will convert it into the proper online format. There will also be programming support to develop and convert existing online material into the current formats for use with all mobile devices regardless of the operating system used. Our current online material does not support all mobile devices and it needs to be reprogrammed to support all current mobile devices regardless of the Operating System (OS) used (Android, Apple, Microsoft).  The Defense Language Institute (DLI) doesn’t have the capability to do any programming modifications to existing programs. The programs are in need of modifications to meet DLI’s new graduation standards of 2+\/2+. \n\nCriminal Information Management System (CIMS): CIMS, formerly known as the Law Enforcement Advisory Program (LEAP), is a collection of mission essential information technology (IT) systems within the United States Army Criminal Investigation Command (USACIDC) and the Office of the Provost Marshal General (OPMG).  Through CIMS, the USACIDC and the OPMG developed an integrated and unified, comprehensive enterprise program \/ system that houses both classified and unclassified Law Enforcement Sensitive (LES) data.  CIMS leverages existing and future Army Law Enforcement (LE) enterprise information technology (IT) assets and other external data sources providing a full range of law enforcement functions to support business objectives and mission.  The primary component is a comprehensive enterprise system known as the Army Law Enforcement Reporting and Tracking System (ALERTS) providing Army LE stakeholders the enhanced capability to rapidly and efficiently manage a variety of LE and criminal intelligence functions as well as a broader range of senior executive reporting requirements.  The Consolidated Operations Police Suite (COPS) was previously comprised of five separate applications: two of these applications have been rationalized under ALERTS; the remaining three (related to the Army Corrections discipline) require modernization to ensure continued function and security compliance. RDT&E dollars are required to further enhance & enable CIMS’ consolidation\/rationalization of LE applications thereby providing the LE community the tools to more quickly investigate, solve, and prevent Army crime while also facilitating the management of those placed in corrections facilities.  At present, all requested CID RDT&E funding will be applied to CIMS initiatives.\n\nEducational Outreach Initiative:  The Defense Forensic Science Center (DFSC), a subordinate element of USACIDC, requires funding for educational outreach initiatives including internship positions at the undergraduate, graduate, and doctoral candidate levels. The DFSC was designated as the leader for forensic science disciplines (DAPM Memo 4 Oct 2011). This memorandum states that the DFSC will establish a forensic RDT&E program that provides the integration of joint operational research, including procedures for establishing customer requirements, and identifying gaps and needs that lead to RDT&E priorities. The program includes developing a scholarly environment across the Defense Forensic Enterprise through the use of educational partnerships, internships and fellowships to facilitate participation in RDT&E projects.  The Educational Outreach program provides an opportunity for students to contribute to forensic science research and influence shared research priorities across forensic science communities, while simultaneously supporting DFSC laboratory operations. Through the internship program, innovative research is conducted that supports research capabilities across the entire range of defense forensic operations (traditional laboratory, expeditionary (forward-deployed) laboratories, and reach-back functions).  \n\nResearch & Development Identified through the Broad Agency Announcement (BAA) Initiative:  The DFSC requires funds to coordinate the execution of forensic research projects that will enhance the capability of forensic science applications for DoD customers both in traditional law enforcement\/criminal justice settings as well as in expeditionary environments.  The DFSC staff manage federally-funded research & development contracts identified through a two-year, rolling BAA procedure.  The BAA is issued under the provisions of paragraph 6.102(d) (2) of the Federal Acquisition Regulation (FAR), which provides for the competitive selection of proposals.  Submitted BAA research proposals selected for award are considered to be the result of full and open competition and in full compliance with the provisions of Public Law 98-369, \"The Competition in Contracting Act of 1984\" (and subsequent applicable amendments).\n\nFinancial Integrated Reporting Environment (FIRE): FIRE is a U.S. Army Material Command (AMC) Enterprise Resource Planning (ERP) system currently deployed at the Armament, Research, Development and Engineering Center (ARDEC). FIRE supports the funding and manpower required to accomplish ARDEC’s reimbursable workload. RDTE is required to develop and expand the system as an enterprise solution across all AMC reimbursable activities. This strategy is in line with existing Army Portfolio Management System (APMS) and Business Enterprise Architecture (BEA) Objectives.\n\nRegional Level Application Software (RLAS) is a critical IT application to the AR managing the automated military pay, funds control, training calendar management and administrative records management for 198,000 Soldiers. \n\nRLAS\n\nArmy Software Marketplace (ASM): ASM will enable the Army to have a centralized location to store software applications and application metadata."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Contract Writing System (ACWS)"
                                    },
                                    "Description": {
                                        "val": "ACWS is the Army strategy for a single enterprise-wide contract writing and management solution that will meet the Army's current critical functional contract writing requirement and can expand to meet future functional needs.  The Army's goal is to streamline Acquistion, Technology and Logistics (AL&T) end-to-end business processes; reduce operating, maintenance and support costs; decrease, and where applicable, mitigate the number of existing and future interfaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.170"
                                            },
                                            "Text": {
                                                "val": "FY16 funds are to perform all requisite activities to carry the program through the source selection process, a contract award authority to proceed decision (ATP-1)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Training Information System (ATIS)"
                                    },
                                    "Description": {
                                        "val": "Army Training Information System (ATIS) is an enterprise system that will provide a common operational picture (COP) of the training environment through integrated, interoperable training development, management, scheduling, and delivery capabilities.  These capabilities will enable Commanders, leaders, Soldiers, and civilians to better understand, visualize, describe, direct, lead, and assess training requirements so they can more effectively plan, prepare, execute, and assess training.  End result is an ATIS that enables Soldiers to train as they will fight, so they can effectively fight as they have trained."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.845"
                                            },
                                            "Text": {
                                                "val": "Complete the Analysis of Alternatives to include the incremental developmental plan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.670"
                                            },
                                            "Text": {
                                                "val": "RDTE funding will be used to complete the Army Cost Estimate, complete Capability Development Document, preparation of life cycle documentation needed for entry into the Business System Functional Requirements and Acquisition Planning (BS FRAP) phase, reduction of technology risks through prototyping, and preparations needed for entry into Business System Acquisition, Testing, and Deployment (BS ATD) phase for development of ATIS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.722"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.722"
                                            },
                                            "Text": {
                                                "val": "Funding will be used to continue the Business System Functional Requirements and Acquisition Planning (BS FARP) phase activities, complete RFP activities, and develop documentation needed to achieve the Acquisition Authority to Proceed (ATP) milestone."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Commanders Risk Reduction Dashboard (CRRD)"
                                    },
                                    "Description": {
                                        "val": "CRRD will consolidate information from multiple Army databases and present to commanders a concise report about which Soldiers in their unit have been involved with at-risk behaviors, some of which may be associated with suicide, and when those instances occurred."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.723"
                                            },
                                            "Text": {
                                                "val": "Receive approval to proceed with development -begin development of CRRD dashboard increment 2 -Conduct Integrated Baseline Review with developer"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.968"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.968"
                                            },
                                            "Text": {
                                                "val": "-Complete development of CRRD Inc 2 capability -Conduct Operational Test"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "The Army Safety and Health Management System (ASHMS)"
                                    },
                                    "Description": {
                                        "val": "The Army Safety and Health Management System (ASHMS) initiative provides a framework of people, processes and technology to synchronize, integrate and optimize Army Safety and Occupational Health (SOH) capabilities to preserve war fighting capabilities and enhance the force by providing a safe and healthy environment for Soldiers, Families, Civilians, and contractors. An analysis of Army SOH Doctrine, Organization, Training, Materiel, Leadership and education, Personnel, Facilities and Policies (DOTMLPF-P) determined that the Army Safety Management Information System – Revised (ASMIS-R), a Defense Business System, is currently not able to satisfy current and emerging ASHMS capability requirements without modernization to resolve these capability gaps. Changes in requirements for the Army Safety and Health Management System (Programmatic) related to DoDI 6055.01, AR 385-10, Information Assurance requirements and direct feedback from the Safety professionals within the DoD and the Army have resulted in the need for changes in associated business processes. Additionally, a business gap analysis performed by the DASA(ESOH) revealed a deficiency in the system's requirements that would support Army Commands in identifying hazards in the work place, determining hazard mitigation strategies and controls, employing these strategies and controls, and measuring their potential for reducing mishaps. Addressing these problems will have an immediate and direct impact on meeting regulatory requirements, improving data integrity, improving information assurance posture (compliance), increasing the Army's ability to reduce mishaps across the force structure, and promoting Army Force Generation (ARFORGEN) capabilities. ."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.765"
                                            },
                                            "Text": {
                                                "val": "FY16 funds are being used for development of products and tools to  modernize mishap reporting through the addition of an Initial Notification capability for Commanders, offline capability for mishap reporting in low\/no bandwidth areas, and mobile application capabilities as well as Human Factors risk management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.846"
                                            },
                                            "Text": {
                                                "val": "FY17 funds are being used to continue development of products and tools to  modernize mishap reporting through the addition of an Initial Notification capability for Commanders, offline capability for mishap reporting in low\/no bandwidth areas, and mobile application capabilities as well as Human Factors risk management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Business System Modernization Initiatives, CPOL, iPERMS & RLAS"
                                    },
                                    "Description": {
                                        "val": "Modernization requirements will add new capabilities to legacy IT systems that support human resource functions such as organization and position management, training, and employment.  The PPB BOS system standardize and integrate the transactional information systems used in the Headquarters Department of Army (HQDA)  Programming and Budgeting processes.   The program is streamlining programming and budgeting business processes and significantly improving strategic analysis capabilities.  The PPB BOS architecture reengineers, streamlines, and consolidates HQDA systems and financial feeder systems; aligns to the DoD Business Enterprise Architecture (BEA); implements powerful business intelligence analytical tools to support strategic planning, programming, and budgeting within HQDA; and provides access to GFEBS funds management and execution data through system interfaces with required SFIS compliancy integral to the PPB BOS data model.  The LEAP program will provide criminal intelligence querying and reporting capabilities in compliance with regulatory and policy standards for Army Law Enforcement regarding investigation of felony crimes.  LEAP captures criminal case investigative information regarding incidents, location descriptors, entities (name, social security number, rank, title, physical characteristics, sex, birth place, and date), agent assignment, crime description and identifiers, statements, property data, laboratory tests; verifies and stores this data for criminal intelligence purposes: and reports this information to the proper authorities from the Division Commanding Officer to the United States Grand Jury.  The system will extract necessary data for consolidation and input to Defense Incident-Based Reporting System (DIBRS) monthly reports, National Incident-Based Reporting System (NIBRS) monthly reports and the Defense Clearance and Investigations Index (DCII) daily updates.  The LIMS system will automate business processes that support the forensic examiners. These processes include, but are not limited to, analytics, materials management, management reporting, Freedom of Information Act requests (FOIA), legal discovery request, court preparation and outsource processing.\n\nCivilian Personnel Online - Portal (CPOL-Portal) is a one stop secure site which provides Army civilian employees and HR specialists access to a private portal with a complete set of employment related resources, links and web based applications that require single sign-on access - Army Regional Tools (ART). CPOL-Portal will provide an Integrated Management System (IMS) in support of Civilian Workforce Transformation (CWT). It will support Civilian human capital decision making and allow leaders and\nemployees to perform their roles more efficiently in support of Army goals and missions. CPOL Portal will provide the full spectrum of IT application support and access to Acquire, Develop, Distribute and Sustain components of the Army Civilian HCM Life-Cycle and link to G3 'Structure' IT Enterprise Applications.\n\nThe Fully Automated System for Classification (FASCLASS) is a centralized, web-based system that maintains civilian position descriptions and position related information across Department of the Army.  It provides classifiers and managers capability to create, edit, and verify position descriptions.  Also it offers robust search, report generation, and lookup & support capabilities.\n\nThe Overseas Entitlement Tracker (OET) provides the capability to accurately track Living Quarters Allowance (LQA). LQA is provided to reimburse employees for suitable, adequate living quarters at posts where the U.S. Government does not provide quarters. OET also tracks these other overseas entitlements for employees: Advance Pay, Danger Pay, Imminent Danger Pay, Foreign Differential, Home Leave, Post Allowance, Separation Maintenance Allowance, and Temporary Quarters Subsistence Allowance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.036"
                                            },
                                            "Text": {
                                                "val": "Modernization requirements will add new capabilities to legacy IT systems that support human resource functions such as organization and position management, training, and employment.  Will continue deployment and final fielding of the enterprise-level PPB BOS application throughout HQDA and the transfer of budget data to the Army's financial enterprise resource system, the General Fund Enterprise Business System.  Will field the full operating capability of the Army Mapper system, which is the Army Geospatial data base of record and the HQDA repository for all Installation & Environment related geo-spatial data systems.\n\nThe RLAS system, lacking substantial technology improvements between FY03 and FY15, operates on aging technology framework, architecture, utilities and Operating Systems (OS) not in compliance with many recent Army CIO policies, Army NETCOM directives and Army Cyber defense requirements.  With the increasing threat of cyber-attack and the resulting increase in Army directives for IT system security compliance, the RLAS system is accumulating a number of system compliance waivers and submitting multiple Plan Of Action Memorandum (POAM) to maintain its Authority To Operate (ATO) on the Army Land War Net (LWN). Funding supports systems modification and development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.413"
                                            },
                                            "Text": {
                                                "val": "Modernization requirements will add new capabilities to legacy IT systems that support human resource functions such as organization and position management, training, and employment.  Will develop technologies for Army Installation Support, PM Personnel Employee Records Management System, HRC Core Automation Support, Records Management and Army Civilian Personnel Operations.\n\nArmy Civilian Human Resources Agency will deliver additional capability increments of OET in FY 2016, through FY 2019.  The FY 2016 increment consists of the initial set of Civilian Employee Interface functions.  The FY 2017 increment delivers enhancements to the Civilian Employee Interface.  The FY 2018 and FY 2019 increments include electronic files in place of paper, embed additional calculations, auto-generate\nadditional notifications, online document review, and automate flow of data to Defense Civilian Personnel Data System."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.777"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.777"
                                            },
                                            "Text": {
                                                "val": "Continue to fund Army Business System Modernization Initiatives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Career Tracker (ACT)"
                                    },
                                    "Description": {
                                        "val": "Modify the existing Soldier Home Page to quickly display key career related status requiring immediate action.  Use ACT professional development systems to support and enhance Soldier competitive efforts for advancement and retention.  ACT will utilize the Real-Time Broker Service (RBS) to get the DoD ID Number from DMDC for new users who come to them through these other systems. This method will allow ACT to retrieve DoD ID for users that may not have been processed in the Batch Request."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Text": {
                                                "val": "Provide competency management tool to manage leader attributes characteristics of the individual that shape the motivations for actions and bearing, and how thinking affects decisions and interactions with others; enhancement of counseling capabilities linked to the Individual Development Plan and current Counselor functions to provide greater functions and access to specific information by various counselors in support of Army Transition; enhance sponsorship functions to provide ease of execution and enhanced workflow between the many sponsorship Stakeholders"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.748"
                                            },
                                            "Text": {
                                                "val": "Provide competency management tool to manage leader attributes characteristics of the individual that shape the motivations for actions and bearing, and how thinking affects decisions and interactions with others;  enhancement of counseling capabilities linked to the Individual Development Plan and current Counselor functions to provide greater functions and access to specific information by various counselors in support of Army Transition; enhance sponsorship functions to provide ease of execution and enhanced workflow between the many sponsorship Stakeholders."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.960"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.960"
                                            },
                                            "Text": {
                                                "val": "The revision of the Professional development model will ensure greater granularity, while providing the ability to capture and report on branch competencies by skill levels. This effort will include provide a backend administrative console for use of management and sustainment, additions and deletions of career\/learning content and related competencies.  The automated Individual Development Plan in ACT does not support the continuous interaction between the supervisor and employee as a living document.  As we transition to DoD Performance Management and Appraisal Program (DPMAP), these required enhancements to the ACT system will assist in keeping a strong connection between performance management and employee development.  Currently the Sergeant Major Management Office (SMMO) does not have an enterprise level leader development tool for accurate display management of KSAs at the personnel or position level.  Exportable Life Long Learning Profile is needed in collaboration with each individual, identify employment, education, and training opportunities which will extend their talents and optimize their performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Criminal Information Management System (CIMS)"
                                    },
                                    "Description": {
                                        "val": "CIMS formerly known as the Law Enforcement Advisory Program (LEAP), is a collection of mission essential information technology (IT) systems within the Criminal Investigation Command (CIDC) and the Office of the Provost Marshal General (OPMG). Thru the CIMS, USACIDC and OPMG developed an integrated and unified, comprehensive enterprise program \/ system that  houses Classified and Unclassified - Law Enforcement Sensitive (LES) data, leveraging existing and future Army LE enterprise information technology (IT) assets and other external data sources providing a full range of law enforcement functions to support business objectives and mission.  The primary component is a comprehensive enterprise system, known as the Army Law Enforcement Reporting and Tracking System (ALERTS), provides US Army Law Enforcement stakeholders the enhanced capability to rapidly and efficiently manage a variety of Law Enforcement and criminal intelligence (CrimIntel) functions; as well as a broader range of senior executive reporting requirements. RDT&E dollars are required to further enhance ALERTS and other CIMS systems to continue the consolidation\/rationalization of LE applications, and to give the LE community the tools to more quickly investigate, solve, and prevent Army crime."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.254"
                                            },
                                            "Text": {
                                                "val": "FY17 funds will be used in the research and development of the LEAP Database and to increase and improve law enforcement data sharing in the Army Law Enforcement Community"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.361"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.361"
                                            },
                                            "Text": {
                                                "val": "FY18 funds will continue to develop the Database and to increase and improve law enforcement data sharing in the Army Law Enforcement Community.  FY18 RDT&E dollars are required to further enhance ALERTS, COPS and other CIMS systems to continue the consolidation\/rationalization of Law Enforcement applications, and to give the law enforcement community the tools to more quickly investigate, solve, and prevent Army crime."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Educational Outreach Initiative"
                                    },
                                    "Description": {
                                        "val": "Defense Forensic Science Center requires funding for educational outreach initiatives including internship positions at the undergraduate, graduate, and doctoral candidate levels. Defense Forensic Science Center was designated as the leader for forensic science disciplines (DAPM Memo 4 Oct 2011). This memorandum states that the DFSC will establish a forensic RDT&E program that provides the integration of joint operational research, including procedures for establishing customer requirements, and identifying gaps and needs that lead to RDT&E priorities. The program includes developing a scholarly environment across the Defense Forensic Enterprise through the use of educational partnerships, internships and fellowships to facilitate participation in RDT&E projects.  The Educational Outreach program will provide an opportunity for students to contribute to forensic science research and influence shared research priorities across the forensic science communities, while supporting the DFSC and laboratory operations. Through the internship program, a variety of innovative research will be conducted that supports research capabilities across the entire range of military operations including traditional, expeditionary (forward deployed laboratories), and reach-back operations."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.156"
                                            },
                                            "Text": {
                                                "val": "FY17 funds will be used to explore 7 innovative internship positions at the undergraduate, graduate, and doctoral candidate levels. Through this startup program interns would provide an invaluable contribution to forensic research…"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Financial Integrated Reporting Environment (FIRE)"
                                    },
                                    "Description": {
                                        "val": "FIRE supports the funding and manpower required to accomplish ARDEC’s reimbursable workload. RDTE is required to develop and expand the system as an enterprise solution across all AMC reimbursable activities. This strategy is in line with existing Army Portfolio Management System (APMS) and Business Enterprise Architecture (BEA) Objectives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.009"
                                            },
                                            "Text": {
                                                "val": "blank"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.569"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.569"
                                            },
                                            "Text": {
                                                "val": "Continue funding development work to expand the system as an enterprise solution across all AMC reimbursable activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research & Development Identified through the Broad Agency Announcement Initiative"
                                    },
                                    "Description": {
                                        "val": "The Defense Forensic Science Center (DFSC) requires funds to coordinate the execution of forensic research projects that will enhance the capability of forensic science applications for DoD customers both in traditional law enforcement\/criminal justice purviews and in expeditionary environments. The DFSC staff will manage federally funded research and development contracts identified through a two year rolling Broad Agency Announcement (BAA) procedure. The BAA is issued under the provisions of paragraph 6.102(d) (2) of the Federal Acquisition Regulation (FAR), which provides for the competitive selection of proposals.  Research proposals submitted in response to this BAA and selected for award are considered to be the result of full and open competition and in full compliance with the provisions of Public Law 98-369, \"The Competition in Contracting Act of 1984\" and subsequent amendments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.340"
                                            },
                                            "Text": {
                                                "val": "FY17 funds will provide for new forensic research and testing of new technology.  Funds will assist the Defense Forensic Science Center to comply with DODD 5205.15E"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Language Software Upgrade"
                                    },
                                    "Description": {
                                        "val": "Modify the Universal Course Authoring Tool (UCAT). This tool will enable the curriculum development department to author new curricula without having to program in HTML. The tool will do the programming automatically in the proper format for online viewing.  There will also be programming support to develop and convert existing online material into the current formats for use with all mobile devices regardless of the operating system used."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.150"
                                            },
                                            "Text": {
                                                "val": "Base FY 2017 Description: Modify the Universal Course Authoring Tool (UCAT). This tool will enable the curriculum development department to author new curricula without having to program in HTML. The tool will do the programming automatically in the proper format for online viewing.  There will also be programming support to develop and convert existing online material into the current formats for use with all mobile devices regardless of the operating system used."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.379"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.379"
                                            },
                                            "Text": {
                                                "val": "Modify the Universal Course Authoring Tool (UCAT). This tool will enable the curriculum development department to author new curricula without having to program in HTML. The tool will do the programming automatically in the proper format for online viewing.  There will also be programming support to develop and convert existing online material into the current formats for use with all mobile devices regardless of the operating system used."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Software Marketplace (ASM)"
                                    },
                                    "Description": {
                                        "val": "ASM will enable the Army to have a centralized location to store software applications and application metadata."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.480"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.480"
                                            },
                                            "Text": {
                                                "val": "User will be able to access application software to perform their mission. ASM will allow the Army to avoid duplicative efforts and excessive cost by creating a standardized environment. ASM will allow the Army to manage software applications and control which users have the ability to download and\/or install software."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Modernize IT legacy systems across Army IT domains by adapting\/improving government off the shelf (GOTS), commercial off the shelf (COTS), and new software development to perform various tasks in a networked environment. These efforts include Army Contract Writing System (ACWS), Army Training Information System (ATIS),Soldier Management System (SMS), Commander's Risk Reduction Dashboard (CRRD), the Army Strategic Readiness Update (ASRU), Law Enforcement Advisory Program (LEAP),Educational Outreach Program, R&D Broad Agency Program, Program Planning Budget Execution (PPBE) - Business Operating System (BOS), Automated Orders and Resources System (AORS), Army Selection Board System (ASBS), Data Base Administration Suite of System (DBA), Enlisted Distribution and Assignment system (EDAS), Enlisted Promotion Model (EPM), Enterprise Service Bus (ESB), Human Resource Command Identity Management System (HIMS), Integrated Total Army Personnel Database (ITAPDB), Officer Selection Support System (OSSS), Reserve Statistics Accounting System\/Reserve Component Common Personnel Data System (RSAS\/RCCPDS), Senior Enlisted Promotions Model (SEPM), Single Evaluation Processing System (SEPS), Soldier Management System Webified Suite of System (SMSWEB), Total Army Personnel Data Base - Active Enlisted (TAPDB-AE), Total Army Personnel Data Base - Active Officer (TAPDB-AO), Total Army Personnel Data Base -Active Reserve (TAPDB-AR), Total Officer Personnel Management Information System (TOPMIS), Total Officer Personnel Management Information System II (TOPMIS II), KEYSTONE Retain System, Army Contract Writing System (ACWS), Army Mapper, and the Interactive Personnel Electronic Records Management System (iPERMS).\n\nACWS strategy is to perform all requisite activities to concurrently develop pre-milestone A\/B documentation and perform pre-solicitation\/source selection activities to meet the USD AT&L timelines for building a contract writing system to replace legacy contract systems to include the Standard Procurement System (SPS).\n\nASMIS-R is comprised of legacy modules (applications) that require modernization to maintain their relevancy to the Army in support of mishap reduction. As stated above, these are primarily related to meeting minimum DoD regulatory requirements related to the collection of mishap information, safety information storage, and resolving inefficiencies in data quality control and information flow.\n\nAdditionally, advances in technology allow for improvements in performance and data integrity that currently are deficiencies in the system. ASMIS-R, in its current state, does not provide any IT (material solution) to the business requirements identified above. The Command has utilized a FFP contract to execute specific Task Orders to develop the tools and products through mid-year FY15. The CRC will be competing a new contract vehicle to support the development of products and tools from midyear FY15 through FY19.\n\nHQDA AG-1 Civilian Personnel (CP) Systems' Acquisition Strategy – The HQDA AG-1 Civilian Personnel (CP) office, Civilian Information Services Division (CISD) Chief and Program Managers will manage these modernization efforts and will utilize the HQDA AG-1 CP's Configuration Control Committee (CCC), Configuration Control Board (CCB), and Integrated Product Teams (IPT) to ensure the appropriate functionality is implemented into OET, CPOL Portal, and FASCLASS.  Development tasks will be performed by AG-1 CP's contractor staff, whose performance is monitored according to the Quality Assurance Surveillance Program. In addition, unit testing and operational testing will be implemented to ensure the new functionality performs as required.  This work will be performed on a firm- fixed- price contract vehicle."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CRRD Program Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Contracting Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rock Island, Il"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.150"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.150"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Army Contract Writing System: The Under Secretary of Defense, Acquisition, Technology and Logistics directed that the Standard Procurement System (SPS) be decommissioned by FY17. In order for the Army to meet appropriate legislative mandates, the new capability will provide improved functionality in general contract writing and contract administration while seamlessly operating in the NIPR, SIPR, CONUS, OCONUS, and in low\/no bandwidth environments. In addition, the replacement capability will produce data that is trackable and auditable by the Army designated finance account system(s) and will be in compliance with the Secretary of Defense’s mandate for implementing internal controls to facilitate full financial audit readiness and accountability.\nArmy Training Information System (ATIS) is an enterprise system that will provide a common operational picture of the training environment through integrated, interoperable training development, management, scheduling, and delivery capabilities.  These capabilities will enable commanders, leaders, soldiers, and civilians to better understand, visualize, describe, direct, lead and assess training requirements so they can more effectively plan, prepare, execute, and assess training. End result is an ATIS that enables soldiers to train as they fight so they can effectively fight as they have trained. \n\nAdapt\/improve\/install\/field government off the shelf (GOTS), commercial off the shelf (COTS), and new software to perform various tasks in a networked environment such as data warehousing, force management, personnel, installation and environmental databases and applications to support Business System Transformation and Installation Management, to include Commander's Risk Reduction Dashboard.\n\nThe Army Human Resources Command (HRC) has several efforts for which RDT&E will be applied.  One is to prepare those systems for subsumption into the Integrated Personnel and Pay System(IPPS-A).  The other is to disconnect and upgrade those systems not being subsumed by IPPS-A. Systems that will be targeted by HRC to prepare for IPPS-A subsumption or upgrade are the Automated Orders and resources System (AORS), Army Selection Board System (ASBS), Data Base Administration Suite of System (DBA), Enlisted Distribution and Assignment system (EDAS), Enlisted Promotion Model (EPM), Enterprise Service Bus (ESB), Human Resource Command Identity Management System (HIMS), Integrated Total Army Personnel Database (ITAPDB), Officer Selection Support System (OSSS), Reserve Statistics Accounting System\/Reserve Component Common Personnel Data System (RSAS\/RCCPDS), Senior Enlisted Promotions Model (SEPM), Single Evaluation Processing System (SEPS), Soldier Management System Webified Suite of System (SMSWEB), Total Army Personnel Data Base - Active Enlisted (TAPDB-AE), Total Army Personnel Data Base - Active Officer (TAPDB-AO), Total Army Personnel Data Base - Active Reserve (TAPDB-AR), Total Officer Personnel Management Information System (TOPMIS), Total Officer Personnel Management Information System II (TOPMIS II), Keystone Request\/Retain System, and the Interactive Personnel Electronic Records Management System (iPERMS).\nCriminal Information Management System (CIMS): CIMS formerly known as the Law Enforcement Advisory Program (LEAP), is a collection of mission essential information technology (IT) systems within the Criminal Investigation Command (CIDC) and the Office of the Provost Marshal General (OPMG). Thru the CIMS, USACIDC and OPMG developed an integrated and unified, comprehensive enterprise program \/ system that  houses Classified and Unclassified - Law Enforcement Sensitive (LES) data, leveraging existing and future Army LE enterprise information technology (IT) assets and other external data sources providing a full range of law enforcement functions to support business objectives and mission.  The primary component is a comprehensive enterprise system, known as the Army Law Enforcement Reporting and Tracking System (ALERTS), provides US Army Law Enforcement stakeholders the enhanced capability to rapidly and efficiently manage a variety of Law Enforcement and criminal intelligence (CrimIntel) functions; as well as a broader range of senior executive reporting requirements. RDT&E dollars are required to further enhance ALERTS and other CIMS systems to continue the consolidation\/rationalization of LE applications, and to give the LE community the tools to more quickly investigate, solve, and prevent Army crime.\nEducational Outreach Initiative:  Defense Forensic Science Center requires funding for educational outreach initiatives including internship positions at the undergraduate, graduate, and doctoral candidate levels. Defense Forensic Science Center was designated as the leader for forensic science disciplines (DAPM Memo 4 Oct 2011). This memorandum states that the DFSC will establish a forensic RDT&E program that provides the integration of joint operational research, including p"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PRODUCT DEVELOPMENT FOR KEYSTONE RETAIN SYSTEM, i-PERMS PRODUCT DEVELOPMENT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "M&RA\/G-1"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "ARLINGTON, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.570"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.570"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PPBOS PRODUCT DEVELOPMENT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OAA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FORT BELVOIR, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "23.230"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.230"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development for ACWS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO EIS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "41.644"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.097"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ATIS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO EIS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT Eustice VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.845"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15.670"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.722"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.722"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CRRD"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.818"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.818"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "The Army Safety and Health Management System"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.692"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.846"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.465"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.465"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Army Career Tracker"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "IBM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.580"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.748"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.960"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.960"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Army Business System Modernization Initiatives"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.679"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.036"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.413"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.837"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.837"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CIMS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ACC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "NCR"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.003"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.254"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.254"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.254"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.511"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Educational Outreach Initiative:"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DFSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FT Gillem"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.156"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.156"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.156"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.312"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Research & Development Identified through the Broad Agency Announcement Initiative"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DFSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Gillem"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.340"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.340"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.340"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.680"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Defense Language Software Upgrade"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.878"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.150"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.379"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.379"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.407"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Army Software Marketplace (ASM)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO EIS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.480"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.480"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.480"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "IPPS-A SUPPORT COSTS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "HRC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FORT KNOX, KY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.357"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.357"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HRC SYSTEMS\nKEYSTONE, IPERMS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "HRC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "FORT KNOX, KY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.385"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.385"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Law Enforcement Advisory Program(LEAP)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ACC\/NCR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Quantico, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.677"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ARMY MAPPER"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.220"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.220"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "The Army Safety and Health Management System (FIRE)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ARMY Contracting Command"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rock Island, IL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.655"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.655"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.655"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-76.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "ACWS Product Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ATIS Product Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CRRD Product Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ASHMS Product Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ACT Prduct Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army Business System Modernization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Army Software Marketplace (ASM)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Army Contract Writing System moves to 0605047 FY17."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VR3"
                    },
                    "ProjectTitle": {
                        "val": "ASMIS-R (REPORTIT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.598"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.598"
                        },
                        "BudgetYearTwo": {
                            "val": "3.027"
                        },
                        "BudgetYearThree": {
                            "val": "3.099"
                        },
                        "BudgetYearFour": {
                            "val": "3.162"
                        },
                        "BudgetYearFive": {
                            "val": "3.260"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.146"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This funding line is not a new start in FY 2018. Army Safety Management Information System - Revised (ASMIS-R) funding has been realigned from PE 0605013, Project T05 to PE 0605047, Project VR3 in FY 2018"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Army Safety and Health Management System (ASHMS) initiative provides a framework of people, processes and technology to synchronize, integrate and optimize Army Safety and Occupational Health (SOH) capabilities to reserve war fighting capabilities and enhance the force by providing a safe and healthy environment for Soldiers, Families, Civilians, and contractors. An analysis of Army SOH Doctrine, Organization, Training, Materiel, Leadership and education, Personnel, Facilities and Policies (DOTMLPF-P) determined that the Army Safety Management Information System – Revised (ASMIS-R), a Defense Business System, is currently not able to satisfy current and emerging ASHMS capability requirements without modernization to resolve these capability gaps. Changes in requirements for the Army Safety and Health Management System (Programmatic) related to DoDI 6055.01, AR 385-10, Information Assurance requirements and direct feedback from the Safety professionals within the DoD and the Army have resulted in the need for changes in associated business processes. Additionally, a business gap analysis performed by the DASA(ESOH) revealed a deficiency in the system's requirements that would support Army Commands in identifying hazards in the work place, determining hazard mitigation strategies and controls, employing these strategies and controls, and measuring their potential for reducing mishaps. Addressing these problems will have an immediate and direct impact on meeting regulatory requirements, improving data integrity, improving information assurance posture (compliance), increasing the Army's ability to reduce mishaps across the force structure, and promoting Army Force Generation (ARFORGEN) capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ASMIS-R Development"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.598"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.598"
                                            },
                                            "Text": {
                                                "val": "FY18 funds are being used to continue development of ASMIS-R products and tools."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "ASMIS-R is comprised of legacy modules (applications) that require modernization to maintain their relevancy to the Army in support of mishap reduction. As stated\nabove, these are primarily related to meeting minimum DoD regulatory requirements related to the collection of mishap information, safety information storage, and\nresolving inefficiencies in data quality control and information flow.\n\nAdditionally, advances in technology allow for improvements in performance and data integrity that currently are deficiencies in the system. ASMIS-R, in its current state,\ndoes not provide any IT (material solution) to the business requirements identified above. The Command has utilized a FFP contract to execute specific Task Orders\nto develop the tools and products through mid-year FY15. The CRC will be competing a new contract vehicle to support the development of products and tools from\nmidyear FY15 through FY19."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}