{
    "id": "2018-AirForce-PB-3600-JBOOK-4677b7373ceb5a2af4f54ac9946d42727733735517b0c06be4cbaa3f97502e4b-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3B-U_RDTE_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0301017F"
        },
        "ProgramElementTitle": {
            "val": "Global Sensor Integrated on Network (GSIN)"
        },
        "R1LineNumber": {
            "val": "218"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.803"
            },
            "CurrentYear": {
                "val": "3.470"
            },
            "BudgetYearOne": {
                "val": "3.549"
            },
            "BudgetYearOneBase": {
                "val": "3.549"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "3.606"
            },
            "BudgetYearThree": {
                "val": "3.674"
            },
            "BudgetYearFour": {
                "val": "3.737"
            },
            "BudgetYearFive": {
                "val": "3.814"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.974"
                },
                "CurrentYear": {
                    "val": "3.470"
                },
                "BudgetYearOne": {
                    "val": "3.539"
                },
                "BudgetYearOneBase": {
                    "val": "3.539"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.803"
                },
                "CurrentYear": {
                    "val": "3.470"
                },
                "BudgetYearOne": {
                    "val": "3.549"
                },
                "BudgetYearOneBase": {
                    "val": "3.549"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.171"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.010"
                },
                "BudgetYearOneBase": {
                    "val": "0.010"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.171"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.010"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.010"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675368"
                    },
                    "ProjectTitle": {
                        "val": "GSIN (Global Integrated Sensor Network)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.803"
                        },
                        "CurrentYear": {
                            "val": "3.470"
                        },
                        "BudgetYearOne": {
                            "val": "3.549"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.549"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.606"
                        },
                        "BudgetYearThree": {
                            "val": "3.674"
                        },
                        "BudgetYearFour": {
                            "val": "3.737"
                        },
                        "BudgetYearFive": {
                            "val": "3.814"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of USSTRATCOM is to establish and provide full-spectrum, global strike, coordinated space and information operations capabilities to meet both deterrent and decisive national security objectives and to provide operational space support, integrated missile defense, Global Command Control, Communications, and Computers Intelligence Surveillance and Reconnaissance (C4ISR), and specialized planning expertise to the joint warfighter.\n\nGSIN directly supports the above mission.  It nets together selected systems and sensors (from tactical to strategic), including the Nation's most modern and capable assets, taking advantage of their larger numbers, improved algorithms, mobility, and forward deployment to provide earlier cross-cueing and expanded decision space when every second counts. Using these traditionally stove-piped systems and sensors, GSIN enables the warfighter in several ways. First it will enable creation of a User Defined Operating Picture (UDOP) to provide a single, unambiguous missile event picture allowing real-time collaboration for nuclear C2 and improved senior leader situational awareness (SA) for effective decision-making. Secondly, it will improve Space Situational Awareness (SSA) by tapping additional sensor capability. Finally, GSIN will dramatically improve the ingestion of non-traditional, but readily available non-US government and commercial data to the space catalog.\n\nThe Nation's strategic C2,sensors, and mission planning programs cannot rapidly exchange information across multiple missions creating ambiguity that delays time critical national C2 decision making processes. GSIN will develop and establish a unified schema that will integrate disparate Missile Warning\/Missile Defense (MW\/MD) data into a single exposed data set providing redundant and unambiguous MW\/MD data to national leadership. GSIN also enables existing sensors to provide data in net-centric formats consumable by other authorized systems and mission areas, thus reducing the need to acquire more sensors. Activities also include studies and analysis to support both current program planning, execution, and future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GSIN Sensor Data Exposure:  MASINT, other technical intelligence and Allied Systems"
                                    },
                                    "Description": {
                                        "val": "Non traditional Data Pre Processor (NDPP): Designs, develops, exposes and integrates Space Situational Awareness (SSA) data from Commercial, Owner-Operator, and Allied non-traditional sensors into space production systems and Space Catalog via the Global Information Grid. Develops implementation plans to mature data exposure capabilities. Army Navy Transportable Radar (AN\/TPY-2): Designs, develops, tests, exposes, and integrates SSA data from the missile defense AN\/TPY-2 sensor into space production systems and the Global Information Grid. Develops implementation plans to mature data exposure capabilities. Measurement and Signals (MASINT)\/Technical Intelligence (TI): Designs, develops, exposes, and integrates data from MASINT and Technical Intelligence sensors in regions of the world where we currently do not have coverage. Provides near real time data from sensors that previously reported hours or days after events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.236"
                                            },
                                            "Text": {
                                                "val": "- Tested and fielded NDPP to enable outbound SSA data sharing and make data available to authorized users for consumption. Integrate with Joint Space Operations Center (JSpOC)Mission System (JMS)                              \n- Began development and testing of SSA Data Sharing Strategy to enhance NDPP \n- Finalized development of TPY-2 and begin testing of the exposure of SSA data from the missile defense AN\/TPY-2 sensor                                      \n- Continued development of C2BMC SSA capability, to include development of Net Centric Command and Control capability to enable exposure of PACOM, CENTCOM, and EUCOM data via C2BMC, providing them with same capability as NORTHCOM\/PACOM  \n- Began exposure of MASINT Phase 2"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.635"
                                            },
                                            "Text": {
                                                "val": "- Continue development and deployment of MASINT\/Allied Project 2.  Prep the community and begin design and deployment MASINT\/Allied System Project 3.\n- Determine feasibility in integrating LRDR effort into GSIN supporting the SSA Mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.664"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.664"
                                            },
                                            "Text": {
                                                "val": "- Enter Operational testing and Full Operational Capability (FOC) for MASINT\/Allied sensors project 2.  \n- Continue development to exposure data for MASINT\/Allied system project 3. \n- Prep the community to begin MASINT\/Allied System project 4."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GSIN Data Integration: Launch Characterization Data Services Net Centric Data Integration Schema Configuration Control Technical Outreach"
                                    },
                                    "Description": {
                                        "val": "Develop common XML net-enabled data schemas and configuration management processes and procedures for Missile Warning, Missile Defense, Space, MASINT\/Technical Intelligence, and Sensor data to manage the XML schema and associated XML messaging and services. Develop technical outreach for potential new GSIN data consumers and providers who require GSIN sensor data. Upgrade GSIN capabilities as DISA Enterprise Services evolve. Continue modifications to data services. Support integration of GSIN sensor data into appropriate registries\/catalogs. Continue development of GSIN data services to enable visualization in a common operating picture. Conduct studies and demonstrations of SSA capabilities, data correlation, launch event characterization and assessment services for risk reduction evaluations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.567"
                                            },
                                            "Text": {
                                                "val": "- Developed common XML net-enabled data schemas to integrate additional sensor data, and continued to develop configuration control processes, technical outreach processes for new GSIN data consumers and providers.\n- Upgraded GSIN capabilities as DISA Enterprise Services evolve.\n- Continued modifications to data services.\n- Began design and development of MASINT Phase 2.\n- Test and delivery schema to correspond to NDPP delivery (Spiral 3), and begin initial schema updates\/development for TPY-2 SSA capability (Spiral 4)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.835"
                                            },
                                            "Text": {
                                                "val": "- Complete and deliver Common XML net-enabled schemas. \n- Continue developing and releasing periodic configuration control processes. \n- Continue technical outreach processes for new GSIN data consumers and providers. \n- Deliver new GSIN capabilities to match evolving DISA Enterprise Service updates. \n- Continue development of new and improved data services. Continued development and deployment of MASINT Phase 2 (including operational testing and fielding activities). \n- Complete and test schema changes for TPY-2 SSA and data service updates (TPY-2 Spiral 4).\n- Comple development and deployment of Exercise Scenario Data Editor  (ESDE)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.885"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.885"
                                            },
                                            "Text": {
                                                "val": "- Will develop and deliver Common XML net-enabled schemas. \n- Will continue developing and releasing periodic configuration control processes. \n- Will continue technical outreach processes for new GSIN data consumers and providers. \n- Will deliver new GSIN capabilities to match evolving DISA Enterprise Service updates. \n- Will continue development of new and improved data services. \n- Will complete development of MASINT Project 3 (including operational testing and fielding activities). \n- Will complete and test schema changes for TPY-2 SSA and data service updates (TPY-2 Spiral 4)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "GSIN uses existing government contract vehicles (from agencies such as Missile Defense Agency (MDA) or Air Force Life Cycle Management Center (AFLCMC)) to develop and modernize the combined Space Situational Awareness\/Missile Warning\/Missile Defense data exposure architecture and solution.  The contracts are managed by the relevant organizations contracting office.  GSIN does not award or manage any contracts.\n\nThe Air Force Life Cycle Management Center at Hanscom AFB, (AFLCMC\/HB) provides necessary program management, financial management, and other support as may be applicable for GSIN."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}