{
    "id": "2018-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-950a5746320338933f77ee67f04c39e5d4c40144f8c92626c879d6e287c1655c-12",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603766E"
        },
        "ProgramElementTitle": {
            "val": "NETWORK-CENTRIC WARFARE TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "58"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "411.060"
            },
            "CurrentYear": {
                "val": "428.894"
            },
            "BudgetYearOne": {
                "val": "439.386"
            },
            "BudgetYearOneBase": {
                "val": "439.386"
            },
            "BudgetYearTwo": {
                "val": "420.714"
            },
            "BudgetYearThree": {
                "val": "388.717"
            },
            "BudgetYearFour": {
                "val": "347.781"
            },
            "BudgetYearFive": {
                "val": "339.315"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Network-Centric Warfare Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to develop and rapidly mature advanced technologies and systems required for today's network-centric warfare concepts.  It is imperative for the future of the U.S. forces to operate flawlessly with each other, regardless of which services and systems are involved in any particular mission.  The overarching goal of this program element is to enable technologies at all levels, regardless of service component, to operate as one system.\n\nThe objective of the Joint Warfare Systems project is to create enabling technologies for seamless joint operations, from strategic planning to tactical and urban operations.  Joint Warfare Systems leverage current and emerging network, robotic, and information technology and provide next generation U.S. forces with greatly expanded capability, lethality, and rapid responsiveness.  Critical issues facing this project are:  (1) U.S. opponents utilizing systems that are flexible, robust, and difficult to neutralize; and (2) U.S. doctrine that limits the use of firepower to lessen the impact of operations on noncombatants.  These problems are magnified in urban and semi-urban areas where combatants and civilians are often collocated, and in peacekeeping operations where combatants and civilians are often indistinguishable.  Meeting these challenges places a heavy burden on joint war planning.  Understanding opponent networks is essential so that creative options can be developed to counter their strategies.  Synchronization of air and ground operations to apply force only where needed and with specific effects is required.  \n\nThe Maritime Systems project will identify, develop and rapidly mature critical advanced technologies and system concepts for the naval forces' role in today's network centric warfare concept.  Improvements in communications between and among submarines, surface ships and naval aircraft have allowed these forces to operate seamlessly with each other and with other Service's network centric systems.  Naval forces will play an ever-increasing role in network centric warfare because of their forward deployed nature, their unique capability to operate simultaneously in the air, on the sea and under the sea and their versatile ability to provide both rapid strike and project-sustained force.  The technologies developed under this project will capitalize on these attributes, improve them and enable them to operate with other network centric forces."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "425.861"
                },
                "CurrentYear": {
                    "val": "428.894"
                },
                "BudgetYearOne": {
                    "val": "410.027"
                },
                "BudgetYearOneBase": {
                    "val": "410.027"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "411.060"
                },
                "CurrentYear": {
                    "val": "428.894"
                },
                "BudgetYearOne": {
                    "val": "439.386"
                },
                "BudgetYearOneBase": {
                    "val": "439.386"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-14.801"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "29.359"
                },
                "BudgetYearOneBase": {
                    "val": "29.359"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-7.394"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.407"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "29.359"
                                },
                                "BudgetYearOneBase": {
                                    "val": "29.359"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.  \nFY 2017:  N\/A\nFY 2018:  Increase reflects expansion of classified programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "NET-01"
                    },
                    "ProjectTitle": {
                        "val": "JOINT WARFARE SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.762"
                        },
                        "CurrentYear": {
                            "val": "72.916"
                        },
                        "BudgetYearOne": {
                            "val": "67.114"
                        },
                        "BudgetYearOneBase": {
                            "val": "67.114"
                        },
                        "BudgetYearTwo": {
                            "val": "114.914"
                        },
                        "BudgetYearThree": {
                            "val": "155.974"
                        },
                        "BudgetYearFour": {
                            "val": "195.958"
                        },
                        "BudgetYearFive": {
                            "val": "192.992"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The objective of the Joint Warfare Systems project is to create enabling technologies for seamless joint operations, from strategic planning to tactical and urban operations.  Joint Warfare Systems leverage current and emerging network, robotic, and information technology and provide next generation U.S. forces with greatly increased capability, lethality, and rapid responsiveness.  Critical issues facing this project are: (1) U.S. opponents using systems that are flexible, robust, and difficult to neutralize; and (2) U.S. doctrine that limits the use of firepower to lessen the impact of operations on noncombatants.  These problems are magnified in urban and semi-urban areas where combatants and civilians are often co-located and in peacekeeping operations where combatants and civilians are often indistinguishable.  Meeting these challenges places a heavy burden on joint war planning.  Understanding opponent networks is essential so that creative options can be developed to counter their strategies.  Synchronization of air and ground operations to apply force only where needed and with specific effects is required.  This project supports all levels of the force structure including: (1) the strategic\/operational level by generating targeting options against opponents' centers of gravity that have complex networked relationships; (2) the tactical\/operational level by managing highly automated forces with tight coupling between air and ground platforms; and (3) the focused tactical level by developing platforms and tools, which acquire targets of opportunity and cue network-based analysis of likely enemy operations thus maximizing the effectiveness of ground forces in stability and support operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System of Systems Integration Technology and Experimentation (SoSite)"
                                    },
                                    "Description": {
                                        "val": "The System of Systems Integration Technology and Experimentation (SoSite) program seeks to implement an architecture framework capable of assessing and demonstrating potential operational benefits of integrating various system capabilities to improve mission success in contested environments.  Such assessments would optimize system-level trades of requirements and architectures to properly leverage an integrated set of system characteristics and capabilities.  The demonstration assessment metrics will measure individual and combined system performance to further streamline resource allocation to maximize operational impact.  In addition, providing a modeling and simulation (M&S) environment to assess complex systems will enable greater utility of emerging system technologies, since they can be assessed in near-real-world simulations without the real-world costs of testing fully integrated systems.  The program will also develop system synthesis and integration technologies that enable rapid assimilation of new and off-the-shelf technologies into the system of systems architecture.  These technologies will break down current barriers to entry that new technologies face in system of systems using formal methods, compositional reasoning, and automated design space exploration.  Technologies from this program will be transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.109"
                                            },
                                            "Text": {
                                                "val": "-  Completed development of architecture demonstration plan, including range and platform options.\n-  Developed a System Integration Laboratory (SIL) to support Government verification and validation of system of systems architectures.\n-  Completed the development of system of systems synthesis and integration tools and protocols.\n-  Completed prototype architecture designs to implement the system of systems concept.\n-  Initiated experimentation in constructive and virtual environments to validate system of systems approach.\n-  Verified prototype of system of systems architectures in M&S environments.\n-  Identified the most promising alternative systems architectures, designs, tools, and protocols for the maritime environment.\n-  Explored system architectures for interdiction of small, unmanned aerial systems in complex urban environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.741"
                                            },
                                            "Text": {
                                                "val": "-  Prepare detailed live flight experimentation plans establishing system of systems risk reduction test objectives, experiment designs, required test articles and experiment support assets, and analysis plans.\n-  Secure test articles for offensive counter-air flight test experiments: manned and unmanned platforms, and experimental mission systems from DARPA and Service Science and Technology programs.\n-  Secure or develop models of test articles to support laboratory and ground checkout prior to live flight.\n-  Secure support assets required for flight test experiments:  ranges and range instrumentation, frequency and airspace authorizations, pilots, virtual and constructive simulation facilities.\n-  Conduct virtual integration and laboratory checkout of system of systems architectures using test article models to verify those architectures will satisfy risk reduction experimentation objectives.\n-  Integrate test articles into system of systems architectures and conduct ground checkout prior to live flight.\n-  Conduct experiments of system of systems architectures for offensive counter air missions in live flight, augmented with virtual and constructive simulation of test articles not ready for live flight; analyze experiment outcomes and document accomplishment of risk reduction objectives.\n-  Develop a System Integration Laboratory (SIL) to support Government verification and validation of system of systems architectures.\n-  Assess in SIL the capability of new formal verification techniques and engineering tools to validate integration of constituent systems into a system of systems.\n-  Develop technologies to facilitate multi-level open architecture security M&S."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.771"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.771"
                                            },
                                            "Text": {
                                                "val": "-  Secure test articles for mobile target strike flight test experiments: manned and unmanned platforms, and experimental mission systems from DARPA and Service Science and Technology programs.\n-  Demonstrate the capability of new engineering tools to validate system of systems architecture designs prior to live flight experiments.\n-  Demonstrate the capability of formal verification techniques to validate integration of constituent systems into a system of systems prior to live flight experiments.\n-  Conduct experiments of system of systems architectures for mobile target strike missions in live flight integrated with architectures for offensive counter-air, augmented with virtual and constructive simulation of test articles not ready for live flight; analyze experiment outcomes and document accomplishment of risk reduction objectives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resilient Synchronized Planning and Assessment for the Contested Environment (RSPACE)"
                                    },
                                    "Description": {
                                        "val": "Currently, Command and Control (C2) of air platforms is a highly centralized process operating largely independently across planning domains (Intelligence, Surveillance, and Reconnaissance (ISR), strike, and spectrum management) and is optimized for a permissive environment.  To address the challenges faced in today's increasingly contested environments, the Resilient Synchronized Planning and Assessment for the Contested Environment (RSPACE) program will develop tools and models to enable distribution of planning functions across the C2 hierarchy for resilience (e.g., loss of communications) while synchronizing strike, ISR, and spectrum planning to maximize the contribution of all assets through increased utilization and exploitation of synergies.  The program will develop tools supporting a mixed initiative planning approach, maximizing automation according to operator's choice, and enabling human-in-the-loop intervention and modification, as well as tactical decision aids for maritime commanders and planners to build and assess courses of action (COAs) for fleet and ship movements and the employment of counter-Intelligence, Surveillance, and Reconnaissance (ISR) techniques.  During execution, the tools will provide lifecycle tracking of targeting and information needs and support assessment of progress towards achieving the commander's intent.  The tools will dynamically respond as directed to ad hoc requests and significant plan deviations via a real-time dynamic replanning capability, and easily adapt to technology refreshes.  The RSPACE tools will transition to the Air Force and the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.429"
                                            },
                                            "Text": {
                                                "val": "-  Completed initial development of algorithms and prototypes for distributed planning and assessment components.\n-  Developed models and simulation capability for testing, analysis, and validation of a distributed system operating in a communications-challenged environment.\n-  Implemented the framework designs into a software prototype.\n-  Tested and evaluated candidate software frameworks and components.\n-  Commenced development of decision support tools for distributed operational planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.448"
                                            },
                                            "Text": {
                                                "val": "-  Develop experiments to highlight the planning and assessment capabilities in both a distributed and communications-challenged environment.\n-  Continue integration efforts with the prototype framework.\n-  Continue development of planning tools that combine planning for strike, reconnaissance and electronic warfare in a distributed environment.\n-  Continue development of assessment capabilities that automatically track plan execution and alert command and control cells when plans are likely to change.\n-  Demonstrate the ability of small, distributed staffs to plan and manage large-scale operations within an established Air Force modeling and simulation environment.\n-  Develop planning and estimation algorithms and initial prototypes to support the maritime counter-ISR mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.596"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.596"
                                            },
                                            "Text": {
                                                "val": "-  Develop a fully integrated software system prototype to demonstrate a distributed concept of operations.\n-  Conduct one or more live-virtual simulation-based tests in conjunction with a scheduled live Air Force experiment to facilitate transition to the Air Force.\n-  Refine models of ISR and counter-ISR capabilities based on Navy guidance following Pacific Fleet (USPACFLT) experiments.\n-  Refine decision aid algorithms and prototype implementations based on Navy guidance following USPACFLT experiments and guidance from Navy transition program of record.\n-  Conduct multiple simulation-based experiments with USPACFLT to facilitate transition to the Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Retrodirective Arrays for Coherent Transmission (ReACT)"
                                    },
                                    "Description": {
                                        "val": "Worldwide advancements in signal processing and electronics have decreased the effectiveness of single-platform, power-based Electronic Warfare (EW) as a viable technique in the future.  The goal of the Retrodirective Arrays for Coherent Transmission (ReACT) program is to develop and demonstrate the capability to combine distributed mobile transmitters to direct high-power spatially resolved radio frequency (RF) beams to a single location.  ReACT will achieve this capability by synchronizing multiple distributed transmitters to form a much larger effective array than a single aperture.  The key technical challenge is to synchronize distributed and moving transmitters while compensating for platform motion and vibration.  The ReACT system will sense the target's emissions and then optimally configure the ReACT transmitters to focus on the area of interest.  The ReACT program builds upon technology developed under the Arrays at Commercial Timescales (ACT) program, which is budgeted in PE 0602716E, Project ELT-01, and will culminate with a flight demonstration of distributed beamforming.  The ReACT technology is planned to transition to the Air Force and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.224"
                                            },
                                            "Text": {
                                                "val": "-  Completed development of algorithms and hardware for coherent beamforming under mobile environments.\n-  Designed vibration compensation circuit for feedback control.\n-  Identified phenomenological barriers (frequency, motion, and vibration) and validated transition opportunities.\n-  Demonstrated system performance over-the-air in mobile ground environments at extended ranges.\n-  Initiated program transition with the Navy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.727"
                                            },
                                            "Text": {
                                                "val": "-  Design predictive algorithms for broadband channel estimation.\n-  Design control and feedback circuits to track highly mobile targets based on the target's emissions.\n-  Integrate hardware for a dynamic airborne demonstration on multiple aircraft.\n-  Continue modeling and analysis study into maritime applications, and the ground-to-airborne scenario.\n-  Investigate multiple coherent node transition paths with the Air Force.\n-  Integrate tracking algorithms for target motion, preparing for air-to-ground demonstration of capability.\n-  Explore alternative jamming methods against surveillance radars."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.984"
                                            },
                                            "Text": {
                                                "val": "-  Integrate node capabilities onto surrogate airborne transmission platform and hardware.\n-  Operate airborne array at suitable test facility with real world scenario\/environment.\n-  Finalize transition package for Navy technology demonstration group."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems of Systems-Enhanced Small Units (SESU)"
                                    },
                                    "Description": {
                                        "val": "The Systems of Systems-Enhanced Small Units (SESU) program will develop and demonstrate capability to enable a small unit of U.S. forces to prevail when severely over-matched by a much larger adversary force.  SESU-developed capabilities will provide the small unit with better indications and warning of an invasion or attack, the means to deter such an attack, and if the attack occurs, the ability to delay the adversary advance to allow sufficient time for reinforcements.  Technologies to accomplish this will include command, control, & communications (C3) to interoperate with host-nation forces, distributed sensing, including the ability to leverage indigenous information sources, and hybrid effects that include a mix of kinetic, non-kinetic, and information operations capabilities.  A major thrust within the SESU program will be technology to enable manned-unmanned teaming with a focus on C3 and autonomy of the unmanned capabilities without placing an undue burden on the human operators.  SESU technologies will be integrated using systems of systems principles developed under the System of Systems Integration Technology and Experimentation (SoSite) program, also budgeted in this Program Element\/Project.  Testing and experimentation will be conducted with Service partners, and technologies produced by this program will be transitioned to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.363"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.363"
                                            },
                                            "Text": {
                                                "val": "-  Develop baseline mission scenarios and SESU components.\n-  Begin selection of maturing technology and initiate tailoring and integration into system concepts.\n-  Define experimentation plan.\n-  Demonstrate initial technologies in a simulated environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototype Resilient Operations Testbed for Expeditionary Urban Systems of Systems (PROTEUS)"
                                    },
                                    "Description": {
                                        "val": "The Prototype Resilient Operations Testbed for Expeditionary Urban Systems of Systems (PROTEUS) program will demonstrate that dynamically composable systems of systems (SoS) provide superior performance and adaptability in the dynamic, uncertain environment posed on U.S. warfighters by urban combat operations.  PROTEUS will provide the tools and automation to enable small tactical units to compose force packages optimized to specific urban combat objectives and challenges.  These tools will support planning and force composition for all missions relevant to the urban environment:  command & control, fires, maneuver, logistics, intelligence, force protection, and medical.  PROTEUS will be adaptive to an inherently dynamic and fluid environment that will extend to the social complexity of urban combat as well as kinetic warfighting.  Technologies will be integrated using systems of systems principles developed under the System of Systems Integration Technology and Experimentation (SoSite) program, also budgeted in this Program Element\/Project.  To support concept development, testing, and warfighter interaction, the program will also develop a supporting virtual testbed.  Technologies from this program will be transitioned to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.400"
                                            },
                                            "Text": {
                                                "val": "-  Initiate wargaming platform development for company-level and above resolution.\n-  Begin development of initial models for multiple warfighting functions.\n-  Demonstrate against a virtual adversary."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NET-02"
                    },
                    "ProjectTitle": {
                        "val": "MARITIME SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "139.053"
                        },
                        "CurrentYear": {
                            "val": "138.303"
                        },
                        "BudgetYearOne": {
                            "val": "138.112"
                        },
                        "BudgetYearOneBase": {
                            "val": "138.112"
                        },
                        "BudgetYearTwo": {
                            "val": "118.694"
                        },
                        "BudgetYearThree": {
                            "val": "83.543"
                        },
                        "BudgetYearFour": {
                            "val": "97.223"
                        },
                        "BudgetYearFive": {
                            "val": "142.323"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The objective of the Maritime Systems project is to identify, develop, and rapidly mature critical advanced technologies and system concepts for the naval forces role in today's network centric warfare concept.  Improvements in communications between and among submarines, surface ships, and naval aircraft have allowed these forces to operate seamlessly with each other and with other service's network centric systems.  Naval forces will play an ever-increasing role in network centric warfare because of their forward deployed nature, their unique capability to operate simultaneously in the air, on the sea and under the sea, and their versatile ability to provide both rapid strike and project sustained force.  The technologies developed under this project will capitalize on these attributes, improve them, and enable them to operate with other network centric forces."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hydra"
                                    },
                                    "Description": {
                                        "val": "The Hydra program will develop and demonstrate advanced capabilities for the undersea deployment and employment of unique payloads.  Hydra integrates existing and emerging technologies and the ability to be positioned in the littoral undersea battlespace to create a disruptive capability.  The system consists of a modular enclosure with communications, command and control, energy storage, and standard interfaces for payload systems.  The modular enclosures are deployed by various means, depending on the need for speed and stealth, and remain deployed until awakened for employment.  Hydra will develop critical enabling technologies for energy storage and recharging, communications, command and control, deployment, and autonomous operations. Technologies from this program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.931"
                                            },
                                            "Text": {
                                                "val": "-  Started development of prototype modular enclosure.  \n-  Conducted in-water tests of critical components.\n-  Completed preliminary design review for undersea payload.\n-  Completed component testing on undersea payload technologies.\n-  Completed critical design review for air vehicle payload.\n-  Conducted flight tests of the air vehicle.\n-  Conducted air vehicle capsule pop-up tests in water.\n-  Developed alternative deployment method for selected Hydra payloads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.682"
                                            },
                                            "Text": {
                                                "val": "-  Complete development and demonstrate prototype modular enclosure.\n-  Complete a full air vehicle flight test.\n-  Launch air vehicle from undersea.\n-  Build prototype hardware to demonstrate alternative deployment method for selected Hydra payloads.\n-  Build prototype hardware for additional payload experimentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.558"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.558"
                                            },
                                            "Text": {
                                                "val": "-  Continue testing of alternative payload deployment methods, and conduct at-sea demonstration.\n-  Complete testing of undersea-launched air vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Multi Material Rotor Full Scale Demonstration (HyDem)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Hybrid Multi Material Rotor Full Scale Demonstration (HyDem) program is to dramatically improve U.S. Navy submarine superiority.  HyDem will apply breakthroughs in materials and material system technologies, and multi-disciplinary design methods to a Virginia Class submarine propulsor, a critical component in submarine performance.  The U.S. Navy's ability to operate their submarine fleet with improved capability allows for the creation of strategic surprise.  Submarines could exploit expanded areas which were previously unattainable for the purpose of submarine warfare, including antisubmarine warfare (ASW), antisurface warfare (ASuW), intelligence, surveillance and reconnaissance (ISR) gathering, strike, Special Forces operations, and strategic deterrence missions.  The HyDem program will design, manufacture, and supply the Navy with a novel component for integration into a new construction Virginia Class submarine.  The Navy will evaluate this component in sea trials.  It is envisioned that the Navy will integrate this design change into the future development of the Virginia Class and Ohio Replacement submarines, and back-fit previously constructed Virginia Class submarines.  This program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed manufacturing of the full-scale propulsor component.\n-  Assessed structural and shock qualification of the propulsor component.\n-  Completed shock building block testing.\n-  Initiated development of advanced concepts seeking to improve performance and affordability.\n-  Initiated long-term environment exposure monitoring test program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Text": {
                                                "val": "-  Deliver full-scale propulsor component to the Navy for integration into a Virginia Class submarine.\n-  Provide integration support for the propulsor component.\n-  Complete structural building block testing.\n-  Initiate Ohio Replacement technology applicability study.\n-  Complete shock qualification of propulsor component.\n-  Assess advanced concepts using material systems in non-propulsor applications.\n-  Transition long-term environmental exposure monitoring program to the Navy.\n-  Initiate design efforts for an improved full scale component."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete Critical Design Review (CDR)-level design of improved full scale component.\n-  Complete naval shafting applications study.\n-  Deliver a scaled shafting component."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Undersea Network Architecture"
                                    },
                                    "Description": {
                                        "val": "Systems fighting as a network are vulnerable to a loss of connectivity in a contested environment.  This connectivity is important for synchronizing forces, establishing and maintaining situation awareness, and control of remotely operated vehicles and systems.  Additionally, undersea systems are challenged to maintain connectivity and must carry their own energy and operate over their design lifetime with little to no maintenance and repair.  These factors inhibit their use in collaborative networks and prevent the full exploitation of the potential of undersea systems.  By leveraging techniques explored under the Distributed Agile Submarine Hunting (DASH) program budgeted within this PE\/Project, the Tactical Undersea Network Architecture program will overcome these limitations by developing the technologies necessary for autonomous, reliable, and secure undersea data transfers; true plug, play, and operating standards; and rapid, cost effective deployment technologies.  The program will develop and demonstrate novel technology options and designs to temporarily restore connectivity for existing tactical data networks in contested environments using small diameter optical fiber and buoy relay nodes.  The program will focus on innovative system architecture designs, lightweight optical fiber technologies, and rapidly deployable buoy node designs and component technologies.  The Tactical Undersea Network Architecture program will emphasize early risk reduction with future scaled at-sea integrated demonstrations of increasing complexity.  Program technologies will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.742"
                                            },
                                            "Text": {
                                                "val": "-  Evaluated environmental condition's impact on system performance via modeling and simulation.\n-  Completed system architecture design trade studies and preliminary designs.\n-  Continued fiber performance testing; demonstrated fiber survivability under at-sea conditions.\n-  Conducted system-level performance modeling.\n-  Completed component-level testing.\n-  Commenced prototype system design and planning for future sea tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.173"
                                            },
                                            "Text": {
                                                "val": "-  Complete and evaluate prototype system design and review.\n-  Commence system fabrication and integration testing.\n-  Continue at-sea system demonstration planning and coordination.\n-  Demonstrate system architecture and information assurance in a shore-based hardware-in-the-loop simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.973"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.973"
                                            },
                                            "Text": {
                                                "val": "-  Complete prototype fabrication.\n-  Demonstrate at-sea deployment, operation and connectivity.\n-  Complete system integration testing.\n-  Transition interface control and system architecture documentation to Navy.\n-  Perform at-sea networking demonstration to facilitate transition to the Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue Wolf"
                                    },
                                    "Description": {
                                        "val": "Undersea platforms have inherent operational and tactical advantages such as stealth and surprise.  Platform drag due to fluid viscosity and platform powering requirements varies with the speed through the water.  Platform energy and power density limitations create two distinct operational usage profiles: one for unmanned undersea vehicles (low speed, long endurance) and another for undersea weapons (high speed, short endurance).  Designers have historically solved this with hybrid systems such as the Navy's Vertical Launch Anti-Submarine Rocket, or by increasing the size of undersea systems.  However, hybrid systems can be vulnerable to air and undersea defensive systems and larger undersea systems can result in significant launch platform modifications.  The Blue Wolf program seeks to provide a radically different solution to develop and demonstrate an undersea demonstrator vehicle with endurance and speed capabilities beyond conventional undersea systems within the weight and volume envelopes of current Navy undersea systems.  Significant technical challenges to be addressed include: dynamic lift and drag reduction, hybrid energy system development compatible with existing manned platform safety requirements and certification, and system integration and demonstration in at-sea environment.  The program will leverage Navy connectivity, autonomy, guidance, navigation, and obstacle avoidance technologies and culminate in a series of at-sea demonstrations and transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Completed component designs and design reviews.\n-  Commenced module development and fabrication.\n-  Commenced sub-system hardware and software testing and module integration.\n-  Updated system performance models.\n-  Commenced subsystem safety certifications and testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.964"
                                            },
                                            "Text": {
                                                "val": "-  Complete module fabrication and integration.\n-  Continue system at-sea testing.\n-  Complete module and system safety and certification testing and analyses.\n-  Commence at-sea demonstration planning, training, and support preparations.\n-  Complete system integration and checkouts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Conduct at-sea demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Positioning System for Deep Ocean Navigation (POSYDON)"
                                    },
                                    "Description": {
                                        "val": "The Positioning System for Deep Ocean Navigation (POSYDON) program will provide continuous, Global Positioning System (GPS)-level positioning accuracy to submarines and autonomous undersea vehicles (AUVs) in ocean basins over extended periods of time.  Undersea navigation cannot use GPS because the water blocks its signals.  At shallower depths, masts can be raised to receive GPS signals, but masts present a detection risk.  Typically, the alternative to GPS for undersea navigation has been inertial navigation systems (INS), but INS accuracy can degrade unacceptably over time.  Building upon concepts explored under the Distributed Agile Submarine Hunting (DASH) program, budgeted within this PE\/Project, and the Upward Falling Payloads program, PE 0602702E, Project TT-03, the POSYDON program will distribute a small number of acoustic sources, analogous to GPS satellites, around the ocean basin.  A submarine or AUV will be equipped with an acoustic receiver and appropriate software in order to obtain, maintain, and re-acquire, if lost, an initial location.  By transmitting specific acoustic waveforms and developing accurate acoustic propagation models to predict and interpret the complex arrival structure of the acoustic sources, the submarine or AUV can determine its range from each source and thus trilaterate its position.  Technologies developed under this program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.865"
                                            },
                                            "Text": {
                                                "val": "-  Began design and development of algorithms for accurately predicting acoustic signal propagation paths.\n-  Began development of the system concept of operations.\n-  Commenced at-sea experiments to validate analysis using source\/receiver pairs at basin-scale range to measure signal tracking accuracy and stability as well as signal acquisition techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.970"
                                            },
                                            "Text": {
                                                "val": "-  Complete at-sea experiments, data collection, and data analysis.\n-  Design and develop signal waveforms for transmitters and receivers.\n-  Refine the system concept of operations based on data collections from at-sea experiments.\n-  Update ocean models to support real-time ranging.\n-  Conduct multiple at-sea demonstrations of real-time ranging signals in various environments with noise and interference."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.718"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.718"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of user equipment.\n-  Continue development of the acoustic propagation models and signal waveforms.\n-  Complete development of user equipment ocean models to support real-time ranging.\n-  Demonstrate interference mitigation and anti-spoof capabilities.\n-  Demonstrate real-time undersea positioning with an AUV tracking multiple acoustic sources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross Domain Maritime Surveillance and Targeting (CDMaST)"
                                    },
                                    "Description": {
                                        "val": "The Cross Domain Maritime Surveillance and Targeting (CDMaST) program seeks to identify and implement architectures consisting of novel combinations of manned and unmanned systems to execute long-range kill chains and develop a robust \"kill web\" against submarines and ships over large contested maritime areas.  By exploiting promising new developments in unmanned platforms, seafloor systems, and emerging long-range weapon systems, the program will develop an advanced, integrated undersea and above sea warfighting capability.  Building upon research conducted under the System of Systems Integration Technology and Experimentation (SoSite) program (budgeted in PE 0603766E, Project NET-01), the Cross Domain Maritime Surveillance and Targeting (CDMaST) program will establish an analytical and experimental environment to explore architecture combinations in terms of operational effectiveness as well as engineering feasibility and robustness.  The program will leverage enabling technologies needed for command, control, and communication (C3) between physical domains in order to support the architecture constructs.  Through experimentation, the program will not only demonstrate integrated system performance, but also develop new tactics that capitalize on features created by the heterogeneous architecture.  The Cross Domain Maritime Surveillance and Targeting (CDMaST) program will invest in technologies that will reduce cost, manage complexity, and improve reliability.  Technologies from this program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.785"
                                            },
                                            "Text": {
                                                "val": "-  Established modeling and simulation environment to conduct high fidelity mission-level architecture analysis.\n-  Developed baseline analysis scenario."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.558"
                                            },
                                            "Text": {
                                                "val": "-  Develop initial system of systems architectures and initiate comprehensive architecture analysis.\n-  Create preliminary design for system of systems live, virtual, and constructive test bed environment.\n-  Create initial experimentation master plan.\n-  Conduct initial Extra Large Unmanned Undersea Vehicle (XLUUV) payload delivery feasibility analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.669"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.669"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of advanced architectures.\n-  Finalize experimentation master plan.\n-  Complete final design and initiate operation of the live, virtual and constructive test bed environment.\n-  Initiate spiral experimentation and demonstration of the advanced CDMaST architecture.\n-  Perform elemental and engineering tests on selected segments of the CDMaST architecture.\n-  Perform operational tests leading to at-sea demonstrations of CDMaST capability to facilitate transition to the Navy.\n-  Conduct Battle Management and Command and Control (BMC2) analysis to evaluate highly resilient kill chains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Offboard Command, Control and Attack (MOCCA)"
                                    },
                                    "Description": {
                                        "val": "The Mobile Offboard Command, Control and Attack (MOCCA) program seeks to counter the fourth generation submarine signature quieting technology that has significantly degraded passive anti-submarine warfare (ASW) sonar detection range and targeting performance.  The MOCCA program will build on lessons learned under the Distributed Agile Submarine Hunting (DASH) program, budgeted within this PE\/Project, to nullify submarine signature reduction trends with active sonar projectors deployed from a mobile unmanned undersea vehicle (UUV) and cooperatively processed with onboard submarine acoustic receive sonar systems.  The off-board UUV sonar projector will operate, under positive control, at a significant distance from the cooperative submarine using communication links. The program seeks to achieve breakthrough capability for long-range submarine detection and precision target tracking.  The program will develop compact, high output acoustic transducers and novel low probability of intercept\/low probability of detection (LPI\/LPD) communication signaling.  In addition, the MOCCA system will be integrated into submarine onboard sonar and weapons control systems.  This program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.850"
                                            },
                                            "Text": {
                                                "val": "-  Developed conceptual design of hardware and software components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.967"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate designs on compact acoustic projectors, and LPI\/LPD communications link system components.\n-  Develop subsystems for compact high output acoustic projector and LPI\/LPD communications link system.\n-  Commence critical technology testing to evaluate at-sea performance of UUV mobile sonar demonstrating source level and beam control, LPI\/LPD communications waveforms detectability, range performance and data rate, and submarine Bi-static sonar processing algorithms.\n-  Conduct feasibility and system design trade space studies.  Identify UUV size, weight, and power requirements to accomplish mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.394"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.394"
                                            },
                                            "Text": {
                                                "val": "-  Initiate process for approval of temporary system integration into submarine systems for test and evaluation.\n-  Conduct system utility analysis to identify optimal performance specifications for concept of operations under multiple tactical situations.\n-  Develop, evaluate, and select system designs for integrated active sonar and communication system on-board a UUV.\n-  Perform systems integration for active sonar and communication systems into a test UUV platform.\n-  Commence construction of integrated UUV sonar and communication system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hunter"
                                    },
                                    "Description": {
                                        "val": "The Hunter program seeks to develop novel concepts for Extra Large Unmanned Undersea Vehicles (XLUUVs) to deliver complex payloads.  The program will explore efficient encapsulation and buoyancy control concepts to be implemented with advanced fiber handling capabilities for high bandwidth communications in order to create a highly modular and adaptable ocean interface.  This interface will give XLUUVs significantly increased payload handling ability and allow them to deliver completely new capabilities previously delivered only by manned platforms.  Building upon research conducted under the Cross Domain Maritime Surveillance and Targeting (CDMaST) program budgeted in this PE\/Project, the Hunter program will establish a new capability for integration into maritime system of systems warfare architectures.  Technologies developed under the Hunter program will transition to the Navy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop system requirements for the Hunter payload delivery carriage and host vehicle integration. \n-  Complete preliminary system design of the Hunter payload delivery carriage.\n-  Initiate information assurance and anti-tamper analysis of payload delivery system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Exploitation of the Acoustic Channel (TEAC)"
                                    },
                                    "Description": {
                                        "val": "The Tactical Exploitation of the Acoustic Channel (TEAC) program will provide the capability to coherently combine acoustic energy from a distributed network of underwater acoustic sources to improve signal transmission in an undersea environment.  The ability to cohere multiple underwater sensors will have a transformative impact on a number of compelling applications including surveillance, communications, and vehicle positioning.  For all of these applications, coherent sensor gain is currently achieved by deploying large, costly, and cumbersome cabled arrays.  Based on technologies explored in the Mobile Offboard C2 and Attack (MOCCA) program, budgeted in this PE\/Project, the TEAC program will create the opportunity to deploy groups of low unit-cost sources that work cooperatively and semi-autonomously to focus energy undersea.  This concept would provide an extensible, affordable, and flexible method to harness the rapid development of undersea vehicles, ocean energy sources, and new acoustic source technologies. Technologies developed under this program are intended to transition to the Navy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.300"
                                            },
                                            "Text": {
                                                "val": "-  Develop underwater source positioning requirements and identify alignment strategies.\n-  Begin system architecture design and acoustic propagation modeling.\n-  Develop the fixed source network, algorithms, and signal waveforms for at-sea demonstration.\n-  Identify and develop mission concepts for TEAC technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual Acoustic Microphone System (VAMS)"
                                    },
                                    "Description": {
                                        "val": "The Virtual Acoustic Microphone System (VAMS) program will develop additional acoustic sensor capabilities for underwater platforms.  The VAMS program seeks to develop and demonstrate technologies that enable projection of underwater acoustic sensor arrays with performance comparable to existing arrays.  The VAMS approach, however, will allow enabling capabilities that are not currently possible with existing technology.  Expanding on lessons learned from the Distributed Agile Submarine Hunting (DASH) program, budgeted within this PE\/Project, the program will combine novel transmitters with novel signal extraction methods and exploit new and emerging high-speed sensor and processor capabilities.  The VAMS system has the potential to be integrated into a number of underwater platforms.  The acoustic sensor technology developed under the VAMS program will transition to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.600"
                                            },
                                            "Text": {
                                                "val": "-  Evaluated core enabling technologies, including the application of high-speed sensor technology to increase the sensitivity of acoustic detection.\n-  Conducted a series of initial underwater phenomenology experiments to support system analysis and design.\n-  Completed the demonstration of core enabling technologies and applied the results to the design of the initial demonstration system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.489"
                                            },
                                            "Text": {
                                                "val": "-  Complete system design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Agile Submarine Hunting (DASH)"
                                    },
                                    "Description": {
                                        "val": "The diesel-electric submarine is an asymmetric threat in terms of its cost and consequential growth in numbers relative to our legacy maritime platforms.  In addition, these submarines have trended toward lower acoustic signature levels and have grown in lethality.  The Distributed Agile Submarine Hunting (DASH) program's goal was to reverse the asymmetric advantage of this threat through the development of advanced standoff sensing from unmanned systems.  Deep-ocean sonar nodes were developed to operate at significant depths in open ocean areas to achieve large fields of view to detect submarines overhead.  Each deep node is the maritime equivalent of a satellite, and is referred to as a subullite.  The significant field of view, along with the advantage of low-noise phenomena at extreme depths, permitted a scalable number of collaborative sensor platforms to detect and track submarines over large areas.  At-sea demonstrations revealed that the detection capability has been achieved.  The program developed prototype systems that evolved through additional at-sea testing.  These tests demonstrated the ability to integrate into the Navy's undersea systems responsible for anti-submarine warfare (ASW).  The program achieved breakthrough technology for long-range detection and classification, communications, energy management, sensor and platform integration, and robust semiautonomous processing and control for distributed sensing platforms.  DASH technologies have transitioned to the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.780"
                                            },
                                            "Text": {
                                                "val": "-  Conducted at-sea demonstrations of a distributed deep-ocean passive sonar barrier using multiple nodes for extended duration.\n-  Conducted at-sea demonstrations of a mobile active sonar node.\n-  Performed data-driven signal processing development to improve automated sonar detection algorithms.\n-  Provided analysis and data to support Navy utility assessments and studies to aid in transition.\n-  Completed data collection experiments in other significant Navy operational areas to characterize DASH performance.\n-  Continued to explore alternate techniques for long-range submarine detection and precision target tracking.\n-  Conducted sea testing with the Navy in operationally relevant environments.\n-  Participated in major fleet prototype operational experimentation and assessment of the DASH system supporting transition activities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NET-06"
                    },
                    "ProjectTitle": {
                        "val": "NETWORK-CENTRIC WARFARE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "212.245"
                        },
                        "CurrentYear": {
                            "val": "217.675"
                        },
                        "BudgetYearOne": {
                            "val": "234.160"
                        },
                        "BudgetYearOneBase": {
                            "val": "234.160"
                        },
                        "BudgetYearTwo": {
                            "val": "187.106"
                        },
                        "BudgetYearThree": {
                            "val": "149.200"
                        },
                        "BudgetYearFour": {
                            "val": "54.600"
                        },
                        "BudgetYearFive": {
                            "val": "4.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "212.245"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "217.675"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "234.160"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "234.160"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}