{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-18",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603618D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Electronic Advanced Technology"
        },
        "R1LineNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.667"
            },
            "CurrentYear": {
                "val": "22.030"
            },
            "BudgetYearOne": {
                "val": "14.389"
            },
            "BudgetYearOneBase": {
                "val": "14.389"
            },
            "BudgetYearTwo": {
                "val": "13.008"
            },
            "BudgetYearThree": {
                "val": "12.167"
            },
            "BudgetYearFour": {
                "val": "12.405"
            },
            "BudgetYearFive": {
                "val": "12.660"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "To counter the United States’ historic technological advantage, adversaries are increasingly developing asymmetric capabilities that are enabled by advanced commercial electronic components and devices that have become globally available. These threats range from terrorist-employed improvised devices, unmanned air systems and easily transportable man portable air defense systems to dedicated military systems that can diminish our technological advantage in conflicts with nation-states. They include cruise and ballistic missiles, integrated air defense systems (IADS) and the advanced sensor systems used by them to detect and target U.S. forces, and advanced electronic warfare (EW) systems used to deny or negate our sensors, communications and precision navigation and targeting capabilities.\n\nThe rate at which new threats are appearing continues to accelerate and new threats are emerging faster than traditional Department of Defense (DoD) research, development and acquisition processes can respond. The plethora of new electromagnetic spectrum (EMS) threats is making operations in the EMS significantly more complex. The challenges posed by new kinetic and non-kinetic threats and the dire consequences of  technology surprise emphasize the need to rapidly develop and field innovative EW and EW-Cyber capabilities that can address new threats in fiscally and temporally responsible ways.\n\nThe Joint Electronic Advanced Technology (JEAT) Program addresses these challenges through efforts designed to accelerate the pace of EW and EW-Cyber capabilities development by exploring technologies and using approaches that fall outside the scope or purview of the Services’ research and development (R&D) programs. Enabling the rapid transition of significant technologies to Service Programs of Record (PoR) at lower cost with lower risk is essential. JEAT thus explores and assesses technological approaches that integrate and demonstrate both new and off-the-shelf military and commercial technologies in innovative ways. \n\nJEAT efforts are focused in four areas under two Project Codes, P619 (Joint Electronic Advanced Technology) and P245 (EW Enterprise Exploration and Innovation). (1) Experimentation\/Demonstration (P619) utilizes innovative field and laboratory experimentation venues to understand current and future threats and explore potential countermeasures and overmatch opportunities. (2) Advanced Technology Development\/Verification (P619) explores technologies and approaches to counter advanced threats in innovative ways. (3) EW Collaboration & Planning (P619) ensures appropriate technological oversight of Departmental and Service EW and EW-Cyber R&D programs and processes and provides necessary governance insights for senior decision makers. (4) EW Enterprise Exploration and Innovation (P245) accelerates the fielding of essential EW capabilities such as innovative countermeasures to new classes of advanced threats (including anti-access\/area denial (A2\/AD) threats), and exploring and developing a variety of non-kinetic technologies, tools, and approaches to counter advanced threats and enhancing operators’ and analysts’ comprehension of the electromagnetic spectrum (EMS) environment to enable real-time precision employment of non-kinetic capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.879"
                },
                "CurrentYear": {
                    "val": "22.030"
                },
                "BudgetYearOne": {
                    "val": "14.402"
                },
                "BudgetYearOneBase": {
                    "val": "14.402"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.667"
                },
                "CurrentYear": {
                    "val": "22.030"
                },
                "BudgetYearOne": {
                    "val": "14.389"
                },
                "BudgetYearOneBase": {
                    "val": "14.389"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.212"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.013"
                },
                "BudgetYearOneBase": {
                    "val": "-0.013"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.400"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.812"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.013"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.013"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P619"
                    },
                    "ProjectTitle": {
                        "val": "Joint Electronic Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.406"
                        },
                        "CurrentYear": {
                            "val": "10.992"
                        },
                        "BudgetYearOne": {
                            "val": "11.646"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.646"
                        },
                        "BudgetYearTwo": {
                            "val": "12.233"
                        },
                        "BudgetYearThree": {
                            "val": "12.167"
                        },
                        "BudgetYearFour": {
                            "val": "12.405"
                        },
                        "BudgetYearFive": {
                            "val": "12.660"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Joint Electronic Advanced Technology (JEAT) explores and assesses innovative technologies and approaches to rapidly mitigate advanced threats and demonstrate new overmatch technologies in ways not being explored by the Services. JEAT’s three efforts, Experimentation\/Demonstration (Expt\/Demo), Advanced Technology Development\/Verification (ATD\/V), and EW Enterprise Collaboration and Planning (EW C&P), focus on enabling nearer-term technology transitions to the Services’ Programs of Record (PoR) with reduced risk and cost. Expt\/Demo efforts focus on exploring, demonstrating, and assessing innovative technologies and approaches to overcome existing and developing threats and provide new overmatch capabilities for the U.S. military. ATD\/V efforts integrate advanced commercial and military off-the-shelf technologies in ways not being explored by the Services to demonstrate nearer-term technological opportunities. EW C&P efforts within Electronic Warfare and Countermeasures Office (EWCO) of the Assistant Secretary of Defense for Research and Engineering assess, ensure coordination and provide senior leadership insights on all Departmental EW and EW-Cyber research and development (R&D) as well as coordinating national and international EW and EW-Cyber efforts. \n\nExperimentation\/Demonstration (Expt\/Demo):\n\nExpt\/Demo explores and demonstrates new EW and EW-Cyber technologies and approaches through the use of large-scale, dynamic field experimentation venues. The current venue, Vigilant Hammer (VH), is a multi-year, multi-agency, live, virtual, and constructive event focused on advancing the state of the art for detecting, classifying, geolocating, and engaging of electromagnetic signals of interest. Modeled after JEAT’s highly successful BLACK DART, TRIDENT SPECTRE, and Rotorcraft Aircraft Survivability Equipment Experiment (RASE) venues, VH includes both scripted and dynamic scenarios to give participants an opportunity to explore the efficacy of existing and new capabilities and approaches to engage emerging electromagnetic spectrum (EMS) threats. Follow-on venues will address concerns such as multi-platform\/multi-aperture, collaborative\/coherent EW and attacking multistatic passive\/active sensing architectures.\n\nAdvanced Technology Development\/Verification (ATD\/V):\n\nATD\/V explores, matures and assesses emerging technologies and approaches to address compelling EW and EW-Cyber warfighting needs. JEAT’s ongoing ATD\/V effort, the Distributed Electronic Effects Development (DEED) Laboratory, explores, matures and assesses emerging EW and EW-Cyber technologies to enable, for example, multi-aperture collaborative\/coherent EW and EW-Cyber employment through exquisite coordination of sensing and electronic attack capabilities. \n\nEW Enterprise Collaboration and Planning (EW C&P):\n\nEW C&P supports all activities of the Director, EWCO, related to the selection, organization, oversight, and coordination of all EW- and EW-Cyber-related efforts across DoD. EW C&P oversees and ensures coordination and collaboration between OSD and the Joint Staff, the Combatant Commands, and the Services on all EW and EW-Cyber activities within DoD. To do this, EW C&P identifies, assesses, and develops recommendations to address EW- and EW-Cyber-related threats impacting sensor, seeker, communications, platform survivability, countermeasures and battle management technologies. EW C&P also provides programmatic recommendations and decision support to the Office of the Under Secretary of Defense for Acquisition, Technology, and Logistics (OUSD(AT&L)) on PoR, including technology maturity and availability, Critical Program Information standards, Foreign Disclosure, and Technical Signals Requirements. EW C&P also conducts and leads analyses of advanced threats and technological opportunities to support Departmental EW and EW-Cyber R&D research, development and acquisition efforts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimentation\/Demonstration (Expt\/Demo)"
                                    },
                                    "Description": {
                                        "val": "Leveraging our history of conducting highly successful experimentation venues, our current multi-year, multi-agency, live, virtual and constructive series of field experimentation venues, Vigilant Hammer (VH), explores and assesses technologies and approaches to more effectively detect, classify, geolocate, engage, and assess actions against modern, agile and cognitive signals in a very dense and highly complex signals environment. Our next Expt\/Demo venue, Nike’s Hammer, will focus on multi-platform\/multi-aperture nonkinetic (electronic and digital) engagement (NKE) of multistatic passive\/active sensing architectures. As with VH and earlier all earlier JEAT experimentation venues, Nike’s Hammer and subsequent future venues will be scoped to address the most pressing electromagnetic spectrum (EMS) threats, and the selection of venue topics and the scoping of these efforts will involve the EW and Cyber Communities of Interest and EXCOMs to ensure maximum relevance and benefits to Departmental efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.519"
                                            },
                                            "Text": {
                                                "val": "VH 2 was conducted in early May of FY 2016 and the final report was completed in November 2016. Assessment of VH 2 results is helping scope planning efforts for VH 3."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.497"
                                            },
                                            "Text": {
                                                "val": "Given the significant findings of VH 1 and VH 2, VH 3 is being delayed until the second quarter of FY 2018 to enable more focused engagement of specific sets of targets and higher fidelity examination of warfighting-essential nonkinetic engagement (NKE) capabilities. Assessment of earlier VH events, compelling threats, and technological maturity is also guiding initial planning efforts of our next Expt\/Demo venue, Nike’s Hammer, which will focus on multi-platform\/multi-aperture NKE of multistatic passive\/active sensing architectures. This venue will be planned during FY 2017 and FY 2018, and is tentatively scheduled to be held in early FY 2019."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.915"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.915"
                                            },
                                            "Text": {
                                                "val": "The third VH event will be held in the second quarter of FY 2018 with a report to follow within a couple of months. The results of VH 3 are expected to enable earlier transitions of new NKE warfighting tools and will guide planning for Nike’s Hammer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Technology Development\/Verification (ATD\/V)"
                                    },
                                    "Description": {
                                        "val": "ATD\/V research efforts mature and assess emerging technologies to address compelling EW and converged EW-Cyber warfighting needs. Utilize JEAT’s Distributed Electronic Effects Development (DEED) Laboratory, these efforts focus on identifying and integrating multiple advanced technologies to synergistically create effects that are far greater than the sum of the constituent systems and identifying more effective and lower cost approaches to more effectively utilize, manage, and protect U.S. electromagnetic spectrum capabilities. The DEED Laboratory integrates promising technologies into UAVs managed by the Naval Air Warfare Center, Weapons Division (NAWCWD), for further exploration and assessment in venues like VH."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.934"
                                            },
                                            "Text": {
                                                "val": "Initial setup of the DEED Laboratory started in mid-FY 2016. Significantly leveraging existing laboratory and analytical capabilities at the NAWCWD, Point Mugu, CA, the DEED Laboratory’s first experimentation efforts will begin following certification of the laboratory in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.511"
                                            },
                                            "Text": {
                                                "val": "The DEED Laboratory’s first experimentation efforts will focus on exploring, developing and validating multi-platform, multi-aperture techniques and approaches that can be employed from distributed systems (unmanned air systems (UAS)). Once developed and validated within the DEED Laboratory’s controlled environment, these capabilities will be integrated into prototypical systems and further explored and assessed in field experimentation venues such as VH."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.627"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.627"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2017 efforts, the DEED Laboratory will continue exploring, developing and validating multi-platform, multi-aperture techniques and approaches that can be employed from distributed systems. Promising capabilities will be integrated in UAS for exploration and assessment in VH 3 and Nike’s Hammer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovative Technology Exploration (ITE)"
                                    },
                                    "Description": {
                                        "val": "ITE supported the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)), and the Director,\nElectronic Warfare and Countermeasures, through studies and analyses of emerging asymmetric threats.  Past efforts included supporting the Aircraft Survivability Equipment Joint Analysis Team and the Helicopter Survivability Task Force, both of which resulted in significant strategic technology investments by the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.328"
                                            },
                                            "Text": {
                                                "val": "FY 2016 efforts focused on analysis of alternative courses of action employing advanced, adaptive and cognitive EW technologies emerging in commercial data communications, radar, and other advanced spectrum domains previously dominated by DoD.  The evaluation of complex spectrum environments, system-to-system interactions; link budget analyses; size, weight and power analysis; and other relevant analytic studies were accomplished under this effort, including issues related to modeling of many advanced jammers operating in the same airspace."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Project terminated in FY 2016. Efforts were consolidated into Expt\/Demo and ATD\/V."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Project terminated in FY 2016."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW Enterprise Collaboration and Planning (EW C&P)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Director, Electronic Warfare and Countermeasures in coordinating, overseeing and managing the plethora of electromagnetic spectrum (EMS) warfare-related research and development (R&D) activities across DoD for the Assistant Secretary of Defense for Research and Engineering. It includes maintaining cognizance of all EW capabilities and capability development activities worldwide; overseeing the all EW-related R&D activities across DoD; exploring new and innovative EMS technologies and approaches; coordinating Departmental, EW-related R&D, programs, protocols, and policy; analyzing requisite development and operational interfaces across DoD and with international partners; and reporting relevant information to top senior leaders and across Department as well as to Congress and other external groups."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.625"
                                            },
                                            "Text": {
                                                "val": "In FY 2016, EW C&P efforts included participating in the EW Executive Committee (EXCOM); providing guidance to and oversight of EW Community of Interest (COI) activities; providing direction and management of Joint Electronic Advanced Technology Experimentation\/Demonstration and Advanced Technology Development\/Verification efforts including initiating new interactions with the Intelligence Community at senior levels to address critical intelligence gaps related to foreign EMS capabilities and advanced technology development efforts; stimulating the initiation of a new study assessing foreign material exploitation and acquisition processes; organizing a new security portfolio for all DoD EW Special Access programs; advancing initiatives for the establishment EW vulnerability portfolios; and providing leadership of efforts to identify potential technological solutions to address Joint Urgent Operational Need SO-0010."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.984"
                                            },
                                            "Text": {
                                                "val": "In addition to continued participation in ongoing efforts mentioned above, FY 2017 efforts include analysis of alternative courses of action for employing advanced, adaptive and cognitive EW technologies that are being developed and marketed commercially for data communications, radar, and other advanced spectrum domains previously dominated by DoD. Assessment of complex spectrum environments, system-to-system interactions, link budget analyses, size, weight and power analyses and other relevant analytic studies will be undertaken as part of this effort, to include issues related to modeling of many advanced jammers operating in the same area. Plans and exploratory investigations will evolve to evaluate and harvest emerging concepts and technologies from the R&E Reliance Process and the EW S&T COI road maps. Analysis and coordination of national and international efforts addressing emerging Information Operations and EW-Cyber Convergence topics will begin as well as efforts to advance imaging IRCM countermeasure technologies and expand U.S.-Australia collaboration in EW-Cyber. Efforts will also guide planning of EW Enterprise Exploration and Innovation (P245) research efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.104"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.104"
                                            },
                                            "Text": {
                                                "val": "In addition to previous, ongoing efforts, FY 2018 efforts will focus on the development of a variety of new EW capabilities including distributed cooperative or coherent aperture techniques; battle management and visualization technologies for optimization of non-kinetic fires; asymmetric targeting technologies; passive system countermeasure techniques; and national technical means applications to EW."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P244"
                    },
                    "ProjectTitle": {
                        "val": "Advanced EW Technology Maturation Project"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.426"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Electronic Warfare (EW) Technology Maturation Project is a one-year effort to mature and demonstrate modular, distributed, configurable EW technologies and systems designs addressing U.S. Marine Corps (USMC) and U.S. Army warfighting requirements that will accelerate the fielding of advanced EW capabilities in the FY 2017 Intrepid Tiger II (IT2) Program of Record. This effort will develop and integrate capabilities to counter radar targets while mitigating blue-on-blue and co-site interference impacts into an existing communications jamming capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced EW Technology Maturation Project"
                                    },
                                    "Description": {
                                        "val": "Technologies demonstrated in this effort will be integrated into future USMC precision EW system of systems architectures and will enable distributed, adaptive, and scalable counter-communications and counter-radar EW capabilities that are compliant with existing open architecture systems and net-centric architectures. The architectural evaluation in conjunction with the digital RF technologies evaluation will inform USMC EW developers on the \"art of the possible\" of current advanced technology capabilities and influence multi-element system designs. These capabilities are envisioned to support combat and contingency operations throughout the world, and are anticipated to transition to the warfighter in the USMC Intrepid Tiger II (AN\/ALQ-231) Family of systems.  These efforts have potential to influence future U.S. Army and Joint Service programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.426"
                                            },
                                            "Text": {
                                                "val": "FY 2016 efforts included the collaboration and evaluation of maturating technologies developed by the Defense Advanced Research Projects Agency (DARPA), industry and the Services to support the USMC EW requirements for counter-radar electronic attack capabilities into existing counter-communications EW systems. New capabilities developed in this effort will counter current and future radar threats, provide improved communications operational availability by adding a spectral \"relocation\" coordination capability and mitigate co-site interference on a mission by mission basis by utilizing dynamically reprogrammable channelized amplifiers and digital filters. Specific efforts included:\n\n• Initial threat systems evaluation conducted to support technology requirements definition. \n• Initial architectural design (systems and RF) identified and drafted. This included a modular system mechanical layout supporting ground, air and surface system needs and functionality inclusion to support spectrum relocation and co-site interference mitigation.\n• Identified technology requirements needed to provide spectrum diverse capabilities from up to millimeter wave in alignment with the above listed threats.\n• Significant market research completed including meeting with industry partners.\n• Investigated, identified and procured advanced transceiver technologies.\n• Investigated, identified and procured advanced modem and network technologies including waveform transitions.\n• Investigated amplifier technologies, solid state and microwave power module. \n• Investigated general antenna technologies and implementations for both podded and external mounting options.\n• Investigated industry standards to determine best approach to support the open architecture design.\n• Evaluated simultaneous transmit and receive antenna technologies and analog cancellers.\n• Evaluated phased array antennas.\n\nThese efforts will be continued under USMC program funding starting in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This one-year effort was completed in FY 2016."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This one-year effort was completed in FY 2016."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P245"
                    },
                    "ProjectTitle": {
                        "val": "EW Enterprise Exploration and Innovation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.835"
                        },
                        "CurrentYear": {
                            "val": "11.038"
                        },
                        "BudgetYearOne": {
                            "val": "2.743"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.743"
                        },
                        "BudgetYearTwo": {
                            "val": "0.775"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This four-year project started in FY 2016. It accelerates the development of innovative technologies to: (1) provide countermeasures to new classes of advanced electronic warfare (EW) threats, (2) develop and demonstrate new approaches to enable high fidelity, real-time comprehension and control of the electromagnetic spectrum battlespace and the effects of non-kinetic attack tools within it, and (3) develop and validate new EW-Cyber capabilities. Five efforts were initiated to address these objectives. Advanced Airborne Countermeasures Development and Advanced Defensive Countermeasures Development address area (1). Non-Kinetic Battle Management and Visualization Technology Development address area (2) and Advanced EW and EW-Cyber Exploration\/Development address area (3). The fifth effort, Ultra Wideband Receiver Development, successfully demonstrated two systems in Vigilant Hammer. Given the maturity of these approaches and many additional developments taking place in this area, the effort was terminated after FY 2016."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Airborne Countermeasures Development"
                                    },
                                    "Description": {
                                        "val": "This two-year classified effort commenced in FY 2016. It will mature and demonstrate an advanced countermeasure to a new class of missile seeker threats that have expanded spectral and temporal coverage and resolution. Final products of this effort will be integrated into existing countermeasure architectures for effectiveness assessment. Expanding on earlier developmental efforts, the final objective of this effort is to enable the earlier transition of a candidate countermeasure capability to the warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.474"
                                            },
                                            "Text": {
                                                "val": "FY 2016 efforts expanded ongoing existing efforts to develop and begin assessments of the objective threat countermeasure. Since the objective countermeasure must fit within the existing countermeasure form, size and weight constraints, integration design efforts also occurred, as well as laboratory assessments of countermeasure effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.550"
                                            },
                                            "Text": {
                                                "val": "FY 2017 efforts will continue FY 2016 work with the focus on integrating and demonstrating the new countermeasure candidates into prototypes and assessing their performance against realistic threats in relevant environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Project competed in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Defensive Countermeasures Development"
                                    },
                                    "Description": {
                                        "val": "This two-year classified effort commenced in FY 2016. It will develop and assess the efficacy of a new approach to defend naval assets against advanced threat weapons employing increasingly sophisticated seeker technologies. Significant leveraging of existing countermeasure approaches will be emphasized with the objective of demonstrating the efficacy of this approach in a realistic field environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.856"
                                            },
                                            "Text": {
                                                "val": "Laboratory developmental efforts were initiated, to include both modeling and experimental approaches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "FY 2017 efforts will continue FY 2016 work and will proceed towards an initial field demonstration of this approach."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Project competed in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Kinetic Battle Management and Visualization Technology Development"
                                    },
                                    "Description": {
                                        "val": "Non-Kinetic Battle Management and Visualization Technology Development explores a variety of advanced technologies ─ to include legacy electromagnetic (EM) battle management (BM) tools and Intelligence Community (IC) capabilities and state-of-the-art ‘big data’ analytics, visualization and novel human-machine interface technologies ─ to significantly enhance the fidelity, timeliness and comprehensibility of information provided to warfighters and analysts responsible for understanding and exercising control of the EM and cyberspace warfighting domains. Leveraging state-of-the-art algorithmic-driven processing, artificial intelligence, and autonomy support, predictive analytics will be developed to enable course of action development for the highly accurate, precise and timely employment of non-kinetic capabilities within the EM and cyberspace warfighting domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.243"
                                            },
                                            "Text": {
                                                "val": "FY 2016 efforts initiated development of the next generation of EM battlespace situational awareness, visualization and control technologies.  Plans were developed and initial steps were taken to maximally leverage hardware- and software-in-the-loop laboratory capabilities to enable build-assess-improve cyclic capability growth relying on state-of-the-art visualization and ‘big data’ assessment technologies.  Initial development of heuristics to enable rapid course-of-action development was also started."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.248"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2016 efforts, FY 2017 efforts significantly expand and refine approaches to increase the representational fidelity and comprehensibility of non-kinetic battlespaces and advance course-of-action development capabilities.  Operational and IC users will be highly leveraged in this work to refine initial products and streamline the transitioning of newly developed capabilities to users for field experimentation and assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.743"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.743"
                                            },
                                            "Text": {
                                                "val": "Efforts will continue work identified in FY 2016 and FY 2017 with a focus on demonstration of capability in field demonstrations with operational and IC users to enable transition of capabilities to these communities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced EW and EW-Cyber Exploration\/Development"
                                    },
                                    "Description": {
                                        "val": "This task will work on access and payload capability for EM spectrum-cyberspace capabilities for closed network access and effects against hard-to-reach targets in A2\/AD environments. This initiative focuses on the continuum between EW effects such as jamming and Cyber effects to produce greater military impact against the adversary. It will also incorporate algorithms, signal processing and techniques for increasing the viable standoff distance for prosecution, interrogation and disruption of adversary threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.079"
                                            },
                                            "Text": {
                                                "val": "In FY 2016, this effort began development of composite EW and Offensive Cyber Operations (OCO) capabilities against A2AD threats, including advanced adversary weaponry, for employment on software-defined and reprogrammable transceivers.  Initial prototypes were developed and these will be demonstrated in field experimentation venues in subsequent years."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.740"
                                            },
                                            "Text": {
                                                "val": "FY 2017 efforts will continue work started in FY 2016 with a focus on demonstrating the potential efficacy of newly developed capabilities in field demonstration venues.  Operational and IC users will be involved to enable earlier transitions of capabilities to these communities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Project competed in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ultra Wideband Receiver Development (UWBR)"
                                    },
                                    "Description": {
                                        "val": "This effort will explore technologies to provide significantly greater instantaneous bandwidth with extreme sensitivity to enhance the detection, identification, classification, geolocation, and cueing of countermeasures against threat emitter systems that have increased spectral coverage, bandwidth, agility, and waveform diversity. Chip-scale, hyper sensitive and ultra wide band receiver technology components will be explored, developed, and demonstrated in dense, extremely complex EM environments, possibly to include VH and\/or subsequent JEAT experimentation\/demonstration venues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.183"
                                            },
                                            "Text": {
                                                "val": "FY 2016 efforts focused on accelerating efforts to (1) mature chip-scale, hyper sensitive and ultra wide band receiver components, (2) develop algorithms and components to process the vast amounts of collected data, and (3) initially characterize system performance. Brassboard capability demonstrations in laboratory and field environments were used to baseline and assess performance in increasingly complex EM environments, and an early prototype system was demonstrated at Vigilant Hammer 2. Based on progress made in this effort and extensive ongoing work by others exploring similar and other approaches, this effort may be terminated upon assessments in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Assess state-of-the-art to determine if continued work is still needed. Further work is to be determined."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Assess state-of-the-art to determine if continued work is still needed. Further work is to be determined."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}