{
    "id": "2018-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-950a5746320338933f77ee67f04c39e5d4c40144f8c92626c879d6e287c1655c-13",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603767E"
        },
        "ProgramElementTitle": {
            "val": "SENSOR TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "59"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "231.633"
            },
            "CurrentYear": {
                "val": "241.288"
            },
            "BudgetYearOne": {
                "val": "210.123"
            },
            "BudgetYearOneBase": {
                "val": "210.123"
            },
            "BudgetYearTwo": {
                "val": "177.278"
            },
            "BudgetYearThree": {
                "val": "281.085"
            },
            "BudgetYearFour": {
                "val": "301.554"
            },
            "BudgetYearFive": {
                "val": "286.554"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Sensor Technology program element is budgeted in the Advanced Technology Development Budget Activity because it funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability and battle damage assessment.  \n\nThe Surveillance and Countermeasures Technology project will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability, and battle damage assessment.  Timely surveillance of enemy territory under all weather conditions is critical to providing our forces with the tactical information needed to succeed in future wars.  This operational surveillance capability must continue to perform during enemy efforts to deny and deceive the sensor systems, and operate, at times, in a clandestine manner.  This project will exploit recent advances in multispectral target phenomenology, signal processing, low-power high-performance computing, and low-cost microelectronics to develop advanced surveillance and targeting systems.  In addition, this project encompasses several advanced technologies related to the development of techniques to counter advanced battlefield threats.\n\nThe Sensors and Processing Systems project develops and demonstrates the advanced sensor and processing technologies and systems necessary for Intelligence, Surveillance, and Reconnaissance (ISR) missions.  Future battlefields will continue to be populated with targets that use mobility and concealment as key survival tactics, and high-value targets will range from specific individual insurgents and vehicles to groups of individuals and large platforms such as mobile missile launchers and artillery.  The Sensors and Processing Systems Project is primarily driven by four needs: (a) providing day-night ISR capabilities against the entire range of potential targets; (b) countering camouflage, concealment, and deception of mobile ground targets; (c) detecting and identifying objects of interest\/targets across wide geographic areas in near-real-time; and (d) enabling reliable identification, precision fire control tracking, timely engagement, and accurate battle damage assessment of ground targets. \n\nThe Exploitation Systems project developed algorithms, software, and information processing systems to extract information from massive Intelligence, Surveillance, and Reconnaissance (ISR) datasets. In particular, it developed new technologies for detection and discrimination of targets from clutter, classification and fingerprinting of high value targets, localization and tracking over wide areas, and threat network identification and analysis. Interest extended to open source information and issues such as trustworthiness and provenance. The resulting technology enables operators to more effectively and efficiently incorporate all sources of information, including sensor, human, and open source data, in intelligence products."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "240.127"
                },
                "CurrentYear": {
                    "val": "241.288"
                },
                "BudgetYearOne": {
                    "val": "207.325"
                },
                "BudgetYearOneBase": {
                    "val": "207.325"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "231.633"
                },
                "CurrentYear": {
                    "val": "241.288"
                },
                "BudgetYearOne": {
                    "val": "210.123"
                },
                "BudgetYearOneBase": {
                    "val": "210.123"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.494"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.798"
                },
                "BudgetYearOneBase": {
                    "val": "2.798"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.277"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-8.771"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.798"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.798"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  Decrease reflects the SBIR\/STTR transfer offset by reprogrammings.  \nFY 2017:  N\/A\nFY 2018:  Increase reflects Blue Note program new start."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SEN-01"
                    },
                    "ProjectTitle": {
                        "val": "SURVEILLANCE AND COUNTERMEASURES TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.772"
                        },
                        "CurrentYear": {
                            "val": "19.027"
                        },
                        "BudgetYearOne": {
                            "val": "37.843"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.843"
                        },
                        "BudgetYearTwo": {
                            "val": "32.694"
                        },
                        "BudgetYearThree": {
                            "val": "26.901"
                        },
                        "BudgetYearFour": {
                            "val": "18.401"
                        },
                        "BudgetYearFive": {
                            "val": "11.401"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability, and battle damage assessment.  Timely surveillance of enemy territory under all weather conditions is critical to providing our forces with the tactical information needed to succeed in future wars.  This operational surveillance capability must continue to perform during enemy efforts to deny and deceive the sensor systems, and operate, at times, in a clandestine manner.  This project will exploit recent advances in multispectral target phenomenology, signal processing, low-power high-performance computing, and low-cost microelectronics to develop advanced surveillance and targeting systems.  In addition, this project encompasses several advanced technologies related to the development of techniques to counter advanced battlefield threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Optical Sensing (MOS)"
                                    },
                                    "Description": {
                                        "val": "The proliferation of radio frequency (RF)-based countermeasures, such as digital radio frequency memory (DRFM), has presented challenges to the effectiveness of data sensors.  The Multi-Optical Sensing (MOS) program will enable an alternative approach to detecting, tracking, and performing non-cooperative target identification, as well as providing fire control for fighter class and long-range strike aircraft.  This program leverages emerging high-sensitivity focal plane array (FPA) and compact, multiband laser systems technology in the near\/mid\/long-wave infrared bands to enable the development of a multi-optical sensing system.  Technical challenges include the demonstration of inexpensive, multiband, large-format, photon-counting, high-bandwidth receivers and their integration into a multi-optical sensor suite compatible with airborne assets.  The MOS program seeks to advance the state of the art of components and technology to support an all-optical airborne system that can detect, geolocate, and identify targets at standoff ranges.  Technologies from this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.772"
                                            },
                                            "Text": {
                                                "val": "-  Completed the development of the first-generation prototype system.\n-  Performed air-to-air demonstrations with the first-generation prototype system.\n-  Initiated the development of a second-generation prototype system, which will demonstrate the full capability out to operational ranges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.027"
                                            },
                                            "Text": {
                                                "val": "-  Complete the development of the second-generation prototype system and integrate onto an airborne platform.\n-  Perform air-to-air demonstrations with the second-generation prototype system.\n-  Perform initial demonstration of the full capability of the second-generation prototype system out to operational ranges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.960"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.960"
                                            },
                                            "Text": {
                                                "val": "-  Conduct demonstration of all modalities of second-generation prototype system capability out to operational ranges.\n-  Incorporate target measurement data into identification algorithms and demonstrate multi-modality identification out to operational ranges.\n-  Demonstrate system scalability through design and analysis to the size, weight, and power necessary for an objective implementation.\n-  Develop roadmap and injection point for transition of capability into near-term and far-term Air Force and Navy operational systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Dragnet"
                                    },
                                    "Description": {
                                        "val": "Aerial Dragnet seeks to detect multiple small unmanned aerial systems (UAS) in complex and\/or urban terrain before they are within line-of-sight (LOS) of friendly assets.  Unlike traditional air targets, small UASs pose a special threat in urban terrain for several reasons:  they can fly at low altitudes between buildings, they are small making them difficult to sense, and they move at slow speeds making them difficult to differentiate from other movers.  Moreover, the development of small UASs is driven by commercial technologies, which make them rapidly adaptable and very easy to use.  Building upon technologies developed in the System of Systems Integration Technology and Experimentation (SoSite) program (budgeted in PE 0603766E, Project NET-01), Aerial Dragnet will perform surveillance using an architecture consisting of networked sensors mounted on distributed aerial platforms.  The ability to see over and into urban terrain allows an Aerial Dragnet to rapidly detect, track, and classify UAS incursions, thus enabling multiple defeat options.  This program focuses on the development of payloads, to be hosted on unmanned aerial platforms, comprising of signal processing software, sensor hardware, and networking for distributed, autonomous operation.  The system will be scalable to provide cost-effective surveillance coverage from neighborhood to city-wide sized areas.  Aerial Dragnet technologies are expected to transition to the Army and Marines with particular relevance to missions in the EUCOM and CENTCOM Area of Responsibilities (AORs)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Commence development of surveillance subsystems for UAS detection, classification, and localization from an aerial platform.\n-  Conduct engineering subsystem tests to assess small UAS detection performance in an instrumented urban test area."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.383"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.383"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of initial hardware sensor payloads.\n-  Evaluate software for non-line-of-sight UAS tracking and classification.\n-  Demonstrate and test the performance of the system over a neighborhood-sized urban area."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue Note"
                                    },
                                    "Description": {
                                        "val": "Blue Note seeks to perform Terrain Scattered Jamming (TSJ) against surveillance radars, where radar signals are scattered off the ground into the threat radar receive beam.  Blue Note, expanding on methods developed under the Retrodirective Arrays for Coherent Transmission (ReACT) program (budgeted in PE 0603766E, Project NET-01), will develop new ways of acquiring the threat radar's waveform, which is required to execute TSJ.  Blue Note will also design new terrain scattered jamming waveforms to make it more difficult to mitigate and more effective at longer ranges from the threat radar.  Technologies developed under the Blue Note program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Text": {
                                                "val": "-  Commence development of new methods for acquiring threat radar waveforms.\n-  Begin design of new jamming waveforms.\n-  Conduct initial data collection using existing U.S. radars."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SEN-02"
                    },
                    "ProjectTitle": {
                        "val": "SENSORS AND PROCESSING SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "129.858"
                        },
                        "CurrentYear": {
                            "val": "145.732"
                        },
                        "BudgetYearOne": {
                            "val": "107.813"
                        },
                        "BudgetYearOneBase": {
                            "val": "107.813"
                        },
                        "BudgetYearTwo": {
                            "val": "103.709"
                        },
                        "BudgetYearThree": {
                            "val": "230.684"
                        },
                        "BudgetYearFour": {
                            "val": "272.653"
                        },
                        "BudgetYearFive": {
                            "val": "267.153"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Sensors and Processing Systems project develops and demonstrates the advanced sensor and processing technologies and systems necessary for Intelligence, Surveillance, and Reconnaissance (ISR) missions.  Future battlefields will continue to be populated with targets that use mobility and concealment as key survival tactics, and high-value targets will range from specific individual insurgents and vehicles to groups of individuals and large platforms such as mobile missile launchers and artillery.  The Sensors and Processing Systems Project is primarily driven by four needs: (a) providing day-night ISR capabilities against the entire range of potential targets; (b) countering camouflage, concealment, and deception of mobile ground targets; (c) detecting and identifying objects of interest\/targets across wide geographic areas in near-real-time; and (d) enabling reliable identification, precision fire control tracking, timely engagement, and accurate battle damage assessment of ground targets.  The Sensors and Processing Systems Project develops and demonstrates technologies and system concepts that combine novel approaches to sensing with emerging sensor technologies and advanced sensor and image processing algorithms, software, and hardware to enable comprehensive knowledge of the battlespace and detection, identification, tracking, engagement, and battle damage assessment for high-value targets in all weather conditions and combat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Spatial, Temporal and Orientation Information for Contested Environments (STOIC)"
                                    },
                                    "Description": {
                                        "val": "The Spatial, Temporal and Orientation Information for Contested Environments (STOIC) program will enable precision cooperative effects by developing global time transfer and synchronization systems independent of GPS.  As a corollary to time synchronization, this program will also enable GPS-independent positioning to maintain precise time synchronization between collaborating mobile users.  Key attributes of this program are global availability; minimal and low cost infrastructure; anti-jamming capability; and performance equal to or better than GPS through recent advances in optical clocks and time transfer. Demonstrations on relevant platforms in relevant environments will be used to validate the technology.  This program will transition to the Services, emphasizing platforms that operate in GPS-denied environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.900"
                                            },
                                            "Text": {
                                                "val": "-  Completed prototype components of optical clocks.\n-  Completed detailed design and began development of compact optical clocks.\n-  Developed prototype components and systems for enabling precision time transfer independent of GPS.\n-  Completed detailed design and began development of GPS-independent precision time transfer systems.\n-  Developed prototype jam-proof Positioning, Navigation, and Timing (PNT) system components (signal transmit and receive) for achieving GPS-level positioning performance in contested environments.\n-  Completed detailed design and began development of jam-proof PNT system based on very low frequency (VLF) transmitters and waveforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.365"
                                            },
                                            "Text": {
                                                "val": "-  Complete development of compact optical clocks.\n-  Complete initial demonstration of prototype GPS-independent precision time transfer system and begin system evaluations.\n-  Complete development of jam-proof PNT system and conduct tests to validate system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.632"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.632"
                                            },
                                            "Text": {
                                                "val": "-  Conduct real-time demonstrations of jam-proof VLF-based positioning system.\n-  Complete validation of optical clock long-term performance.\n-  Conduct real-time demonstration of precision time transfer using tactical data link signals.\n-  Leverage real-time demonstrations on relevant platforms to facilitate transition discussions with the Navy and Air Force."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automatic Target Recognition (ATR) Technology"
                                    },
                                    "Description": {
                                        "val": "Automatic Target Recognition (ATR) systems provide the capability to detect, identify, and track high value targets from collected sensor data.  Current ATRs are typically designed for specific sensors and static due to pre-programmed target lists and operating mode, limiting mission execution capabilities.  Extending ATR Technology to accommodate sensor upgrades or include new emerging targets can be costly and time consuming.  The objective of the ATR Technology program is to develop technologies that reduce operation limitations while also providing significant performance improvements, dramatically reduced development times, and reduced life cycle maintenance costs.  Recent breakthroughs in deep learning, sparse representations, manifold learning, and embedded systems offer promise for dramatic improvements in ATR Technology.  The program will focus on three core areas: (1) development of on-line adaptive algorithms that enable performance-driven sensing and ATR technology; (2) recognition technology that enables rapid incorporation of new targets; and (3) technologies that dramatically reduce required data rates, processing times, and the overall hardware and software footprint of ATR systems.  ATR technology developed under the program is planned for transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.259"
                                            },
                                            "Text": {
                                                "val": "-  Initiated design of an embedded real-time, low-cost radar ATR processor that incorporates advanced ATR algorithms and uses commercial mobile embedded computing platforms.\n-  Designed and executed additional data collection experiments for continued algorithm development and testing.\n-  Continued to improve ATR algorithm performance, including decoy rejection and false target rejection.\n-  Initiated design of an Open Mission System (OMS) architecture study for ATR algorithms to enable rapid and flexible integration onto multiple operational platforms.\n-  Evaluated first set of results from ATR algorithms, with results matching or exceeding comparable state-of-the-art algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.759"
                                            },
                                            "Text": {
                                                "val": "-  Develop adaptable ATR algorithms to rapidly learn new targets with minimal measured data and evaluate algorithm learning rate.\n-  Evaluate algorithm performance against denied targets for which limited or no training data is available.\n-  Conduct radar data collection to provide additional targets and training data.\n-  Continue to improve ATR algorithm performance, focusing on false-alarm performance.\n-  Complete design and begin development of a flightworthy, low-power ATR processing hardware that executes the ATR algorithm in real-time.\n-  Demonstrate ATR algorithm running in an OMS enabled environment on embedded hardware."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.652"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.652"
                                            },
                                            "Text": {
                                                "val": "-  Continue to improve ATR algorithm performance, focusing on reducing processing times and system size and power requirements.\n-  Continue development of a flightworthy, low-power ATR processing hardware that executes the ATR algorithm in real-time.\n-  Prepare for a flight demonstration of ATR algorithms running on an airborne platform.\n-  Perform flight demonstration of ATR algorithms operating on an airborne platform to facilitate transition to the Services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seeker Cost Transformation (SECTR)"
                                    },
                                    "Description": {
                                        "val": "The Seeker Cost Transformation (SECTR) program will develop novel weapon terminal sensing and guidance technologies and systems, for air-launched and air-delivered weapons, that can: (1) find and acquire fixed and moving targets with only minimal external support; (2) achieve high navigation accuracy in a GPS-denied environment; and (3) have very small size and weight, and potentially low cost.  The development objectives are technologies and systems with small size, weight and power (SWaP), low recurring cost, applicability to a wide range of weapons and missions such as small unit operations, suppression of enemy air defenses, precision strike, and time-sensitive targets.  The technical approach for the sensing\/processing hardware is to use both passive electro-optical infrared (EO\/IR) sensors, which have evolved into very small and inexpensive devices in the commercial market, and a reconfigurable processing architecture, such as the architecture developed in DARPA's Adaptable, Low Cost Sensors (ADAPT) program.  The program will also develop a Government-owned open architecture for the seeker with standardized interfaces between components (both hardware and software).  The technical approach to target recognition will start from \"deep learning\" and 2D\/3D machine vision algorithms pioneered for facial recognition and the identification of critical image features.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.315"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of core seeker system engineering design.\n-  Initiated development of open seeker standard architecture and interfaces.\n-  Developed small size, weight, and power (SWaP) and cost sensor and processing unit.\n-  Designed novel target recognition algorithms.\n-  Designed GPS-free image navigation and processing sensor and algorithm.\n-  Performed initial hardware-in-the-loop (HWIL) test for GPS-free navigation algorithms.\n-  Performed initial HWIL test for target recognition algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.002"
                                            },
                                            "Text": {
                                                "val": "-  Conduct laboratory demonstrations of sensor\/processing unit.\n-  Conduct captive flight test of small SWaP sensors.\n-  Complete Critical Design Review (CDR) of the prototype seeker system.\n-  Integrate GPS-free navigation software and target recognition software into the small SWaP sensors\/processing unit.\n-  Conduct HWIL test of integrated sensors\/processing unit with GPS-free navigation and target recognition software.\n-  Complete and distribute seeker open standard architecture and interfaces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.989"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.989"
                                            },
                                            "Text": {
                                                "val": "-  Integrate prototype SECTR seeker including all GPS-free navigation and novel target recognition subsystems into the seeker system.\n-  Conduct prototype SECTR seeker performance laboratory tests.\n-  Perform integration of prototype SECTR seeker with one or more Precision Guided Munition (PGM) platforms.\n-  Demonstrate prototype SECTR seeker performance in HWIL tests simulating flight with integrated PGM platforms.\n-  Conduct flight test of integrated prototype SECTR seeker-guided PGM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Satellite Sensors"
                                    },
                                    "Description": {
                                        "val": "The Small Satellite Sensors program will develop and space-qualify electro-optical and infrared (EO\/IR) sensor and inter-satellite communications technologies, and establish feasibility that new DoD tactical capabilities can be implemented on small (< 100 kg) satellites.  Experimental payloads will be flown on small satellites, and data will be collected to validate new operational concepts.  Small satellites provide a low-cost and quick-turnaround capability for testing new technologies and experimental payloads.  Operationally, small and low-cost satellites enable the deployment of larger constellations which can provide greater coverage, persistence, and survivability compared to a small number of more expensive satellites, as well as the possibility for launch-on-demand.  This program seeks to leverage rapid progress being made by the commercial sector on small satellite bus technology, as well as investments being made by DoD and industry on low-cost launch and launch-on-demand capabilities for small satellites.  The program will focus on developing, demonstrating, and validating key payload technologies needed by DoD that are not currently being developed for commercial space applications.  Technologies developed under this program will transition to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed conceptual designs for EO\/IR sensor and inter-satellite communications link subsystems.\n-  Developed software performance models for candidate sensor systems, and performed laboratory testing to improve model fidelity and assist in design of flight hardware.\n-  Began design of experimental sensor payloads compatible with a small satellite bus, and performed preliminary design review.\n-  Began development of lightweight and low-power inter-satellite communications links suitable for providing high-bandwidth crosslinks for 100 pound class satellites.\n-  Investigated alternative low-cost payloads suitable for integration on a small satellite."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.478"
                                            },
                                            "Text": {
                                                "val": "-  Complete detailed design of small satellite EO\/IR sensor, and complete satellite system critical design review.\n-  Complete construction of the first small EO\/IR payload and satellite bus.\n-  Build inter-satellite communications link hardware for integration into satellites.\n-  Develop and test mission data processing software.\n-  Develop detailed plan for on-orbit operations.\n-  Initiate design of direct-to-user data downlinks for tactical experimentation with time-critical strike concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.651"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.651"
                                            },
                                            "Text": {
                                                "val": "-  Launch one or more satellites into low earth orbit, each with a compact telescope and an EO\/IR sensor.\n-  Initiate on-orbit operations including mission planning, payload testing, and image collection.\n-  Demonstrate on-board image processing.\n-  Downlink raw imagery for ground processing and pre-processed imagery for comparative analysis.\n-  Use the results from data collections to determine the appropriate attributes of an objective system.\n-  Implement direct-to-user data link hardware and software on at least one satellite.\n-  Develop ground-segment receivers and experimentation plan for real-time demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Radar Countermeasures (ARC)"
                                    },
                                    "Description": {
                                        "val": "The Adaptive Radar Countermeasures (ARC) program will pursue new algorithms for rapidly protecting DoD systems against new or unknown radar-based threats.  Protecting these systems currently relies on uniquely identifying an enemy radar and applying an appropriate, pre-programmed electronic countermeasure (ECM), which can take years to develop.  The emergence of digitally-programmed radars that exhibit novel behaviors and agile waveform characteristics, however, has made this approach to countering radar-based threats increasingly challenging.  Developing new ECM over several years is no longer sufficient.  ARC will therefore pursue new processing techniques and algorithms that adapt in real-time to generate suitable countermeasures.  Using techniques such as machine learning and artificial intelligence, ARC will learn the behavior of the threat system and then choose and implement an appropriate countermeasure strategy.  The program is planned for transition to Air Force, Navy, and Marine Corps airborne electronic warfare systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.512"
                                            },
                                            "Text": {
                                                "val": "-  Completed real-time software and firmware implementation of all major algorithm modules on transition partner provided baseline electronic warfare (EW) systems.\n-  Refined adaptive radar threat models for use in testing which emulate future adversary radar capabilities that are expected to challenge current baseline EW systems.\n-  Demonstrated real-time prototype systems by effectively operating against unanticipated or ambiguous radar signals in a hardware-in-the-loop laboratory environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.487"
                                            },
                                            "Text": {
                                                "val": "-  Identify test ranges and assets that emulate advanced, complex radar signals in static and open-air testing environments.\n-  Develop detailed flight demonstration objectives and conduct test readiness reviews in coordination with Service transition partners.\n-  Refine algorithms to make them robust to realistic Radio Frequency (RF) test conditions in real-time laboratory testing, free-space static testing, and open-air flight demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "-  Conduct testing of ARC against advanced, complex radar signals in static and open-air testing environments.\n-  Deliver ARC technology to Service transition partners for inclusion into identified airborne platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamically Composed RF Systems"
                                    },
                                    "Description": {
                                        "val": "Dominance of the RF spectrum is critical to successful U.S. military operations.  Radar systems, electronic warfare (EW) systems, and communication systems require custom software and hardware that is costly and time consuming to build and integrate onto platforms.  Expanding on ideas developed under the Multifunction RF program, also budgeted in this PE\/Project, the Dynamically Composed RF Systems program addresses these challenges by developing adaptive, converged RF array systems.  This enables enhanced operational capability by dynamically adapting the system for tasks to support radar, communications, and EW in a converged manner.  This program will design and develop: (1) a modular architecture for collaborative, agile RF systems; (2) advanced techniques for RF apertures and airframe integration and the associated wide-band agile electronics to support converged missions over those apertures; (3) a heterogeneous signal processing complex implementing hardware-agnostic RF operating modes (the RF Virtual Machine); (4) software tools for the control, coordination, and scheduling of RF functions and payloads at the element level to maximize overall task performance (a system and sensor resource manager (SSRM)).  This capability can be adapted to address diverse missions.  Technology developed under this program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Assemble requirements to provide an abstraction of underlying software and hardware architectures (RF Virtual Machine).\n-  Commence design of modular architecture for agile, collaborative converged RF payload systems, and assessment of candidate missions, platforms, and costs.\n-  Commence design of RF apertures and associated airframe integration, and agile low-power wide-band RF electronics suitable for RF payloads for compact platforms\/UAVs.\n-  Commence development of SSRM software for controlling and scheduling RF hardware (including processor) to carry out the desired RF functions.\n-  Explore and experimentally establish technical readiness of candidate design approaches to technical program elements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.689"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.689"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate intelligent SSRM algorithms and software approach for controlling and scheduling RF hardware to execute converged RF functions.\n-  Select prototype system architecture and begin detailed design of converged RF payload.\n-  Design RF Virtual Machine performing RF processing on heterogeneous processing complexes.\n-  Conduct laboratory testing on RF Virtual Machine to confirm validity of design approach.\n-  Design converged RF front end and apertures to address bandwidth, field of view, and sensitivity goals commensurate with the prototype system architecture and the limitations of compact platforms \/ UAVs.\n-  Design and begin implementation of SSRM software to control and schedule the RF hardware to execute converged RF missions with functional and spectral flexibility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Scanning Technology for Imaging Radars (ASTIR)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Scanning Technology for Imaging Radars (ASTIR) program will provide immediate benefit to applications that are constrained by power, weight, and the complexity limits of production.  The goal of this program, building on technologies developed under the Multifunction RF (MFRF) program which is budgeted in this PE\/Project, is to demonstrate a new imaging radar architecture using an electronically scanned sub-reflector to produce a more readily available, cost-effective sensor solution that does not require platform or target motion.  Key system attributes will: (1) provide high-resolution 3D imaging for enhanced identification and targeting, independent of platform or target motion; (2) produce video frame rates to provide well-focused images even when there is platform or target motion; (3) beam steer with a single transmit\/receive chain to reduce system complexity resulting in lower cost, power, and weight; and (4) integrate millimeter-wave (mmW)\/terahertz (THz) electronic component advancements from other DARPA programs for transmit and receive functions.  The completion of this program will result in a more readily available, cost-effective imaging radar technology that will work in concert with a wide area surveillance system to provide target identification at video frame rates in all conditions where existing sensors will not work.  Candidate military applications include efficient terminal seekers, imaging systems for defense of shipping in ports and littoral environments, base perimeter monitoring, and screening of personnel passing through access control points.  This technology is intended to transition to Special Operations Command and the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.988"
                                            },
                                            "Text": {
                                                "val": "-  Developed sensor design concepts and defined processing requirements.\n-  Built prototype electronic sub-reflector beam-steering systems and conducted tests to characterize performance and validate approach.\n-  Conducted mission studies and determined the system performance metrics required to support specific candidate military applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.985"
                                            },
                                            "Text": {
                                                "val": "-  Complete assessments of candidate military applications and show benefit from technologies developed under this effort.\n-  Complete electronically scanned sub-reflector sensor requirements.\n-  Design imaging radar system utilizing technologies developed under this effort to address additional military applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunction RF (MFRF)"
                                    },
                                    "Description": {
                                        "val": "The Multifunction RF (MFRF) program goal is to enable U.S. rotary wing aircraft forces to fight effectively in all forms of severely Degraded Visual Environments (DVE) when our adversaries cannot.  The program goes beyond landing aids in DVE to address all elements of combat to include landing, takeoff, hover\/taxi, in route navigation, lethality, and survivability.  Building on previous RF sensors advancements, the program seeks to eliminate many redundant RF elements of current independently developed situational and combat support systems to provide multifunction capability with flexibility of adding new mission functions.  This will reduce the overall size, weight, power, and cost (SWaP-C) of subsystems and protrusive exterior antennas on military aircraft, enabling greater mission capability with reduced vehicle system integration burden.  The program approach includes: (1) development of synthetic vision for pilots that fuses sensor data with high-resolution terrain databases; (2) development of Advanced Rotary Multifunction Sensor (ARMS), utilizing silicon-based tile arrays, for agile electronically scanning technology at low SWAP-C; and (3) implementation of software development kit to re-define modes as required by mission or platform needs, and ease of adding new modes via software without hardware modifications.  The program is planned for transition to the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.273"
                                            },
                                            "Text": {
                                                "val": "-  Conducted laboratory and field demonstrations with integrated ARMS, synthetic vision backbone, other potential collision avoidance sensors and multifunction software development kit.\n-  Demonstrated DVE landing, takeoff, Ground Moving Target Indicator (GMTI), and Synthetic Aperture Radar (SAR) modes of operation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "-  Prepare technologies developed under MFRF for planned transition to the Army."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Video-rate Synthetic Aperture Radar (ViSAR)"
                                    },
                                    "Description": {
                                        "val": "Recent conflicts have demonstrated the need for close air support by precision attack platforms such as the AC-130J aircraft in support of ground forces.  Under clear conditions, targets are easily identified and engaged quite effectively, but in degraded environments, the atmosphere can inhibit traditional optical sensors.  The AC-130J must fly above cloud decks in order to avoid anti-aircraft fire, negating optical targeting sensors.  Similarly, rotary\/wing blades in urban operations generate copious amounts of dust that prevent circling assets from supplying cover fire for ground forces.  The Video-rate Synthetic Aperture Radar (ViSAR) program seeks to develop a real-time spotlight synthetic aperture radar (SAR) imaging sensor that provides imagery of a region to allow high-resolution fire direction in conditions where optical sensors do not function.  Technology from this program is planned to transition to Air Force Special Operations Command (AFSOC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.250"
                                            },
                                            "Text": {
                                                "val": "-  Completed development and unit-level testing of flightworthy high power amplifier.\n-  Integrated hardware into a sensor control system (gimbal) and demonstrated performance in a laboratory scenario, and in over-the-air testing against calibration targets.\n-  Integrated hardware and gimbal on a surrogate aircraft.\n-  Conducted flight tests to demonstrate ViSAR performance in comparison to Electro-Optic sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Conduct flight demonstrations in cooperation with the Air Force Research Laboratory (AFRL) and AFSOC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Imaging and Surveillance Technology (MIST)"
                                    },
                                    "Description": {
                                        "val": "The Military Imaging and Surveillance Technology (MIST) program is developing a fundamentally new optical Intelligence, Surveillance, and Reconnaissance (ISR) capability that provides high-resolution 3-D images to locate and identify a target at much longer ranges than is possible with existing optical systems.  Short, moderate, and long-range prototype optical surveillance and observation systems are being developed that: (1) demonstrate probabilities of recognition and identification at distances sufficient to allow stand-off engagement; (2) overcome atmospheric turbulence, which now limits the ability of high-resolution optics; and (3) increase target identification confidence to reduce fratricide and\/or collateral damage.  The program will develop and integrate the necessary component technologies including high-energy pulsed lasers, receiver telescopes that have a field of view and depth of field that obviates the need for steering or focusing the optical system, computational imaging algorithms to improve system resolution, and data exploitation and analysis tools.  Advances in laser systems, digital imagers, and novel image processing algorithms will be leveraged to reduce the overall size, weight, and power (SWaP) of imaging systems to allow for soldier portable and Unmanned Aerial Vehicle (UAV) platform integration.  The MIST program will transition the optical ISR technology to the Services and Special Operations Command (SOCOM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.361"
                                            },
                                            "Text": {
                                                "val": "-  Completed the development of the short-range 3-D imaging system.\n-  Demonstrated the capabilities of the completed short-range 3-D imaging system.\n-  Completed the development of the mountain-to-ground demonstration capability for the moderate-range 3-D imaging system.\n-  Conducted mountain-to-ground demonstrations of the moderate-range 3-D imaging system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.656"
                                            },
                                            "Text": {
                                                "val": "-  Transition the short-range and moderate-range 3-D imaging system to the Services and SOCOM."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SEN-03"
                    },
                    "ProjectTitle": {
                        "val": "EXPLOITATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.456"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Exploitation Systems project developed algorithms, software, and information processing systems to extract information from massive Intelligence, Surveillance, and Reconnaissance (ISR) datasets.  In particular, it developed new technologies for detection and discrimination of targets from clutter, classification and fingerprinting of high value targets, localization and tracking over wide areas, and threat network identification and analysis.  Interest extended to open source information and issues such as trustworthiness and provenance.  The resulting technology enables operators to more effectively and efficiently incorporate all sources of information, including sensor, human, and open source data, in intelligence products."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Insight"
                                    },
                                    "Description": {
                                        "val": "Insight developed the next generation multi-intelligence exploitation and analysis system.  Insight provided new exploitation capabilities through an integrated, standards-based system that is designed for mission flexibility and cross-theater applicability.  Insight enabled threat detection through combination and analysis of information from imaging and non-imaging sensors and other sources.  The technical approach emphasized graph-based correlation, adversary behavior modeling, threat network analysis tools, a unified data management and processing environment, novel exploitation algorithms and analysis methodologies, and tools to integrate human and machine processing, including visualization, hypothesis manipulation, and on-line learning.  Insight development activities leveraged both virtual and physical test bed environments.  The virtual test bed enabled evaluation of alternative sensor mixes and algorithms under extended operating conditions.  The physical test bed enabled live testing under realistic operational conditions using current and next generation sensing and processing systems.  Insight technology development was coordinated with the following transition sponsors: Army Program Executive Office - Intelligence, Electronic Warfare & Sensors (PEO IE&WS), United States Army Intelligence Center of Excellence (USAICoE), Project Manager Distributed Common Ground System - Army (PM DCGS-A), Air Staff, National Air and Space Intelligence Center (NASIC), Air Force Research Laboratory, and an operational command partner.  There are MOAs or MOUs in place with each of these transition stakeholders.  Insight provided a unified architecture for plug-and-play ISR with extensibility to all Services and Combatant Commands."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.456"
                                            },
                                            "Text": {
                                                "val": "-  Tested advanced fusion and analytic technologies, and demonstrated improvements and maturity of multi-intelligence exploitation capabilities.\n-  Addressed capability objectives and key performance parameters identified by the Army, and delivered Insight software to PM DCGS-A.  \n-  Met capability objectives jointly identified with NASIC, delivered Insight software to NASIC, and conducted assessments of the capabilities in conjunction with NASIC personnel.\n-  Provided a capability to support operational command partner exercises and mission training, delivered Insight software to the partner, and collaborated on the application of Insight capabilities to partner training exercises."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SEN-06"
                    },
                    "ProjectTitle": {
                        "val": "SENSOR TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "72.547"
                        },
                        "CurrentYear": {
                            "val": "76.529"
                        },
                        "BudgetYearOne": {
                            "val": "64.467"
                        },
                        "BudgetYearOneBase": {
                            "val": "64.467"
                        },
                        "BudgetYearTwo": {
                            "val": "40.875"
                        },
                        "BudgetYearThree": {
                            "val": "23.500"
                        },
                        "BudgetYearFour": {
                            "val": "10.500"
                        },
                        "BudgetYearFive": {
                            "val": "8.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "72.547"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "76.529"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "64.467"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "64.467"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}