{
    "id": "2018-AirForce-PB-3600-JBOOK-4677b7373ceb5a2af4f54ac9946d42727733735517b0c06be4cbaa3f97502e4b-17",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3B-U_RDTE_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305114F"
        },
        "ProgramElementTitle": {
            "val": "Air Traffic Control, Approach, and Landing System (ATCALS)"
        },
        "R1LineNumber": {
            "val": "244"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.830"
            },
            "CurrentYear": {
                "val": "9.770"
            },
            "BudgetYearOne": {
                "val": "6.306"
            },
            "BudgetYearOneBase": {
                "val": "6.306"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "6.318"
            },
            "BudgetYearThree": {
                "val": "6.501"
            },
            "BudgetYearFour": {
                "val": "6.615"
            },
            "BudgetYearFive": {
                "val": "6.750"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.392"
                },
                "CurrentYear": {
                    "val": "9.770"
                },
                "BudgetYearOne": {
                    "val": "6.288"
                },
                "BudgetYearOneBase": {
                    "val": "6.288"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.830"
                },
                "CurrentYear": {
                    "val": "9.770"
                },
                "BudgetYearOne": {
                    "val": "6.306"
                },
                "BudgetYearOneBase": {
                    "val": "6.306"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.562"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.018"
                },
                "BudgetYearOneBase": {
                    "val": "0.018"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.562"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.018"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "673587"
                    },
                    "ProjectTitle": {
                        "val": "Air Traffic Control Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.830"
                        },
                        "CurrentYear": {
                            "val": "9.770"
                        },
                        "BudgetYearOne": {
                            "val": "6.306"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.306"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.318"
                        },
                        "BudgetYearThree": {
                            "val": "6.501"
                        },
                        "BudgetYearFour": {
                            "val": "6.615"
                        },
                        "BudgetYearFive": {
                            "val": "6.750"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "To support the Air Force worldwide flying mission, this program element funds research, development, and management of new air traffic control communications, surveillance, positioning, and precision approach and landing systems.  When applicable, this includes joint efforts with the Federal Aviation Administration (FAA) and coordination with the International Civil Aviation Organization and the North Atlantic Treaty Organization.  ATCALS development funding currently focuses on the Next Generation (NextGen) Air Transportation System (ATS) and Deployable Radar Approach Control (D-RAPCON) programs as described below.\n\nNextGen ATS.  This is the United States initiative for the transformation of the National Airspace System (NAS) over the next 20-30 years to enhance safety, security, efficiency, affordability and capacity, meeting the requirements of all users of the NAS.  This interagency effort is designed to enable the transition from a ground infrastructure dominated Air Traffic Management capability to a capability that leverages advances in aircraft Performance Based Navigation (PBN), non-radar based surveillance services, and transition from solid-state analog voice communications to networked digital voice and data exchange.  Per Deputy Secretary of Defense Direction (28 Dec 07 Memo), the Air Force is the DoD lead Service for NextGen ATS implementation and architecture development.  NextGen ATS will be built on key elements from existing programs and technologies and on new systems under development.  As these technologies and architectures mature, ground system upgrades will be coordinated and fielded concurrently with aircraft avionics capabilities that are acquired and integrated into Air Force aircraft (manned and unmanned).  These efforts are a subset of the Communication, Navigation, and Surveillance\/Air Traffic Management program in PE 0305099F and will involve aircraft avionics as well as fixed based and deployable air traffic control and landing systems.  FY18 efforts will continue to use the Lead Service Office (LSO) process to develop a NextGen ATS DoD Strategic Roadmap, Consolidated Avionics Repository, and Command and Control Core Function Support Plan, outlining DoD and Air Force equities and requirements, via in-depth analysis of FAA NextGen ATS programs and timelines.  Portfolio analysis will be captured in DoD NextGen ATS charters to guide Services through a broad and complex NextGen ATS environment.  To minimize integration costs, the LSO will work with other organizations such as the Joint Program Office (JPO), across the Air Force and the DoD, to adopt a common framework with practical guidelines to evaluate the validity of NextGen ATS initiatives with the Air Force's mission.  These efforts support the development of operational strategies that realize the achievement of valid NextGen ATS initiatives in concert with acquisition strategies in integrated avionics advances for systems such as Mode 5 Identification Friend or Foe (IFF), Global Positioning System (GPS) Military (M)-Code, Automatic Dependent Surveillance-Broadcast (ADS-B), Data Communications (Data Comm), and PBN.  In support of Unmanned Aircraft System (UAS) operations, FY18 JPO efforts will also continue to support requests for implementation of Ground Based Sense and Avoid (GBSAA) at new locations.  In FY18, the Air Force Flight Standards Agency (AFFSA) will continue NextGen ATS strategic planning efforts and also examine new civil air traffic control and landing system technologies that may have military utility such as a remote (unmanned) Air Traffic Control Tower System.  In total, these efforts will focus on enabling DoD aircraft to take advantage of NextGen ATS envisioned efficiencies, developing policies\/procedures to reduce costs while ensuring airspace access, seamlessly integrating UASs into the NAS and international airspaces, improving the display of aircraft position to air traffic controllers, determining future requirements for digital communications with manned and unmanned aircraft, and enhancing flight safety.  \n\nDeployable Radar Approach Control (D-RAPCON).  D-RAPCON will replace the 40 year old Air National Guard (ANG) AN\/MPN-14K and Active Duty (AD) AN\/TPN-19 Airport Surveillance Radar and Operations Shelter subsystems with state-of-the-art digital systems.  Due to diminishing manufacturing sources, modification and overhaul of the existing systems has proven to be ineffective.  On average, due to systemic equipment failures, no more than four of the existing 14 systems are deployable at any given time and none are fully mission capable.  The current AN\/TPN-19 (4 systems) and AN\/MPN-14K (10 systems) operational availability rates are 25% and 60% respectively versus a requirement of D-RAPCON of 98%.  D-RAPCON will provide aircraft surveillance\/sequencing, air traffic control communications, and automation capabilities for terminal area air traffic control operations.  D-RAPCON will also be deployed with a fixed base or deployable Instrument Landing System, a fixed or mobile control tower, and a fixed or mobile Tactical Air Navigation system to provide a complete air traffic control capability.  D-RAPCON will support the full range of tactical military, worldwide humanitarian, and domestic disaster relief operations.  The primary surveillance radar coverage (non-cooperative targets) extends out 60 nautical miles (nm) and the secondary surveillance radar coverage (cooperative targets) will increase from 120 nm to 200 nm.  The D-RAPCON Capability Development Document was approved by the Air Force Requirements Oversight Council on 8 Feb 11.  The D-RAPCON Milestone C is planned in Jan 18 with a full rate production decision in Jul 18.  In FY18 no development funds are requested for D-RAPCON.  Remaining development tasks in FY18 will be accomplished with prior year funds and focused on completion of operational testing and the following system certifications: Air Traffic Control Radar Beacon System Identification Friend or Foe, Mark XII\/Mark XIIA Systems Certification; National Airspace System Certification; Shelter\/Transportability Certification; Electro-Magnetic Spectrum Certification; Information Assurance Certification; and Accreditation and Interoperability and Supportability Certification.  Related OPAF funds are in PE 0305114F Weapon System Code 833010.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NextGen ATS"
                                    },
                                    "Description": {
                                        "val": "Includes efforts to implement NextGen ATS efficiencies and capabilities. Focus is on Automatic Dependent Surveillance Broadcast (ADS-B) integration risk reduction, seamless integration of Unmanned Aircraft Systems (UASs) into civil airspace, Lead Service Office (LSO)\/Joint Program Office (JPO) technical support\/architecture development, development of NextGen ATS aircraft performance based navigation avionics roadmaps, a Consolidated Avionics Repository, and surveillance radar\/ADS-B integration\/automation system upgrades."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.886"
                                            },
                                            "Text": {
                                                "val": "- Continued to execute analysis of NextGen ATS programs and capture results through charters and incorporate into NextGen ATS DoD Strategic Roadmap and Consolidated Avionics Repository which included the following tasks:\n-- Completed development of performance based navigation strategic roadmap charter based on Air Mobility Command Flight Operations and Air Navigation Service Provider perspectives.\n-- Continued use of performance based navigation roadmap and charter to conduct analysis and prioritization of NextGen ATS aircraft avionics and ground system capabilities.\n-- Continued testing\/validation of position sources and transponders against ADS-B requirements to determine ADS-B compatibility.\n-- Continued assessment of DoD GPS avionics and Identification Friend or Foe transponders.\n-- Continued gathering\/clarifying\/analyzing data on FAA radar dependencies (ADS-B) for impact and mitigation strategies (minimum operating network) in the event of FAA divestiture.\n-- Continued to develop solutions\/timeline to integrate Data Comm equipage into DoD fleet.\n-- Continued to advance electronic flight bag applications and standardization across all major commands.\n-- Continued to coordinate with interagency partners to promote UAS integration into civil airspace, including participation in applicable standards organizations.\n-- Continued to support requests for implementation of UAS GBSAA capability at new locations.\n-- Began effort to evaluate solutions for Self-Contained Approaches.\n-- Began effort to evaluate solutions for Alternative Positioning, Navigation, and Timing.\n- Began preparation of engineering change proposal to integrate Mode 5 Identification Friend or Foe and secure comm into D-RAPCON surveillance radar and automation system.\n- Gathered data from industry request for information responses on solutions for Remote Air Traffic Control Tower System."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.020"
                                            },
                                            "Text": {
                                                "val": "- Continue to execute analysis of NextGen ATS programs and capture results through charters and incorporate into NextGen ATS DoD Strategic Roadmap and Consolidated Avionics Repository which include the following tasks:\n-- Continue use of performance based navigation roadmap\/charter to conduct analysis & prioritization of NextGen ATS aircraft and ground system capabilities.\n-- Continue testing\/validation of position sources and transponders against ADS-B requirements to determine ADS-B compatibility.\n-- Continue assessment of DoD GPS avionics and Identification Friend or Foe (IFF) transponders.\n-- Continue to analyze FAA radar divestiture impacts and AF radar and FAA ADS-B coverage data for establishing a minimum operating network (MON). \n-- Continue to develop solutions\/timeline to integrate Data Comm equipage into DoD fleet.\n-- Continue to advance electronic flight bag applications across all major commands.\n-- Continue to support requests for implementation of UAS GBSAA capability at new locations.\n-- Continue evaluation of solutions for Self-Contained Approaches.\n-- Continue evaluation of solutions for Alternative Positioning, Navigation, and Timing (APNT).\n-- Begin analysis on specific base flight operations to identify opportunities to enhance performance based navigation usage.\n-- Provide requirements analysis and document actions and costs to replace legacy air traffic control surveillance radars with the Spectrum Efficient National Surveillance Radar.\n- Continue integration analysis of Mode 5 IFF\/Secure Comm into D-RAPCON.\n- Assess maturity of Remote Air Traffic Control Tower technology and potential to support AF flying\/ATC missions in lieu of brick and mortar control towers.\n- Conduct analysis of options to develop Procedures for Air Navigation Service - Operations (Pans-Ops) Terminal Instrument procedures (TERPS) capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.306"
                                            },
                                            "Text": {
                                                "val": "- Will continue to execute analysis of NextGen ATS programs and capture results through charters and incorporate into NextGen ATS DoD Strategic Roadmap and Consolidated Avionics Repository which will include the following tasks:\n-- Will continue use of performance based navigation (PBN) roadmap and charter to conduct analysis and prioritization of NextGen ATS aircraft and ground system capabilities.\n-- Will continue analysis on specific base flight operations to identify opportunities to enhance PBN usage.\n-- Will continue testing\/validation of position sources and transponders against Automatic Dependent Surveillance Broadcast (ADS-B) requirements to determine ADS-B compatibility.\n-- Will continue assessment of DoD GPS avionics and Identification Friend or Foe transponders.\n-- Will complete joint FAA\/Air Force analysis\/assessment of FAA radar divesture\/impacts and establishment of a MON.\n-- Will continue development of solutions to integrate Data Comm capability into DoD fleet.\n-- Will continue to advance electronic flight bag applications.\n-- Will continue to coordinate with interagency partners to promote UAS integration into civil airspace.\n-- Will continue to support requests for implementation of UAS GBSAA capability at new locations.\n-- Will continue evaluation of solutions for Self-Contained Approaches.\n-- Will continue evaluation of solutions for APNT.\n- Will continue to refine D-RAPCON Mode 5 and secure comm\/architecture and concept of operation.\n- Will continue planning for execution of Operational Utility Evaluation of a Remote Air Traffic Control Tower capability to AF flying\/ATC missions in lieu of brick and mortar control towers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "D-RAPCON"
                                    },
                                    "Description": {
                                        "val": "Effort supports D-RAPCON engineering, manufacturing, and development and government developmental and operational testing of one Pre-Production Unit (PPU) leading to Milestone C and production decisions in FY18."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.944"
                                            },
                                            "Text": {
                                                "val": "- Continued contractor testing.\n- Obtained frequency allocation and authority to radiate approvals.\n- Continued preparation of documentation to obtain six separate certifications which are required for entry into full rate production:\n-- Air Traffic Control Radar Beacon System, Identification Friend or Foe, Mark XII\/Mark XIIA Systems Certification. \n-- National Air Space Certification.\n-- Shelter\/Transportability Certification.\n-- Electro-Magnetic Spectrum Certification.\n-- Information Assurance Certification.\n-- Accreditation and Interoperability and Supportability Certification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Text": {
                                                "val": "- Complete contractor testing and begin government developmental testing and deficiency mitigation work as necessary.\n- Continue to prepare for Milestone C decision and production contract award in FY18. \n- Continue the following system certifications which are required prior to full rate production decision:\n-- Air Traffic Control Radar Beacon System, Identification Friend or Foe, Mark XII\/Mark XIIA Systems Certification. \n-- National Airspace System Certification.\n-- Shelter\/Transportability Certification.\n-- Electro-Magnetic Spectrum Certification.\n-- Information Assurance Certification.\n-- Accreditation and Interoperability and Supportability Certification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA 03: Line Item # 833010"
                                    },
                                    "Title": {
                                        "val": "Air Traffic Control and Landing Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "24.866"
                                        },
                                        "BudgetYearOne": {
                                            "val": "65.079"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "48.579"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "16.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "54.086"
                                        },
                                        "BudgetYearThree": {
                                            "val": "46.713"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.100"
                                        },
                                        "BudgetYearFive": {
                                            "val": "37.772"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA 05: Line Item # 861900"
                                    },
                                    "Title": {
                                        "val": "Spares and Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "1.009"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.294"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.294"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.939"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.957"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.143"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.201"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "ATCALS is a basket program element with multiple programs in various stages of acquisition which provide the air traffic control infrastructure to support peacetime and wartime missions.  The current acquisition strategy is focused on replacing 1960\/70s era deployable and fixed based equipment with mature off-the-shelf technology with remote maintenance capability while also looking to the future under the NextGen ATS initiative.\n\nCurrent contracting efforts include D-RAPCON development and GBSAA\/NextGen ATS planning and implementation.  The contracting strategy for D-RAPCON development is based on award of a competitive fixed price incentive firm contract emphasizing off-the-shelf technology and maximizing the use of non-developmental items. The contract includes engineering, manufacturing, and development and test with follow-on production options.  GBSAA and NextGen ATS Enterprise Architecture Implementation Tasks are being executed via Military Inter-Departmental Purchase Requests, and Project Orders with various organizations (FAA, MITRE, Army, Air Force Research Laboratory, and Air Force Flight Standards Agency).       \n\nThe Air Force Program Executive Officer (PEO) for Battlefield Management (BM) is the PEO for ATCALS.  PEO\/BM is also the delegated milestone decision authority for ATCALS.  The Air Force Life Cycle Management Center Aerospace Management Systems Division (AFLCMC\/HBA) is aligned under the PEO\/BM and includes program management, contracts, legal, and financial management support."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}