{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c43fbf6cbb750060d4e843075183a8e999b0dddb3a2f8fae77d834880adb92d8-10",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603122D8Z"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism Technology Support"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "380.126"
            },
            "PriorYear": {
                "val": "146.115"
            },
            "CurrentYear": {
                "val": "73.002"
            },
            "BudgetYearOne": {
                "val": "101.230"
            },
            "BudgetYearOneBase": {
                "val": "76.230"
            },
            "BudgetYearOneOCO": {
                "val": "25.000"
            },
            "BudgetYearTwo": {
                "val": "79.902"
            },
            "BudgetYearThree": {
                "val": "80.112"
            },
            "BudgetYearFour": {
                "val": "81.368"
            },
            "BudgetYearFive": {
                "val": "83.392"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "148.030"
                },
                "CurrentYear": {
                    "val": "73.002"
                },
                "BudgetYearOne": {
                    "val": "77.325"
                },
                "BudgetYearOneBase": {
                    "val": "77.325"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "146.115"
                },
                "CurrentYear": {
                    "val": "73.002"
                },
                "BudgetYearOne": {
                    "val": "101.230"
                },
                "BudgetYearOneBase": {
                    "val": "76.230"
                },
                "BudgetYearOneOCO": {
                    "val": "25.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.915"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "23.905"
                },
                "BudgetYearOneBase": {
                    "val": "-1.095"
                },
                "BudgetYearOneOCO": {
                    "val": "25.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Internal Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.915"
                                },
                                "BudgetYearOne": {
                                    "val": "23.905"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.095"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "25.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 realignments and other reductions were in support of Departmental efficiencies and economic assumptions.\nFY 2018 Service Requirement Review Board - As part of the Department of Defense reform agenda, the incremental reduction accounts for consolidation and reduction of service contracts.\nFY 2018 The Department added additional OCO funds to support the Anti-Tunnel project under Physical Security"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "484"
                    },
                    "ProjectTitle": {
                        "val": "Combating Terrorism Technology Support (CTTS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "380.126"
                        },
                        "PriorYear": {
                            "val": "146.115"
                        },
                        "CurrentYear": {
                            "val": "73.002"
                        },
                        "BudgetYearOne": {
                            "val": "101.230"
                        },
                        "BudgetYearOneBase": {
                            "val": "76.230"
                        },
                        "BudgetYearOneOCO": {
                            "val": "25.000"
                        },
                        "BudgetYearTwo": {
                            "val": "79.902"
                        },
                        "BudgetYearThree": {
                            "val": "80.112"
                        },
                        "BudgetYearFour": {
                            "val": "81.368"
                        },
                        "BudgetYearFive": {
                            "val": "83.392"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Combating Terrorism Technical Support (CTTS) program identifies capabilities to combat terrorism and irregular adversaries and delivers these capabilities to U.S., interagency, and international users through rapid research and development, advanced studies, and technical innovation. CTTS is expanding its partnerships with other Defense rapid development and acquisition organizations to leverage their expertise as it tries to expedite and transition new and innovative capabilities for Defense and Interagency users. \n\nCTTS major area of emphasis during FY16 and FY17 will be projects to Countering-ISIL.  Projects are distributed among 10 mission categories, in line with the interagency Technical Support Working Group (TSWG): Advanced Analytics and Capabilities; Chemical, Biological, Radiological, Nuclear, and Explosives; Improvised Device Defeat; Investigative Support and Forensics; Personnel Protection, Physical Security; Surveillance, Collection, and Operations Support; Tactical Operations Support; Training Technology Development; and a new working group, Irregular Warfare and Evolving Threats.\n\nSpecific CTTS areas of emphasis in FY16 and FY17 include Counter-tunnel, Countering-UAVs, Countering-Violent Extremism, and Improving Digital Operations at the tactical level.  The CTTS program is a diverse, advanced technology development effort that capitalizes on interagency and international participation to demonstrate the utility and effectiveness of technology when applied to combating terrorism requirements. It includes technology capability development, proof-of-principle demonstrations in field applications, and coordination to transition from development to operational use. CTTS manages approximately 450 individual projects in support of Defense, federal, state, local, and International customers and partners. \n\nThe CTTS program justified in the R-2 exhibit identifies the projects fully or partially funded by Congressional appropriations for the CTTS program. However, the Combating Terrorism Technical Support (CTTS) also develops technology and provides support using external funds provided by other DoD and other Federal Departments and International partnerships. These projects and support activities are not necessarily reflected in this justification R-2; but the number of activities do reflect positively on the trust and competence that CTTSO has earned throughout the Department and interagency to rapidly conduct critical RDT&E and provide innovative products. \n\nIn FY16, CTTS focused on DoD requirements that supported military forces and interagency operators in demanding or hostile environments such as Iraq, Syria, Afghanistan, and Africa and in the domestic environment by leading the Department in rapidly developing and delivering leading edge products such as CORIAN and MARS-K counter small UAS systems currently deployed to Iraq; tactical tethered ISR vehicles; applications for operational and intelligence collection and analysis of Publically Available Information (PAI) now a Program of Record for USSOCOM; cyber training COSMO and COG that are now Program of Record for the Special Warfare Center and School; an underwater remote operating vehicle (UROV); miniature handheld spectrometers; ruggedized CB protective clothing; systems integration and environment testing of the HALO Maritime Barrier System; and enhancement of the SUNet, off-GIG encrypted communications and data sharing system.\n\nAt the tactical level, CTTS will increasingly address technology requirements requested from USSOCOM’s field components as they increase their regional operations tempo in Iraq, Syria, and Africa.  CTTS will address weight reduction of small arms and ammunition; and secure communications for small units deployed to austere and hostile environments; and mobile counter small UAS systems. Another area of continued emphasis will be the protection of U.S. personnel, to include State Department personnel in embassy and consulate locations overseas that need increased security.  Additionally, in response to congressional direction, CTTS will continue its partnership with Israel to address their tunnel threat and ensure the joint ventures are beneficial U.S. counter-tunnel activities. \n\nCTTS will continue to actively support the Department’s Homeland Defense mission for advanced technology and capabilities that will (1) enhance security along the U.S. Southwest Border and (2) proactively address improvised devices and other chemical, biological, nuclear and radiological threats in a domestic environment.  Additionally, CTTS will assist federal; state and local law enforcement in improving their capabilities investigate and mitigate acts of terrorism in CONUS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Analytic Capabilities (AAC)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Analytic Capabilities (AAC) Subgroup's objective is to develop and deploy integrated analytic capabilities; enabling Commanders, Warfighters, and Mission Partners to share information and make better\/faster decisions at the Strategic, Operational, and Tactical levels. AAC projects improve sense-making, decision-making, and data management across a range of mission areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.378"
                                            },
                                            "Text": {
                                                "val": "Completed the development of an enhanced Critical Thinking Tool that supports the application of evidence-based reasoning for intelligence questions and captures analytic problem-solving approaches. Completed technical integration, operational evaluations, and transition of an Interagency analytic and situational awareness platform. Completed initial prototype design for field evaluation with user communities of the Model-Enabled Analysis, Design, and Execution (MEADE) system to improve decision-making and resource optimization. Completed the development of a target and asset management system incorporating Intelligence, Meteorological, and Oceanographic information as well as adversary behavior that allows for the most efficient allocation of limited resources against an uncertain target set. Completed the development of a platform to support the quick reference and visualization of groups, group relationships, and evolving group dynamics that enable analysts and field operators to quickly identify potential opportunities and risks in evolving operating environments. Completed the development of a visual information system for intelligence and operations networks that is easy to use at the lowest echelon of user and provides a mission planning tool that accounts for terrain and threats. Completed the development of user centric campaign design and planning interface that provides operational users the ability to quickly design, launch, and adjust an active and passive structured data collection and analysis campaign at the operational edge. Continued development, assessment, and accreditation of a secure multi-intelligence collection and distributed processing and sensor fusion platform with an open Application Programming Interface architecture. Initiated development of Operate to Know Concept of Operations (CONOPS) and tools necessary to create a continuous receive-respond and collect-pulse connection between intelligence and operations to investigate, test, and understand the environment in order to take decisive action. Initiated development of a prototype system that exploits videos, images, and social media.  Initiated development of a machine learning lab to predict location of relevant networks. Initiated development of anticipatory analytic tools that will enable military analysts, government analysts, and decision makers to anticipate force activity consequences, discern potential outcomes, and compare\/contrast multiple courses of action simultaneously."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.019"
                                            },
                                            "Text": {
                                                "val": "Complete development, assessments, and support transition of a secure multi-intelligence collection and distributed processing and sensor fusion platform with an open Application Programming Interface architecture. Complete development of a machine learning lab to predict location of relevant assets. Continue prototyping of Model-enabled Analysis, Design, and Execution (MEADE) to include the Military Decision-making Process (MDMP).  Continue development, integration, evaluation, and field testing required to apply Operate to Know CONOPS and tools necessary to create a continuous receive-respond and collect-pulse connection between intelligence and operations to investigate, test, and understand the environment in order to take decisive action to field operations. Continue development of anticipatory analytic tools that will enable military analysts, government analysts, and decision makers to anticipate force activity consequences; discern potential outcomes; and compare\/contrast multiple courses of action simultaneously. Continue development of a prototype system that exploits video, images, and social media based on analyst’s task and creates entity, site, and event dossiers by creating advanced tagging, filtering, and fusion. Initiate development of a Tactical Micro Cloud Server (T-MCS) that will be a secure, rugged, man-packable or fixed mount data server that connects to tactical network devices. Initiate development of analytic methodologies to detect, locate, classify, and geo-spatially portray tunnels or tunneling activity by assessing the threat as a network. Initiate research and development of new capabilities for mission planning and battle management using advanced geographic information systems (GIS) tools on Android based platforms; specifically, the capability to augment geographic information in the field. Initiate development of an ability to extract images from the field and make them useable for digital processing using Optical Character Recognition (OCR) processing so that the images can be used in commercial Arabic translation software. Initiate drone based analytics for in-field mission planning support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.377"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.377"
                                            },
                                            "Text": {
                                                "val": "Complete enhancement of the Model Enabled Analysis, Design, and Execution (MEADE) system by identifying and assessing indirect strategies as well as developing response options against associated types of Gray Zone conflicts. Continue development, integration, evaluation, and field testing required to apply Operate to Know CONOPS and tools necessary to create a continuous receive-respond and collect-pulse connection between intelligence and operations to investigate, test, and understand the environment in order to take decisive actions during field operations. Continue development of a Tactical Micro Cloud Server (T-MCS) that will be a secure, rugged, man-packable or fixed mount data server that connects to tactical network devices.  Complete development of analytic tools that will enable military analysts, government analysts, and decision makers to anticipate force activity consequences; discern potential outcomes; and compare\/contrast multiple courses of action simultaneously. Complete development of a prototype system that exploits social media based on analyst’s task and creates entity, site, and event dossiers by creating advanced tagging, filtering, and fusion of social media collection. Continue development and start deploying of analytic methodologies tool to detect, locate, classify, and geo-spatially portray tunnels or tunneling activity by assessing the threat as a network. Continue development and evaluation of new capabilities for mission planning and battle management using advanced geographic information systems (GIS) tools on Android based platforms; specifically, the capability to augment geographic information in the field. Continue development of an ability to extract images from the field and make them useable for digital processing using Optical Character Recognition(OCR)processing so that the images can be used in commercial Arabic translation software. Continue drone based analytics for in-field mission planning support. Initiate Cognitive Sensing capabilities that will develop an understanding of an operational area, the local dynamics, and identify the disruptive trends that could affect that environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CHEMICAL, BIOLOGICAL, RADIOLOGICAL, NUCLEAR, AND EXPLOSIVES (CBRNE)"
                                    },
                                    "Description": {
                                        "val": "The CBRNE subgroup’s objective is to improve defense capabilities to meet tomorrow’s CBRNE threats. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation on threat characterization; materials attribution; personal protective equipment; detection of CBRNE materials at trace and bulk levels at point, proximity and stand-off distances; development of information resources and decision support tools to assist response elements with risk-based decision making; and consequence management for post-event activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.063"
                                            },
                                            "Text": {
                                                "val": "Continued development of a next generation chemical and biological (CB) glove and initiated development of additional glove sizes. Completed field evaluations and National Fire Protection Association (NFPA) 1994 Class 3 certification testing of a next generation CB sock. Completed incorporation of analytical and sampling procedures for the non-destructive evaluation of CB protective clothing for key contaminants in the field into a decision support matrix. Completed development of a powder material with imbedded chemical detection and decontamination properties. Completed development of a radio-frequency identification (RFID) detection technology for explosives, solid oxidizers, and fumigants in packages and cargo. Completed development of a miniature, hand-portable mass spectrometer for the detection of chemical and explosive threats. Completed development of an apparatus suitable for studying biological threat aerosols under environmentally realistic conditions to update source terms for hazard prediction models. Completed development of a water filtration system capable of producing potable water for 20-50 operators in austere conditions. Completed a study on the deposition and transport of chemical warfare agents (CWAs) in organs post mortem to support science based decision making procedures when handling\/preparing bodies that have been exposed to CWAs. Completed the systematic evaluation of gas forming reactions that could be used in improvised chemical devices. Completed development of a low cost, handheld Raman system for the detection of explosives and chemical threats. Completed development of a microfluidic paper-based analytical device for in-field screening of organic explosives.  Completed transition of a colorimetric fabric technology to a commercialization partner. Completed development of a standardized, evidence-based fire literacy program to address shortcomings of current approaches in current fire safety and survival training. Completed development of a flexible, versatile, and easily transportable platform for detection of small amounts of explosive materials hidden inside portable electronic devices using a combination of passive and active technologies. Completed development of decontamination protocols to preserve forensic evidence while allowing chemical and biological analysis to be performed. Continued test and evaluation of an unobtrusive colorimetric detection system for the detection of CWAs. Completed development of decision support tools to provide on-scene responders with evidence-based information to support decision making for emergency medical response to chemical events, chemical detection, radiological response, firefighting guidance, and countering improvised explosive threats. Continued testing and evaluation of a novel, miniaturized chemiresistor wearable sensor which enables detection of low concentrations of chemicals in an urban environment. Continued testing and evaluation of a novel bio-sensor based upon pyroelectric transducer technology for the detection of biological warfare agents. Continued development of a database and advanced analytical tools for the analysis of improvised CB agent production methods.  Continued evaluation of potential methods of production of threat materials, and identify key indicators and warnings for response personnel.  Continued development and initiated field evaluations of a ruggedized garment which provides NFPA 1994 Class 3 and NFPA 1992 protection. Continued development of new algorithms that increase the specificity and improve the overall utility of commercial Raman explosive detection systems. Continued development of a flexible, versatile, and easily transportable platform for detection of small amounts of explosive materials hidden inside of portable electronic devices using a combination of passive and active technologies. Continued development and evaluation of a modular computer\/web-based training package for hand-held explosive detection technologies. Continued development of a scalable vacuum evidentiary collection device for the collection and preservation of known or suspected biological agent powders. Continued updating source terms for urban dispersion models to improve the ability to characterize deposition patterns in realistic radiological device dispersal (RDD) events. Continued best practices for clean-up procedures for contaminated areas after an RDD event. Continued demonstrating, measuring, and understanding the mechanisms of improvements in defeat or disablement of CB threats using weapons that employ structurally reactive materials (SRM). Continued field evaluations of a new CB protective mask capable of interoperability with tactical equipment for use in tactical environments. Continued testing and evaluation of optimized sampling media for the collection of trace explosive materials. Continued testing and evaluation of next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats. Continued evaluation of enhanced sampling materials and systems for CBRNE threats. Continued development of a risk-based decision support model for skin decontamination in the case of dermal exposures to CWAs. Continued support of the Quadrilateral Group on Chemical, Biological, and Radiological (CBR) Counterterrorism. Continued development of a National Institute for Occupational Safety and Health (NIOSH) certified 15-min chemical, biological, radiological, and nuclear (CBRN) protection escape hood capable of fitting in the pocket of a suit jacket that also passes the flammability, heat resistance and carbon monoxide (CO) protection requirements for a combination CBRN\/CO capability. Continued development of wireless communications that provide the ability to communicate without breaching the CBRN suit integrity or requiring an electrical pass-through. Continued development of a ruggedized one-piece garment which provides NFPA 1994 Class 2 protection from exposure to the harmful effects of all traditional CB warfare agents and toxic industrial chemicals (TICs) listed in NFPA 1994 while allowing for communication and interoperability with tactical equipment. Continued testing new methods to more effectively and efficiently collect nanogram quantities of commercial, military, and homemade explosives that are present near improvised explosive devices. Initiated development of new hardware and software solutions for a broad range of popular handheld detectors, enabling the real-time connectivity of handheld detectors from remote sites to a central location utilizing the First Responder Sensor Protocol. Initiated CBRN respirator testing against additional TICs representative of the current threats encountered. Initiated development of multiple use biological personal protective equipment which provides NFPA 1999, Standards on Protective Clothing for Emergency Medical Operations, protection, and NFPA 1994, Standard on Protective Ensembles for First Responders to CBRN Terrorism Incidents, Class 4 protection. Initiated development of a hazmat technician level, skills-based training program to prepare hazmat operators to use risk-based selection mechanisms to determine the appropriate level of personal protective equipment. Initiated development of a hazmat technician level, skills-based training program to prepare hazmat operators to use evidence-based selection mechanisms to develop and\/or choose the appropriate mass decontamination protocols for a given situation. Initiated development of assessment tools and criteria to properly rank and qualify commercial cooling systems to use with CBRNE personal protective equipment (PPE). Initiated development of a small, low-cost, disposable sampler, containment vessel, and adapter to be used in sampling of broad spectrum chemical residues on operational surfaces. Initiated development of next generation evidence packaging for the safe transport of CBRN materials. Initiated an international assessment of a novel genomic sequencing standard for forensic deoxyribonucleic acid (DNA) metagenomics. Initiated a study on a next generation sequencing technology for potential applications in field deployed laboratories. Initiated development of a test bed for the evaluation of cargo for contraband including special nuclear materials, explosives, drugs, and other potential materials of interest, utilizing muon tomography and electron stopping. Initiated development of a research and development test bed for the evaluation of high volume explosive sampling devices with a focus on cargo\/container screening."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.049"
                                            },
                                            "Text": {
                                                "val": "Complete development of four additional sizes of a next generation CB Glove and initiate NFPA 1994 Class 3 certification testing. Complete development of an unobtrusive, colorimetric system for the detection of CWAs and TICs of concern. Complete development and commercialize a novel, miniaturized chemiresistor wearable sensor which enables detection of low concentrations of chemicals in an urban environment. Complete development of a novel bio-sensor based upon pyroelectric transducer technology for the detection of biological warfare agents. Complete development of an advanced analytical database for the analysis of improvised CB agent production methods. Complete evaluation of potential methods of production of threat materials, and identify key indicators and warnings for response personnel. Complete field evaluations and certify a ruggedized garment which provides NFPA 1994 Class 3 and NFPA 1992 protection. Complete development of new algorithms that increase the specificity and improve the overall utility of commercial Raman explosive detection systems. Complete development of a flexible, versatile, and easily transportable platform for detection of small amounts of explosive materials hidden inside of portable electronic devices using a combination of passive and active technologies. Complete development of a modular computer\/web-based training package for hand-held explosive detection technologies. Complete development of a scalable vacuum evidentiary collection device for the collection and preservation of known or suspected biological agent powders. Complete source term development for urban dispersion models to improve the ability to characterize deposition patterns in realistic RDD events. Complete best practices for clean-up procedures for contaminated areas after an RDD event. Complete evaluation of SRMs. Continue to conduct verification and validation testing of a new CB protective mask capable of interoperability with tactical equipment for use in tactical environments. Continue testing and evaluation of optimized sampling media for the collection of trace explosive materials. Continue testing and evaluation of next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats. Continue evaluation of enhanced sampling materials and systems for CBRNE threats. Complete development of a risk-based decision support model for skin decontamination in the case of dermal exposures to CWAs. Complete NIOSH certification of a 15-min CBRN protection escape hood capable of fitting in the pocket of a suit jacket that also passes the flammability, heat resistance and CO protection requirements for a combination CBRN\/CO capability. Complete field testing of wireless communications that provide the ability to communicate without breaching the CBRN suit integrity or requiring an electrical pass-through. Complete NFPA 1994 Class 2 certification testing of a ruggedized one-piece garment which provides protection from exposure to the harmful effects of all traditional CB warfare agents and TICs listed in NFPA 1994 while allowing for communication and interoperability with tactical equipment. Complete development of new hardware and software solutions for a broad range of popular handheld detectors, enabling the real-time connectivity of handheld detectors from remote sites to a central location utilizing the First Responder Sensor Protocol. Continue support of the Quadrilateral Group on CBR Counterterrorism. Continue testing new methods to more effectively and efficiently collect nanogram quantities of commercial, military, and homemade explosives that are present near improvised explosive devices. Continue CBRN respirator testing against additional TICs representative of the current threats encountered. Continue development of multiple use biological PPE which provides NFPA 1999, Standards on Protective Clothing for Emergency Medical Operations, protection, and NFPA 1994, Standard on Protective Ensembles for First Responders to CBRN Terrorism Incidents, Class 4 protection. Complete development of a hazmat technician level, skills-based training program to prepare hazmat operators to use risk-based selection mechanisms to determine the appropriate level of personal protective equipment. Complete development of a hazmat technician level, skills-based training program to prepare hazmat operators to use evidence-based selection mechanisms to develop and\/or choose the appropriate mass decontamination protocols for a given situation. Complete development of assessment tools and criteria to properly rank and qualify commercial cooling systems to use with CBRNE PPE. Continue development of a small, low-cost, disposable sampler, containment vessel, and adapter to be used in sampling of broad spectrum chemical residues on operational surfaces. Complete development of next generation evidence packaging for the safe transport of CBRN materials. Continue assessment of novel genomic sequencing standards for forensics DNA metagenomics. Continue development of a next generation sequencing technology for potential applications in field deployed laboratories. Continue development of a test bed for the evaluation of cargo for contraband including special nuclear materials, explosives, drugs, and other potential materials of interest, utilizing muon tomography and electron stopping. Continue development of a research and development test bed for the evaluation of high volume explosive sampling devices with a focus on cargo\/container screening. Initiate an effort to develop an integrated light-weight inhalation hazard detection system capable of signaling a combination unit respirator (CUR) switching-mechanism to change operating modes of a CUR between filtered air and supplied air. Initiate development of a low profile tactical self-contained breathing apparatus (SCBA) to allow for working in confined spaces, tunnels, and similar access denied environments while providing high quality breathing air. Initiate development of an explosive trace detector with a limit of detection less than ten picograms for military and common homemade explosives. Initiate an effort to modify currently fielded ion mobility spectroscopy systems to expand the list of threats detectable to include compounds from emerging military explosives and compounds used in gun powder formulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.562"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.562"
                                            },
                                            "Text": {
                                                "val": "Complete NFPA 1994 Class 3 certification testing of a next generation CB Glove. Complete NIOSH certification of a new CB protective mask capable of interoperability with tactical equipment for use in tactical environments. Continue testing and evaluation of optimized sampling media for the collection of trace explosive materials. Continue support of the Quadrilateral Group on CBR Counterterrorism. Continue testing new methods to more effectively and efficiently collect nanogram quantities of commercial, military, and homemade explosives that are present near improvised explosive devices. Continue testing and evaluation of a next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats. Complete CBRN respirator testing against additional TICs representative of the current threats encountered. Complete certification of multiple use biological PPE to NFPA 1999, Standards on Protective Clothing for Emergency Medical Operations, protection, and NFPA 1994, Standard on Protective Ensembles for First Responders to CBRN Terrorism Incidents, Class 4. Continue evaluation of enhanced sampling materials and systems for CBRNE threats. Complete development of a small, low-cost, disposable sampler, containment vessel, and adapter to be used in sampling of broad spectrum chemical residues on operational surfaces. Complete assessment of novel genomic sequencing standards for forensics DNA metagenomics. Complete development of a next generation sequencing technology for potential applications in field deployed laboratories. Complete development of a test bed for the evaluation of cargo for contraband including special nuclear materials, explosives, drugs, and other potential materials of interest, utilizing muon tomography and electron stopping. Complete development of a research and development test bed for the evaluation of high volume explosive sampling devices with a focus on cargo\/container screening. Continue development of an integrated light-weight inhalation hazard detection system capable of signaling a CUR switching-mechanism to change operating modes of a CUR between filtered air and supplied air. Continue development of a low profile tactical SCBA to allow for working in confined spaces, tunnels, and similar access denied environments while providing high quality breathing air. Continue development of an explosive trace detector with a limit of detection less than ten picograms for military and common homemade explosives. Continue modification of currently fielded ion mobility spectroscopy systems to expand the list of threats detectable to include compounds from emerging military explosives and compounds used in gun powder formulations. Initiate development of a low-cost detect-to-warn wearable sensing technology to alert and protect first responders and the warfighter of the presence of specific, high-interest toxic industrial chemical (TIC) and chemical warfare agent (CWA) vapors. Initiate development of a low-cost detect-to-identify wearable sensing technology to inform chemical-specialist first responders and warfighters of the presence of a broad range of TIC and CWA vapors. Initiate development of a hyperspectral rapid, large area survey instrument that guides activities ranging from contaminant avoidance to decontamination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IMPROVISED DEVICE DEFEAT (IDD)"
                                    },
                                    "Description": {
                                        "val": "The IDD\/EC Subgroup’s objective is to deliver capabilities to defeat or neutralize the continuum of terrorist improvised weapons and explosive devices. IDD\/EC improves the operational capabilities of the bomb disposal community, consisting of military EOD, and federal, state, and local bomb squads, by developing and delivering advanced tools and technologies, and decision support information to defeat improvised terrorist devices. The IDD\/EC Subgroup identifies and prioritizes multi-agency end-user requirements in collaboration with military units, and federal, state, and local agencies. IDD\/EC actively works with vendors and end-users to deliver advanced prototype systems that provide greater efficiency and increased safety for Bomb Technicians who investigate, access, evaluate, and if needed, render safe or dispose of suspect devices. All development efforts undertaken are in support Presidential Policy Directive 17 (PPD-17), Countering Improvised Explosive Devices, and the National Bomb Squad Commanders Advisory Board (NBSCAB) National Strategic Plan."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.868"
                                            },
                                            "Text": {
                                                "val": "Completed development and delivery of prototypes for operational testing and evaluation of a submersible remotely operated vehicle to counter water-borne IEDs. Completed analysis of alternatives for the development of a capability to robotically conduct on-site desensitization and disposal of sensitive homemade explosives (HMEs) by mixing small quantities of the target HME with a flammable liquid followed by incineration. Completed development of a mobile device application for delivery of trend analyses of worldwide incidents involving improvised explosive device that provides technical data accessible to bomb technician. Completed development of a decision support tool that covers the full range of issues involved in vehicle-borne improvised explosive device (VBIED) response by bomb disposal personnel. Completed analysis of the use of additive manufacturing to build and conceal explosive devices. Completed exploitation of improvised electric detonators and igniter components. Complete development of an environmentally hardened, remotely delivered and operated pan-and-tilt render safe capability for IED disruption. Continue development of a compact, high-power next generation X-ray generator for EOD use. Continue development of a system that can employ data analytics to X-ray images at the scene of a suspect package, hoax device, or IED incident to instantly and automatically identify bomb or IED components by matching database exemplars. Continue development of a device defeat application that allows bomb technicians to select disruption tools based on automated X-ray diagnostics. Continue development of a low cost, disposable Radio Frequency (RF) initiation system for firing commercial blasting caps. Continue development of a lightweight IED protective suit and ballistic helmet to allow increased freedom of movement during counter-IED operations. Initiate development of scalable 3D Computer Assisted Design (CAD) models on non-patented bomb squad render safe tools. \nInitiate an East Coast-based technology requirement gathering capability exercise (TRG CAPEX) to develop and test advanced skills to maneuver hazardous duty robots in challenging, real-world scenarios. Initiate develop of common standards of characterization, analysis and facsimile devices methods for Radio Controlled Improvised Explosive Devices. Initiate development and testing of highly intelligent and power efficient advanced communications ECM techniques that are fully capable of defeating the environmentally adaptive communications capabilities embedded in most advanced wireless systems and networks. Initiate development of common test standards and assessment methods for the full spectrum of EOD disruptors to facilitate the exchange of reliable data. Initiate research, information sharing, and joint peer review of methods for Electromagnetic and Electrostatic Discharge mechanisms for counter-IED applications in support of Directed Energy neutralize capabilities. Initiate development of an HME neutralization field reference for use by Military EOD and Public Safety Bomb Technicians."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.422"
                                            },
                                            "Text": {
                                                "val": "Complete development and delivery of a compact, high-power next generation X-ray generator for EOD use. Complete development of a system that can employ X-ray image analytics at the scene of a bomb or IED incident to instantly and automatically identify bomb or IED components from a database of exemplars. Continue development of a device defeat application that allows bomb technicians to select disruption tools based on automated X-ray diagnostics. Complete development of a low cost, disposable Radio Frequency (RF) firing system for firing commercial blasting caps. Continue development of a lightweight IED protective suit and ballistic helmet to allow increased freedom of movement during counter-IED operations. Continue development of a scalable 3D Computer Assisted Design (CAD) models on non-patented bomb squad render safe tools. Continue an East Coast-based technology requirement gathering capability exercise (TRG CAPEX) to develop and test advanced skills to maneuver hazardous duty robots in challenging, real-world scenarios. Complete develop of common standards of characterization, analysis and facsimile devices methods for Radio Controlled Improvised Explosive Devices. Continue development and testing of highly intelligent and power efficient advanced communications ECM techniques that are fully capable of defeating the environmentally adaptive communications capabilities embedded in most advanced wireless systems and networks. Continue development of common test standards and assessment methods for the full spectrum of EOD disruptors to facilitate the exchange of reliable data. Continue research, information sharing, and joint peer review of methods for Electromagnetic and Electrostatic Discharge mechanisms for counter-IED applications in support of Directed Energy neutralize capabilities. Continue development of an HME neutralization field reference for use by Military EOD and Public Safety Bomb Technicians. Initiate and complete development of an IED Instant Notification System. Initiate development of enhanced capabilities for a submersible remotely operated vehicle to counter water borne IEDs based on operational capability assessment. Initiate development of a hands-free Bomb Suit Heads up Display. Initiate development of a Multi-Fit Inflatable Bomb Suit Helmet Liner capable of being retrofitted to the Med-Eng EOD 9, EOD 9A, and SRS 5 model helmets.  Initiate development of a 3D X-ray Imaging System to interrogate a suspected improvised explosive device (IED) and locate critical components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.786"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.786"
                                            },
                                            "Text": {
                                                "val": "Complete development of a device defeat application that allows bomb technicians to select disruption tools based on automated X-ray diagnostics. Complete development of a low cost, disposable RF firing system for firing commercial blasting caps. Complete development of a lightweight IED protective suit and ballistic helmet to allow increased freedom of movement during counter-IED operations. Continue development of scalable 3D Computer Assisted Design (CAD) models on non-patented bomb squad render safe tools. Continue an East Coast-based technology requirement gathering capability exercise (TRG CAPEX) to develop and test advanced skills to maneuver hazardous duty robots in challenging, real-world scenarios. Complete development and testing of highly intelligent and power efficient advanced communications ECM techniques that are fully capable of defeating the environmentally adaptive communications capabilities embedded in most advanced wireless systems and networks. Complete development of common test standards and assessment methods for the full spectrum of EOD disruptors to facilitate the exchange of reliable data. Complete research, information sharing, and joint peer review of methods for Electromagnetic and Electrostatic Discharge mechanisms for counter-IED applications in support of Directed Energy neutralize capabilities. Complete development of an HME neutralization field reference for use by Military EOD and Public Safety Bomb Technicians. Continue development of enhanced capabilities for a submersible remotely operated vehicle to counter water borne IEDs based on operational capability assessment. Continue development of a hands-free Bomb Suit Heads up Display. Continue development of a Multi-Fit Inflatable Bomb Suit Helmet Liner capable of being retrofitted to the Med-Eng EOD 9, EOD 9A, and SRS 5 model helmets.  Continue development of a 3D X-ray Imaging System to interrogate a suspected improvised explosive device (IED) and locate critical components. Initiate development of a humanoid-type robotic platform for use IED Defeat operations in urban environments. Initiate development of a small, high definition, live streaming camera that displays images onto a hand-held or bomb suit worn screen, or Heads-Up Display. Initiate development of an enhanced spatial awareness capability for robotic platforms that can maintain 360-degree awareness of the platforms surrounding environment. Initiate development of a mixed-reality visualization system for command post\/up-range support that will allow bomb technicians and support personnel to see what is transpiring down-range, and assist the bomb technician with on-scene analysis. Conduct a workshop that integrates Explosive Ordnance Disposal (EOD) and Public Safety Bomb Technicians (PSBT) with engineers and roboticists to collaboratively design and develop new capabilities for VBIED response. Initiate development of a Remotely Operated Vehicle (ROV) vision enhancement capability for operations in turbid waters. Initiate development of an arm and claw for the Sea Wasp underwater ROV that has four (4) very specific, user-defined degrees of freedom."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INVESTIGATIVE AND FORENSICS SCIENCE"
                                    },
                                    "Description": {
                                        "val": "The IFS subgroup’s objective is to advance combating terrorism capabilities in investigative and forensic science. IFS supports joint, interagency, and other partners who apply investigative and forensic science methods, means, or practices to forensic intelligence or investigations. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation of new and advanced technology, equipment, forensic techniques, and investigative tools, as well as development of information resources and on support tools for risk-based decision making and rapid exploitation of evidence.  Projects emphasize rapid and field deoxyribonucleic acid (DNA) analysis, identification of insider threat within agencies, pre-blast and post-blast forensic examination, electronic evidence data acquisition and analysis, sensitive site exploitation, forensic intelligence, and criminalistics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.515"
                                            },
                                            "Text": {
                                                "val": "Completed development of a comprehensive forensic procedure to separate mixed samples of DNA by using short tandem repeats in nuclear DNA. Completed development of an automatic tool that recognizes and identifies faces in uncontrolled files and images. Completed development of a remote identification card image system for the detection of suspected fraudulent ID cards at checkpoints. Completed development of a tool that automatically ingests and analyzes data from mobile device extraction tools and produces intelligence reports. Completed development of mobile device corpus to track, exploit, and store electronic evidence devices. Completed development of a methodology to identify and exploit organic and inorganic compounds found in ammonium nitrate and calcium ammonium nitrate samples for geographical sourcing.  Initiated development of an advanced and improved system that analyzes, stores, and links data and traits from fraudulent identification and travel documents. Initiated development of forensically validated procedures using high resolution mass spectrometry to determine the geographic source of cultivation and processing of heroin and related opium substances. Initiated development of the best forensic methodologies to analyze 3-D printed firearms made with non-metallic materials. Initiated development of a forensic software application that performs searches, matches, and exclusions of vehicle images in still image or video databases. Initiated development of an integrated device for rapid collection and analysis of forensic and biometric data most frequently found at crime scenes and sensitive sites. Initiated development of training procedures to educate and motivate employees at a worksite to report observations indicating other workers may be a potential insider threat to commit espionage or workplace violence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.472"
                                            },
                                            "Text": {
                                                "val": "Complete development of an advanced and improved system that analyzes, stores, and links data and traits from fraudulent identification and travel documents. Complete development of forensically validated procedures using high resolution mass spectrometry to determine the geographic source of cultivation and processing of heroin and related opium substances. Complete development of the best forensic methodologies to analyze 3-D printed firearms made with non-metallic materials. Complete development of a forensic software application that performs searches, matches, and exclusions of vehicle images in still image or video databases. Complete development of an integrated device for rapid collection and analysis of forensic and biometric data most frequently found at crime scenes and sensitive sites. Complete development of training procedures to educate and motivate employees at a worksite to report observations indicating other workers may be a potential insider threat to commit espionage or workplace violence. Initiate development of a software tool that detects and extracts any type of handwritten content on digitized documents. Initiate development of an automated mobile latent fingerprint processing device that enables non-experts to develop searchable quality prints on all types of objects.  Initiate development of a tool that will locate and collect digital data and information from cloud-based sites when the user name and password is known."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.983"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.983"
                                            },
                                            "Text": {
                                                "val": "Complete development of a software tool that detects and extracts any type of handwritten content on digitized documents. Complete development of an automated mobile latent fingerprint processing device that enables non-experts to develop searchable quality prints on all types of objects.  Complete development of a tool that will locate and collect digital data and information from cloud-based sites when the user name and password is known. Initiate development of standard procedures in forensic speaker recognition. Initiate credibility assessment technology algorithm development. Initiate development of an unconstrained scalable facial recognition system. Initiate development of an annual security appraisal tool for insider threat. Initiate design and development of miniature cover body worn audio-video transmitters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Irregular Warfare and Evolving Threats (IW\/ET)"
                                    },
                                    "Description": {
                                        "val": "The IW\/ET subgroup develops new concepts and capabilities for warfighters and inter-agency partners who are confronting the complexity of the current operational environment, while simultaneously looking outward rather than inward to appropriately size, shape and develop their forces. In accordance with the Quadrennial Defense Review’s (QDR) emphasis on preparation to defeat adversaries and succeed in a wide range of contingencies, IW\/ET will engage in operational assessment, concept development, and independent validation of unique prototype capabilities to identify, confront, and defeat evolving threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.085"
                                            },
                                            "Text": {
                                                "val": "Completed an effort to bolster rewards programs by better understanding how to incentivize “street-level” community reporting that may provide indicators of instability and violence (for cents rather than thousands of dollars). The potential exists to dramatically increase the volume, information security, and quality of reporting possible through crowdsourcing applications, particularly when combined with the micro-payment processing breakthrough afforded by blockchain technology. Developed and tested a methodology and application to enable automated and incentivized reporting by civilians in zones of conflict in exchange for micro-payments or tip-sized rewards. Completed the expansion and standardization of requirements for an automated and integrated open source secure analytical platform that fuses critical open source layers with data tools in order to conduct analysis and persistent monitoring to expedite operational planning products and enabled strategic, operational, and tactical users to remotely perform mission critical tasks that result in lower costs and improve system performance. Completed case-studies that provided applicable lessons from literature and expert practitioners on Lawfare and other analogous policy tools and provided recommendations for a framework outlining how the U.S. and its allies can effectively defend against and conduct offensive legal warfare. Completed an initial assessment and analysis of current authorities within the Department of Defense (DoD) and Department of State (DoS) that support building regional stability with U.S. partner nations in the face of a global blended threat and recommended an initial path forward to ensure U.S. investments in the stability paradigm are done in a more coordinated and impactful way. Completed the Network Enablement Capability (NEC) contract that transitioned the LEGACY exportable informant management capability to U.S. forces. Completed Project LEGACY, an exportable informant management capability that significantly improved Afghan National Security Forces counterinsurgency and military intelligence capabilities. Completed an effort to research and develop a classified report that makes use of the Open Source Enterprise's open source analytical expertise in order to support mission-enabling research and analysis capabilities for a CTTSO end user. Completed development of an analytical framework to provide analysts and planners tools and techniques for understanding the urban operational environment that can be used to support operational design, intelligence preparation of the operational environment, course of action (COA) development, COA analysis, COA selection, and plan\/order production. Completed development of statistical models using near real time blockchain data to determine the probability that a Bitcoin transaction is associated with illicit activities. Completed deployment of a government off-the-shelf application that integrates and fuses social medial data for use in strategic and tactical operational planning and preparation of the battlefield. Continued the Behavioral Influence Assessment effort in partnership with the UK’s Defense Science and Technology Laboratory (DSTL) to enable analysts to assess higher-order cascading influences and reactions to events, as well as determine the uncertainty that the event will produce the desired results over time. Continued the Peer-2-Peer effort to challenge university students from the U.S. and abroad to create an online community to counter a common enemy of violent extremists wherever they might exist through the design of a social or digital initiative to counter violent extremism. Continued the analysis and advancement of information operations (IO) as a valid and critical element of combined arms by providing support to: planning and organizing integration of influence capabilities into cyber planning and execution, understanding and planning for the impact and implications of “now media,” and planning and organizing to conduct military deception, as well as the distillation and dissemination of best practices in the planning, execution, and assessment of IO. Continued development and operational deployment of the Nightingale effort, a prototype digital workflow management and content approval capability for members of the Counter Terrorism Strategic Communication community of practice who actively engage on social media platforms. Continued the design of a holistic common interagency analytical and planning approach that better identifies capabilities authorities and funding, links U.S., Allied and partner nation objectives and builds synergy when conducting partner nation capacity building missions. Continued an operational test of the NEC Clever Enabler project with Special Operations Command Africa. Final deliverable will be an exportable all source intelligence training curriculum for use with partner nations. Upon completion of the curriculum and a brief test, the contract will transition to U.S. Africa Command for continued use. Continued the development of a platform to collect and analyze photographs, videos, audio recordings, and general text-based information via precise crowd sourcing techniques and provide the capability to conduct facial, object and ISIL branded recognition. Continued to develop and deliver Secure Unclassified Network (SUNet) which provides a unique virtualization of a single hardware suite of servers and software that provide protected dynamic enclaves of capability for multi-agency users (law enforcement, interagency, coalition, and foreign nationals). Continued research and development of a low-cost, effective and efficient method of extending or creating local security, sustainable governance, and protection from terrorism in small and large urban environments through relevant doctrine, training, technology and innovative partnerships. Utilizing SUNet architecture, this effort facilitates dialogue and information sharing among entities involved in developing community resilience\/resistance in the face of armed violence and creates a platform to test and evaluate tools and TTPs for use in the \"ungoverned\" or \"under-governed\" urban environment. Continued development of the Conflict Zone Tool Kit (CZTK) which resides on a secure, unclassified network and empowers analysts and operators with leading edge tools and expert instruction to enable near-real time situational awareness from host-nation perspective (‘green lens’) related to activities and actors of concern. This platform focuses exclusively on publicly available information accessible on the internet to enhance the ability of analysts and operators to develop and maintain a real time pulse of how terrorist groups make use of open source messaging to recruit, train, and fundraise. Continued the development and test of an exportable IO capability that legitimate governments’ can use to counter violent extremist messaging. Conducted testing and evaluation by delivering training and periodic evaluation through the use of mobile advise and assist training teams in Iraq. Initiated and completed development of a tool to monitor publicly available information, identify and archive trends, and disseminate and respond to real-time threats on a hand-held device in permissive and non-permissive environments using a mobile application that provides real-time publicly available information and situational awareness around a mobile military unit. Initiated the Social Networking Terrain Analysis effort to develop a web-based software application framework that can visualize and monitor the online social network terrain using publicly available information and will be integrated into CZTK. Initiated a new effort implementing advanced information exchange tools and training to help build partner nation collaborative capacity. Initiated an effort to evaluate a new technology that 1) detects real-time cases of Da’esh’s recruitment on social media and 2) in an automated fashion, engages and disrupts extremist recruitment and provide information on current and developing technology, as well as advice on opportunities and risks in developing a program to support this new capability. Initiated an effort that will address a gap in understanding the strategy and concepts of how to foster effective Counter Unconventional Warfare (UW) in the modern age and inform strategy and concepts focused on how a country prepares itself to conduct resistance against an occupying aggressor and what measures and actions a country can take prior to occupation. Cancelled the effort to develop an assessment methodology that will assist counterterrorism strategic messaging by enhancing the ability to use publicly available information to identify key influencers, derive linguistically and culturally accurate insights for message development, and then measure the impact and resonance of such messages. This project was not initiated in lieu of other more urgent requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.168"
                                            },
                                            "Text": {
                                                "val": "Complete the Behavioral Influence Assessment effort in partnership with the UK’s DSTL to enable analysts to assess higher-order cascading influences and reactions to events, as well as determine the uncertainty that the event will produce the desired results over time. Complete the Peer-2-Peer effort to challenge university students from the U.S. and abroad to create an online community to counter a common enemy of violent extremists wherever they might exist, and transition the effort to the Department of Homeland Security, U.S. State Department, and Facebook. Complete the analysis and advancement of IO as a valid and critical element of combined arms by supporting the development and dissemination of operational art of IO, the composition of information related capabilities, and training for IO throughout the U.S. Marine Corps. Complete development and operational deployment of the Nightingale effort to deploy digital workflow, approval, and archival processes in support of the counter-violent extremism mission. Complete the design of a holistic common interagency analytical and planning approach that better identifies capabilities authorities and funding, links U.S., Allied and partner nation objectives and builds synergy when conducting partner nation capacity building missions. Complete an operational test of the NEC Clever Enabler project with Special Operations Command Africa. Final deliverable will be an exportable all source intelligence training curriculum for use with partner nations. Upon completion of the curriculum and a brief test, the contract will transition to U.S. Africa Command for continued use. Complete the development of a platform to collect and analyze photographs, videos, audio recordings, and general text-based information and provide the capability to conduct facial, object and ISIL branded recognition. Complete initial development and delivery of SUNet, which provides a unique virtualization of a single hardware suite of servers and software that will provide protected dynamic enclaves of capability for multi-agency users (law enforcement, interagency, coalition, and foreign nationals). Complete research and development of a low-cost, effective and efficient method of extending or creating local security, sustainable governance, and protection from terrorism in small and large urban environments through relevant doctrine, training, technology and innovative partnerships. Utilizing SUNet architecture, this effort facilitates dialogue and information sharing among entities involved in developing community resilience\/resistance in the face of armed violence and creates a platform to test and evaluate tools and TTPs for use in the \"ungoverned\" or \"under-governed\" urban environment. Complete development of CZTK which resides on a secure, unclassified network and empowers analysts and operators with leading edge analytical tools and expert instruction, to enable near-real time situational awareness from host-nation perspective (‘green lens’), related to activities and actors of concern. This platform focuses exclusively on publicly available information accessible on the internet to enhance the ability of analysts and operators to develop and maintain a real time pulse of how terrorist groups make use of open source messaging to recruit, train, and fundraise. Continue the development and test of an exportable IO capability that legitimate governments’ can use to counter violent extremist messaging. Conduct testing and evaluation by delivering training and periodic evaluation through the use of mobile advise and assist training teams in three select countries. Complete development of the Social Networking Terrain Analysis effort, a web-based software application framework that can visualize and monitor online social network terrain using publicly available information and will be integrated into CZTK. Complete a new effort implementing advanced information exchange tools and training to help build partner nation collaborative capacity. Complete evaluation study on a new technology that 1) detects real-time cases of Da’esh’s recruitment on social media and 2) in an automated fashion, engages and disrupts extremist recruitment and provide information on current and developing technology, as well as advice on opportunities and risks in developing a program to support this new capability. Complete an effort that will address a gap in understanding the strategy and concepts of how to foster effective Counter Unconventional Warfare (UW) in the modern age and inform strategy and concepts focused on how a country prepares itself to conduct resistance against an occupying aggressor and what measures and actions a country can take prior to occupation. Initiate an effort to define the information environment in 2025, outline potential capability gaps, and describe necessary actions in order to gain and maintain information dominance. In addition, this effort will explore information-related capabilities of defense agencies, emerging technologies, and will recommend implementation considerations based on current budget concerns. Initiate development of a capability to simultaneously engage populations across numerous modalities such as social media, web, voice, SMS, MMS, and paper-to-digital, in order to reach disconnected populations around the globe. This effort will enable wide-scale two-way communications in a variety of geopolitical environments, to include those areas with and without internet connectivity. Initiate a Remote Advise and Assist (RAA) project to examine conditions that would lead to successful RAA operations in a full spectrum environment and then develop and field advanced RAA prototypes in order to test the ability of advisors to continue mentoring partners remotely and be able to significantly enhance time with their partners when physical access is severely restricted. Initiate the development of a database containing relevant foreign criminal statutes\/regulations translated into English and searchable against identified behaviors\/activities to compare relevant foreign criminal statutes\/regulations as well as the willingness\/capability of partner nations to take action against identified threat networks and help operationalize law as another non-kinetic tool for commanders. Initiate the development of a tool to support decision makers managing digital operations with predictive advice as to how people will respond to a choice of different types of interventions and improved decision making not only for planning purposes but also for the development of capability underpinned by a behavioral science evidence base. Initiate an effort to manage, develop, enhance, integrate, test, deploy, and maintain a SUNet enterprise system that allows users the ability to detect, monitor, understand, and act in the information environment through mission specific enclaves (partitioned mission or function information cells)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.569"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.569"
                                            },
                                            "Text": {
                                                "val": "Complete the development and test of an exportable IO capability that legitimate governments’ can use to counter violent extremist messaging. Conduct testing and evaluation by delivering training and periodic evaluation through the use of mobile advise and assist training teams. Upon completion, the U.S. Government (USG) will have an exportable IO model that can be used in select partner nations. Complete an effort to define the information environment in 2025, outline potential capability gaps, and describe necessary actions in order to gain and maintain information dominance. In addition, this effort will explore information-related capabilities of defense agencies, emerging technologies, and will recommend implementation considerations based on current budget concerns to help prepare the USG for evolving challenges in hybrid-warfare. Complete development of a capability to simultaneously engage populations across numerous modalities such as social media, web, voice, SMS, MMS, and paper-to-digital, in order to reach disconnected populations around the globe. This effort will enable wide-scale two-way communications in a variety of geopolitical environments, to include those areas with and without internet connectivity. Continue a RAA project to examine conditions that would lead to successful RAA operations in a full spectrum environment and then develop and field advanced RAA prototypes in order to test the ability of advisors to continue mentoring partners remotely and, be able to significantly enhance time with their partners when physical access is severely restricted. Continue the development of a database containing relevant foreign criminal statutes\/regulations translated into English and searchable against identified behaviors\/activities to compare relevant foreign criminal statutes\/regulations as well as the willingness\/capability of partner nations to take action against identified threat networks and operationalize law as another non-kinetic tool for commanders. Continue the development of a tool to support decision makers managing digital operations with predictive advice as to how people will respond to a choice of different types of interventions and improve decision making not only for planning purposes but also for the development of capability underpinned by a behavioral science evidence base. Continue an effort to manage, develop, enhance, integrate, test, deploy, and maintain a SUNet enterprise system that allows the user the ability to detect, monitor, understand, and act in the information environment through mission specific enclaves (partitioned mission or function information cells). Initiate new efforts to develop and deploy capabilities that support DoD, interagency and foreign partners and allies who are confronting ever evolving threat networks and complex global operational environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PERSONNEL PROTECTION"
                                    },
                                    "Description": {
                                        "val": "The Personnel Protection Subgroup’s objective is to develop new equipment, reference tools, and standards to improve the protection of personnel. Projects focus on putting innovative tools such as automated information management systems, communication devices, tagging, tracking and locating devices, mobile surveillance systems, as well as personal and vehicle protection equipment in the hands of personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.862"
                                            },
                                            "Text": {
                                                "val": "Completed development of a tethered aerial platform for enhanced situational awareness and communication capabilities. Completed development of a concealable carrier system that, in conjunction with appropriately sized armor plates, will provide rifle threat protection. Completed development of automated exploitation algorithms for light detection and ranging data. Completed development of a miniaturized transmitter device that can accommodate a Tier 1 unmanned aerial vehicle (UAV) to transmit the UAV video feed over the cellular network for enhanced situational awareness. Completed characterization of ballistic clay to understand unconstrained boundary effects of built up regions of ballistic clay backing in armor testing. Continued development of a multi-radio device that combines multiple radios, GSM and Iridium communication capabilities into one device. Continued development of a wireless tactical communications headset. Continued development of counter unmanned aerial vehicle capabilities. Continued development of biomarker identification for brain injury using magnetic resonance imaging (MRI) and magnetic resonance spectroscopy (MRS) to monitor neurochemical biomarkers for post-traumatic stress disorder and mild traumatic brain injury. Continued development of a novel material for ballistic and blast protection that utilizes fiber optics to enable visibility with opaque armor. Continued a performance analysis of environmental, storage, duty, and geographic region parameters on the degradation and life cycle of body armor. Initiated development of an imminent danger notification system that immediately alerts building occupants to a perceived or actual threat. Initiated development of an event pin detection system to mitigate the risk of adversaries, including insider threats, gaining unauthorized access to event sites. Initiated development of an enhanced vehicle tracking system to operate in urban and GPS denied areas. Initiated development of a system to detect magnetically attached explosive devices placed on vehicles and research and provide proof of concepts to detach the devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.552"
                                            },
                                            "Text": {
                                                "val": "Complete development of a wireless tactical communications headset. Complete development of counter unmanned aerial vehicle capabilities. Complete development of biomarker identification for brain injury using magnetic resonance imaging (MRI) and magnetic resonance spectroscopy (MRS) to monitor neurochemical biomarkers for post-traumatic stress disorder and mild traumatic brain injury. Complete development of a novel material for ballistic and blast protection that utilizes fiber optics to enable visibility with opaque armor. Complete a performance analysis of environmental, storage, duty, and geographic region parameters on the degradation and life cycle of body armor. Complete development of an imminent danger notification system that immediately alerts building occupants to a perceived or actual threat. Complete development of an event pin detection system to mitigate the risk of adversaries, including insider threats, gaining unauthorized access to event sites. Complete development of an enhanced vehicle tracking system to operate in urban and GPS denied areas. Complete development of a multi-radio device that combines multiple radios, GSM and Iridium communication capabilities into one device. Continue development of a system to detect magnetically attached explosive devices placed on vehicles and research and provide proof of concepts to detach the devices. Initiate and complete development of a small lightweight wearable device that securely transmits biometric and geolocation data to a common operating picture. Initiate development of a multifunctional head protection system that provides ballistic protection, and incorporates communication and data display capabilities. Initiate development of a standalone personal armor plated for high power, armor piercing projectile threats using advanced materials. Initiate development of a helmet system to protect against common high power rifle projectile threats. Initiate development of a test apparatus that serves to measure dynamic and static events during and after the course of a ballistic impact. Initiate development of a female body armor ballistic validation protocol through the development of a female backing system and female armor test protocol to ensure female body armor performs to the same standards as male body armor. Initiate development of a mobile sensor suite that can detect subsonic and supersonic rounds that are fired at a convoy and display it on a real time map to provide situational awareness to the operator. Initiate development of appropriately sized armor plates for use in a concealable carrier system to provide rifle threat protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.626"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.626"
                                            },
                                            "Text": {
                                                "val": "Complete development of a system to detect magnetically attached explosive devices placed on vehicles and research and provide proof of concepts to detach the devices. Complete development of a stand standalone personal armor plated for high power, armor piercing projectile threats using advanced materials. Complete development of a helmet system to protect against common high power rifle projectile threats. Complete development of a mobile sensor suite that can detect subsonic and supersonic rounds that are fired at a convoy and display the round’s origin, heading and range on a real time map to provide situational awareness to the operator. Complete development of appropriately sized armor plates for use in a concealable carrier system to provide rifle threat protection. Continue development of a multifunctional head protection system that provides ballistic protection, and incorporates communication and data display capabilities. Continue development of a test apparatus that serves to measure dynamic and static events during and after the course of a ballistic impact. Continue development of a female body armor ballistic validation protocol through the development of a female backing system and female armor test protocol to ensure female body armor performs to the same standards as male body armor. Initiate development of a wearable sensor that provides heart rate, body temperature, pulse oximetry, respiration, and GPS location. Initiate development of standalone armor plates to defeat the 7.62 X 39mm, 124 grain, mild steel core (MSC) projectile. Initiate development of a mechanism to wirelessly charge onboard power supplies for in-flight SUASs at a range of one (Threshold) to three (Objective) kilometers line-of-sight. Initiate development of a robust Electromyography (EMG) sensor system comprised of electrodes, sampling electronics and processing electronics capable of integration into a robotic\/human augmentation platform. Initiate development of an air deployable unmanned aerial system that is capable of dashing ahead of the V-22 and providing at least 8.5 minutes of overhead intelligence, surveillance and reconnaissance (ISR) at the landing zone or drop zone prior to the force arrival. Initiate development of an updated Armored Passenger Vehicle (APV) Handbook with regards to the current management of government APV programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PHYSICAL SECURITY"
                                    },
                                    "Description": {
                                        "val": "Rapidly develop and transition physical security\/force protection capabilities and technologies to support forward deployed and domestic first responders, military, interagency, and international partners in the focus areas of Emerging Explosive Threats\/Blast Effects and Mitigation; Maritime Security; Screening, Observation, Detection, and Protection; and, Subterranean Activities. Emphasize these technology development efforts primarily at U.S. embassies and consulates, forward operating bases, along the U.S. borders, at mass transportation and commerce nodes, in maritime port and littoral environments, and in support of large scale public venues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "43.583"
                                            },
                                            "Text": {
                                                "val": "Completed development of a modular air-droppable force protection kit that includes mini-radar, trip wire sensor and electro-optical\/IR camera sensor.  Completed development of a software tool for an understanding of TNT equivalency that will provide operational forces necessary information for protecting personnel and infrastructure.  Completed development of a rapidly deployable, temporary barrier system to protect fixed and expeditionary facilities in response to increased threat levels.  Completed development of a high performance towed sled to provide increased payload and deployment options for existing combatant craft used by Naval Special Warfare (NSW).  Completed development of US Navy life cycle cost benefit analysis by conducting intermediate system integration and environmental testing of the HALO Maritime Barrier System.  Completed a joint test and evaluation of a portable system that can be used to quickly block target entrances\/exits as well as doorways.  Completed development of tactical arresting systems designed to stop vehicles over a short distance.  Continued development of forced-entry, ballistic and blast resistant doors to support US facilities abroad.  Continued development of an automatic target recognition system for on-the-move, standoff IED detection.  Continued development of an Advanced Diver Data Display System final prototype for combat swimmers.  Continued development of an advanced active diver thermal protection system for long exposure dives.  Continued development and upgrade of a tactical compact aerostat surveillance system for ground and maritime intelligence, surveillance and reconnaissance, as well as communication between non-line-of-sight (NLOS) forces.  Continued development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures.  Continued development of an in-tunnel unmanned aerial vehicle (UAV) that will provide the ability to safely conduct reconnaissance of discovered illicit tunnels and\/or scheduled inspections of underground municipal infrastructures (UMIs) for evidence of interconnecting tunnel activity.  Continued test program to determine the smallest booster size needed to initiate a detonation of Ammonium Nitrate Prill in shipping configuration.  Continued development of materials and mechanisms for tactical delivery of novel non-lethal solutions for maritime vessel disablement.  Continued development of a mobile application to enhance and host the Vehicle Explosion Analysis Software.  Continued to test, characterize and model a novel propane tank Vehicle Borne Improvised Explosive Device (VBIED) threat.  Continued development of a portable and ruggedized body scanner for personnel protection missions based on the existing automated identification technology (AIT) stationary body scanner system.  Continued development and evaluation of two versions of a unique geophysical mapping capability.  Continued development of a prototype communications system for special missions in specified environments.  Continued development and evaluation of a scanning system which will be able to maneuver independently inside specified geophysical target areas and provide situational awareness.  Continued development of a system for mapping particular geophysical phenomena.  Continued development of a joint multi-disciplinary geophysical survey kit, comprised of distinct tools.  Continued development of a system for detection of unique geophysical phenomena and testing and evaluation of the prototypes’ performance in representative sites.  Continued the design and characterization of a test site for testing emerging technologies for unique operational missions.  Continued testing and evaluating the integration of proven land-based sensors into a novel platform for the purpose of conducting advanced geophysical surveys.  Initiated development of a surveillance system with automated 360-degree long range scanning capability (optical radar) to protect the force in tactical combat outposts.  Initiated development of a set of guidelines and certifications that can be used by public, private, academic, and government entities to support the qualification of engineers and architects capable of characterizing and mitigating explosive effects.  Initiated testing on localized responses from facades to quantify the effects of responding components on blast propagation through a new series of controlled explosive tests. Initiated development of a mobile system for stand-off detection and mapping of specified geophysical phenomena.  Initiated development and integration of an extended coverage system for novel border protection applications and test and evaluate the integrated system in different terrain\/geophysical conditions.  Initiated adaptation of existing sensors to detect underground geophysical phenomena from the surface."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.155"
                                            },
                                            "Text": {
                                                "val": "Complete development of forced-entry, ballistic and blast resistant doors to support US facilities abroad.  Complete development of an automatic target recognition system for on-the-move, standoff IED detection.  Complete development of an Advanced Diver Data Display System final prototype for combat swimmers.  Complete development and upgrade of a tactical compact aerostat surveillance system for ground and maritime intelligence, surveillance and reconnaissance, as well as communication between non-line-of-sight (NLOS) forces.  Complete development of an in-tunnel unmanned aerial vehicle (UAV) that will provide the ability to safely conduct reconnaissance of discovered illicit tunnels and\/or scheduled inspections of underground municipal infrastructures (UMIs) for evidence of interconnecting tunnel activity.  Complete development of a surveillance system with automated 360-degree long range scanning capability (optical radar) to protect the force in tactical combat outposts.  Complete test program to determine the smallest booster size needed to initiate detonation of Ammonium Nitrate Prill in shipping configuration.  Complete development of materials and mechanisms for tactical delivery of novel non-lethal solutions for maritime vessel disablement.  Complete development of a mobile application to enhance and host the Vehicle Explosion Analysis Software.  Complete testing, characterization and modeling of a novel propane tank Vehicle Borne Improvised Explosive Device (VBIED) threat.  Complete development of a portable and ruggedized body scanner for personnel protection missions based on the existing AIT stationary body scanner system.  Complete development of a system for mapping particular geophysical phenomena.  Complete development and evaluation of a scanning system which will be able to maneuver independently inside specified geophysical target areas and provide situational awareness.  Complete development of a joint multi-disciplinary geophysical survey kit, comprised of distinct tools.  Complete development of a system for detection of unique geophysical phenomena, and testing and evaluation of the prototypes’ performance in representative sites.  Complete the design and characterization of a test site for testing emerging technologies for unique operational missions.    Continue development of an advanced active diver thermal protection system for long exposure dives.  Continue development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures.  Continue testing on localized responses from facades to quantify the effects of responding components on blast propagation through a new series of controlled explosive tests.  Continue development and evaluation of two versions of a unique geophysical mapping capability.  Continue development of a prototype communications system for special missions in specified environments.  Continue testing and evaluating the integration of proven land-based sensors into a novel platform for the purpose of conducting advanced geophysical surveys.  Continue development of a set of guidelines and certifications that can be used by public, private, academic, and government entities to support the qualification of engineers and architects capable of characterizing and mitigating explosive effects.  Continue development of a mobile system for stand-off detection and mapping of specified geophysical phenomena.  Continue development and integration of an extended coverage system for novel border protection applications and test and evaluate the integrated system in different terrain\/geophysical conditions.  Continue development of a prototype system and concept of operations to detect a particular geophysical phenomenon.  Initiate development of improved, cost-effective High Power Radio Frequency (HPRF) sources for nonlethal vessel and vehicle stopping that achieve militarily useful effective ranges against fast moving targets.  Initiate development of a fast-running ultra-high performance concrete slab model, WAC-U, and improve tools for design, protective use, and vulnerability assessments.  Initiate development of a set of handcuffs that are able to withstand specific physical defeat techniques employed by a detained individual or individuals without the appropriate key, while maintaining the basic design and functionality of currently used handcuffs.  Initiate development of a software tool associated with a comprehensive evaluation of horizontal directional drilling (HDD) equipment that can be used to focus intelligence collection and threat assessments.  Initiate development of a Compact Wireless Surveillance System to safely conduct ground reconnaissance within specific geophysical environments with limited access points.  Initiate development of a remote activation device for tactical arresting systems designed to stop vehicles over a short distance.  Initiate the testing and evaluation of the use of binary explosives for unique applications in specific environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.732"
                                            },
                                            "Text": {
                                                "val": "Complete development of an advanced active diver thermal protection system for long exposure dives.  Complete development of a fast-running ultra-high performance concrete slab model, WAC-U, and improve tools for design, protective use, and vulnerability assessments.  Complete testing on localized responses from facades to quantify the effects of responding components on blast propagation through a new series of controlled explosive tests. Complete development and evaluation of two versions of a unique geophysical mapping capability.  Complete development of a prototype communications system for special missions in specified environments.  Complete testing and evaluating the integration of proven land-based sensors into a novel platform for the purpose of conducting advanced geophysical surveys.  Complete development of a set of guidelines and certifications that can be used by public, private, academic, and government entities to support the qualification of engineers and architects capable of characterizing and mitigating explosive effects.  Complete development of a mobile system for stand-off detection and mapping of specified geophysical phenomena.  Complete development and integration of an extended coverage system for novel border protection applications and test and evaluate the integrated system in different terrain\/geophysical conditions.  Complete development of a prototype system and concept of operations based on a particular geophysical phenomenon.  Complete development of a set of handcuffs that are able to withstand specific physical defeat techniques employed by a detained individual or individuals without the appropriate key, while maintaining the basic design and functionality of currently used handcuffs.  Complete development of a software tool associated with a comprehensive evaluation of horizontal directional drilling (HDD) equipment that can be used to focus intelligence collection and threat assessments.  Complete development of a remote activation device for tactical arresting systems designed to stop vehicles over a short distance.  Complete the testing and evaluation of the use of binary explosives for unique applications in specific environments.  Continue development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures.  Continue development of improved, cost-effective High Power Radio Frequency (HPRF) sources for nonlethal vessel and vehicle stopping that achieve militarily useful effective ranges against fast moving targets.  Continue development of a Compact Wireless Surveillance System to safely conduct ground reconnaissance within specific geophysical environments with limited access points.  Initiate development of a roller door that is forced-entry (FE) resistant and capable of meeting the State Department 15-Minute FE performance criteria.  Initiate development of an in-depth guide of best practices for rescuing tunnel collapse victims inside OSHA-compliant and non-compliant tunnels to enhance survivability.  Initiate development of a novel ship-to-shore fuel transport system in an amphibious towable container that mitigates risk to personnel and fuel loss in the event of an attack.  Initiate development of additional capability for existing Incident Management Preparedness and Coordination Toolkit (IMPACT) software to provide additional flexibility in generating robust and comprehensive site surveys for security planners and first responders."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "Program enhancements would expand new, and accelerate promising rapid RDT&E counter tunnel efforts to support current and emerging requirements articulated in the existing JEON, CBA, and Interagency requirements, while specifically leveraging our most technologically relevant and operational experienced partner through our joint CTTSO\/Israel project work.  The U.S.\/Israel FY18 efforts will primarily focus on the following four (4) lines of effort:\n1)\tOperational Evaluation of Technologies:  A capability that was already proven in terms of technology. Example: A lab demonstrator was built and a technology demonstrator is required in order to use in the field. \n2)\tEnhanced Feasibility Study: The process in which a new concept or technological idea has to be demonstrated. At the end of the study, there will be some (limited) capability to operate the concept in the field (probably by experts) in the CENTCOM AOR.\n3)\tTest site: Northern tunnel test site phased expansion to conduct- for U.S. and Israel to test emerging counter tunnel technologies.    \n4)\tAdvanced R&D: Develop tactical and operational level technologies in support of DoD maneuver forces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURVEILLANCE, COLLECTION AND OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "Identify high-priority user requirements and special technology initiatives focused primarily on countering terrorism through offensive operations.  Enhance US intelligence capabilities to conduct retaliatory or preemptive operations and reduce the capabilities and support available to terrorists."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.233"
                                            },
                                            "Text": {
                                                "val": "Supported the development and testing of an advanced Unmanned Aircraft System (UAS) environmental and functional system test capability to improve assessment of flight worthiness, test functionality and certify subsystems. Completed development of multimedia, exploitation human language technology tools for required languages and for insertion into operational settings to better combat ISIL. Completed development of customized force tracking capabilities to combat ISIL into existing fielded technologies and transition existing systems and tools. Completed integration of public databases into a single user interface application to protect privacy and personal information from ISIL operatives. Completed development of enhanced technology to assist analysts with biometric intelligence and reporting on ISIL personnel.  Initiated the development of enhanced capabilities to facilitate Computer Network Operations against ISIL. Completed deployment of field technical surveillance capabilities against ISIL and enhanced custom force tagging, tracking and locating capabilities. Completed the development of a software application capable of collecting performance and biographical data for selection and assignment of military personnel, complex modeling, and demand forecasting to assign the appropriate personnel to combat ISIL. Initiated the development of convergence solutions to support sustained operations by deployed elements combating ISIL through enhanced layered capabilities.  Initiated the development of non-standard and specialized communications capabilities to combat ISIL and other highly technical adversaries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.651"
                                            },
                                            "Text": {
                                                "val": "Continuing development and integration of Unmanned Aircraft Systems (UAS) and subsystems to improve the effectiveness and efficiency of communication relays to counter ISIL. Initiating new capabilities focused on Human Language Technology and multimedia exploitation in critical languages for operational use against ISIL at the strategic and tactical levels. Continuing development of enhanced capabilities to facilitate Computer Network Operations against ISIL. Continuing development of enhanced capabilities against vehicular signals of interest to counter ISIL. Continuing deployment of field technical surveillance capabilities against ISIL and enhanced custom force tagging, tracking and locating capabilities. Continuing the development of convergence solutions to support sustained operations by deployed elements combating ISIL through enhanced layered capabilities.  Continuing the development of non-standard and specialized communications capabilities to combat ISIL and other highly technical adversaries.  Initiate development of unique biometric capabilities to target ISIL."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.148"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.148"
                                            },
                                            "Text": {
                                                "val": "Complete development and integration of Unmanned Aircraft Systems (UAS) and subsystems to improve the effectiveness and efficiency of communication relays to counter ISIL. Continue new capabilities focused on Human Language Technology and multimedia exploitation in critical languages for operational use against ISIL at the strategic and tactical levels. Continue development of enhanced capabilities to facilitate Computer Network Operations against ISIL. Continue development of enhanced capabilities against vehicular signals of interest to counter ISIL. Continue deployment of field technical surveillance capabilities against ISIL and enhance custom force tagging, tracking and locating capabilities. Continue the development of convergence solutions to support sustained operations by deployed elements combating ISIL through enhanced layered capabilities. Continue the development of non-standard and specialized communications capabilities to combat ISIL and other highly technical adversaries.  Continue development of unique biometric capabilities to target ISIL."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TACTICAL OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "The Tactical Operations Support subgroup’s mission is to execute rapid research and development projects that enhance capabilities of DoD and Interagency special operations tactical teams engaged in finding, fixing, and finishing terrorists.  This includes support to state and local law enforcement agencies to combat domestic terrorism.  The development focus is enabling small tactical units of dominance by providing state of the art overmatch capabilities in:  Offensive Systems; Unconventional Warfare, Counter-Insurgency Support; Tactical Communications; Tactical Reconnaissance, Surveillance, and Target Acquisition Systems; Specialized Infiltration, Access and Exfiltration Systems; Survivability Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.164"
                                            },
                                            "Text": {
                                                "val": "Completed development and delivery of a sniper ballistic and downwind sensor system to increase first round hit capability. Completed development and delivery of a high-definition aerial Intelligence, Surveillance, and Reconnaissance (ISR) gimbal payload for specified air platforms that will enhance situational awareness and intelligence through higher fidelity imaging capabilities. Completed development and delivery of a man-portable aerial radar system that can detect unmanned aerial vehicles and ultralights at the tactical edge. Completed development and delivery of a tactical tethered aerial ISR capability via an indigenous, non-standard mobility platform that provides austere locations with rapid and improved organic situational awareness. Completed and delivered an air mobility vehicle analysis of alternatives and demonstration initiative to conduct training and an operational feasibility assessment for unconventional warfare. Completed development and delivery of a portable tactical micro marker system to enhance personnel recovery operations. Completed a test and evaluation of a new ground mobility vehicle for Special Operations Forces (SOF) that increases survivability and provides signature reduction. Completed development and delivery of an underwater vision enhancement device for ship hull inspections in turbid water and for maritime to land operations. Completed development and delivery of a mobile mesh network repeater system to expand the capabilities of the micro tactical ground robot system in subterranean environments. Completed development and delivery of a next generation small arms signature reduction suppressors for the MK18 CQBR and M4. Completed development and delivery of a lightweight intermediate caliber cartridge utilizing polymer material technologies to reduce combat load and enhance terminal ballistics. Completed development and delivery of a 5.56mm polymer round to reduce weight for standard issue rounds, enhancing combat effectiveness and reducing warfighter operational load and cost. Completed development and delivery of an enhanced military free fall navigation board that incorporates Android applications for greater command and control and mission planning\/execution. Completed development and delivery of a Multi-Role Thermal Survivability System (MRTSS) to support tactical operators conducting aviation, ground mobility, and first responder combating terrorism (CbT) missions. Completed development, delivery, and evaluation of a social media analysis tool for tactical operators. Completed development and delivery of a system that attaches to a smartphone that enables tactical operators to measure areas rapidly to gain a 3D model. Continued development and delivery of an acoustic tooth communicator system for low-visibility operations. Continued development and delivery of microSD chips that provide state-of-the-art high computing at very low power that can create dual personas, enabling secure communication on a smartphone device. Completed RDT&E and provided a prototype that will inform the future development of a solution for a man-portable optical camera system capable of being deployed in complex urban confined spaces, traversing 90 degree corners and obstacles to provide high fidelity situational awareness to law enforcement and SOF tactical teams. Continued development and delivery of a non-pyrotechnic diversionary device that will mitigate collateral damage in confined spaces. Continued development of a multispectral augmented visually enhanced reality imaging capability that provides a significant advantage for long range target acquisition in challenging environments. Continued development of a maritime canister launched small unmanned aerial system for amphibious and maritime operations requiring overhead aerial ISR capabilities. Continued development of a lethal miniature aerial munition system (LMAMS) with substantially improved maneuverability, attack angle, loiter time, and lethality with a full mission profile flight training variant. Continued development and delivery of an unclassified, open source digital operations technical course tailored to train tactical operators in a digital dojo environment to understand the cyber domain and to identify and mitigate cyber threats. Continued development and delivery of a tactical level training course that teaches enhanced operational preparation of the environment and force protection within the digital social media publically accessible information domain to execute 21st Century Special Warfare mission sets. Continued development of a next-generation small unmanned aircraft system stabilized gimbal that integrates laser target designation technologies. Initiated development of a state‐of‐the‐art amplified speaker unit to work with a number of military and commercial radio devices. Initiated development of an increased field of view night vision device for Special Operations Forces (SOF). Initiated development of capabilities for next generation specialized access breaching capabilities involving explosives and hand-held devices. Initiated development of a capability to self-geolocate without causing an RF signature and without relying on GPS capabilities. Initiated development of a next generation Lightweight Medium Machine Gun (MMG) and ammunition to give operators a distinct advantage in both the extended and close-in fight and can transition rapidly from mounted operations to dismounted operations. Initiated development of a modular multi-ability rapidly reconfigurable hand launched small unmanned aircraft system with a common controller that is capable of being re-configured in the field for mission specific tasks. Initiated development of a night vision device with Israel that increases the capability of a tactical operator working in a subterranean environment. Initiated development of a night vision device for US operators only that increases the capability of working in a subterranean environment. Initiate development of a 7.62x51mm Subsonic round optimized to address powder sensitivity issues in order to improve consistency, range, and accuracy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.353"
                                            },
                                            "Text": {
                                                "val": "Complete development and delivery of an acoustic tooth communicator system for low-visibility operations. Complete development and delivery of a tactical communications capability that provides small tactical teams the ability to utilize cutting edge software applications and smartphone hardware over an untrusted host-nation cellular\/internet infrastructure that also includes integration with the Android Tactical Assault Kit (ATAK) and secure forward operational logistics. Complete development and delivery of a non-pyrotechnic diversionary device that will mitigate collateral damage in confined spaces. Complete development and delivery of a multispectral augmented visually enhanced reality imaging capability that provides a significant advantage for long range target acquisition in challenging environments. Complete development and delivery of a maritime canister launched small unmanned aerial system for amphibious and maritime operations requiring overhead aerial ISR capabilities. Complete development and delivery of a lethal miniature aerial munition system (LMAMS) with substantially improved maneuverability, attack angle, loiter time, and lethality with a full mission profile flight training variant. Complete development and delivery of an unclassified, open source digital operations technical course tailored to train tactical operators in a digital dojo environment to understand the cyber domain and to identify and mitigate cyber threats, while also providing tactical operators the ability to conduct sustainment training on a digital sandbox range. Complete development and delivery of a tactical level training course that teaches operationally relevant capabilities to execute digital force protection and operational security for Publically Available Information (PAI). Complete development and delivery of a next-generation small unmanned aircraft system stabilized gimbal that integrates laser target designation technologies. Complete development of a state‐of‐the‐art amplified transceiver speaker unit to work with a number of military and commercial radio devices. Complete development of an increased field of view night vision device for Special Operations Forces (SOF). Continue development and delivery of capabilities for next generation specialized access breaching capabilities involving explosives and hand-held devices. Complete development of a capability to self-geolocate without causing an RF signature and without relying on GPS capabilities. Continue development of a next generation Lightweight Medium Machine Gun (MMG) and polymer .338 Norma Magnum ammunition to give operators a distinct advantage in both the extended and close-in fight and be able to transition rapidly from mounted operations to dismounted operations. Continue development and delivery of a modular multi-ability rapidly reconfigurable hand launched small unmanned aircraft system with a common controller that is capable of being re-configured in the field for mission specific tasks. Complete development of a 7.62x51mm Subsonic round optimized to address powder sensitivity issues in order to improve consistency, range, and accuracy. Initiate development of an Air to Surface Employment Kit (A2SEEK), for the already developed Micro Weather Sensor (MWS), to be packaged into a complete system that will be air dropped out of military aircraft to support operators and C2 elements to receive sensed weather elements and formulate aviation reports in deep battlespace or denied areas. Initiate development of an augmented reality navigation system capability that fuses and overlays a tablet camera’s live footage, navigation instructions, and targeting information for an operator to utilize while operating a vehicle. Initiate development of a man-portable (dismounted\/static) and on-the-move (vehicle mounted) anti-drone system kit that is capable of detection, tracking, identification, and defeating a small Unmanned Aircraft System (sUAS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.610"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.610"
                                            },
                                            "Text": {
                                                "val": "Complete development and delivery of capabilities for next generation specialized access breaching capabilities involving explosives and hand-held devices. Complete development of a next generation Lightweight Medium Machine Gun (MMG) and polymer .338 Norma Magnum ammunition to give operators a distinct advantage in both the extended and close-in fight and be able to transition rapidly from mounted operations to dismounted operations. Complete development and delivery of a modular multi-ability rapidly reconfigurable hand launched small unmanned aircraft system with a common controller that is capable of being re-configured in the field for mission specific tasks. Complete development of an Air to Surface Employment Kit (A2SEEK), for the already developed Micro Weather Sensor (MWS), to be packaged into a complete system that will be air dropped out of military aircraft to support operators and C2 elements to receive sensed weather elements and formulate aviation reports in deep battlespace or denied areas. Complete development of an augmented reality navigation system capability that fuses and overlays a tablet camera’s live footage, navigation instructions, and targeting information for an operator to utilize while operating a vehicle. Continue development of a man-portable (dismounted\/static) and on-the-move (vehicle mounted) anti-drone system kit that is capable of detection, tracking, identification, and defeating a small Unmanned Aircraft System (sUAS)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGY DEVELOPMENT"
                                    },
                                    "Description": {
                                        "val": "The TTD Subgroup’s objective is to provide SOF, DoD, and the interagency community with agile, rapid response, R&D capabilities for optimizing performance in the operational environment and increasing readiness for tomorrow’s threats.  To meet this objective, the subgroup develops human centered technologies that are performance outcome focused in the areas of mobile learning solutions; human performance tools and techniques; immersive and adaptive learning environments; and advanced education and technical skill enhancement methods. TTD’s innovative training capabilities are implemented globally to prepare for critical missions in any operational environment to identify, disrupt, and defeat terrorist threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.364"
                                            },
                                            "Text": {
                                                "val": "Completed development, implementation, and evaluation of a low visibility technology and training solution to enhance operator’s capabilities for illuminating improvised explosive device networks in the maritime and littoral environment. Completed evaluation of a live-fire targetry simulation training system to develop and maintain long range shooting skill sets. Completed development and evaluation of a training and performance support tool for secure use of mobile devices in operational environments. Completed the analysis and development of a suite of augmented reality tools for mobile wearable platforms. Completed development of software models and a mobile application to train features and functions of over 25 foreign and SOF-Peculiar weapons. Completed the evaluation of a reactive shooter course incorporating wearable device human performance measures and training simulation. Completed an evaluation of tools and techniques used by Special Operations personnel to optimize and maintain their cognitive performance through a comprehensive literature review and controlled study. Completed testing of neurocognitive tasks that will measure deficiencies in neurophysiological function such as attention, memory, time estimation, response inhibition, and non-verbal reasoning to inform the development of a mobile training platform for optimizing and maintaining cognitive skills in the field. Continued the development of low-cost robotic targets that move autonomously on a live-fire training range to enhance marksmanship skills and decision making. Continued the development of a multi-week special warfare commercial communications course. Initiated the design and development of task force officer verification and refresher training for delivery on a mobile device. Initiated the implementation, evaluation, and refinement of a program and next generation technology designed to enhance visual acuity and improve operational visual task performance. Initiated the development of a virtual reality part task trainer for pre-mission tasks associated with AC-130 operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.161"
                                            },
                                            "Text": {
                                                "val": "Complete the development and delivery of four low-cost robotic targets that move autonomously on a live-fire training range to enhance marksmanship skills and decision making. Complete the development and evaluation of a multi-week special warfare commercial communications course. Complete the design and development of Task Force Officer verification and refresher training for delivery on a mobile device. Complete the implementation, evaluation, and refinement of a program and next generation technology designed to enhance visual acuity and improve operational visual task performance. Complete the design and development of training software for officers to accomplish immersive use of force decision-making training from a desktop computer or tablet. Continue the development of a virtual reality part task trainer for pre-mission tasks associated with AC-130 operations. Initiate the development of a virtual reality simulated city environment where students will be immersed into realistic training scenarios, such as surveillance, with representative quantities and behaviors of non-player characters including people and vehicles. Initiate the design and development of Remotely Operated Vehicle (ROV) training simulator incorporating the use of the ROV’s cameras, sonar, and navigation software. Initiate the development and evaluation of an automated capability to diagnose shooter performance and problems based on data from an iron sight camera, trigger force sensors, hand grip pressure sensors, and an accelerometer. Initiate the development of a system for snipers to enhance marksmanship skills and receive ballistically accurate feedback in a role-player training environment where live-fire is not available or feasible."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.837"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.837"
                                            },
                                            "Text": {
                                                "val": "Complete the development and evaluation of a virtual reality training part task trainer for pre-mission tasks associated with AC-130 operations. Complete the development of a virtual reality simulated city environment where students will be immersed into realistic training scenarios, such as surveillance, with representative quantities and behaviors of non-player characters (NPCs) including people and vehicles. Complete the development of a Remotely Operated Vehicle (ROV) training simulator incorporating the use of the ROV’s cameras, sonar, and navigation software.  Complete the development and evaluation of an automated capability to diagnose shooter performance and problems based on data from an iron sight camera, trigger force sensors, hand grip pressure sensors, and an accelerometer. Continue the development and evaluation of a system for snipers to enhance marksmanship skills and receive ballistically accurate feedback in a role-player training environment where live-fire is not available or feasible."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}