{
    "id": "2018-Army-PB-2040-JBOOK-4b1431d557244e9ea54e049cfbecfc8cdb410cfc025b821caca6b08b36a8ebb9-21",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605898A"
        },
        "ProgramElementTitle": {
            "val": "Management HQ - R&D"
        },
        "R1LineNumber": {
            "val": "173"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "48.312"
            },
            "CurrentYear": {
                "val": "49.885"
            },
            "BudgetYearOne": {
                "val": "54.679"
            },
            "BudgetYearOneBase": {
                "val": "54.679"
            },
            "BudgetYearTwo": {
                "val": "54.197"
            },
            "BudgetYearThree": {
                "val": "55.312"
            },
            "BudgetYearFour": {
                "val": "56.321"
            },
            "BudgetYearFive": {
                "val": "56.834"
            }
        },
        "ProgramElementNote": {
            "val": "Planned Program Army Joint Test Element (JTE) moved from Project M65 to Program Element (PE) 0605712 \/ Project 001 in Fiscal Year (FY) 2017."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides funding for the salaries and related personnel benefits for the authorized civilian personnel positions that provide for the management functions and the technical direction of the United States (US) Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground, Maryland.  ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter. \n\nThis Program Element includes staff\/management functions of resource management, human resources, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), Aberdeen Proving Ground, Maryland; to the Operational Test Command (OTC), Fort Hood, Texas which consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas; and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range:  Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; West Desert Test Center (WDTC), at Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Yuma Test Center (YTC) at Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC), Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of ~ 2,700 developmental tests; approximately ~70 operational events; and more than ~700 Evaluation and Safety documents supporting acquisition programs.  ATEC’s FY15 total authorized workforce is 8,282 with a $1.8 billion program.\n\nThe Army JTE examines Joint Service, Combatant Command (COCOM) and Department of Defense (DoD) agencies mission gaps, tactics and doctrine resulting in the development of Tactics Techniques and Procedures (TTP), Concept of Operations (CONOPS), and assessment documents.  Products are developed through operational non-materiel solutions to urgent, specific, Joint Warfighter problems. The JTE coordinates and develops nominations for Quick Reaction Tests (QRTs), Joint Feasibility Studies (JFS); serves as the Operational Test Agency (OTA) for Army-led QRTs; and coordinates resources to support Joint Feasibility Studies (JFSs) and chartered Joint Tests (JT) under the Joint Test Unit (JTU) assigned to ATEC as the joint OTA.  The ATEC Commanding General serves as the Executive Steering Committee (ESG) member, while the Executive Director serves as the Technical Advisory Board (TAB) member.  Department of Defense Directive (DoDD) 5010.41 provides policies and responsibilities for the JTE.  The Department of Army (DA) G-8 is the agent for JTE for operations and DoD level Senior Advisory Council (SAC) responsibly.  Mission support also includes the support to two JTUs under the re-engineered Joint Test program.  ATEC provides military resource support to Nellis Air Force Base, and Suffolk VA with Officer and Non-Commissioned Officer (NCO) support.  Additional support to Joint Tests remains a requirement until the Office of the Secretary of Defense (OSD) Chartered projects are completed and transitioned to the respective Sponsoring COCOM.\n\nThis project does not finance test facility operations, test instrumentation or test equipment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "48.955"
                },
                "CurrentYear": {
                    "val": "49.885"
                },
                "BudgetYearOne": {
                    "val": "49.742"
                },
                "BudgetYearOneBase": {
                    "val": "49.742"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.312"
                },
                "CurrentYear": {
                    "val": "49.885"
                },
                "BudgetYearOne": {
                    "val": "54.679"
                },
                "BudgetYearOneBase": {
                    "val": "54.679"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.643"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.937"
                },
                "BudgetYearOneBase": {
                    "val": "4.937"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.643"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "4.118"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.118"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.811"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.811"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "CivPay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.008"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.008"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "M65"
                    },
                    "ProjectTitle": {
                        "val": "Army Test and Evaluation Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "48.312"
                        },
                        "CurrentYear": {
                            "val": "49.885"
                        },
                        "BudgetYearOne": {
                            "val": "50.802"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.802"
                        },
                        "BudgetYearTwo": {
                            "val": "50.243"
                        },
                        "BudgetYearThree": {
                            "val": "51.282"
                        },
                        "BudgetYearFour": {
                            "val": "52.207"
                        },
                        "BudgetYearFive": {
                            "val": "52.636"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Army Joint Test Element (JTE) will be moved to Program Element (PE) 0605712A, Project 001 in Fiscal Year (FY) 2017."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project provides funding for the salaries and related personnel benefits for the authorized civilian personnel positions that provide for the management functions and the technical direction of the United States (US)  Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground, Maryland.  ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter. \n\nThis Project includes staff\/management functions of resource management, human resources, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), Aberdeen Proving Ground, Maryland; to the Operational Test Command (OTC), Fort Hood, Texas which consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas; and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range:  Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; West Desert Test Center (WSTC) at Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Yuma Test Center (YTC), at Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC), Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of ~ 2,700 developmental tests; approximately ~70 operational events; and more than ~700 Evaluation and Safety documents supporting acquisition programs. ATEC’s Fiscal Year (FY) 2015 total authorized workforce is 8,282 with a $1.8 billion program.\n\nThe Army Joint Test Element (JTE) examines Joint Service, Combatant Command (COCOM) and Department of Defense (DoD) agencies mission gaps, tactics and doctrine resulting in the development of Tactics Techniques and Procedures (TTP), Concept of Operations (CONOPS), and assessment documents.  Products are developed through operational non-materiel solutions to urgent, specific, Joint Warfighter problems. The JTE coordinates and develops nominations for Quick Reaction Tests (QRTs), Joint Feasibility Studies (JFS); serves as the Operational Test Agency (OTA) for Army-led QRTs; and coordinates resources to support Joint Feasibility Studies (JFSs) and chartered Joint Tests (JT) under the Joint Test Unit (JTU) assigned to ATEC as the joint OTA.  The ATEC Commanding General serves as the Executive Steering Committee (ESG) member, while the Executive Director serves as the Technical Advisory Board (TAB) member.  Department of Defense Directive (DoDD) 5010.41 provides policies and responsibilities for the JTE.  The Department of Army (DA) G-8 is the agent for JTE for operations and DoD level Senior Advisory Council (SAC) responsibly.  Mission support also includes the support to two Joint Test Units (JTU) under the re-engineered Joint Test program.  ATEC provides military resource support to Nellis Air Force Base, and Suffolk VA with Officer and Non-Commissioned Officer (NCO) support.  Additional support to Joint Tests remains a requirement until the Office of the Secretary of Defense (OSD) Chartered projects are completed and transitioned to the respective Sponsoring COCOM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Test and Evaluation Command"
                                    },
                                    "Description": {
                                        "val": "Civilian labor and other support required to manage and administer the Army test and evaluation mission at ATEC.  ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.049"
                                            },
                                            "Text": {
                                                "val": "Funded authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.885"
                                            },
                                            "Text": {
                                                "val": "Will fund authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "50.802"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "50.802"
                                            },
                                            "Text": {
                                                "val": "Will fund authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Joint Test Element"
                                    },
                                    "Description": {
                                        "val": "This Project also funds Army's JTE which is comprised of civilian and military personnel.  The JTE is required to research COCOM Integrated Priorities, Generate\/Develop\/Support efforts through rigorous COCOM engagements, and provide support during QRT\/JT support through the transition phase at the end of each directed project.  As the OTA, the JTE is responsible to maintain oversight status for the OSD for all directed test  efforts. In addition, JTE provides for handbook development for the Warfighter throughout the world in hard copy and in electronic book form."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.263"
                                            },
                                            "Text": {
                                                "val": "Funded civilian labor and COCOM engagements, e-book development and exploring transition efforts to US Army Training and Doctrine Command (TRADOC) \/Army Capabilities Integration Center (ARCIC)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XW7"
                    },
                    "ProjectTitle": {
                        "val": "Command HQ - ARI"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.877"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.877"
                        },
                        "BudgetYearTwo": {
                            "val": "3.954"
                        },
                        "BudgetYearThree": {
                            "val": "4.030"
                        },
                        "BudgetYearFour": {
                            "val": "4.114"
                        },
                        "BudgetYearFive": {
                            "val": "4.198"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funding for Project XW7 funding was a realignment from Program Element (PE) 0601102A (Defense Research Sciences), Project 74F (Pers Perf & Training); PE 0602785A (Manpower, Personnel and Training Technology), Project 790 (Personnel Performance & Training Technology); and PE 0603007A (Manpower, Personnel and Training Advanced Technology), Project 792 (Personnel Performance & Training)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The U.S. Army Research Institute for the Behavioral and Social Sciences (ARI) is the only Science and Technology (S&T) laboratory that conducts research to enhance\nthe Soldier lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., culture of dignity, respect, and inclusion). This project\nsupports the non-Army Management Headquarters Activity (non-AMHA) management and administrative functions to enable ARI to accomplish its research mission\nand includes activities such as budget execution, procurement oversight, RDT&E program planning and evaluation, management control, security\/safety, logistics,\ninformation technology, and personnel\/manpower execution and oversight. ARI's behavioral and social science research provides effective non-materiel solutions to help\nthe Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Pay"
                                    },
                                    "Description": {
                                        "val": "This effort will provide personnel for management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance Research and Development (R&D) program."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.877"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.877"
                                            },
                                            "Text": {
                                                "val": "Will provide operation of management, administrative, personnel, budget, and support functions at a level consistent with Army\nand mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader\ndevelopment, and organizational performance R&D program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}