{
    "id": "2018-Navy-PB-1319-JBOOK-a90deec0cc3550b6cbaca862df579377c9c386cf1392b0eedba7fcb7f4474588-19",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0606355N"
        },
        "ProgramElementTitle": {
            "val": "(U)Warfare Innovation Management"
        },
        "R1LineNumber": {
            "val": "190"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "21.123"
            },
            "BudgetYearOne": {
                "val": "28.841"
            },
            "BudgetYearOneBase": {
                "val": "28.841"
            },
            "BudgetYearTwo": {
                "val": "19.529"
            },
            "BudgetYearThree": {
                "val": "13.817"
            },
            "BudgetYearFour": {
                "val": "14.093"
            },
            "BudgetYearFive": {
                "val": "14.375"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "FLEX Project 3319:  \nThe Fleet Experimentation (FLEX) project advances\/augments operational and tactical warfighter capabilities through the experimentation of high payoff initiatives, technologies and concepts, Fleet Concepts of Operations (CONOPS), doctrine, and new tactics, techniques and procedures (TTP). The objective of FLEX is to produce recommended changes in doctrine, organization, training, materiel, leadership development, personnel, facilities, and policy (DOTMLPF-P) actions. \nFLEX was previously funded under PE 0604707N.  \n\nTW Project 3320: \nTW enables early delivery of capabilities to the warfighter via Fleet-directed Trident Warrior operational events with an emphasis on USFF\/CPF directed focus areas.\nTrident Warrior (TW) was transferred from 0604231N (Tactical Command Systems) to 0606355N (Warfare Innovation Management)in FY17.\n  \nSFOC Project 3420\nClassified Project Expeditionary Submarine Fiber Optic Cable (SFOC) Communications is not a new start.  Funding was realigned from project 3319 FLEX in FY18. The Expeditionary Submarine Fiber Optic Cable (SFOC) Communications is developing and experimenting innovative concepts designed to validate both material and non-material methodologies to provide resilient command and control within the maritime domain.  Identified previous work done within OSD channels, and will leverage lessons learned."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "21.123"
                },
                "BudgetYearOne": {
                    "val": "34.938"
                },
                "BudgetYearOneBase": {
                    "val": "34.938"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "21.123"
                },
                "BudgetYearOne": {
                    "val": "28.841"
                },
                "BudgetYearOneBase": {
                    "val": "28.841"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-6.097"
                },
                "BudgetYearOneBase": {
                    "val": "-6.097"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.104"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.104"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.007"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.007"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3319"
                    },
                    "ProjectTitle": {
                        "val": "Fleet Experimentation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "18.954"
                        },
                        "BudgetYearOne": {
                            "val": "11.572"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.572"
                        },
                        "BudgetYearTwo": {
                            "val": "11.219"
                        },
                        "BudgetYearThree": {
                            "val": "11.453"
                        },
                        "BudgetYearFour": {
                            "val": "11.682"
                        },
                        "BudgetYearFive": {
                            "val": "11.916"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Fleet Experimentation (FLEX) program examines the doctrine, organization, training, materiel, leadership and education, personnel, facilities, and policy (DOTMLPF-P) solutions to identified warfighter capability gaps within the Future Years Defense Program (FYDP). The FLEX program considers warfighting gaps identified in: Integrated Prioritized Capability Lists (IPCL) generated by Warfighting Development Centers (WDC); USFF\/CPF's Integrated Priorities Letter (IPL) delivered annually to the CNO; USFF\/CPF's Commanders' FLEX Guidance; and Navy and Joint Urgent Operational Needs Statements. In addition, FLEX addresses innovative concepts, and tactics, techniques, and procedures (TTP), and Fleet Concepts of Operation (CONOPS) that collectively mitigate Fleet-identified warfighting capability gaps as defined by annual FLEX guidance. Through experimentation activities such as workshops, system or seminar war simulations, live at-sea events, and experimentation campaigns, the FLEX program examines potential materiel and non-materiel tangible solutions that will enhance the Fleet's ability to execute assigned missions. FLEX events and campaigns are comprised of all facets of experimentation including design, planning, systems engineering and integration, execution, data collection, analysis, assessment, and the delivery of tangible products to the fleet. While Naval-centric, FLEX efforts include joint, coalition, Science and Technology (S&T), academia, and industry partners.\n\n\tExperimentation is vital to continuously improving naval warfighting capabilities. As such, the FLEX program directly supports four of the five elements outlined in the Secretary of the Navy's Innovation Vision: Build the Naval Innovation Network, Improve the Use of DON Information, Accelerate Emerging Operational Capabilities to the Fleet, and Develop Game-Changing Warfighting Concepts.\n\nExpeditionary SFOC Communications (Classified Project) will transfer from Project 3319 (FLEX) to Project 3420 (Expeditionary SFOC Communications) in FY18."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fleet Experimentation"
                                    },
                                    "Description": {
                                        "val": "FLEX is a USFF\/CPF collaborative effort to address fleet prioritized capability gaps, led by USFF N8\/N9, supported by Navy Warfare Development Command (NWDC), and coordinated with Naval Component Commands (NCC)\/Numbered Fleets, Type Commanders (TYCOM), Systems Commands (SYSCOM), OPNAV, Services, Coalition, and Science & Technology (S&T) community.  The Fleet Experimentation program objective is to produce recommended changes in doctrine, organization, training, materiel, leadership development, personnel, facilities, and policy (DOTMLPF-P) actions. Deliverables are focused on operational and tactical warfighting capability in the near term (within the Future Years Defense Program), and prioritized by the Commander, U.S. Fleet Forces (USFF)\/Commander, Pacific Fleet (CPF) Fleet Experimentation annual guidance. NWDC plans and executes USFF\/CPF approved multi-year Fleet experimentation campaigns and final reports.  USFF\/CPF staff manage the follow-on DOTMLPF-P actions with OPNAV, SYSCOMs, TYCOMs and Warfighter Development Center (WDC) staffs to establish or enhance warfighting capability in Integrated Air and Missile Defense (IAMD), Amphibious Warfare (AMW), Surface Warfare (SUW), Strike Warfare (STW), Anti-Submarine Warfare(ASW),Expeditionary Warfare (EXW), Information Dominance (ID), Mine Warfare (MIW) and Anti-Terrorism\/Force Protection (AT\/FP).\n \nFLEX supports Operational\/Tactical venues to experiment, demonstrate, assess warfighting CONOPS development, concepts, doctrine\/training development, techniques and procedures (TTPs), and technologies \n\tMulti-year experiment campaigns focus on warfighting capability per CPF\/CUSFFC guidance to evaluate and transition to DOTMLPF-Policy change recommendations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FLEX project was previously funded in PE 0604707N SEW ARCHITECTURE\/ENG SUPPORT in FY16"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.954"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FY17 FLEX EXPLAN is based on four USFF\/CPF directed focus areas to include, in very broad terms, Multi-mission Electromagnetic Maneuver Warfare, Naval Integrated Fires, Full Spectrum Mine Warfare, and Unmanned Systems. FLEX will also be leveraged to support new platform introduction capabilities. The FLEX Execution Plan supports the following events: \n\na. Fleet Battle Experiment 2017 At-Sea\nb. Spectral Tsunami 2017 Seminar War Simulation\nc. USFF Independent Deployments At-Sea (Three ships)\nd. Emerging Concepts War Simulation\ne. Netted Sensors At-Sea\nf. Trident Warrior 2017 At-Sea\ng. Bold Alligator 2017 At-Sea\nh. Red Nitrum At-Sea\nI. Navy Integrated Fire Control - Counter Air System (NIFC-CA) System War Simulation\nj. MIW At-Sea\nk. Counter Unmanned Systems (UxS) At-Sea\nl. Office of Naval Research (ONR) Technology Innovation Games (TIGs)\n\n\nAdditionally, this project to provide funds for technical and subject matter expertise support throughout the experiment planning, execution, and analysis process in support of the draft FLEX ExPlan for FY 2017 At-Sea events and War simulations with the outcomes to advance or augment warfighting capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.572"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.572"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FY18 FLEX program aligns to the \"Fleet Design\" end state of fleet centric fighting power, enabled by integration, distribution and maneuver for a Fleet Level simultaneous employment across multiple domains with integrated kinetic and non-kinetic mission execution.  The FY18 FLEX program campaign areas comprise Multi-mission Electromagnetic Maneuver Warfare, Naval Integrated Fires, Full Spectrum Mine Warfare, Operational\/Tactical integration (new), Assured Logistics (new) and Unmanned Systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "FLEX is a non-acquisition program."
                        },
                        "PerformanceMetrics": {
                            "val": "Fleet Experimentation MOP:\n\tFLEX funding is used for approximately 100 experimental initiatives annually, focused on addressing Fleet- identified capability gaps. The majority of this funding is used to acquire intellectual capital in emerging technical areas through contracts providing engineering expertise, experiment design, execution and analysis support, and also used to fund select engineering and integration costs associated with certain experiments.\nFleet Experimentation MOE:\n-\tCNO\/CUSFF\/CPF directed experiment for emerging future capability\n-\tMitigate critical capability gaps\n-\tInform Doctrine TTP, and training\n-\tInform Fleet Platform Wholeness or Warfighter CONOPS validation\n-\tImpact to Fleet Warfighting within the FYDP"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3320"
                    },
                    "ProjectTitle": {
                        "val": "TRIDENT Warrior"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.169"
                        },
                        "BudgetYearOne": {
                            "val": "2.269"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.269"
                        },
                        "BudgetYearTwo": {
                            "val": "2.310"
                        },
                        "BudgetYearThree": {
                            "val": "2.364"
                        },
                        "BudgetYearFour": {
                            "val": "2.411"
                        },
                        "BudgetYearFive": {
                            "val": "2.459"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Trident Warrior (TW) was transferred from 0604231N (Tactical Command Systems) to 0606355N (Warfare Innovation Management) in FY17."
                        },
                        "ProjectMissionDescription": {
                            "val": "TW enables early delivery of Information Warfare (IW) capabilities to the warfighter via Fleet-directed TW operational events. Integrates stand-alone systems and efforts to achieve substantially enhanced capability, demonstrates\/tests these capabilities in both laboratory and operational environments, and evaluates their effectiveness. Develops supporting concepts and Concept of Operations to improve warfighting effectiveness. Coordinates IW efforts with other Service\/Joint\/Department of Defense\/National efforts to ensure Joint\/Interagency\/Allied\/Coalition applicability and interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trident Warrior"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Trident Warrior was funded under PE 0604231N (Tactical Command Systems) in FY16."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.169"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluate TW16 executed experiments and recommend next steps for Naval Warfare Development Command (NWDC).\n- In accordance with standardized procedures, lead TW participant efforts with the following: specific goal identification; risk identification; experiment plans (to include data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provide subject matter experts (SMEs) for core ship services during the experimentation period. Provide independent experts to ensure compliance with experiment plans, lead analysis effort, and deliver unbiased assessments.\n- Provide results to government sponsors to support the program's engineering recommendations.\n- Plan and execute TW17 experiments to accelerate the transition of IW capability to the Fleet.\n- Begin TW18 planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluate TW17 executed experiments and recommend next steps for NWDC.\n- Promote broad participation in TW by researching advanced technology solution candidates, in conjunction with other services, commercial entities and academic research in order to fill IW technology gaps.\n- In accordance with standardized procedures, lead Trident Warrior (TW) participant efforts with the following: specific goal identification; risk identification; experiment plans (to include data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provide subject matter experts (SMEs) for core ship services during the experimentation period. Provide independent experts to ensure compliance with experiment plans, lead analysis effort, and deliver unbiased assessments.\n- Provide results to government sponsors to support the program's engineering recommendations.\n- Plan and execute TW18 experiments to accelerate the transition of Information Warfare (IW) capability to the Fleet.\n- Begin TW19 planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Confirmation of Fleet and Joint Interoperability with technology candidates, Information Assurance Certification and Accreditation, and alignment with United States Fleet Forces (USFF) Commander's Guidance, as well as related Program Executive Office (PEO) objectives and projected architectures."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3420"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Submarine Fiber Optic Cable (SFOC)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "15.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Expeditionary Submarine Fiber Optic Cable (SFOC) Communications project is a classified program responsible for  developing and experimenting innovative concepts designed to validate both material and non-material methodologies to provide resilient command and control within the maritime domain.  The project focus is to demonstrate capabilities that leverage existing DOD investments and infrastructure using non-traditional means to move data and information.  The key deliverable will be a demonstration using maritime assets, experimental methodologies, and current backhaul architecture to validate C2 data movement in the maritime domain.  Continue the development and refinement of advanced networking and communication capabilities in a maritime environment that promote C2 interoperability in Satellite Communications (SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat Anti-Access Area Denial (A2\/AD).  Solutions will address higher bandwidth technologies across the Radio Frequency (RF) and Optical spectrum.\n\nThis is not a new start. $7.54M of funding was transferred from project 3319 FLEX and moved to 3420 Expeditionary Submarine Fiber Optic Cable (SFOC) Communications for transparency."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Submarine fiber Optic Cable (SFOC)"
                                    },
                                    "Description": {
                                        "val": "Classified Project: The Expeditionary Submarine Fiber Optic Cable (SFOC) Communications project is developing and experimenting innovative concepts designed to validate both material and non-material methodologies to provide resilient command and control within the maritime and littoral domains. The project focus is to demonstrate capabilities that leverage existing industry and DOD investments and infrastructure using non-traditional means to move data and information. The key deliverable will be a demonstration using maritime assets, experimental methodologies, and current backhaul architecture to validate C2 data movement across the maritime domain.  Continue the development and refinement of advanced networking and communication capabilities in a maritime environment that promote C2 interoperability in Satellite Communications (SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat Anti-Access Area Denial (A2\/AD).  Solutions will address higher bandwidth technologies across the Radio Frequency (RF) and Optical spectrum."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding was in project 3319 of this PE in FY17."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2018 Base Plans:\nThis project will continue to provide funds for the development and refinement of advance networking and  communication capabilities in a maritime environment that promote C2 interoperability in Satellite Communications\n(SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat of Anti-Access Area Denial(A2\/AD). Final demonstration will show ability to use submarine fiber optic cable to establish beyond line of sight communications in a tactically relevant timeline.\n- Acquire maritime vessel as test article IAW objectives\n- Modify vessel as required to meet demonstration objectives\n- Remote Operated Vehicle\/ crew lease\n- Communication suite build\n- Cable engine procurement\n- SFOC, repeater procurement\n- Communication architecture integration"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Expeditionary SFOC Communications is a non-acquisition program that promotes DoD interoperability to achieve resilient C2 data flows by facilitating maritime architectures in both processes and communications systems, including emerging capabilities, to counter growing high-end asymmetric threats, and is a key enabler of the Combatant Commanders C2 functionality."
                        },
                        "PerformanceMetrics": {
                            "val": "Expeditionary SFOC Communications will employ laboratory testing and at-sea demonstrations to assess specific technologies, operational concepts, and integrated Doctrine, Organization, Training, Material, Leadership, Personnel and Facilities (DOTMLPF) solutions pertaining to C2 communications and other aspects of Information Dominance (ID).  These assessments will report on identified capability gaps, link capability gaps to technology\/DOTMLPF gaps, and identify technologies and DOTMLPF solutions considered ready for deployment to enhance war fighting capability and enhance interoperability."
                        }
                    }
                }
            ]
        }
    }
}