{
    "id": "2018-Army-PB-2040-JBOOK-8aa6116a07f4d60601a05c4a1332e7f28609a7e32c0f8c7666562466c33015eb-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603778A"
        },
        "ProgramElementTitle": {
            "val": "MLRS Product Improvement Program"
        },
        "R1LineNumber": {
            "val": "178"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.202"
            },
            "CurrentYear": {
                "val": "34.763"
            },
            "BudgetYearOne": {
                "val": "8.929"
            },
            "BudgetYearOneBase": {
                "val": "8.929"
            },
            "BudgetYearTwo": {
                "val": "8.981"
            },
            "BudgetYearThree": {
                "val": "8.980"
            },
            "BudgetYearFour": {
                "val": "10.286"
            },
            "BudgetYearFive": {
                "val": "12.627"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Funding for DZ8 has been realigned to PE 0607134, Proj ES1, beginning FY17."
        },
        "ProgramElementMissionDescription": {
            "val": "Project DX8.  The M142 High Mobility Artillery Rocket System (HIMARS) launcher is a full spectrum, combat proven, all weather, 24\/7 lethal and responsive, precision strike weapon system.  HIMARS provides critical missile precision strike, operational shaping fires, counterfire, and close support destructive and suppressive fires.  HIMARS is a C-130 or C-17 transportable, wheeled, indirect fire, rocket\/missile launcher capable of firing one pod of precision rockets\/missiles from the Multiple Launch Rocket System (MLRS) Family of Munitions (MFOM), to include the Guided Multiple Launch Rocket System (GMLRS) and the Army Tactical Missile System (ATACMS).  These munitions are capable of engaging targets with precision at ranges up to 300 kilometers.  This project funds software development for the HIMARS launcher.  The government assumed responsibility for software development and maintenance from the prime contractor in FY2016.  Organic software is defined as government developed, maintained, and owned software.  The long-term end state is a convergence of tactical software across the HIMARS and MLRS launcher platforms into a single product supporting both systems.\n\nJustification:\n\nFY2018 Base funding in the amount of $3.929 million for project DX8 supports HIMARS-unique Software Build, Version 8.2.  This software is projected to be available for fielding to the M142 fleet in FY2019.  Software Version 8.2 enables portability to the M270A2 (MLRS) tracked launcher upon receipt of a hardware Fire Control System upgrade.\n\nProject 093.  The Multiple Launch Rocket System (MLRS) launcher is a full spectrum, combat proven, all weather, 24\/7 lethal and responsive, precision strike weapon system.  MLRS provides critical missile precision strike, operational shaping fires, counterfire, and close support destructive and suppressive fires.  MLRS is a tracked, indirect fire, rocket\/missile launcher capable of firing two pods of precision rockets\/missiles from the Multiple Launch Rocket System (MLRS) Family of Munitions (MFOM), to include the Guided Multiple Launch Rocket System (GMLRS) and the Army Tactical Missile System (ATACMS).  These munitions are capable of engaging targets with precision at ranges up to 300 kilometers. This project funds software development for the MLRS launcher.  The government assumed responsibility for software development and maintenance from the prime contractor in FY2016.  Organic software is defined as government developed, maintained, and owned software.  The long-term end state is a convergence of tactical software across the HIMARS and MLRS launcher platforms into a single product supporting both systems.\n\nJustification:\n\nFY2018 Base funding in the amount of $5.000 million for project 093 supports the initiation of software development of an organic tactical software build in support of the interim Fire Control System (FCS) hardware supporting both the current MLRS Fleet (upon upgrade with a modern hardware FCS) and the Army’s MLRS Fleet Expansion effort.  This software development leverages the program’s completed software transition from the prime contractor to the government in FY2016.  This interim FCS solution will be ready to field in FY2021 and the long-term FCS solution is expected to be ready to field in FY2024.  The tactical software is a critical developmental item required to field additional launchers, maintain backward compatibility for current fleet sustainment, and anticipated to be the first release of organic software common to both the MLRS and HIMARS launcher in FY2021.\n\nProject DZ8:  Long Range Precision Fires (LRPF) is being developed as a cluster and insensitive munition compliant system that replaces and improves upon Army Tactical Missile System (ATACMS) capabilities. The mission of the LRPF System will be to attack\/neutralize\/suppress\/destroy targets using missile delivered indirect precision fires.  LRPF will provide Joint Force Commanders with a 24\/7, all-weather capability to attack critical and time sensitive area and point targets including threat air defense, missile launchers, command and control centers, assembly\/staging areas and high payoff targets at all depths of the tactical battlefield. LRPF will counter the enemy's ability to conduct combat maneuver and air defense operations. LRPF requirements include: max range of greater than 300km, specified lethality against the designated target set, a Launch Pod Missile Container (LPMC) that holds a minimum of one missile, and compatibility with the existing launcher platforms (M270A1 Multiple Launch Rocket System (MLRS) and M142 High Mobility Artillery Rocket System (HIMARS)). LRPF is being designed with an open system architecture that provides the capability for future growth to counter new and emerging threats. An Analysis of Alternatives (AoA) was directed in the Material Development Decision (MDD) on 6 November 2013. The AoA was completed on 30 April 2015 and a letter of sufficiency issued by OSD in September 2015. Milestone A; Technology Maturation and Risk Reduction (TMRR) is scheduled for 06 January 2017."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.397"
                },
                "CurrentYear": {
                    "val": "9.663"
                },
                "BudgetYearOne": {
                    "val": "3.778"
                },
                "BudgetYearOneBase": {
                    "val": "3.778"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.202"
                },
                "CurrentYear": {
                    "val": "34.763"
                },
                "BudgetYearOne": {
                    "val": "8.929"
                },
                "BudgetYearOneBase": {
                    "val": "8.929"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.805"
                },
                "CurrentYear": {
                    "val": "25.100"
                },
                "BudgetYearOne": {
                    "val": "5.151"
                },
                "BudgetYearOneBase": {
                    "val": "5.151"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.534"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.729"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "5.151"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.151"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY2017 Amendment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "25.100"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17:  Increased $25.100 million to enable risk reduction to support the MLRS Launcher Fleet Expansion effort.\nFY18:  Increased $5.151 million to support initiation of a MLRS launcher tactical software build."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "093"
                    },
                    "ProjectTitle": {
                        "val": "Multi-Launch Rocket System (MLRS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "25.100"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.000"
                        },
                        "BudgetYearThree": {
                            "val": "5.000"
                        },
                        "BudgetYearFour": {
                            "val": "5.100"
                        },
                        "BudgetYearFive": {
                            "val": "5.100"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project 093.  The Multiple Launch Rocket System (MLRS) launcher is a full spectrum, combat proven, all weather, 24\/7 lethal and responsive, precision strike weapon system.  MLRS provides critical missile precision strike, operational shaping fires, counterfire, and close support destructive and suppressive fires.  MLRS is a tracked, indirect fire, rocket\/missile launcher capable of firing two pods of precision rockets\/missiles from the Multiple Launch Rocket System (MLRS) Family of Munitions (MFOM), to include the Guided Multiple Launch Rocket System (GMLRS) and the Army Tactical Missile System (ATACMS).  These munitions are capable of engaging targets with precision at ranges up to 300 kilometers. This project funds software development for the MLRS launcher.  The government assumed responsibility for software development and maintenance from the prime contractor in FY2016.  Organic software is defined as government developed, maintained, and owned software.  The long-term end state is a convergence of tactical software across the HIMARS and MLRS launcher platforms into a single product supporting both systems.\n\nJustification:\n\nFY2018 Base funding in the amount of $5.000 million for project 093 supports the initiation of software development of an organic tactical software build in support of the interim Fire Control System (FCS) hardware supporting both the current MLRS Fleet (upon upgrade with a modern hardware FCS) and the Army’s MLRS Fleet Expansion effort.  This software development leverages the program’s completed software transition from the prime contractor to the government in FY2016.  This interim FCS solution will be ready to field in FY2021 and the long-term FCS solution is expected to be ready to field in FY2024.  The tactical software is a critical developmental item required to field additional launchers, maintain backward compatibility for current fleet sustainment, and anticipated to be the first release of organic software common to both the MLRS and HIMARS launcher in FY2021."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Accelerate MLRS Fleet Expansion"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.100"
                                            },
                                            "Text": {
                                                "val": "This increased funding ($25.100 million , Project 093) will accelerate the MLRS Launcher Fleet expansion. This effort is fourfold, it will: build one M270A1 carrier hull from an excess M270A0 hull, establish tooling and processes to enable efficient execution of the follow-on fleet expansion, redesign of the current fire control system, and identifying, quoting and making first item purchases for parts no longer manufactured for the MLRS fleet expansion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MLRS Product Improvement Program"
                                    },
                                    "Description": {
                                        "val": "The MLRS Product Improvement Program provides the preservation of platform viability and readiness to accept technology insertion as capability enhancements and obsolescence mitigations are developed.  Support efforts include: obsolescence mitigation and enhancements for the M993A1 carrier, Fire Control System, Launcher Loader Module and Enhanced Command and Control (EC2); develop and update the Fire Control System software to keep pace with changes to the munitions; perform Command, Control, Communications, Computers and Intelligence (C4I)\/interoperability and Information Assurance compliance certification and network interoperability testing.   Perform technical assessments, concept studies for obsolescence mitigation, crew protection, automotive and hardware\/software enhancements, improving operational timelines and risk reduction."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Begin tactical launcher software development to support the Fire Control System obsolescence mitigation hardware upgrade required to operate a MLRS launcher."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "C67500000"
                                    },
                                    "Title": {
                                        "val": "MLRS Mods (C67500)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.970"
                                        },
                                        "CurrentYear": {
                                            "val": "34.704"
                                        },
                                        "BudgetYearOne": {
                                            "val": "36.771"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "36.771"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "37.312"
                                        },
                                        "BudgetYearThree": {
                                            "val": "46.698"
                                        },
                                        "BudgetYearFour": {
                                            "val": "46.968"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CA0265000"
                                    },
                                    "Title": {
                                        "val": "MLRS Mod Initial Spares (CA0265)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.067"
                                        },
                                        "CurrentYear": {
                                            "val": "1.676"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.089"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.089"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.105"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "4.937"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The MLRS Product Improvement Program performs development efforts required to address emerging requirements. \n\nThe Army transitioning complete software acquisition from the prime contractor (legacy v7.x) to an organic (government developed, maintained, and owned) approach (v8.x forward) by utilizing the Aviation & Missile Research & Development Engineering Center's (AMRDEC) Software Engineering Directorate (SED) as the software developer. This funding supports the MLRS share of the software development and is funded via Military Interdepartmental Purchase Request (MIPR).\n\nEmerging requirements include updates to address emerging threats of the launcher organic version 8.x software, reacting to system changes driven by policy and emerging requirements, and maintaining architectural compatibility.  Communication suite changes, munitions updates, and introduction of new munitions require software and\/or hardware updates to ensure full compatibility and maintain operational viability.\n\nThe enduring organic v8.2 software effort is projected for Materiel Release and fielding to the M270A2 (MLRS) launcher when upgraded with the interim Fire Control System solution. An incremental software release plan will be developed to address emerging SW requirements beyond v8.2 in the future."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DX8"
                    },
                    "ProjectTitle": {
                        "val": "HIMARS Product Improvement Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.301"
                        },
                        "CurrentYear": {
                            "val": "9.663"
                        },
                        "BudgetYearOne": {
                            "val": "3.929"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.929"
                        },
                        "BudgetYearTwo": {
                            "val": "3.981"
                        },
                        "BudgetYearThree": {
                            "val": "3.980"
                        },
                        "BudgetYearFour": {
                            "val": "5.186"
                        },
                        "BudgetYearFive": {
                            "val": "7.527"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project DX8.  The M142 High Mobility Artillery Rocket System (HIMARS) launcher is a full spectrum, combat proven, all weather, 24\/7 lethal and responsive, precision strike weapon system.  HIMARS provides critical missile precision strike, operational shaping fires, counterfire, and close support destructive and suppressive fires.  HIMARS is a C-130 or C-17 transportable, wheeled, indirect fire, rocket\/missile launcher capable of firing one pod of precision rockets\/missiles from the Multiple Launch Rocket System (MLRS) Family of Munitions (MFOM), to include the Guided Multiple Launch Rocket System (GMLRS) and the Army Tactical Missile System (ATACMS).  These munitions are capable of engaging targets with precision at ranges up to 300 kilometers.  This project funds software development for the HIMARS launcher.  The government assumed responsibility for software development and maintenance from the prime contractor in FY2016.  Organic software is defined as government developed, maintained, and owned software.  The long-term end state is a convergence of tactical software across the HIMARS and MLRS launcher platforms into a single product supporting both systems.\n\nFY2018 Base funding in the amount of $3.929 million for project DX8 supports HIMARS-unique Software Build, Version 8.2.  This software is projected to be available for fielding to the M142 fleet in FY2019.  In addition to addressing software maintenance, Software Version 8.2 enables portability to the M270A2 (MLRS) tracked launcher upon receipt of a hardware Fire Control System upgrade."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MLRS Production Improvement Program (PIP)-HIMARS PIP"
                                    },
                                    "Description": {
                                        "val": "Provide enduring tactical software development and maintenance required to address security concerns, implement fixes to newly discovered issues, and address emerging threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.301"
                                            },
                                            "Text": {
                                                "val": "In FY16, a next generation communications device demo was performed to help identify viable candidate radio devices to replace the existing short and long-range communications devices within the system architecture.\n\nOrganic Version 8.0 Software was demonstrated by test through conducting seven live fire events verifying GMLRS-U, ATACMS, and GMLRS-AW munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.663"
                                            },
                                            "Text": {
                                                "val": "The initial version of government developed software, version 8.0 will achieve Software Materiel Release and be ready for fielding to the 363 Army Acquisition Objective (AAO) HIMARS launcher fleet.\n\nThe first maintenance software build, version 8.1, to address open issues will begin development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.929"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.929"
                                            },
                                            "Text": {
                                                "val": "Version 8.1 tactical software build for HIMARS launcher will complete and achieve readiness for operational fielding.\n\nVersion 8.2 tactical software build will begin to add support to launcher Insensitive Munitions Propulsion System (IMPS) GMLRS munitions starting production. This software upgrade will be required to launch the newest production munitions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "C67501"
                                    },
                                    "Title": {
                                        "val": "HIMARS Modifications (C67501)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.148"
                                        },
                                        "CurrentYear": {
                                            "val": "27.847"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.566"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.566"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.456"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.768"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.320"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.546"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The HIMARS Product Improvement Program performs development efforts required to address emerging requirements.\n\nThe Army is transitioning complete software acquisition from the prime contractor (legacy v7.x) to an organic approach (v8.x forward) by utilizing the Aviation & Missile Research & Development Engineering Center's (AMRDEC) Software Engineering Directorate (SED) as both the software developer and maintainer.  These efforts are funded via Military Interdepartmental Purchase Request (MIPR).\n\nEmerging requirements include maintenance and update to address emerging threats of the launcher organic version 8.x software, reacting to system changes driven by policy and emerging requirements, and maintaining architectural compatibility.  Communication suite changes, munitions updates, and introduction of new munitions require software and\/or hardware updates to ensure full compatibility.\n\nThe enduring organic v8.x software effort is projected for Materiel Release and fielding to HIMARS fleet in FY17.  Version 8.0 will be the initial roll-out.  Version 8.1 will follow in FY18. Version 8.2 will follow in FY19. Version 8.2 will enable portability to the M270A2 (MLRS) launcher when upgraded with the interim Fire Control System solution.  An incremental software release plan will be developed to address emerging software requirements beyond v8.2 in the future with the ultimate end-state to achieve a common tactical software platform for both the HIMARS and MLRS launcher fleets."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DZ8"
                    },
                    "ProjectTitle": {
                        "val": "Long Range Precision Fires"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.901"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.901"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Starting in FY2017 funding for LRPF has been realigned to new OSD-directed PE 0607134A, Proj ES1."
                        },
                        "ProjectMissionDescription": {
                            "val": "Long Range Precision Fires (LRPF) is being developed as a cluster and insensitive munition compliant system that replaces and improves upon Army Tactical Missile System (ATACMS) capabilities. The mission of the LRPF System will be to attack\/neutralize\/suppress\/destroy targets using missile delivered indirect precision fires.  LRPF will provide Joint Force Commanders with a 24\/7, all-weather capability to attack critical and time sensitive area and point targets including threat air defense, missile launchers, command and control centers, assembly\/staging areas and high payoff targets at all depths of the multi-domain battlefield. LRPF will counter the enemy's ability to conduct combat maneuver and air defense operations. LRPF requirements include: max range of greater than 400km, specified lethality against the designated target set, a Launch Pod Missile Container (LPMC) that holds a minimum of one missile, and compatibility with the existing launcher platforms (M270A1 Multiple Launch Rocket System (MLRS) and M142 High Mobility Artillery Rocket System (HIMARS)). LRPF is being designed with an open system architecture that provides the capability for future growth to counter new and emerging threats. Milestone A; Technology Maturation and Risk Reduction (TMRR) was approved on 31 March 2017.\n\nThe Army initially funded the development of the LRPF under PE 0603778A, Proj DZ8. Two DoD Ordnance Technology Consortium (DOTC) agreements were awarded to support efforts under the Material Solution Analysis Phase."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TM\/RR"
                                    },
                                    "Description": {
                                        "val": "Develop and prototype an insensitive munition compliant missile that provides increased range, improved lethality for both point and area targets, meets cluster munition policy requirements, and provides increased firepower with a multiple missile per launch pod solution.  Long Range Precision Fires (LRPF) provides field artillery units with a deep-strike capability while supporting brigade, division, corps, Army, theater, Joint and Coalition forces in full, limited or expeditionary operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.901"
                                            },
                                            "Text": {
                                                "val": "Investigated high-level requirements for the components and system based on the Technical Requirements Document (TRD), including minimum and maximum delivery range, effectiveness of the warhead, the accuracy of the missile system, and the interoperability of the missile system with the M142 and M270A1 launch platforms.  Reviewed and assessed the LRPF target sets to include: Air Defense Radar, Missile Launch Site, and a Helicopter Staging Area.  Assessed rocket motor design options and Launch Pod Missile Container (LPMC) requirements.  Assessed technologies that provide a growth path to achieving objective range and effectiveness requirements as defined in the LRPF TRD.  Assessed the Flight Termination System\/Telemetry (FTS\/TM) requirements for LRPF flight testing and determined an approach for development\/integration and qualification\/approval of an FTS\/TM package."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "LRPF is being developed as a cluster and insensitive munition compliant system that replaces and improves upon ATACMS capabilities to provide Joint Force Commanders with a 24\/7, all-weather, area target, long-range fires capability without placing aircraft and crews at risk. An AoA supporting the MS A decision has been completed by U.S. Army Training and Doctrine Command (TRADOC) Analysis Center-White Sands Missile Range (TRAC-WSMR), with the OSD letter of sufficiency issued in September 2015.  Two DoD Ordnance Technology Consortium (DOTC) agreements were awarded to support efforts under the Material Solution Analysis (MSA)Phase. The Milestone Decision Authority (MDA) held a MS A decision review in 2QFY17. TMRR will include two DOTC award agreements for competitive prototyping leading to flight demonstrations and PDRs in FY19. Data from the TMRR phase to include results from the flight demonstrations will support the FY21 Engineering and Manufacturing Development (EMD) contract award. EMD will be awarded to a single industry team that has the best overall LRPF design. The EMD phase will complete product development, qualification, production readiness assessment, and limited user test."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}