{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-4",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604321A"
        },
        "ProgramElementTitle": {
            "val": "All Source Analysis System"
        },
        "R1LineNumber": {
            "val": "84"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.309"
            },
            "CurrentYear": {
                "val": "3.958"
            },
            "BudgetYearOne": {
                "val": "4.774"
            },
            "BudgetYearOneBase": {
                "val": "4.774"
            },
            "BudgetYearTwo": {
                "val": "7.839"
            },
            "BudgetYearThree": {
                "val": "4.241"
            },
            "BudgetYearFour": {
                "val": "3.872"
            },
            "BudgetYearFive": {
                "val": "3.988"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The All Source Analysis System (ASAS) provided US Army commanders at all echelons from battalion to Army Service Component Command (ASCC) with automated support to the management and planning, processing and analysis, and dissemination of intelligence, counterintelligence, and electronic warfare. ASAS provided the means to enhance the commander's timely and comprehensive understanding of enemy deployments, capabilities, and potential courses of action. The system used standard joint and Army protocols and message formats to interface with selected National, joint, theater, and tactical intelligence, surveillance, and reconnaissance systems and preprocessors and Army, joint, and coalition battle command systems. The ASAS Family of Systems migrated into the Distributed Common Ground System-Army (DCGS-A) program and the Army is using it as the initial platform to provide accelerated DCGS-A capabilities to the force. \n\nThe Counterintelligence (CI) and Human Intelligence (HUMINT) Automated Reporting and Collection System (CHARCS) is the Army's CI and HUMINT tactical collection and reporting system.  CHARCS provides automation support for information collection, reporting, investigations, source & interrogation operations and document exploitation. The CHARCS automation architecture extends from the individual HUMINT team soldier or CI agent to the Corps Analysis and Control Element (ACE).  CHARCS reports digital data such as maps, overlays, images, video, biometrics, scanned documents and audio files.  These media are transmitted through secure networks and interfaces with the DCGS-A for detailed analysis and creation of finished intelligence products.  Collection and reporting teams at Military Intelligence (MI) battalions and their operational managers are equipped with one of two CHARCS systems.  The first is the AN\/PYQ-8 Individual Tactical Reporting Tool (ITRT) which provides collection and processing devices for individual HUMINT team member or CI agents.  The second is the AN\/PYQ-3 CI\/HUMINT Automated Tool Set (CHATS) which provides the team leader tools to process and manage team-collected information and a robust set of devices such as printers, scanners, cameras and audio recorders to assist the collection mission.  Each CHATS has an associated Mission Support Peripheral Sets and Kits (MS-PSK) or Collection Peripheral Sets and Kits (C-PSK). \n\nThe Machine Foreign Language Translation System (MFLTS) develops, fields, and sustains a basic automated foreign speech and text translation capability for Army tactical systems to augment and compliment limited human linguistic resources. These integrated automated translation capabilities will be applicable across three different system configurations; a hand-held\/wearable portable device, a laptop\/mobile device, and in a networked\/web-enabled system. The software modules will translate English from a prioritized list of languages in a prioritized collection of domains (e.g. medical, intelligence, base security). MFLTS is interoperable with Commercial Off-The-Shelf (COTS) and Government Off-The-Shelf (GOTS) automation equipment to include the Distributed Common Ground System-Army (DCGS-A) and Nett Warrior, and will be interoperable with a future version of the CI\/HUMINT Automated Reporting and Collection System (CHARCS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.309"
                },
                "CurrentYear": {
                    "val": "3.958"
                },
                "BudgetYearOne": {
                    "val": "4.923"
                },
                "BudgetYearOneBase": {
                    "val": "4.923"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.309"
                },
                "CurrentYear": {
                    "val": "3.958"
                },
                "BudgetYearOne": {
                    "val": "4.774"
                },
                "BudgetYearOneBase": {
                    "val": "4.774"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.149"
                },
                "BudgetYearOneBase": {
                    "val": "-0.149"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.149"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.149"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 base budget year adjustments reflect a $.159 million increase to CHARCS and a $.308 million decrease to MFLTS.  Net result is $.149 million decrease to the Program Element."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "B41"
                    },
                    "ProjectTitle": {
                        "val": "CI\/HUMINT Software Products (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.242"
                        },
                        "CurrentYear": {
                            "val": "2.782"
                        },
                        "BudgetYearOne": {
                            "val": "3.274"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.274"
                        },
                        "BudgetYearTwo": {
                            "val": "2.304"
                        },
                        "BudgetYearThree": {
                            "val": "2.179"
                        },
                        "BudgetYearFour": {
                            "val": "1.771"
                        },
                        "BudgetYearFive": {
                            "val": "1.824"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Counterintelligence (CI) and Human Intelligence (HUMINT) Automated Reporting and Collection System (CHARCS) is the Army's CI and HUMINT tactical collection and reporting system. CHARCS provides automation support for information collection, reporting, investigations, source & interrogation operations and document exploitation. The CHARCS automation architecture extends from the individual HUMINT team soldier or CI agent to the Corps. CHARCS reports digital data such as maps, overlays, images, video, biometrics, scanned documents and audio files. These media are transmitted through secure networks and interfaces with the Distributed Common Ground System-Army (DCGS-A) for detailed analysis and creation of finished intelligence products. Collection and reporting teams at Military Intelligence (MI) battalions and their operational managers are equipped with one of two CHARCS systems. The first is the AN\/PYQ-8 Individual Tactical Reporting Tool (ITRT) which provides collection and processing devices for individual HUMINT team member or CI agents. The second is the AN\/PYQ-3 CI\/HUMINT Automated Tool Set (CHATS) which provides the team leader and Operational Management Team (OMT) tools to process and manage team-collected information and a robust set of devices such as printers, scanners, and cameras to assist the collection mission. Each CHATS has an associated Mission Support Peripheral Sets and Kits (MS-PSK) or Collection Peripheral Sets and Kits (C-PSK).  Phasing in of the Mobile Hand Held (M H\/H), to displace the C-PSK, will begin in FY 2018.\n\nThe C-PSK provides specialized collection component capabilities to support CI\/HUMINT collection missions. C-PSK capabilities are commercial-off-the-shelf (COTS) technologies and include video and camera equipment, global positioning system (GPS), voice recording device and infrared strobe lights.  Phasing in of the Mobile Hand Held, to displace the C-PSK, will begin in FY 2018.  The MS-PSK provides specialized collection component capabilities to support CI\/HUMINT collection missions at the OMT.  MS-PSK capabilities are COTS technologies and include night vision photography & video, captured materiel tracking, Credibility Assessment Capability, Digital Media Forensics software, and Document Exploitation software.\n\nFY 2018 Base amount of $3.274 million will fund efforts for the development of a single CI\/HUMINT software baseline in coordination with DCGS-A, software testing, software support to the Mobile Handheld (M H\/H), and system engineering management support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development and Integration toward a single CI\/HUMINT Software baseline; software testing of v1.0.4.2; software baseline enhancement and testing of v1.0.4.2.2 and v1.0.4.4; increased SW perf. cap."
                                    },
                                    "Description": {
                                        "val": "Development and Integration toward a single CI\/HUMINT Software baseline; software testing of v1.0.4.2; software baseline enhancement and testing of v1.0.4.2.2 and v1.0.4.4; increased software (SW) performance capability; Hardware (HW) integration testing of CHARCS SW.  Integration of Exploitation software onto MHH."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.242"
                                            },
                                            "Text": {
                                                "val": "Initiated efforts to create a single CI\/HUMINT software baseline in coordination with DCGS-A.  Continued effort for testing related to AIC and COE compliance for v1.0.4.2.2.  Software baseline enhancement and testing for v1.0.4.4.  Provided system engineering management support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.782"
                                            },
                                            "Text": {
                                                "val": "Continue efforts for a single CI\/HUMINT software baseline in coordination with DCGS-A.  Continue software baseline enhancement and testing for v1.0.4.2.2 and v1.0.4.4.  Provide system engineering management support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.274"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.274"
                                            },
                                            "Text": {
                                                "val": "Will continue efforts for development of a single CI\/HUMINT software baseline in coordination with DCGS-A.  Will continue software baseline enhancement and testing for v1.0.4.4.  Will initiate integration of exploitation software onto Mobile Hand Held platform. Will provide system engineering management support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CI HUMINT AUTO REPRTING AND COLL (C"
                                    },
                                    "Title": {
                                        "val": "BK5275"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.402"
                                        },
                                        "CurrentYear": {
                                            "val": "14.891"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.275"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.815"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "14.460"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.092"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.250"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.424"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.084"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Program capability documentation was updated to include Capabilities Development Document (CDD) Increment 2 requirements in CHARCS Capabilities Production Document (CPD) Increment 1, Revision 1, which was signed 6 September 2012. CHARCS is a post-Milestone C program. CHARCS is leveraging Communications Electronic Command Software Engineering Center (CECOM SEC) to increase current capabilities and provide an increased performance capability version of the CHARCS software.  CHARCS will conduct testing of the Nett Warrior End User device.  CHARCS software requires development to keep pace with incremental technology improvements, Defense Intelligence Agency compliance, and to meet AROC approved requirements documented in the CHARCS CPD Increment 1, Revision 1. CHARCS is continuously evaluating and assessing existing Commercial-off-the-shelf (COTS) and Government-off-the-shelf (GOTS) that support CHARCS CPD Increment 1, Revision 1."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "B51"
                    },
                    "ProjectTitle": {
                        "val": "Machine - Foreign Language Translation System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.067"
                        },
                        "CurrentYear": {
                            "val": "1.176"
                        },
                        "BudgetYearOne": {
                            "val": "1.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.500"
                        },
                        "BudgetYearTwo": {
                            "val": "5.535"
                        },
                        "BudgetYearThree": {
                            "val": "2.062"
                        },
                        "BudgetYearFour": {
                            "val": "2.101"
                        },
                        "BudgetYearFive": {
                            "val": "2.164"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Machine Foreign Language Translation System (MFLTS) develops, fields, and sustains a basic automated foreign speech and text translation capability for Army tactical systems to augment and compliment limited human linguistic resources. These integrated automated translation capabilities will be applicable across three different system configurations; a hand-held\/wearable portable device, a laptop\/mobile device, and in a networked\/web-enabled system. The software modules will translate English from a prioritized list of languages in a prioritized collection of domains (e.g. medical, intelligence, base security). MFLTS is interoperable with Commercial Off-The-Shelf (COTS) and Government Off-The-Shelf (GOTS) automation equipment to include the Distributed Common Ground System-Army (DCGS-A) and Nett Warrior, and will be interoperable with a future version of the CI\/HUMINT Automated Reporting and Collection System (CHARCS).\n\nFY18 base dollars in the amount of $1.500 million provides for the program office support to the development and collection of prioritized Speech to Speech (S2S) and Text to Text (T2T) languages and domains."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development and Engineering Support"
                                    },
                                    "Description": {
                                        "val": "Development, integration and improvement of Critical Technology Elements (CTE) of Automated Speech Recognition (ASR), Optical Character Recognition (OCR), and Machine Language Translation Translation Engine (MLT TE) software.  Includes incremental development of Speech to Speech (S2S) and Text to Text (T2T) languages and domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.614"
                                            },
                                            "Text": {
                                                "val": "Completed development of the Iraqi Arabic and Pashto S2S languages and the Modern Standard Arabic (MSA) T2T language in the Checkpoint Operations and Base Security domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.709"
                                            },
                                            "Text": {
                                                "val": "Will provide for the planning of incremental development of Speech to Speech (S2S) and Text to Text (T2T) languages and domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.772"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.772"
                                            },
                                            "Text": {
                                                "val": "Will provide for the development and collection of prioritized Speech to Speech (S2S) and Text to Text (T2T) languages and domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PD Support and Management Services"
                                    },
                                    "Description": {
                                        "val": "Program Office Support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.453"
                                            },
                                            "Text": {
                                                "val": "Provided program management office support at Government activity sites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.467"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide program management office support at Government activity sites."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.728"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.728"
                                            },
                                            "Text": {
                                                "val": "Will provide program management office support at Government activity sites."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B88605"
                                    },
                                    "Title": {
                                        "val": "Machine Foreign Language Translation System (MFLTS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.125"
                                        },
                                        "CurrentYear": {
                                            "val": "0.545"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.567"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.567"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.583"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.601"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.619"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.631"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The MFLTS Technology Development (TD) Phase developed an open software architecture prototype using full and open competition that allowed the addition, upgrade and replacement of translation system components for integration into existing Programs. During the Engineering and Manufacturing Development (EMD) Phase, the program integrated technology demonstrated during the TD Phase to meet Key Performance Parameters (KPPs).  This included the requirement to meet an Interagency Language Roundtable (ILR) level of 1 for two speech translation modules and an ILR level of 1+ for one text translation module in hand-held\/wearable portable, laptop\/mobile, and networked\/web-enabled system configurations.  Milestone B was achieved 22 Jul 13 and an option period for the EMD phase contract was awarded 22 Jul 13.  Following the Limited Deployment Decision (LDD), a contract was awarded to integrate and field MFLTS capability drop #1 in FY16.  A full and open competition will result in the award of a contract(s) in FY18 for the incremental development of new MFLTS SW Capability Drops."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}