{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-61",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604875D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Architecture Development"
        },
        "R1LineNumber": {
            "val": "139"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "13.147"
            },
            "PriorYear": {
                "val": "3.007"
            },
            "CurrentYear": {
                "val": "4.499"
            },
            "BudgetYearOne": {
                "val": "4.851"
            },
            "BudgetYearOneBase": {
                "val": "4.851"
            },
            "BudgetYearTwo": {
                "val": "5.213"
            },
            "BudgetYearThree": {
                "val": "5.270"
            },
            "BudgetYearFour": {
                "val": "5.372"
            },
            "BudgetYearFive": {
                "val": "5.484"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Department and acquisition reform initiatives call for top down, national security strategy-driven capabilities-based planning. Department of Defense (DoD) Instruction 5000.02 and Chairman of the Joint Chiefs of Staff Instruction 3170.01 promulgate capabilities-based requirements and acquisition processes. The JSAD program enables collaborative efforts to achieve these goals with a focus on Major Defense Acquisition Programs (MDAPs). These efforts include warfighting capability-based analyses; assessments of joint capability areas and joint integrating concepts; development of system-related data; integrated roadmaps to support acquisition investment decisions; and assessments of MDAPs in a capability area context.  Activities in the JSAD project are divided into three areas:  (1) capability-based analysis; (2) roadmaps; and (3) support tools and guidance. Capability-based analysis provides analysis of the different technology, functionality, and integration impacts of systems on warfighting capability.  Acquisition roadmaps guide systems development and associated investment plans.  JSAD support tools and guidance initiatives develop systems data, and tools, exploit modeling and simulation and architecture efforts to improve DoD’s overall assessment capability.  These efforts guide the development and improve the testing and fielding of integrated systems of systems in order to achieve Joint mission capabilities.  The Department has also undergone an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches. This means:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning, programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  To accomplish this direction, there needs to be a focused goal and concerted emphasis on shifting from systems acquisition to capabilities-based portfolio management (or portfolio systems acquisition).  This program enables collaborative efforts to implement the QDR direction outlined above in order to achieve portfolio systems acquisition goals.  The program is broken up into two focus areas (Portfolio Management and Reform Initiatives)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.076"
                },
                "CurrentYear": {
                    "val": "4.499"
                },
                "BudgetYearOne": {
                    "val": "5.080"
                },
                "BudgetYearOneBase": {
                    "val": "5.080"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.007"
                },
                "CurrentYear": {
                    "val": "4.499"
                },
                "BudgetYearOne": {
                    "val": "4.851"
                },
                "BudgetYearOneBase": {
                    "val": "4.851"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.069"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.229"
                },
                "BudgetYearOneBase": {
                    "val": "-0.229"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.069"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "SRRB Reductions\/Management Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.196"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.196"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "DTIC Offset Bill"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.033"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.033"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Service Requirement Review Board - As part of the Department of Defense reform agenda, the incremental reduction accounts for consolidation and reduction of service contracts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P875"
                    },
                    "ProjectTitle": {
                        "val": "Portfolio Systems Acquisition (PSA)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.147"
                        },
                        "PriorYear": {
                            "val": "2.809"
                        },
                        "CurrentYear": {
                            "val": "3.166"
                        },
                        "BudgetYearOne": {
                            "val": "3.451"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.451"
                        },
                        "BudgetYearTwo": {
                            "val": "3.813"
                        },
                        "BudgetYearThree": {
                            "val": "3.870"
                        },
                        "BudgetYearFour": {
                            "val": "3.972"
                        },
                        "BudgetYearFive": {
                            "val": "4.084"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Departments 2005 Quadrennial Defense Review (QDR) laid out the need for an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches.  This meant:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning, programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  The Department’s 2010 QDR report further addressed reforming how we buy, noting that the conventional acquisition process is too long and too cumbersome to fit the needs of the many systems that require continuous changes and upgrades - a challenge that will become only more pressing over time. Better Buying Power (BBP) is the implementation of best practices to strengthen the Defense Department's buying power, improve industry productivity, and provide an affordable, value-added military capability to the Warfighter.  Launched in 2010, BBP encompasses a set of fundamental acquisition principles to achieve greater efficiencies through affordability, cost control, elimination of unproductive processes and bureaucracy, and promotion of competition. BBP initiatives also incentivize productivity and innovation in industry and Government, and improve tradecraft in the acquisition of services. The Department will improve how it matches requirements with mature technologies, maintains disciplined systems engineering approaches.  To accomplish this direction, there needed to be a focused goal and concerted emphasis on shifting from acquisition of individual systems to portfolio management (or portfolio systems acquisition).  This program enables collaborative efforts to implement the QDR direction outlined above and advance BBP initiatives to achieve portfolio systems acquisition goals and to develop and implement acquisition reform initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Portfolio Systems Acquisition (PSA)"
                                    },
                                    "Description": {
                                        "val": "The program is broken up into two focus areas (Portfolio Management and Reform Initiatives) and consolidates work previously performed under various other Program Elements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.809"
                                            },
                                            "Text": {
                                                "val": "-Continued and expanded support Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conducted additional analyses and supported implementation of updated Better Buying Power (BBP) initiatives.\n-Provided technical expertise in support of warfare area portfolios including Tactical Air (TACAIR), unmanned systems, electronic warfare, and land warfare and munitions.\n-Assessed progress of program management initiatives and continued support to a variety of certification and qualification standards activities.\n-Continued \"reliability by design\" analyses and support to programs.\n   --Continued radar systems study of G\/ATOR and 3DELRR reliability to reduce O&S cost.\n   --Studied requirements generation process to develop criteria to help ensure requirements are based on sound physics and to understand correct entry points for OSD;  goal is reduced test costs and better milestone readiness.\n   --Continued support to programs\/initiate new analyses.\n-Updated roadmaps and where appropriate generated new roadmaps to guide investments in critical areas (e.g., future vertical lift and Integrated Air and Missile Defense (IAMD).\n-Continued analytical support for the IAMD portfolio.\n-Provided analysis and support to the Homeland Defense Coordinator and DoD-DHS Capability Development Working Group (CDWG) Executive Secretary functions within OUSD(AT&L)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.166"
                                            },
                                            "Text": {
                                                "val": "-Continue and expand support Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conduct additional analyses and support implementation of updated Better Buying Power (BBP) initiatives.\n-Provide technical expertise in support of warfare area portfolios.\n-Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n-Continue \"reliability by design\" analyses and support to programs.\n-Develop DoD courses of action and views on homeland defense implementation and compliance issues in multiple bilateral and multilateral fora.\n-Provide analytical support to the Homeland Defense Coordinator function within OUSD(AT&L).\n-Update roadmaps and where appropriate generate new roadmaps to guide investments in critical areas (e.g., future vertical lift, weapons and Integrated Air and Missile Defense (IAMD).\n-Continue analytical support for the IAMD portfolio.\n-Provide analysis and support to the Homeland Defense Coordinator and DoD-DHS Capability Development Working Group (CDWG)  Executive Secretary functions within OUSD(AT&L)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.451"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.451"
                                            },
                                            "Text": {
                                                "val": "-Continue and expand support Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conduct additional analyses and support implementation of updated Better Buying Power (BBP) initiatives.\n-Provide technical expertise in support of warfare area portfolios.\n-Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n-Continue \"reliability by design\" analyses and support to programs.\n-Develop DoD courses of action and views on homeland defense implementation and compliance issues in multiple bilateral and multilateral fora.\n-Provide analytical support to the Homeland Defense Coordinator function within OUSD(AT&L).\n-Update roadmaps and where appropriate generate new roadmaps to guide investments in critical areas (e.g., future vertical lift, weapons and Integrated Air and Missile Defense (IAMD).\n-Continue analytical support for the IAMD portfolio.\n-Provide analysis and support to the Homeland Defense Coordinator and DoD-DHS Capability Development Working Group (CDWG)  Executive Secretary functions within OUSD(AT&L)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Not Applicable"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P220"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Warfare Executive Committee"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.198"
                        },
                        "CurrentYear": {
                            "val": "1.333"
                        },
                        "BudgetYearOne": {
                            "val": "1.400"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.400"
                        },
                        "BudgetYearTwo": {
                            "val": "1.400"
                        },
                        "BudgetYearThree": {
                            "val": "1.400"
                        },
                        "BudgetYearFour": {
                            "val": "1.400"
                        },
                        "BudgetYearFive": {
                            "val": "1.400"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Electronic Warfare (EW) Executive Committee (EXCOM) - co-chaired by the Under Secretary of Defense for Acquisition, Technology and Logistics and the Vice Chairman of the Joint Chiefs of Staff - is tasked to provide senior oversight, coordination, budget\/capability harmonization, and advice on EW matters to the Secretary of Defense, Deputy Secretary of Defense, and the Deputy's Management Action Group. This program develops, maintains, and implements the overarching DoD EW Strategy and Implementation Plan to achieve Electromagnetic Spectrum (EMS) superiority. This program provides technical analyses, technology assessments, capability and capability gap identification, intelligence and threat evaluations to inform DoD EW requirements, acquisition programs, and investment decisions. This program also advances EW needs in modeling, simulation, test, exercises, experimentation, and training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Executive Committee"
                                    },
                                    "Description": {
                                        "val": "Funds are to conduct analytic assessments, threat-projective red-teaming, and physics-based modeling of electronic warfare capabilities to support the Deputy Secretary of Defense-directed Electronic Warfare (EW) Executive Committee (EXCOM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.198"
                                            },
                                            "Text": {
                                                "val": "- Developed overarching DoD EW Strategy. Analyzed existing DoD EMS management capabilities and identified promising technologies and coordinated solutions to improve EMS management capabilities. \n- Analyzed adversary kill-chains to support the development of non-kinetic attack options."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.333"
                                            },
                                            "Text": {
                                                "val": "-\tContinue underpinning analysis for EW Strategy and implementation plans. Provide analysis to improve Airborne Electronic Attack System of Systems, advanced electronic protection techniques, passive targeting, and perform assessments of US systems to detect, intercept, and attack advanced threat signals. \n- Examine options for aircraft survivability equipment (ASE), including Infrared Countermeasures and missile warning programs and develop roadmap to synchronize investment in DoD ASE programs.\n- Continue EMS management and adversary kill chain analysis.\n- Examine options for improved capabilities to detect complex threat emitters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "- Perform analytic underpinning for EW Strategy implementation, for synchronization of Services’ EW investments, and for advancing DoD EW capabilities, training, exercises, modeling and simulation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Not Applicable"
                        }
                    }
                }
            ]
        }
    }
}