{
    "id": "2018-AirForce-PB-3600-MJBOOK-3-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-85",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3A-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "1203940F"
        },
        "ProgramElementTitle": {
            "val": "Space Situation Awareness Operations"
        },
        "R1LineNumber": {
            "val": "317"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.416"
            },
            "CurrentYear": {
                "val": "93.802"
            },
            "BudgetYearOne": {
                "val": "99.984"
            },
            "BudgetYearOneBase": {
                "val": "99.984"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "50.241"
            },
            "BudgetYearThree": {
                "val": "23.140"
            },
            "BudgetYearFour": {
                "val": "23.557"
            },
            "BudgetYearFive": {
                "val": "22.668"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY2018, PE 0305940F, BA07, Space Situational Awareness Operations efforts were transferred to PE 1203940F, BA07, Space Situational Awareness Operations due to the creation of a new Major Force Program for Space. FY2016 and FY2017 funding is now documented in the exhibits for PE 1203940F."
        },
        "ProgramElementMissionDescription": {
            "val": "Space Situational Awareness (SSA) is knowledge of all aspects of space related to operations. As the foundation for space control, SSA encompasses surveillance of all space objects and activities; detailed reconnaissance of specific space assets; monitoring space environmental conditions; monitoring cooperative space assets; gathering intelligence on adversary space operations; and conducting integrated command, control, communications, processing, analysis, dissemination, and archiving activities. This program element fields, upgrades, operationalizes, operates and maintains Air Force sensors and information integration capabilities within the SSA network while companion program element 1206425F, Space Situational Awareness Systems, develops new network sensors and improved information integration capabilities across the network. Activities funded in this program element (1203940F) focus on surveillance of objects in earth orbit to aid tasks including satellite tracking; space object identification; tracking and cataloging; satellite attack warning; notification of satellite flyovers to U.S. forces; space treaty monitoring; and technical intelligence gathering.  \n\nThe Sensor Life Extension Programs (SLEPs) project funds efforts to upgrade, operationalize and extend the life of operational SSA sensors, as needed. These SLEPs include, but are not limited to, programs which extend the serviceable life of assets and maintain critical capability by replacing aging and increasingly unsustainable components with modern and sustainable equipment. SLEPs may incorporate equipment which inherently includes technological advances resulting in enhanced or increased capabilities. In addition, the SLEP itself may be designed to increase capabilities not currently realized.  The on-going Ground-based Electro Optics Deep Space Surveillance (GEODSS) Phase II is representative of sensor system upgrades in the SLEP project.  As the need arises in the execution year, funds in this project may be used to begin sensor life extension programs on additional efforts.  \n\nGlobal Sensor Watch Program provides an integrated SSA Tip and Cue capability that implements a survivable architecture which provides overlapping, assured, and viable surveillance options for executing event response (demonstrated by the SSA Ops Demo), multiple level security processing of SSA data and automated cross-sensor tipping and cueing around the globe.  \n\nBeginning in FY17 this program element will begin fielding and sustaining the Joint Interagency Combined Space Operations Center (JICSpOC) infrastructure in response to US Strategic Command Joint Emergent Operational Need (ST-0006).  The JICSpOC seeks to improve unity of effort and information sharing across the national security space community to effectively respond to potential future space threat events and will have the capability to develop, test, and integrate new space system tactics, techniques and procedures (TTPs) in support of both DoD and Intelligence Community operations. \n\nIn FY18 this program element will continue a series of Ground Radar Upgrades designed to improve the sensitivity, search capability and CONOPS of existing SSA sensors to better support fire control timelines.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.016"
                },
                "CurrentYear": {
                    "val": "35.002"
                },
                "BudgetYearOne": {
                    "val": "22.803"
                },
                "BudgetYearOneBase": {
                    "val": "22.803"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.416"
                },
                "CurrentYear": {
                    "val": "93.802"
                },
                "BudgetYearOne": {
                    "val": "99.984"
                },
                "BudgetYearOneBase": {
                    "val": "99.984"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.400"
                },
                "CurrentYear": {
                    "val": "58.800"
                },
                "BudgetYearOne": {
                    "val": "77.181"
                },
                "BudgetYearOneBase": {
                    "val": "77.181"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.903"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.503"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "58.800"
                                },
                                "BudgetYearOne": {
                                    "val": "77.181"
                                },
                                "BudgetYearOneBase": {
                                    "val": "77.181"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  Increase due to higher Air Force prioritization of SSA Operations activities due to emerging threats.\nFY 2017: $58.800M FY17 Request for Additional Appropriations (RAA) to address emergency warfighting readiness requirements\nFY 2018:  $8.291M Increase due to higher Air Force prioritization of SSA Operations activities due to emerging threats. $0.09M inflation adjustment.  $68.8m to support NSDC. Total increase of $77.181M."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "670004"
                    },
                    "ProjectTitle": {
                        "val": "Other STRATCOM Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "73.652"
                        },
                        "BudgetYearOne": {
                            "val": "71.340"
                        },
                        "BudgetYearOneBase": {
                            "val": "71.340"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "30.522"
                        },
                        "BudgetYearThree": {
                            "val": "2.673"
                        },
                        "BudgetYearFour": {
                            "val": "2.712"
                        },
                        "BudgetYearFive": {
                            "val": "2.775"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The National Space Defense Center (NSDC), formerly the Joint Interagency Combined Space Operations Center (JICSpOC), seeks to improve unity of effort and information sharing across the national security space community to effectively respond to potential future space threat events. The NSDC requires effective battle management, command and control (BMC2) to integrate and synchronize space and cyber forces and the intelligence community with efforts across all domains and to execute unity of effort through the core command and control functions of:  situation monitoring, planning, decision making, space force management and space force direction.  The NSDC will have the capability to develop, test, and integrate new space system tactics, techniques and procedures (TTPs) in support of both DoD and Intelligence Community (IC) operations. Lessons learned from NSDC experimentation will inform requirements development for future BMC2 architectures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NSDC Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Develop and field space battle management, command and control (BMC2) infrastructure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "73.652"
                                            },
                                            "Text": {
                                                "val": "Design, develop and field a communications architecture and suite of decision support and analytical tools to support space BMC2."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.340"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.340"
                                            },
                                            "Text": {
                                                "val": "Conduct space defense experimentation and exercises to further refine necessary capabilities and tactics, techniques, and procedures to enable the NSDC to conduct  the space defense mission.  Continue prototyping efforts to develop tools to fill capability gaps uncovered in experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SpODC Development"
                                    },
                                    "Description": {
                                        "val": "Development of the Space Operations Development Center (SpODC) modeling and simulation infrastructure"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.000"
                                            },
                                            "Text": {
                                                "val": "Build hardware and software applications to create capability to perform future space experimentation, technology maturation, and operating training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Accelerated Space BMC2 JEON (ST-0006) is led by AFRL\/RV and will utilize existing contracts (e.g. Space Security and Defense Program (SSDP) and SMC\/SY) and provide funds to other AF\/DoD organizations to execute on their contracts. Additionally, AFRL\/RV will initiate and utilize commercial consortiums to deliver capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "FY17 includes $58.8M Request for Additional Appropriations for emergency warfighting readiness requirements."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "SYSTEM ENGINEERING AND INTEGRATION"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.425"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.425"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.425"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SPACE OPERATIONAL DEVELOPMENT CENTER DESIGN AND EXPERIMENTATION"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "64.652"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "34.590"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "34.590"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "COMMUNICATIONS ARCHITECTURE DESIGN AND DEVELOPMENT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.575"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.575"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.575"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "APPLICATION DEVELOPMENT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.750"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.750"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "VARIOUS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "FFRDC"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "COLORADO SPRINGS, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NSDC Infrastructure Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NSDC Experimentation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NSDC Capabiity Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SpODC Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67A017"
                    },
                    "ProjectTitle": {
                        "val": "Sensor Service Life Extension Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.416"
                        },
                        "CurrentYear": {
                            "val": "20.150"
                        },
                        "BudgetYearOne": {
                            "val": "28.644"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.644"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.719"
                        },
                        "BudgetYearThree": {
                            "val": "20.467"
                        },
                        "BudgetYearFour": {
                            "val": "20.845"
                        },
                        "BudgetYearFive": {
                            "val": "19.893"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "153.134"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Space Situational Awareness (SSA) is knowledge of all aspects of space related to operations. As the foundation for space control, SSA encompasses surveillance of  all space objects and activities; detailed reconnaissance of specific space assets; monitoring space environmental conditions; monitoring cooperative space assets; gathering intelligence on adversary space operations; and conducting integrated command, control, communications, processing, analysis, dissemination, and archiving activities. SSA also encompasses the integration, exploitation and delivery of data sources to facilitate the battle management and command and control of space forces.  This program element fields, upgrades, modifies, modernizes, operationalizes, operates and maintains Air Force sensors and information integration capabilities within the SSA Space Surveillance network (SSN) while companion program element 1206425F, Space Situational Awareness Systems, develops new network sensors and improved information integration capabilities across the network. Activities funded in this program element (1203940F) focus on surveillance of objects in earth orbit to aid tasks including satellite tracking; space object identification; tracking and cataloging; satellite attack warning; notification of satellite flyovers to U.S. forces; space treaty monitoring; and technical intelligence gathering.\n\nThe 67A017 project funds efforts to upgrade, operationalize and extend the life of operational SSA sensors, as needed. Through Service Life Extension Programs (SLEPs) the following types of activities are performed, but is not limited to, programs that extend the serviceable life of assets and maintain critical capability by replacing aging and increasingly unsustainable components with modern and sustainable equipment. In addition, the SLEP itself may be designed to increase capabilities not currently realized. As the need arises in the execution year, funds in this project may be used to begin SLEPs on additional efforts.  \n\nGlobal Sensor Watch Program provides an integrated SSA Tip and Cue capability that implements a survivable architecture which provides overlapping, assured, and viable surveillance options for executing event response (demonstrated by the SSA Ops Demo), multiple level security processing of SSA data and automated cross-sensor tipping and cueing around the globe.  Other efforts to support Battle Management Command & Control (BMC2) in space include developing & deploying advanced software algorithms to identify, acquire, characterize, and maintain custody of deep space (S)High Inclination Orbits(HIO); optimizing intelligence community & Missile Defense Agency (MDA) sensors to better support BMC2; developing & executing Joint Functional Component Command (JFCC) for Space exercises such as Joint Space Operations Center (JSPOC) Experimentation, Test and Training Initiative (JETTI) to test & optimize Space Control capabilities, concept of operations (CONOPS) development to increase probability of survival for blue assets, and refining requirements across space enterprise; enhancing sensor performance to close the solar exclusion gap leveraging technologies such as optical daylight tracking; and improving legacy communication paths to support bi-directional machine-to-machine sensor communications enabling a more complete BMC2 capability.\n\nGround Based Radar Upgrades improve the sensitivity, search capabilities and CONOPS of existing SSA sensors to better support custody and fire control timelines."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Global Sensor Watch Program"
                                    },
                                    "Description": {
                                        "val": "Global Sensor Watch Program provides an integrated SSA Tip and Cue capability that implements a survivable architecture which provides overlapping, assured, and viable surveillance options for executing event response (demonstrated by the SSA Ops Demo), multiple level security processing of SSA data and automated cross-sensor tipping and cueing around the globe.  Other efforts to support Battle Management Command & Control (BMC2) in space include developing & deploying advanced software algorithms to identify, acquire, characterize, and maintain custody of deep space (S)HIOs; optimizing intelligence community & MDA sensors to better support BMC2; developing & executing JFCC Space exercises such as JETTI to test & optimize Space Control capabilities, CONOPS development to increase probability of survival for blue assets, and refining requirements across space enterprise; enhancing sensor performance to close the solar exclusion gap leveraging technologies such as optical daylight tracking; and improving legacy communication paths to support bi-directional machine-to-machine sensor communications enabling a more complete BMC2 capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.360"
                                            },
                                            "Text": {
                                                "val": "Developed tip and cue software upgrades and began preparations for follow-on test\/demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.350"
                                            },
                                            "Text": {
                                                "val": "Continue to develop tip and cue software upgrades and conduct follow-on test\/demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.616"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.616"
                                            },
                                            "Text": {
                                                "val": "Provide findings from SSA Operations Demonstration to the Office of the Secretary of Defense\/Cost Assessment and Program Evaluation Office (OSD\/CAPE), refine processing algorithms, address communications network findings, refine CONOPS\/TTPs with operational community, and deliver final report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GEODSS SLEP"
                                    },
                                    "Description": {
                                        "val": "The GEODSS effort extends the operational life of the Ground Based Electro-Optical Deep Space Surveillance System (GEODSS).  It replaces the aging Sensor Controller Group (SCG), Data Processing Group (DPG), Data Communications Group (DCG), and other unsupportable subsystems as required to maintain Space Surveillance Network (SSN) tracking capabilities for objects in deep space and geosyncronous orbits."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.056"
                                            },
                                            "Text": {
                                                "val": "Conducted Preliminary Design Review (PDR) and obtained milestone B decision to enter Engineering and Manufacturing Development (EMD).  Began EMD, conduct Critical Design Review (CDR), purchased hardware, conducted software development and began integration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Radar Upgrades"
                                    },
                                    "Description": {
                                        "val": "This effort improves the sensitivity, search capability and CONOPS of existing SSA sensors to better support fire control timelines"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.800"
                                            },
                                            "Text": {
                                                "val": "Begin prototyping L-Band solid-state transmitter, operationalize UHF transmitter\/receiver upgrade and field a COTS-based L-band high voltage power supply."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.028"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.028"
                                            },
                                            "Text": {
                                                "val": "Field capability improvements for existing SSA sensors and system tactics to improve custody of resident space objects (RSOs).  Continue program office and other related support activities that may include, but are not limited to studies, technical analysis, etc."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The GEODSS SLEP was awarded as an Engineering Change Proposal on the SENSOR contract.  The GEODSS SLEP uses a phased development and deployment strategy to reduce risk. \n\nThe acquisition strategies for SSA Operations Demo and Ground Based Radar Upgrades include a mix of modifications to existing Air Force contracts and directing funds to other AF or DoD organizations for contract support."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "GEODSS design, development and life extension"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Exelis\/TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.848"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.848"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Global Sensor Watch Program"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Exelis\/TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.196"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.935"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "16.370"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "16.370"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Global Sensor Watch Enterprise Systems Engineering and Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Systems Engineering and Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Ground Radar Upgrades - L-Band"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT\/LL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.383"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Ground Radar Upgrades - UHF Radar Transmitter\/Receiver"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Execlis\/TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.836"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.836"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MIT Lincoln Labaoratory"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.014"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.993"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.090"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.858"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.858"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.788"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFLCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lexington,MA ColSpgs,CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.015"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.042"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.230"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.230"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "16.626"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "GEODSS Phase II Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Global Sensor Watch Program"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ground Radar Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}