{
    "id": "2018-Army-PB-2040-JBOOK-3e91339aa28ec2881f9549044dc8a7daf4e287c1ca461095f2d8b42bf2f292b8-11",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603790A"
        },
        "ProgramElementTitle": {
            "val": "NATO Research and Development"
        },
        "R1LineNumber": {
            "val": "64"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.835"
            },
            "CurrentYear": {
                "val": "2.300"
            },
            "BudgetYearOne": {
                "val": "2.588"
            },
            "BudgetYearOneBase": {
                "val": "2.588"
            },
            "BudgetYearTwo": {
                "val": "3.127"
            },
            "BudgetYearThree": {
                "val": "3.016"
            },
            "BudgetYearFour": {
                "val": "2.865"
            },
            "BudgetYearFive": {
                "val": "2.790"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) implements the provisions of Title 10 United States (US) Code, Section 2350a, Cooperative Research and Development (R&D) Projects: Allied Countries.  The objective is to improve, through the application of emerging technologies, the conventional defense capabilities of the United States and our cooperative partners, including the North Atlantic Treaty Organization (NATO), US major non-NATO allies and Friendly Foreign countries. Through technology sharing and joint equipment development these projects help reduce US acquisition costs and leverage important technologies for the Army Transformation and the development of the Future Combat system. Cooperative efforts also improve multinational force compatibility with potential coalition partners through the development and use of similar equipment and improved interfaces. The program focuses specifically on international cooperative technology demonstration, validation, and interoperability of Army weapon and command, control, communications and information (C3I) systems, including the NATO Defense Against Terrorism initiatives. Projects are implemented through international agreements with foreign partners that define scope, cost and work sharing arrangements, management, contracting, security, data protection and third party transfers.  Funds are used to pay for only the US work share that occurs in the United States at US Government and US contractor facilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.075"
                },
                "CurrentYear": {
                    "val": "2.300"
                },
                "BudgetYearOne": {
                    "val": "3.128"
                },
                "BudgetYearOneBase": {
                    "val": "3.128"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.835"
                },
                "CurrentYear": {
                    "val": "2.300"
                },
                "BudgetYearOne": {
                    "val": "2.588"
                },
                "BudgetYearOneBase": {
                    "val": "2.588"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.240"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.540"
                },
                "BudgetYearOneBase": {
                    "val": "-0.540"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.240"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.540"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.540"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year 2018 reduction due to inflation adjustments and other Economic Assumptions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "691"
                    },
                    "ProjectTitle": {
                        "val": "NATO Rsch & Devel"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.835"
                        },
                        "CurrentYear": {
                            "val": "2.300"
                        },
                        "BudgetYearOne": {
                            "val": "2.588"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.588"
                        },
                        "BudgetYearTwo": {
                            "val": "3.127"
                        },
                        "BudgetYearThree": {
                            "val": "3.016"
                        },
                        "BudgetYearFour": {
                            "val": "2.865"
                        },
                        "BudgetYearFive": {
                            "val": "2.790"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project implements the provisions of Title 10 U.S. Code, Section 2350a, Cooperative Research and Development (R&D) Projects: Allied Countries.  The objective is to improve, through the application of emerging technologies, the conventional defense capabilities of the United States and our cooperative partners, including the North Atlantic Treaty Organization (NATO), U.S. major non-NATO allies and Friendly Foreign countries. Through technology sharing and joint equipment development these projects help reduce U.S. acquisition costs and leverage important technologies for the Army Transformation and the development of the Future Combat system. Cooperative efforts also improve multinational force compatibility with potential coalition partners through the development and use of similar equipment and improved interfaces. The Project focuses specifically on international cooperative technology demonstration, validation, and interoperability of Army weapon and command, control, communications and information (C3I) systems, including the NATO Defense Against Terrorism initiatives. Activities are implemented through international agreements with foreign partners that define scope, cost and work sharing arrangements, management, contracting, security, data protection and third party transfers.  Funds are used to pay for only the U.S. work share that occurs in the United States at U.S. Government and U.S. contractor facilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Armaments Cooperation Enterprise Support"
                                    },
                                    "Description": {
                                        "val": "Armaments Cooperation Enterprise Support\/ International Online (IOL) Development and Implementation NATO\/International Cooperative R&D (AR 70-41) and International Acquisition (AR 70-1, AR 70-3). Prior to FY15, efforts in this area were covered under the area entitled Scientific and Technology Enterprise Management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.763"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to expand worldwide allied standardization and interoperability through cooperative Research and Development (R&D) and technology sharing per SECDEF guidance and especially in support of the U.S. Army. This program will fund the travel costs and administrative support (studies, analysis, interpretation, equipment, etc.) required to participate internationally, such as the North Atlantic Treaty Organization (NATO) Army Armaments Group (NAAG), Defense Against Terrorism (DAT) and to pursue new cooperative R&D initiatives and international cooperative agreements such as memoranda of understanding.  Additional funds will allow the coordination for cooperative research, development and evaluation of defense technologies\/systems\/equipments plus joint production and follow-on support of defense systems or equipment and the procurement of foreign technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.760"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to expand worldwide allied standardization and interoperability through cooperative Research and Development (R&D) and technology sharing per SECDEF guidance and especially in support of the U.S. Army. The execution AR 70-41 responsibilites requires DASA (DE&C) to conduct engagement with key strategy foreign partners in all regions of the world through the SNR(A) program, international agreement negotiations, and other bilateral and multilateral forums involving DASA (DE&C) personnel. This program will fund the travel costs and administrative support (studies, analysis, interpretation, equipment, etc.) required to participate internationally, such as the North Atlantic Treaty Organization (NATO) Army Armaments Group (NAAG), Defense Against Terrorism (DAT) and to pursue new cooperative R&D initiatives and international cooperative agreements such as memoranda of understanding.  Funds will allow the coordination for cooperative research, development and evaluation of defense technologies\/systems\/equipments plus joint production and follow-on support of defense systems or equipment and the procurement of foreign technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.979"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.979"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to expand worldwide allied standardization and interoperability through cooperative Research and Development (R&D) and technology sharing per SECDEF guidance and especially in support of the U.S. Army. The execution AR 70-41 responsibilites requires DASA (DE&C) to conduct engagement with key strategy foreign partners in all regions of the world through the SNR(A) program, international agreement negotiations, and other bilateral and multilateral forums involving DASA (DE&C) personnel. This program will fund the travel costs and administrative support (studies, analysis, interpretation, equipment, etc.) required to participate internationally, such as the North Atlantic Treaty Organization (NATO) Army Armaments Group (NAAG), Defense Against Terrorism (DAT) and to pursue new cooperative R&D initiatives and international cooperative agreements such as memoranda of understanding.  Funds will allow the coordination for cooperative research, development and evaluation of defense technologies\/systems\/equipments plus joint production and follow-on support of defense systems or equipment and the procurement of foreign technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications Interoperability, and Electronics Technologies"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop technologies that enable interoperability among partner countries' command, control, communications, sensors, and information systems.  Efforts include development of a single solution standard avoiding development of multiple unique solutions and leverage existing interoperability standards developed by NATO. Such standards include common doctrine, technical and procedural specifications to make better use of existing information, shared data, leveraged national operating picture capabilities and enable the development of interoperability of data, databases, applications, security domains and national networks architectures.  Includes efforts from areas formerly titled Multi-National Network Enabled Capabilities, Low Level Air Defense Interoperability, JTRS, Combat Identification, and Multilateral Interoperability Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.288"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to develop technologies that enable interoperability among partner countries' command, control, communications, sensors, and information systems.  Efforts include development of a single solution standard avoiding development of multiple unique solutions and leverage existing interoperability standards developed by NATO. Such standards include common doctrine, technical and procedural specifications to make better use of existing information, shared data, leverage national operating picture capabilities and enable the development of interoperability of data, databases, applications, security domains and national networks architectures.  Includes projects formerly titled Multi-National Network Enabled Capabilities, Low Level Air Defense Interoperability, JTRS, Combat Identification, and Multilateral Interoperability Program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.125"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to develop technologies that enable interoperability among partner countries' command, control, communications, sensors, and information systems.   Efforts include development of a single solution standard avoiding development of multiple unique solutions and leverage existing interoperability standards developed by NATO. Such standards include common doctrine, technical and procedural specifications to make better use of existing information, shared data, leverage national operating picture capabilities and enable the development of interoperability of data, databases, applications, security domains and national networks architectures. FY17 funding will be used to pursue cooperative projects that were postponed such as: the Coalition Wideband Networking  Waveform Phase II, 5-Power-Net-centric Command and Control Interoperability projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.141"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to develop technologies that enable interoperability among partner countries' command, control, communications, sensors, and information systems.   Efforts include development of a single solution standard avoiding development of multiple unique solutions and leverage existing interoperability standards developed by NATO. Such standards include common doctrine, technical and procedural specifications to make better use of existing information, shared data, leverage national operating picture capabilities and enable the development of interoperability of data, databases, applications, security domains and national networks architectures. FY18 funding will be used to pursue cooperative projects that were postponed such as: the Coalition Wideband Networking Waveform Phase II, 5-Power-Net-centric Command and Control Interoperability projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Senior National Representatives (Army) (SNR-(A))"
                                    },
                                    "Description": {
                                        "val": "Senior National Representatives (Army) (SNR-(A)) Projects (Partners: France, Germany, United Kingdom and Italy): Supports harmonization of programs at various levels: exchanging information, identifying knowledge gaps and conducting feasibility studies to further promote cooperative development; standardizing, fielding and roadmapping various processes; distributing the workload among the different nations. Technology Demonstrations hosted by the U.S. reps to Land Group 6, NATO Army Armaments Group (NAAG), will provide an opportunity to observe and demonstrate the current and future capability of participating NATO nations with a view to assisting future operational and materiel interoperability. Army support of NAAG studies, analysis and technology demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.144"
                                            },
                                            "Text": {
                                                "val": "Senior National Representatives (Army) (SNR-(A)) Projects with international partner will support harmonization of programs at various levels: exchanging information, identifying knowledge gaps and conducting feasibility studies to further promote cooperative development; standardizing, fielding and road mapping various processes; distributing the workload among the different nations. Technology Demonstrations hosted by the U.S. reps to Land Group, NATO Army Armaments Group (NAAG), will provide an opportunity to observe and demonstrate the current and future capability of participating NATO nations with a view to assisting future operational and materiel interoperability. Army will support of NAAG studies, analysis and technology demonstrations.  Additional funds will be used to persue cooperative initiatives that were postponed, cancelled or not pursued due to funding reductions in previous years such as forums and engagement with long-standing foreign partners to identify interoperability gaps and develop necessary standardization programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.013"
                                            },
                                            "Text": {
                                                "val": "Senior National Representatives (Army) (SNR-(A)) Projects with international partner will support harmonization of programs at various levels: exchanging information, identifying knowledge gaps and conducting feasibility studies to further promote cooperative development; standardizing, fielding and road mapping various processes; distributing the workload among the different nations. Technology Demonstrations hosted by the U.S. reps to Land Group, NATO Army Armaments Group (NAAG), will provide an opportunity to observe and demonstrate the current and future capability of participating NATO nations with a view to assisting future operational and materiel interoperability. Army will support of NAAG studies, analysis and technology demonstrations.  Additional funds will be used to persue cooperative initiatives that were postponed, cancelled or not persued due to funding reductions in previous years such as forums and engagement with long-standing foreign partners to identify interoperability gaps and develop necessary standardization programs. FY17 funding will be used to pursue cooperative initiatives (i.e., forums and engagement with long-standing foreign partners to identify interoperability gaps and develop necessary standardization programs)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.015"
                                            },
                                            "Text": {
                                                "val": "Senior National Representatives (Army) (SNR-(A)) Projects with international partner will support harmonization of programs at various levels: exchanging information, identifying knowledge gaps and conducting feasibility studies to further promote cooperative development; standardizing, fielding and road mapping various processes; distributing the workload among the different nations. Technology Demonstrations hosted by the U.S. reps to Land Group, NATO Army Armaments Group (NAAG), will provide an opportunity to observe and demonstrate the current and future capability of participating NATO nations with a view to assisting future operational and materiel interoperability. Army will support of NAAG studies, analysis and technology demonstrations.  Additional funds will be used to pursue cooperative initiatives that were postponed, cancelled or not pursued due to funding reductions in previous years such as forums and engagement with long-standing foreign partners to identify interoperability gaps and develop necessary standardization programs. FY18 funding will be used to pursue cooperative initiatives (i.e., forums and engagement with long-standing foreign partners to identify interoperability gaps and develop necessary standardization programs)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapons and Munitions Technologies"
                                    },
                                    "Description": {
                                        "val": "Weapons and munitions technologies (Partners: France, Germany, Italy, UK):  The Participants in this program will develop an automated software interface between their national field artillery command and control systems.  The nations will be able to receive and provide mutual fire support (i.e. cannon and rocket fire) in combined operations more rapidly and with minimal errors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.238"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and to develop jointly technologies to improve range, payloads, speed, survivability and lethality to maintain U.S. technical superiority and combat overmatch for Army weapons systems and associated munitions.   Areas of cooperation include fuzing and warhead systems, guidance systems, counter improvised explosive device neutralization, directed energy, and fire control systems.  Such cooperative development is done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries.  Since FY15, efforts in this activity were combined with Artillery Command and Control Interopeability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and develop jointly technologies to improve range, payloads, speed, survivability and lethality to maintain U.S. technical superiority and combat overmatch for Army weapons systems and associated munitions.   Areas of cooperation include fuzing and warhead systems, guidance systems, counter improvised explosive device neutralization, directed energy, and fire control systems.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries. This activity was combined with Artillery Command and Control Interopeability in FY15. FY17 funding will be used to pursue cooperative projects (i.e., to develop and demonstrate interoperability among U.S. foreign partners artillery weapons systems and ammunitions)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.113"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.113"
                                            },
                                            "Text": {
                                                "val": "The goal of this project is to cooperate with partner countries to increase interoperability and develop jointly technologies to improve range, payloads, speed, survivability and lethality to maintain U.S. technical superiority and combat overmatch for Army weapons systems and associated munitions.  Areas of cooperation include fuzing and warhead systems, guidance systems, counter improvised explosive device neutralization, directed energy, and fire control systems.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries. This program was combined with Artillery Command and Control Interopeability in FY15. FY17 funding will be used to pursue cooperative projects (i.e., to develop and demonstrate interoperability among U.S. foreign partners artillery weapons systems and ammunitions)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Technologies"
                                    },
                                    "Description": {
                                        "val": "Soldier Technologies (Partners: United Kingdom, France, Germany, Italy, Sweden, Canada): Soldier Technologies will include R&D collaboration on technologies such as Counter Rocket and Mortar (C-RAM) and Counter Improvised Explosive Devices (C-IED). Programs include Military Operations in Urban Terrain (MOUT) and a variety of Defense Against Terrorism (DAT) initiatives such as Defense Against Mortar Attacks (DAMA) and Joint Precision Air Drop System (JPADS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.288"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and develop jointly improved technologies to increase the effectiveness, health, and reliability of the individual soldier.  Such technologies will maximize soldier survivability, sustainability, mobility, combat effectiveness, and field quality of life.  Efforts under this project will also enable interoperability and standardization among partner country systems that support the individual soldier.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries. Since FY15 this program adopted Force Protection Project  and  projects under TRDP, additional funds will be used to pursue cooperative projects that were postponed or not pursue due to funding reductions in previous years such as cooperative projects in soldier psychological health and traumatic brain injury, improved small arms systems, eye safe lasers, portable soldier power technologies, and enhance body armor."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Systems Technologies"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and develop jointly technologies to improve survivability, weapons, ground platforms (manned and unmanned), and mobility and counter-mobility to provide soldiers with unmatched offensive and defensive capabilities in weapons and military vehicles.   Areas of cooperation include ground systems design, propulsion, structures, robotics, alternative fuels and lubricants, systems integration, electronics, and power management.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.240"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and develop jointly technologies to improve survivability, weapons, ground platforms (manned and unmanned), and mobility and counter-mobility to provide soldiers with unmatched offensive and defensive capabilities in weapons and military vehicles.   Areas of cooperation will include ground systems design, propulsion, structures, robotics, alternative fuels and lubricants, systems integration, electronics, and power management.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries. Additional FY16  funds will be used to continue funding cooperative projects in armored vehicle underbody blast protection and unmanned ground vehicles such as Hybrid Electric PA between US and Japan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and develop jointly technologies to improve survivability, weapons, ground platforms (manned and unmanned), and mobility and counter-mobility to provide soldiers with unmatched offensive and defensive capabilities in weapons and military vehicles.   Areas of cooperation will include ground systems design, propulsion, structures, robotics, alternative fuels and lubricants, systems integration, electronics, and power management.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries. FY17 funding will be used to fund the continuation of cooperative projects in armored vehicle underbody blast protection and unmanned ground vehicles such as Hybrid Electric Project Agreement between US and Japan."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.113"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.113"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and develop jointly technologies to improve survivability, weapons, ground platforms (manned and unmanned), and mobility and counter-mobility to provide soldiers with unmatched offensive and defensive capabilities in weapons and military vehicles.   Areas of cooperation will include ground systems design, propulsion, structures, robotics, alternative fuels and lubricants, systems integration, electronics, and power management.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries. FY17 funding will be used to fund the continuation of cooperative projects in armored vehicle underbody blast protection and unmanned ground vehicles such as Hybrid Electric Project Agreement between US and Japan."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation Systems Technologies"
                                    },
                                    "Description": {
                                        "val": "The goal of this activityis to cooperate with partner countries to increase interoperability and develop jointly improved aerodynamics, aeromechanics, avionics, weapons and sensor integration, propulsion, and aviation autonomy technologies that improve range, payloads, speed, survivability and lethality to maintain U.S. technical superiority and combat overmatch for vertical lift aviation systems.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.442"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and develop jointly improved aerodynamics, aeromechanics, avionics, weapons and sensor integration, propulsion, and aviation autonomy technologies that improve range, payloads, speed, survivability and lethality to maintain U.S. technical superiority and combat overmatch for vertical lift aviation systems.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries. Additional FY16 funds will be used to persue cooperative projects that were postponed or not pursued due to funding reductions in previous years such as cooperative projects to develop advance rotorcraft technologies and improve systems that aid pilots and aircrew in degrated visual environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.202"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and develop jointly improved aerodynamics, aeromechanics, avionics, weapons and sensor integration, propulsion, and aviation autonomy technologies that improve range, payloads, speed, survivability and lethality to maintain U.S. technical superiority and combat overmatch for vertical lift aviation systems.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries. FY 17 funding will be used to pursue cooperative projects (i.e., the development of advance rotorcraft technologies and improve systems that aid pilots and aircrew in degraded visual environments)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.227"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.227"
                                            },
                                            "Text": {
                                                "val": "The goal of this activity is to cooperate with partner countries to increase interoperability and develop jointly improved aerodynamics, aeromechanics, avionics, weapons and sensor integration, propulsion, and aviation autonomy technologies that improve range, payloads, speed, survivability and lethality to maintain U.S. technical superiority and combat overmatch for vertical lift aviation systems.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries. FY 17 funding will be used to pursue cooperative projects (i.e., the development of advance rotorcraft technologies and improve systems that aid pilots and aircrew in degraded visual environments)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemical and Biological Defense Technologies"
                                    },
                                    "Description": {
                                        "val": "The goal of this project is to cooperate with partner countries to increase interoperability and standardization of chemical, biological, and radiological defense materiel and to develop jointly improved technologies to defend against weapons of mass destruction.  Areas of cooperation include aerosol physics, toxicology, vaccinations, filtration science, agent detection and monitoring, handling, and demilitarization.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.240"
                                            },
                                            "Text": {
                                                "val": "The goal of this project is to cooperate with partner countries to increase interoperability and standardization of chemical, biological, and radiological defense materiel and to develop jointly improved technologies to defend against weapons of mass destruction.  Areas of cooperation include aerosol physics, toxicology, vaccinations, filtration science, agent detection and monitoring, handling, and demilitarization.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries.  Additional FY16 funds will be used to continue cooperative projects that were postponed due to funds reductions in previous years, such as cooperative projects to develop vaccines for soldier protection against biological threats and enhanced radiological and biological threat detection systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missiles and Rocket Technologies"
                                    },
                                    "Description": {
                                        "val": "The goal of this project is to cooperate with partner countries to increase interoperability and deveop jointly improved missile and rocket technologies, such as propulsion, energetic materials, payloads, flight control systems, sensors, and seekers.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purpose of improving defense capabilities of the U.S. and partner countries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.192"
                                            },
                                            "Text": {
                                                "val": "The goal of this project is to cooperate with partner countries to increase interoperability and deveop jointly improved missile and rocket technologies, such as propulsion, energetic materials, payloads, flight control systems, sensors, and seekers.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purpose of improving defense capabilities of the U.S. and partner countries. a portion of former Technology Research and Development Projects (TRDP) was moved to Missiles and Rockets as part of project realignment in FY15.\nAdditional FY16 funds are used to persue cooperative projects that were postponed or not pursued due to funding reductions in previous years such as cooperative projects to enhance coalition capabilities in Ground-based Air Defense."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Acquisition Strategy: \nThe goal of this program is to expand worldwide allied standardization interoperability through cooperative research and development (R&D) and technology sharing  per SECDEF guidance and especially in support of the of the U.S. Army. \nAll projects are test or technical demonstrations to feed into potential new requirements in support of Army Transformation to the Future Force or as product improvements to the Current Force.\n\nList of the programs curently in place:\nCommunications, Interoperability, and Electronics Technologies\nThe goal of this project is to develop technologies that enable interoperability among partner countries’ command, control, communications, sensors, and information systems.   Efforts under this project include development of a single solution standard avoiding development of multiple unique solutions and leverage existing interoperability standards developed by NATO. Such standards include common doctrine, technical and procedural specifications to make better use of existing information, shared data, leverage national operating picture capabilities and enable the development of interoperability of data, databases, applications, security domains and national networks architectures.  Includes projects formerly titled Multi-National Network Enabled Capabilities, Low Level Air Defense Interoperability, JTRS, Combat Identification, and Multilateral Interoperability Program.\n\nMissile and Rocket Technologies\nThe goal of this project is to cooperate with partner countries to increase interoperability and develop jointly improved missile and rocket technologies, such as propulsion, energetic materials, payloads, flight control systems, sensors, and seekers.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries.\n\nAviation Systems Technologies \nThe goal of this project is to cooperate with partner countries to increase interoperability and develop jointly improved aerodynamics, aeromechanics, avionics, weapons and sensor integration, propulsion, and aviation autonomy technologies that improve range, payloads, speed, survivability and lethality to maintain U.S. technical superiority and combat overmatch for vertical lift aviation systems.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries.\n\nSoldier Technologies\nThe goal of this project is to cooperate with partner countries to increase interoperability and develop jointly improved technologies to increase the effectiveness, health, and reliability of the individual soldier.  Such technologies will maximize soldier survivability, sustainability, mobility, combat effectiveness, and field quality of life.  Efforts under this project will also enable interoperability and standardization among partner country systems that support the individual soldier.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries.\n\nChemical and Biological Defense Technologies\nThe goal of this project is to cooperate with partner countries to increase interoperability and standardization of chemical, biological, and radiological defense materiel and to develop jointly improved technologies to defend against weapons of mass destruction.  Areas of cooperation include aerosol physics, toxicology, vaccinations, filtration science, agent detection and monitoring, handling, and demilitarization.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries.\n\nGround Systems Technologies\nThe goal of this project is to cooperate with partner countries to increase interoperability and develop jointly technologies to improve survivability, weapons, ground platforms (manned and unmanned), and mobility and counter-mobility to provide soldiers with unmatched offensive and defensive capabilities in weapons and military vehicles.   Areas of cooperation include ground systems design, propulsion, structures, robotics, alternative fuels and lubricants, systems integration, electronics, and power management.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries.\n\nWeapons and Munitions Technologies\nThe goal of this project is to cooperate with partner countries to increase interoperability and develop jointly technologies to improve range, payloads, speed, survivability and lethality to maintain U.S. technical superiority and combat overmatch for Army weapons systems and associated munitions.   Areas of cooperation include fuzing and warhead systems, guidance systems, counter improvised explosive device neutralization, directed energy, and fire control systems.  Such cooperative development will be done under the auspices of international agreements established among the participating countries for the purposes of improving defense capabilities of the U.S. and partner countries.\n\nSenior National Representative (Army) program\nSenior National Representatives (Army) (SNR-(A)) Projects with international partners: Supports harmonization of programs at various levels: exchanging information, identifying knowledge gaps and conducting feasibility studies to further promote cooperative development; standardizing, fielding and road mapping various processes; distributing the workload among the different nations. Technology Demonstrations hosted by the U.S. reps to Land Group, NATO Army Armaments Group (NAAG), provides an opportunity to observe and demonstrate the current and future capability of participating NATO nations with a view to assisting future operational and materiel interoperability. Army support of NAAG studies, analysis and technology demonstrations.\n\nArmaments Cooperation Enterprise Support\nThe goal of this program is to expand worldwide allied standardization and interoperability through cooperative research and development (R&D) and technology sharing per SECDEF guidance and especially in support of the U.S. Army. This program will fund the travel costs and administrative support (studies, analysis, interpretation, equipment, etc.) required to participate internationally, such as the North Atlantic Treaty Organization (NATO) Army Armaments Group (NAAG), Defense Against Terrorism (DAT) and to pursue new cooperative R&D initiatives and international cooperative agreements such as memoranda of understanding. This program will also include:  the United States' share of costs of the NATO Civil Budget, Chapter IX, which funds the NATO Industrial Advisory Group (NIAG) and the Special Fund for Cooperative Planning (U. S. Army is Executive Agent for this NATO bill); the Technical Cooperation Program, and Army armaments cooperation working groups with many nations."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}