{
    "id": "2018-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-8c969fda2b08c8b1edabf434c4065342c0a47952a0575e86cbca2b99dbcebccc-8",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603286E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED AEROSPACE SYSTEMS"
        },
        "R1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "165.764"
            },
            "CurrentYear": {
                "val": "182.327"
            },
            "BudgetYearOne": {
                "val": "155.406"
            },
            "BudgetYearOneBase": {
                "val": "155.406"
            },
            "BudgetYearTwo": {
                "val": "162.028"
            },
            "BudgetYearThree": {
                "val": "176.551"
            },
            "BudgetYearFour": {
                "val": "181.434"
            },
            "BudgetYearFive": {
                "val": "180.316"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "173.631"
                },
                "CurrentYear": {
                    "val": "182.327"
                },
                "BudgetYearOne": {
                    "val": "156.089"
                },
                "BudgetYearOneBase": {
                    "val": "156.089"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "165.764"
                },
                "CurrentYear": {
                    "val": "182.327"
                },
                "BudgetYearOne": {
                    "val": "155.406"
                },
                "BudgetYearOneBase": {
                    "val": "155.406"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.867"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.683"
                },
                "BudgetYearOneBase": {
                    "val": "-0.683"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.609"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.258"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.683"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.683"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.  \nFY 2017:  N\/A\nFY 2018:  Decrease reflects minor program repricing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AIR-01"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED AEROSPACE SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "165.764"
                        },
                        "CurrentYear": {
                            "val": "182.327"
                        },
                        "BudgetYearOne": {
                            "val": "155.406"
                        },
                        "BudgetYearOneBase": {
                            "val": "155.406"
                        },
                        "BudgetYearTwo": {
                            "val": "162.028"
                        },
                        "BudgetYearThree": {
                            "val": "176.551"
                        },
                        "BudgetYearFour": {
                            "val": "181.434"
                        },
                        "BudgetYearFive": {
                            "val": "180.316"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Aerospace Systems program element is budgeted in the Advanced Technology Budget Activity because it addresses high pay-off opportunities to dramatically reduce costs associated with advanced aeronautical systems and provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  Research and development of integrated system concepts, as well as enabling vehicle subsystems will be conducted.  Studies conducted under this project include examination and evaluation of emerging aerospace threats, technologies, concepts, and applications for missiles, munitions, and vehicle systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactically Exploited Reconnaissance Node (TERN)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Tactically Exploited Reconnaissance Node (TERN) program, a joint effort with the Office of Naval Research, is to develop a systems approach for, and perform technical demonstration of, a Medium-Altitude, Long-Endurance Unmanned Aerial Vehicle (MALE UAV) capability from smaller ships.  The program will demonstrate the technology for launch and recovery of large unmanned aircraft capable of providing persistent 24\/7 Intelligence, Surveillance, and Reconnaissance (ISR) and strike capabilities at long radius orbits.  By extending the ISR\/strike radius and simultaneously increasing time on station beyond current capabilities from smaller ships, TERN will enable novel operational concepts including maritime surveillance and responsive, persistent deep overland ISR and strike, without requirement for forward basing.  To achieve these goals, the program will create new concepts for aircraft launch and recovery, aircraft logistics and maintenance, and aircraft flight in regimes associated with maritime operating conditions.  The program will culminate in a launch and recovery demonstration.  Application of TERN technologies and operational concepts will enable a novel and cost efficient approach for multiple mission sets.  The transition partner is the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.391"
                                            },
                                            "Text": {
                                                "val": "-  Completed high fidelity integrated ship-aircraft simulation.\n-  Commenced procurement of long-lead demonstrator system components.\n-  Performed detailed design of demonstrator aircraft.\n-  Began fabrication and testing of demonstrator system hardware.\n-  Initiated software in the loop \/ hardware in the loop build.\n-  Completed integrated testing of propulsion subsystem.\n-  Performed subsystem risk reduction demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct demonstrator system Critical Design Review (CDR).\n-  Commence demonstrator system wing and fuselage fabrication.\n-  Perform demonstrator system integrated avionics testing.\n-  Conduct integrated propulsion system testing.\n-  Complete vehicle structure tooling.\n-  Conduct vehicle structure assembly and testing.\n-  Conduct demonstrator system assembly.\n-  Initiate fabrication of second demonstrator air vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct demonstrator system ground checkout.\n-  Conduct demonstrator system airworthiness assessment.\n-  Conduct demonstrator system instrumentation calibration.\n-  Conduct demonstrator system first flight.\n-  Analyze demonstrator flight test data.\n-  Refine demonstrator system flight control.\n-  Conduct land-based demonstrator system flight testing.\n-  Commence system integration checkout of second air vehicle demonstrator."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Operations in Denied Environment (CODE)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Collaborative Operations in Denied Environment (CODE) program is to enhance mission performance, reduce cost, confound adversaries, and reduce reliance on space assets for navigation and communication by distributing mission functions such as sensing, communication, precision navigation, kinetic, and non-kinetic effects to small platforms and increasing their level of autonomy.  Collaboration of multiple assets offers new possibilities to conduct military missions using smaller air platforms to enhance survivability, reduce overall acquisition cost, create new effects, increase communications range and robustness in denied environments, increase search area, increase areas held at risk, reduce target prosecution reaction time, and provide multi-mission capabilities by combinations of assets.  This effort will specifically focus on developing and demonstrating approaches that will expand the mission capabilities of legacy air assets through autonomy and collaborative behaviors, within a standard based open architecture.  Potential transition partners include the Air Force, Army, and Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.543"
                                            },
                                            "Text": {
                                                "val": "-  Began selection of algorithms for the current leading capabilities: collaborative navigation without Global Positioning System (GPS), formation flight, simultaneous time of arrival from multiple azimuths against moving targets, dynamic prioritized target re-assignment to compensate for attrition, synchronized search using multiple sensor types, collaborative communication using relays or other techniques, closed loop tracking and identification, and terse communication protocols for data fusion and task allocation.\n-  Modified demonstration platform to include mission computer, mesh network capable radio, and supporting hardware.\n-  Demonstrated release 1 collaboration algorithms in real time simulation, including low bandwidth sensor fusion and collaborative tasking that maximizes system effectiveness.\n-  Developed collaborative algorithms, tactics, concepts for communication, and human interface.\n-  Evaluated algorithms, tactics, communication and interfaces, in non-real time simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.027"
                                            },
                                            "Text": {
                                                "val": "-  Continue software maturation through progressive software releases.\n-  Validate software in hardware in the loop testing that includes mesh network, mission computer, mission sensors, and high fidelity air vehicle simulator.\n-  Implement algorithms in first release releases of flightworthy software (release 1) hosted in mission computer compatible with demonstration platform and objective operational platforms.\n-  Demonstrate in-flight capabilities of release 1 focused on basic limited capability software functionality verification, with initial autonomy modules including formation flight, GPS denied navigation, and other vehicle level autonomy modules such as on-board real time sensor processing, contingency management, and mission planning two real and four virtual RQ-23 Unmanned Air Vehicles (UAVs)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.106"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.106"
                                            },
                                            "Text": {
                                                "val": "-  Validate next major software releases in flight.\n-  Perform capstone demonstration involving six live and multiple virtual aircraft performing a test mission with complete software package.\n-  Demonstrate ability of single commander to insert new objectives, modify and introduce new flight restrictions, and provide authorization to engage simulated targets.\n-  Demonstrate the ability to integrate a software module independently developed based on their published software development toolkit.\n-  Collaborate with operational system owners and other partners to develop early transition opportunities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hypersonic Air-breathing Weapon Concept (HAWC)"
                                    },
                                    "Description": {
                                        "val": "The Hypersonic Air-breathing Weapon Concept (HAWC) program is a Joint DARPA \/ Air Force effort that will develop and demonstrate technologies to enable transformational changes in responsive, long-range strike against time-critical or heavily defended targets.  HAWC will pursue flight demonstration of the critical technologies for an effective and affordable air-launched hypersonic cruise missile.  These technologies include advanced air vehicle configurations capable of efficient hypersonic flight, hydrocarbon scramjet-powered propulsion to enable sustained hypersonic cruise, thermal management approaches designed for high-temperature cruise, and affordable system designs and manufacturing approaches.  HAWC technologies also extend to reusable hypersonic air platforms for applications such as global presence and space lift.  The HAWC program will leverage advances made by the previously funded Falcon, X-51, and HyFly programs.  This is a joint program with the Air Force, and HAWC technologies are planned for transition to the Air Force after flight testing is complete."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.500"
                                            },
                                            "Text": {
                                                "val": "-  Completed preliminary design of hypersonic air-breathing missile flight demonstration system.\n-  Completed full-scale freejet propulsion system testing.\n-  Began fabrication and testing of thermal protection.\n-  Began detailed design of the hypersonic air-breathing missile flight demonstration system.\n-  Began creating test-validated performance databases to anchor demonstration vehicle design.\n-  Continued detailed plans for flight testing of the air-breathing missile demonstration system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.500"
                                            },
                                            "Text": {
                                                "val": "-  Update test-validated performance databases to anchor demonstration vehicle design.\n-  Begin subsystem critical design of hypersonic air-breathing missile flight demonstration system.\n-  Conduct preliminary traceability assessment between the HAWC demonstration system and the HAWC operational system.\n-  Conduct software architecture and algorithm design.\n-  Begin software-in-the-loop testing for the demonstration vehicle.\n-  Begin procurement of long lead hardware for hypersonic air-breathing missile flight demonstration vehicle.\n-  Initiate flight certification reviews with the test range.\n-  Begin hardware-in-the-loop testing for the flight demonstration vehicle.\n-  Initiate full-scale flight-like freejet engine testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue updating test-validated performance databases to anchor demonstration vehicle design.\n-  Complete system critical design of hypersonic air-breathing missile flight demonstration system.\n-  Continue software-in-the-loop testing for the demonstration vehicle.\n-  Continue procurement of hardware for hypersonic air-breathing missile flight demonstration vehicle.\n-  Continue flight certification reviews with the test range.\n-  Continue hardware-in-the-loop testing for the demonstration vehicle.\n-  Continue full-scale flight-like freejet engine testing.\n-  Continue detailed plans for flight testing of the air-breathing missile demonstration system.\n-  Begin full-scale thermal-structural testing.\n-  Begin procurement of test assets and test support equipment.\n-  Begin assembly, integration, and test of the air-breathing missile flight demonstration vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Boost Glide"
                                    },
                                    "Description": {
                                        "val": "The Tactical Boost Glide (TBG) program is a Joint DARPA \/ Air Force effort that will develop and demonstrate technologies to enable air-launched tactical range hypersonic boost glide systems, including flight demonstration of a vehicle that is traceable to an operationally relevant weapon that can be launched from current platforms.  The program will also consider traceability to, and ideally compatibility, with the Navy Vertical Launch System (VLS).  The metrics associated with this objective include total range, time of flight, payload, accuracy, and impact velocity.  The program will address the system and technology issues required to enable development of a hypersonic boost glide system considering (1) vehicle concepts possessing the required aerodynamic and aero-thermal performance, controllability and robustness for a wide operational envelope, (2) the system attributes and subsystems required to be effective in relevant operational environments, and (3) approaches to reducing cost and improving affordability for both the demonstration system and future operational systems.  TBG capabilities are planned for transition to the Air Force and the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.200"
                                            },
                                            "Text": {
                                                "val": "-  Completed operational analysis of the Phase I performer TBG operational systems.\n-  Completed baseline operational analysis of evolved Government Reference Vehicle (GRV).\n-  Selected TBG demonstration test range.\n-  Completed Phase I aerodynamic and aerothermal concept testing.\n-  Completed first generation aero databases.\n-  Continued risk reduction testing.\n-  Developed initial flight test plan.\n-  Updated Technology Maturation Plans (TMPs) and Risk Management Plans (RMPs).\n-  Completed Preliminary Design Reviews (PDR).\n-  Completed initial range safety documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.800"
                                            },
                                            "Text": {
                                                "val": "-  Conduct All-Up Round (AUR) aerodynamic and aerothermodynamic testing.\n-  Conduct glider aerodynamic and aerothermodynamic testing.\n-  Conduct material arcjet testing.\n-  Complete second generation aero databases.\n-  Prepare for Critical Design Review (CDR).\n-  Begin procurement of hardware for demonstration vehicles.\n-  Begin hardware in the loop (HWIL), software in the loop (SIL), and qualification testing.\n-  Continue detailed flight test and range safety planning, coordination, and documentation.\n-  Begin advanced operational analysis using GRV to assess new systems and technologies.\n-  Update TMPs and RMPs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.600"
                                            },
                                            "Text": {
                                                "val": "-  Complete Critical Design Review.\n-  Conduct aeroshell thermo-structural testing.\n-  Conduct component aerothermal testing.\n-  Continue procurement of hardware for demonstration vehicles.\n-  Continue hardware in the loop (HWIL), software in the loop (SIL), and qualification testing.\n-  Begin Assembly, Integration, and Test (AI&T).\n-  Continue detailed flight test and range safety planning, coordination, and documentation.\n-  Update TMPs and RMPs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vertical Take-Off and Landing (VTOL) Technology Demonstrator"
                                    },
                                    "Description": {
                                        "val": "The Vertical Take-Off and Landing (VTOL) Technology Demonstrator program will demonstrate revolutionary improvements in (heavier than air) VTOL air vehicle capabilities and efficiencies through the development of subsystem and component technologies, aircraft configurations and system integration.  The program will build and flight test an unmanned 10,000 - 12,000 lb. aircraft capable of sustained speeds in excess of 300 kt, demonstrate system level hover efficiency within 25 percent of the ideal power loading, and a lift-to-equivalent drag ratio no less than ten.  Additionally, the demonstrator will be designed to have a useful load of no less than 40 percent of the gross weight with a payload capacity of at least 12.5 percent of the gross weight.  A strong emphasis will be placed on the development of elegant, multi-functional subsystem technologies that demonstrate net improvements in aircraft efficiencies to enable new and vastly improved operational capabilities.  Technologies developed under this program will be made available to all Services for application to future air systems development.  The anticipated transition partners for this effort are the Army, Marine Corps, and Special Operations Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "58.800"
                                            },
                                            "Text": {
                                                "val": "-  Flight tested and analyzed data from a sub-scale vehicle demonstrator (~330 lb.) through the hover testing phase.\n-  Continued preliminary design refinements leading toward detailed design of the demonstrator aircraft and associated subsystems.\n-  Completed preliminary design reviews of air-vehicle configuration and all major subsystems.\n-  Initiated aircraft software architecture, mission systems, and flight control law development and simulation.\n-  Developed detailed airworthiness and flight test preparation requirements in support of the full-scale technology demonstrator.\n-  Initiated aircraft assembly and manufacturing processes to include tooling design and fabrication.\n-  Initiated procurement of key long-lead items for aircraft fabrication.\n-  Continued refinements and development of the sub-scale vehicle demonstrator's aerodynamic model database for transition to forward flight.\n-  Completed detail design of the power generation system to include necessary power electronics and control features. Initiated generator fabrication."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete forward flight testing of the Subscale Vehicle Demonstrator.\n-  Continue to refine and finalize air vehicle systems design, perform subsystem critical design reviews, initiate systems fabrication.\n-  Perform subsystem testing to support component performance validation efforts.\n-  Complete testing of aircraft propulsion power generator system to verify electro-mechanical system functionality.\n-  Complete subsystem testing of power generation and distribution system (Iron Bird) to include the turboshaft engine, driveshaft, gearbox, generators, electric power distribution, and electric motor functionality.\n-  Initiate hardware\/software-in-the-loop testing.\n-  Complete vehicle management system development and avionics requirements, as well as all elements of ground control and operator\/pilot stations.\n-  Select test site(s) that can accommodate full-scale hover and transition flight, and finalize flight test plans.\n-  Initiate fabrication and assembly of the full, complete aircraft with integrated systems and subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.700"
                                            },
                                            "Text": {
                                                "val": "-  Complete fabrication and assembly of the full, complete aircraft with integrated systems and subsystems.\n-  Complete all air-worthiness considerations and required documentation.\n-  Complete ground and tie-down testing.\n-  Disassemble aircraft and ship to flight test location.\n-  Initiate flight testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aerospace System Concepts"
                                    },
                                    "Description": {
                                        "val": "Studies conducted under this program examine and evaluate emerging aerospace technologies and system concepts for applicability to military use.  This includes the degree and scope of potential impact and improvements to military operations, mission utility, and warfighter capability.  Studies are also conducted to analyze emerging aerospace threats along with possible methods and technologies to counter them.  The feasibility of achieving potential improvements, in terms of resources, schedule, and technological risk, is also evaluated.  The results from these studies are used, in part, to formulate future programs or refocus ongoing work.  Topics of consideration include: methods of defeating enemy anti-aircraft attacks; munition technologies to increase precision, range, endurance, and lethality of weapons for a variety of mission sets; novel launch systems; air vehicle control, power, propulsion, materials, and architectures; and payload and cargo handling systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed feasibility experiments of candidate technologies and system concepts.\n-  Conducted trade studies and modeling and simulation for novel technologies.\n-  Conducted proof of concept demonstrations utilizing low-cost UAVs for long endurance as well as collaborative operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate concepts of operation for enabling technology and sub-system feasibility experiments.\n-  Research sub-system performance and conduct sub-system risk reduction testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct enabling technology and sub-system feasibility experiments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Full Range Engine (AFRE)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Full Range Engine (AFRE) program will establish the feasibility of hypersonic aircraft propulsion through a two-pronged approach.  AFRE will demonstrate turbine to Dual Mode Ramjet (DMRJ) transition of a Turbine-Based Combined Cycle (TBCC) propulsion system utilizing an off-the-shelf turbine engine.  Large scale components of this complex propulsion system will be developed and demonstrated independently, followed by a full-scale freejet TBCC propulsion system mode transition ground test.  Accomplishing these objectives will enable future hypersonic systems resulting in transformational changes in long range strike, high speed Intelligence, Surveillance and Reconnaissance (ISR) and Two-Stage-To-Orbit (TSTO) operations.  The anticipated transition partner for this effort is the Air Force."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct test facility startup assessment.\n-  Complete vehicle conceptual design and define TBCC ground demonstration engine performance requirements.\n-  Begin preliminary design of the TBCC ground demonstration propulsion system, and develop ground test and associated technology development plans.\n-  Initiate large scale common inlet design.\n-  Design and initiate fabrication of full-scale combustor.\n-  Initiate full-scale common nozzle design.\n-  Initiate integrated TBCC propulsion controls development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete fabrication and initiate testing of large-scale common inlet.\n-  Complete fabrication and initiate testing of full-scale combustor.\n-  Complete fabrication of full-scale nozzle.\n-  Initiate assembly and integration of off-the-shelf turbine with full-scale nozzle.\n-  Complete integrated propulsion controls architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Reconfigurable Embedded System (ARES)"
                                    },
                                    "Description": {
                                        "val": "Current and future land and ship-to-shore operations will require rapid and distributed employment of U.S. forces on the battlefield.  The Aerial Reconfigurable Embedded System (ARES) program will develop a vertical take-off and landing (VTOL), modular unmanned air vehicle that can carry a 3,000 lb. useful load at a range of 250 nautical miles on a single tank of fuel.  ARES will enable distributed operations and access to compact, high altitude landing zones to reduce warfighter exposure to hostile threats and bypass ground obstructions.  ARES modular capability allows for mission modules to be quickly interchanged and deployed at the company level.  This enables the flexible employment of many different capabilities including: cargo resupply, casualty evacuation, reconnaissance, weapons platforms, and other types of operations.  ARES vehicles could be dispatched to resupply isolated small units.  ARES is well suited for enhanced company operations concepts that would provide the warfighter\/team increased situational awareness for operations in an urban environment.  The enabling technologies of interest developed under the ARES program includes vertical and translational flight, conversion between powered lift and wing borne lift, ducted fan propulsion systems, lightweight materials, tailless configuration, modularity, and advanced over-actuated flight controls for stable transition from vertical to horizontal flight.  Additionally, the program will explore opportunities for the design, development, and integration of new, key technologies and capabilities.  These include adaptable landing gear concepts to enable operations from irregular landing zones and moving launch\/recovery platforms, and autonomous take off and landing.  The anticipated transition partners for this effort are the Army, Marine Corps, and Special Operations Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Redesigned and fabricated revised swashplate and prop-rotor control system.\n-  Completed dynamic testing of drive train and rotor controls."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete air vehicle integration.\n-  Perform full system hardware in the loop tests.\n-  Support flight release development and approval process.\n-  Perform ground tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology for Enriching and Augmenting Manned - Unmanned Systems"
                                    },
                                    "Description": {
                                        "val": "The Technology for Enriching and Augmenting Manned - Aircraft (TEAM-US) project sought to increase lethality, survivability, payload, and reach of combat aircraft by: (i) teaming them (wingmen) with advanced Unmanned Aerial Vehicles (UAVs), and (ii) enabling swarming employment and operations of manned and unmanned airborne systems.  Balancing in situ battle management with highly capable, mission specific unmanned teammates would offset new threat technologies, enable more cost effective mission execution, and increase the survivability of the manned platform team leader."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.330"
                                            },
                                            "Text": {
                                                "val": "-  Performed operational analysis and technology maturity assessments to determine the minimum set of critical platform attributes and technology advances required of an unmanned teammate.\n-  Investigated technology development and system attributes that matched short-term and long-term goals with specific technology solutions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}