{
    "id": "2018-Navy-PB-1319-JBOOK-7c1f5721a78c701930fe0b135d5a2c8e9035a06c3349419fd1ce0594386dd4aa-32",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA5-U_RDTE_JustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604518N"
        },
        "ProgramElementTitle": {
            "val": "Combat Information Center Conv"
        },
        "R1LineNumber": {
            "val": "128"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "49.280"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "6.283"
            },
            "BudgetYearOne": {
                "val": "8.062"
            },
            "BudgetYearOneBase": {
                "val": "8.062"
            },
            "BudgetYearTwo": {
                "val": "8.260"
            },
            "BudgetYearThree": {
                "val": "8.564"
            },
            "BudgetYearFour": {
                "val": "5.466"
            },
            "BudgetYearFive": {
                "val": "5.508"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Note: Prior year Undersea Warfare Decision Support System (USW-DSS) funding ended in FY 2013. This budget represents the restoral of USW-DSS development efforts, re-starting in FY 2017, for the modernization of Program of Record (PoR) Anti-Submarine Warfare (ASW) and Command, Control, Communications and Computer (C4) systems. Upgrades are required to address Cyber Security and End of Life (EOL) issues, improve capability and system interoperability, and implement Theater ASW (TASW).  \n\nUSW-DSS provides the integrated, near-real time, net-centric ASW Common Tactical Picture (CTP) \/ Common Operational Picture (COP) on an electronic Master Tactical Plot (eMTP) capability across multiple surface platforms and critical shore sites. USW-DSS is a C4 capability, identified in the ASW Initial Capabilities Document (ICD), for the Sea Combat, Theater USW (TUSW), and ASW Commanders, and enables the planning and conduct of USW operations, alignment of sensors for exploitation of the environment, allocation of resources, optimization of operations and risk, and vulnerability assessment. USW-DSS provides USW Commanders with an expanded, net-centric USW capability across Carrier Strike Group (CSG) platforms (CVNs, CG\/DDGs, and Integrated Undersea Surveillance System (IUSS)) as well as supporting shore nodes to include Theater Surface Combatants (TSC), Training, Naval Oceanographic Processing Facility (NOPF), and Commander Task Force (CTF).\n\nUSW-DSS processing software is hosted on the Consolidated Afloat Networks and Enterprise Services (CANES) and implements a Service-Oriented Architecture (SOA). USW-DSS capability is phased to deliver timely and cost-effective software improvements to the warfighter. The current software version, Build 2 Release 3, will continue to field until the follow-on Build 3 is ready for Initial Operational Capability (IOC) certification in FY 2020."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "6.283"
                },
                "BudgetYearOne": {
                    "val": "7.002"
                },
                "BudgetYearOneBase": {
                    "val": "7.002"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "6.283"
                },
                "BudgetYearOne": {
                    "val": "8.062"
                },
                "BudgetYearOneBase": {
                    "val": "8.062"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.060"
                },
                "BudgetYearOneBase": {
                    "val": "1.060"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.100"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.100"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.040"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.040"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: \nFY 2018: Net increase by $+1.060M to begin the integration of high-level fusion and other technologies\/capabilities and implementation of cyber security and boundary defense requirements in support of TASW ($+1.100M) offset by decreases ($-0.040M) for Naval Innovative Science & Engineering (NISE)\/Section 219 and NWCF rate adjustments. \n\nYEAR-TO-YEAR OVERALL BUDGET CONTROL INCREASES\/DECREASES:\n- FY 2017 to FY 2018 increase ($+1.779M) is required to accelerate the development and test of the cyber security requirements to implement the multi-level security that results from the new sensors from cross-domain systems (Distributed Common Ground System - Navy (DCGS-N)).\n\nSchedule Changes from PB17 to PB18: The nomenclature of USW-DSS builds has been changed.  Future builds, beyond the currently fielded Build 2\/Release 3 systems, will be categorized as Fleet Capability Releases (FCR). Build 3 became Build 3\/Fleet Capability Release 1. Build 4 became Build 3\/Fleet Capability Release 2. As the program has moved closer to execution, required efforts, events and time lines have been further evaluated and refined\/adjusted accordingly. This increased the design\/development phases and adjusted the start of the Integration\/Test and Certification Test events.\n\nAdditionally, integration and test events were delayed in order to accommodate the integration of new cyber security requirements, as directed for all Navy systems in FY16. These new cyber security requirements resulted in increased design and development costs in FY 2017 and FY 2018."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3094"
                    },
                    "ProjectTitle": {
                        "val": "USW Decision Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "49.280"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "6.283"
                        },
                        "BudgetYearOne": {
                            "val": "8.062"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.062"
                        },
                        "BudgetYearTwo": {
                            "val": "8.260"
                        },
                        "BudgetYearThree": {
                            "val": "8.564"
                        },
                        "BudgetYearFour": {
                            "val": "5.466"
                        },
                        "BudgetYearFive": {
                            "val": "5.508"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project 3094 develops USW-DSS to provide the integrated, near-real time, net-centric ASW CTP\/COP on an eMTP capability across multiple surface platforms and critical shore sites. USW-DSS is a C4 capability, identified in the ASW ICD, for the Sea Combat, TUSW, and ASW Commanders, and enables the ability to plan and conduct USW operations, alignment of sensors for exploitation of the environment, allocation of resources, optimization of operations and risk, and vulnerability assessment. USW-DSS provides USW Commanders with an expanded net-centric USW capability across CSG platforms (CVNs, CG\/DDGs, and IUSS) as well as supporting shore nodes to include TSCs, Training, NOPF, and CTF.\n\nUSW-DSS provides capabilities to shorten C2 decision processes for detection-to-engagement across multiple platforms, including those with low-bandwidth communications or intermittent connectivity.\n\nUSW-DSS software processing requirements are hosted on CANES and implement a SOA while display generation and operator interfaces are provided via USW-DSS hardware. Build 3 Fleet Capability Release (FCR) incremental developments will implement cost effective cyber security, TASW functionality by integrating data from data sources and platforms such as the P-8, provide improved and additional functionality, and improve stability\/reliability.  \n\nUSW-DSS will provide common and improved visualization, integrated USW platform sensor data sharing, reduced data entry, improved sensor performance predictions, data fusion, and reduced redundancy across USW Tactical Decision Aids (TDAs). The program will provide a greater understanding of the undersea battle space by allowing the entire force (carrier\/expeditionary strike group, theater, or other) to have a common and thorough understanding of the battle space with characterized uncertainties.\n\nThe Navy continues to modernize and add capabilities to existing PORs that are significant data sources for USW-DSS. These include, but not limited to, the AN\/SQQ-89 Surface ASW Combat System, the AN\/SQQ-34 Aircraft Carrier Tactical Support Center (CV-TSC), Global Command and Control System - Maritime (GCCS-M), and the Distributed Common Ground System - Navy (DCGS-N).\n\nUSW-DSS capability is phased to cost-effectively deliver software improvements to the warfighter. The current software version, Build 2 Release 3 (development completed in FY 2013), will continue to field until the follow-on Build 3\/FCR 1 is certified for Fleet deployment.\n\nWith the restoral of funding in FY 2017, USW-DSS will develop and test the software changes necessary to address EOL support that will impact Build 2 Release 3 and subsequently design, develop, integrate, and test additional USW-DSS tools\/capabilities into Build 3 including, but not limited to: CTP, Platform Data Fusion Integration, Cross-Platform Data Fusion, Automated Asset Allocation, Asset\/Threat State Information, Vulnerability Analysis enhancement, ASW Track Management, Automated Re-planning, Engagement Target Pairing, improved TASW capabilities, Data-Focused Navy Tactical Cloud Integration, and incorporate the eMTP visualization\/display service on which to render the CTP\/COP."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "USW-DSS Capability Improvements"
                                    },
                                    "Description": {
                                        "val": "Design, develop, integrate, and test additional USW-DSS tools\/capabilities for Build 3 including, but not limited to, CTP, Platform Data Fusion Integration, Cross-Platform Data Fusion, Automated Asset Allocation, Asset\/Threat State Information, Vulnerability Analysis enhancement, ASW Track Management, Automated Re-planning, Engagement Target Pairing, improved TUSW capabilities, Data-Focused Navy Tactical Cloud Integration, and incorporate the eMTP visualization\/display service."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Not Applicable"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.283"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Restore USW-DSS development and begin design\/development efforts for Build 3\/FCR 1. Build 2 Release 3 is the baseline for Build 3.  \n- Implement the SOA required for cyber security. \n- Design, develop, and integrate TASW capability into USW-DSS Build 3\/FCR 1. \n- Maintain critical existing data source interfaces with other ASW PORs such as AN\/SQQ-89, CV-TSC, and GCCS-M.\n- Initiate USW-DSS Build 3\/FCR 1 test planning efforts, including drafting Test & Evaluation Master Plan (TEMP) and test\/integration plans."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.062"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.062"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development efforts for Build 3\/FCR 1 and begin Build 3\/FCR 1 integration and testing activities.\n- Develop and test software updates to Build 2 Release 3 fielded systems required for USW-DSS to remain certified through EOL (prior to fielding of Build 3).\n- Accelerate and synchronize USW-DSS and DCGS-N and develop the interfaces to support the multi-level security for high-level fusion of new national sensors used for Wide-Area Search \/ Surveillance for TASW.\n- Complete interface specifications and draft Interface Control Drawings (ICDs) in preparation for prototype delivery Commander Task Force (CTF) 34 Theater ASW watch floor for Composite Training Unit Exercise (COMPTUEX) at-sea event scheduled for 3Q18. \n- In accordance with current cyber security Information Assurance (IA) directives, develop\/integrate updates to achieve certification of USW-DSS Build 3\/FCR 1."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2176"
                                    },
                                    "Title": {
                                        "val": "USW Support Equipment (N2N6\/USW-DSS only)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.867"
                                        },
                                        "CurrentYear": {
                                            "val": "4.463"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.784"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.784"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.519"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.201"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.181"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.164"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "- Hardware\/Software development and integration via Navy Warfare Centers and Small Business contractors."
                        },
                        "PerformanceMetrics": {
                            "val": "- Improve capability and system interoperability. \n- Achieve IOC for TASW capability."
                        }
                    }
                }
            ]
        }
    }
}