{
    "id": "2018-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-950a5746320338933f77ee67f04c39e5d4c40144f8c92626c879d6e287c1655c-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601101E"
        },
        "ProgramElementTitle": {
            "val": "DEFENSE RESEARCH SCIENCES"
        },
        "R1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "317.207"
            },
            "CurrentYear": {
                "val": "362.297"
            },
            "BudgetYearOne": {
                "val": "432.347"
            },
            "BudgetYearOneBase": {
                "val": "432.347"
            },
            "BudgetYearTwo": {
                "val": "410.178"
            },
            "BudgetYearThree": {
                "val": "405.698"
            },
            "BudgetYearFour": {
                "val": "395.466"
            },
            "BudgetYearFive": {
                "val": "412.498"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Research Sciences Program Element is budgeted in the Basic Research Budget Activity because it provides the technical foundation for long-term National Security enhancement through the discovery of new phenomena and the exploration of the potential of such phenomena for Defense applications.  It supports the scientific study and experimentation that is the basis for more advanced knowledge and understanding in information, electronic, mathematical, computer, biological and materials sciences.\n\n     The Bio\/Info\/Micro Sciences project investigated and developed the intersections of biology, information technology and micro\/physical systems to exploit important technological advances and leverage fundamental discoveries for the development of new technologies, techniques, and systems of interest to the DoD. This research is critical to the development of improved training and cognitive rehabilitation. Programs in this project drew upon the information and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels. This project developed the basic research tools in biology that are unique to the application of biological-based solutions to critical Defense problems.\n\n     The Math and Computer Sciences project supports scientific study and experimentation on new computational algorithms, models, and mechanisms in support of long-term national security requirements. The project is exploring novel means of leveraging computer capabilities, including: practical, logical, heuristic, and automated reasoning by machines; enhanced human-to-computer and computer-to-computer interaction technologies; innovative approaches to the composition of software; innovative computer architectures; mathematical programs and their potential for defense applications; and new learning mechanisms for systematically upgrading and improving these capabilities. Promising techniques will transition to both technology development and system-level projects.\n\n      The Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cyber security. Information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness. Meanwhile, cyber threats grow in sophistication and number, and put sensitive data, classified computer programs, and mission-critical information systems at risk. The basic research conducted under the Cyber Sciences project will produce breakthroughs necessary to enhance the resilience of DoD information systems to current and emerging cyber threats. Promising research results will be transitioned to both technology development and system-level projects.\n\n     The Electronic Sciences project is for basic exploration of electronic and optoelectronic devices, circuits, and processing concepts to meet the military's need for near real-time information gathering, transmission, and processing. In seeking to continue the phenomenal progress in microelectronics innovation that has characterized the last few decades, the project should provide DoD with new, improved, or potentially revolutionary device options for accomplishing these critical functions. The resulting technologies should help maintain knowledge of the enemy, communicate decisions based on that knowledge, and substantially improve the cost and performance of military systems. The Beyond Scaling programs in this project will support investigations into materials, devices, and architectures to provide continued improvements in electronics performance with or without the benefit of Moore's Law (silicon scaling). Within the next ten years, traditional scaling will start to encounter the fundamental physical limits of silicon, requiring fresh approaches to new electronic systems. \n\n     The Materials Sciences project provides the fundamental research that underpins the design, development, assembly, and optimization of advanced materials, devices, and systems for DoD applications in areas such as robust diagnostics and therapeutics, novel energetic materials, and complex hybrid systems.\n\n     The Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in computing and the computing-reliant subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "333.119"
                },
                "CurrentYear": {
                    "val": "362.297"
                },
                "BudgetYearOne": {
                    "val": "361.151"
                },
                "BudgetYearOneBase": {
                    "val": "361.151"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "317.207"
                },
                "CurrentYear": {
                    "val": "362.297"
                },
                "BudgetYearOne": {
                    "val": "432.347"
                },
                "BudgetYearOneBase": {
                    "val": "432.347"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-15.912"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "71.196"
                },
                "BudgetYearOneBase": {
                    "val": "71.196"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-5.304"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-10.608"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "71.196"
                                },
                                "BudgetYearOneBase": {
                                    "val": "71.196"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  Decrease reflects reprogrammings and the SBIR\/STTR transfer.\nFY 2017:  N\/A\nFY 2018:  Increase reflects expanded focus in Math and Computer sciences, Cyber, Electronics (including Beyond Scaling programs), Materials and Transformative sciences."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BLS-01"
                    },
                    "ProjectTitle": {
                        "val": "BIO\/INFO\/MICRO SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigated and developed the intersections of biology, information technology and micro\/physical systems to exploit important technological advances and leverage fundamental discoveries for the development of new technologies, techniques, and systems of interest to the DoD.  This research is critical to the development of improved training and cognitive rehabilitation.  Programs in this project drew upon the information and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  This project developed the basic research tools in biology that are unique to the application of biological-based solutions to critical Defense problems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Quantitative Models of the Brain"
                                    },
                                    "Description": {
                                        "val": "The Quantitative Models of the Brain program established a functional mathematical basis on which to build future advances in cognitive neuroscience, computing capability, and signal processing across the DoD.  An important focus of this program was determining how information is stored and recalled in the brain and other DoD-relevant signals, developing predictive, quantitative models of learning, memory, and measurement.  Using this understanding, the program developed powerful new symbolic computational capabilities for the DoD in a mathematical system that has provided the ability to understand complex and evolving signals and tasks while decreasing software and hardware requirements and other measurement resources.  This included a comprehensive mathematical theory to extract and leverage information in signals at multiple acquisition levels that would fundamentally generalize compressive sensing for multi-dimensional sources beyond domains typically used.  New insights related to signal priors, task priors, and adaptation have enabled these advances.  This program further exploited advances in the understanding and modeling of brain activity and organization to improve training of individuals as well as identify new therapies for cognitive rehabilitation (e.g., Traumatic Brain Injury (TBI), Post Traumatic Stress Disorder (PTSD)).  Critical to success was the ability to detect cellular and network-level changes produced in the brain during the formation of new, hierarchically organized memories and memory classes, and to correlate those changes with memory function of animals during performance of behavioral tasks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Built hippocampal-neocortical model of stimulation-based memory enhancement.\n-  Developed and applied a new set of classification models for the prediction of behavioral outcomes from the spatio-temporal patterns of electrophysiological recordings in the hippocampus.\n-  Developed initial computational model of integrated neural, physiological, and environmental effects in neural replay, skill acquisition, and subsequent memory recall."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCS-02"
                    },
                    "ProjectTitle": {
                        "val": "MATH AND COMPUTER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "142.533"
                        },
                        "CurrentYear": {
                            "val": "149.065"
                        },
                        "BudgetYearOne": {
                            "val": "169.069"
                        },
                        "BudgetYearOneBase": {
                            "val": "169.069"
                        },
                        "BudgetYearTwo": {
                            "val": "186.160"
                        },
                        "BudgetYearThree": {
                            "val": "185.643"
                        },
                        "BudgetYearFour": {
                            "val": "180.196"
                        },
                        "BudgetYearFive": {
                            "val": "186.536"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Math and Computer Sciences project supports scientific study and experimentation on new computational algorithms, models, and mechanisms in support of long-term national security requirements.  The project is exploring novel means of leveraging computer capabilities, including: practical, logical, heuristic, and automated reasoning by machines; enhanced human-to-computer and computer-to-computer interaction technologies; innovative approaches to the composition of software; innovative computer architectures; mathematical programs and their potential for defense applications; and new learning mechanisms for systematically upgrading and improving these capabilities.  Promising techniques will transition to both technology development and system-level projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Building Resource Adaptive Software from Specifications (BRASS)"
                                    },
                                    "Description": {
                                        "val": "The Building Resource Adaptive Software from Specifications (BRASS) program is developing an automated framework that permits software systems to seamlessly adapt to changing resource conditions in an evolving operational environment.  Effective adaptation is realized through rigorously defined specifications that capture application resource assumptions and resource guarantees made by the environment.  The current manual adaptation process is based on corrective patching, which is time-consuming, error-prone and expensive.  Predicting the myriad of possible environment changes that an application may encounter in its lifetime is problematic and existing reactive approaches are brittle and often incorrect.  The use of specification-based adaptation will allow BRASS applications to be correctly restructured in real time whenever stated assumptions or guarantees are broken.  This restructuring is optimized to trade off execution fidelity and functionality for continued operation.  BRASS will create tools to automatically discover and monitor resource changes, build new analyses to infer deep resource-based specifications, and implement compiler and runtime transformations that can efficiently adapt to resource changes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.343"
                                            },
                                            "Text": {
                                                "val": "-  Initiated the integration of specifications within an operational environment to monitor resource changes and trigger signals when resource invariants are violated.\n-  Formulated compile-time and runtime transformations that ensure survivable operation in the face of unexpected environment changes.\n-  Designed validation tools that certify that transformed applications satisfy specification assumptions in the context of new operating environment guarantees.\n-  Developed platform-specific challenge problems from military domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.419"
                                            },
                                            "Text": {
                                                "val": "-  Develop new forms of resource-sensitive specifications capable of defining complex resource changes involving both physical and logical resources.\n-  Build compiler and runtime infrastructure that are sensitive to ecosystem evolution.\n-  Incorporate monitoring tools capable of runtime verification of adaptive program transformations without incurring significant execution overhead.\n-  Evaluate the effectiveness of the developed systems in collaboration with potential transition partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.450"
                                            },
                                            "Text": {
                                                "val": "-  Integrate formal methods techniques to verify correctness of adaptive transformations.\n-  Develop real-time capabilities for dynamically updating software systems in response to ecosystem changes.\n-  Implement program synthesis tools that automatically generate new programs functionally in response to underlying resource changes, while maintaining important system invariants.\n-  Design continuous testing frameworks capable of identifying salient resource changes and automatically generating specifications based on test observations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Young Faculty Award (YFA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Young Faculty Award (YFA) program is to encourage junior faculty at universities and their equivalent at non-profit science and technology research institutions to participate in sponsored research programs that will augment capabilities for future defense systems.  This program focuses on cutting-edge technologies for greatly enhancing microsystems technologies, biological technologies and defense sciences.  The long-term goal for this program is to develop the next generation of scientists, engineers and mathematicians in key disciplines who will focus a significant portion of their careers on DoD and national security issues.  The aim is for YFA recipients to receive deep interactions with DARPA program managers, programs, performers and the user community.  Current activities include research in fifteen topic areas spanning from Machine Learning and Many Body Physics to Wideband Transmitter-Antenna Interfaces and Multi-Scale Models of Infectious Disease Dynamics.  A key aspect of the YFA program is DARPA-sponsored military visits; all YFA Principal Investigators are expected to participate in one or more military site visits to help them better understand DoD needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.440"
                                            },
                                            "Text": {
                                                "val": "-  Awarded new FY 2016 grants for new two-year research efforts across the topic areas which established a new set of appropriate technologies to solve current DoD problems.\n-  Continued FY 2015 research on new concepts for microsystem technologies, biological technologies and defense sciences by exercising second year funding and by providing continued mentorship by program managers.\n-  Awarded Director's Fellowships for top FY 2014 participants.  During this additional year of funding, researchers will refine their technology further and align to DoD needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Award new FY 2017 grants for new two-year research efforts across the topic areas, establishing a new set of appropriate technologies to solve current DoD problems.\n-  Continue FY 2016 research on new concepts for microsystem technologies, biological technologies and defense sciences by exercising second year funding and by providing continued mentorship by program managers.\n-  Award Director's Fellowships for top FY 2015 participants.  During this additional year of funding, researchers will refine their technology further and align to DoD needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Award new FY 2018 grants for new two-year research efforts across the topic areas which established a new set of appropriate technologies to solve current DoD problems.\n-  Continue FY 2017 research on new concepts for microsystem technologies, biological technologies and defense sciences by exercising second year funding and by providing continued mentorship by program managers.\n-  Award Director's Fellowships for top FY 2016 participants.  During this additional year of funding, researchers will refine their technology further and align to DoD needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Social Systems"
                                    },
                                    "Description": {
                                        "val": "The social sciences provide essential theories and models that can enable deeper understanding of human social systems and behaviors relevant to national security such as humanitarian aid, disaster relief, and stability support missions, as well as tactical, operational, strategic, and policy-level decision-making across the DoD. However, current limitations to the speed, scalability and reproducibility of empirical social science research continue to hamper its practical use by the DoD. One focus area of the Social Systems thrust is to develop and validate new methods, models and tools to perform rigorous, reproducible experimental research at scales necessary to understand emergent properties of human social systems. Another focus area is to identify methods to better characterize and quantify properties, dynamics and behaviors of different social systems to enable better and more confident forecasting of changes in social systems, particularly when under stress. This research thrust will provide DoD with new, reliable strategies to better understand and respond to social system issues at city scale. This thrust is an aggregation of programs previously contained in Knowledge Representation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Began to explore novel experimental approaches for repeatable and replicable testing of social simulation representation and modeling tools for understanding social behavioral outcomes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.640"
                                            },
                                            "Text": {
                                                "val": "-  Develop new methods and tools to enhance the reproducibility of experimental results to accelerate discovery in research and modeling of human social behaviors. \n-  Demonstrate the utility of new networked data collection, mathematical, and computational modeling tools for representing complex social interactions. \n-  Begin to initiate the development of new simulation and computational modeling tools for representing complex social interactions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.400"
                                            },
                                            "Text": {
                                                "val": "-  Develop new capabilities for experimentally testing and validating multiple models of human social systems and behaviors. \n-  Demonstrate the applicability of newly developed representation and modeling tools for understanding potential social behavioral outcomes. \n-  Test newly developed representation and modeling tools to determine applicability for understanding social behavioral outcomes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communicating With Computers (CWC)"
                                    },
                                    "Description": {
                                        "val": "The Communicating With Computers (CWC) program is advancing the state-of-the-art in human-computer interaction by enabling computers to comprehend language, gesture, facial expression and other communicative modalities in context.  Human language is inherently ambiguous and so humans depend strongly on perception of the physical world and context to make language comprehensible.  CWC aims to provide computers with analogous capabilities to sense the physical world, encode the physical world in a perceptual structure and link language to this perceptual encoding.  To accomplish this, CWC will apply and extend research in language, vision, gesture recognition and interpretation, dialog management, cognitive linguistics and the psychology of visual encoding which are essential for human communication in the physical world.  CWC will also work to extend the communication techniques developed for physical contexts to nonphysical contexts such as virtual constructs in the cyber domain.  CWC advances will impact military application areas such as robotics and command and control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.576"
                                            },
                                            "Text": {
                                                "val": "-  Explored methods for determining whether transmitted communications have been successfully received, and if not, what additional communications would most likely result in success.\n-  Implemented initial representations for the physical world and developed first versions of connectors to large-scale knowledge bases to enable visual-language synergies.\n-  Began construction of a universal corpus of elementary composable ideas that in combination can convey the meaning of most communications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.213"
                                            },
                                            "Text": {
                                                "val": "-  Develop a capability to enable computer inputs using gesture, facial expression and other communicative modalities.\n-  Implement initial techniques for confirming that communications have been successfully received and extrapolate potentially missing information.\n-  Demonstrate human-machine communication and collaboration on a physical problem solving task."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.966"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.966"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate human-machine communication on a problem solving task in which humans and machines collaborate to explain how gene and protein interactions cause phenotypic effects.\n-  Demonstrate learning of communication principles and evaluate through the biocuration use case.\n-  Demonstrate that increased cognitive bandwidth of communication enables machines to be full collaborators with humans, not merely tools, in solving problems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mining and Understanding Software Enclaves (MUSE)"
                                    },
                                    "Description": {
                                        "val": "The Mining and Understanding Software Enclaves (MUSE) program is developing program analyses and frameworks for improving the resilience and reliability of complex software applications at scale.  MUSE techniques will apply machine learning algorithms to large software corpora to repair defects and vulnerabilities in existing software and to create new software programs that conform to desired behaviors and specifications.  MUSE frameworks will enable robust execution of large-scale and data-intensive computations.  Specific technical challenges include generation and analysis of persistent semantic artifacts, identification and repair of defects, and inference and synthesis of specifications.  MUSE research will improve the security of intelligence-related applications and enhance computational capabilities in areas such as automated code maintenance and revision management, low-level systems implementation, graph processing, entity extraction, link analysis, high-dimensional data analysis, data\/event correlation and visualization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.069"
                                            },
                                            "Text": {
                                                "val": "-  Implemented scalable mining algorithms that allow the ingestion and analysis of tens of millions of lines of open-source software.\n-  Integrated machine learning algorithms that direct and assimilate mining activities on analysis artifacts.\n-  Evaluated component-level synthesis techniques to build implementations for complex self-contained algorithms.\n-  Demonstrated the effectiveness of the developed systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Extend the size of the ingested corpus by orders of magnitude to deal with increasingly more complex program repair and synthesis tasks.\n-  Apply deep learning algorithms on complex graph structures produced by corpus mining to discover latent relationships among corpus elements.\n-  Exploit techniques such as program sketching, user-guided feedback, and specification-driven analysis to automatically construct implementations of complex protocols from discovered specifications.\n-  Evaluate the effectiveness of the developed systems in collaboration with potential transition partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop statistical database technologies for scalable feature exploration and mining of the corpus.\n-  Apply machine learning concepts to predict, repair, and synthesize program properties and structures from purely black-box observations.\n-  Explore the use of both static and dynamic program analyses to discover software anomalies and prescribe program repair recipes.\n-  Use natural language processing techniques to discover semantic properties of code from information sources such as developer documentation, message boards, tutorial material, question-and-answer forums, and blog entries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Tools for Modeling and Simulation"
                                    },
                                    "Description": {
                                        "val": "The Advanced Tools for Modeling and Simulation thrust will develop foundational mathematical and computational theories, approaches and tools to better represent, quantify and model complex DoD systems from multimodal data analysis through part\/system design and fabrication.  One focus area of this thrust is developing a unified mathematical framework to enable better visualization and analysis of massive, complex data sets.  Rigorous mathematical theories are also being developed to address uncertainty in the modeling and design of complex multi-scale physical and engineering systems, incorporating capabilities to handle noisy data and model uncertainty that are well beyond the scope of current capabilities.  Other work in this thrust focuses on developing the mathematical and computational tools required to generate and better manage the enormous complexity of design, ultimately allowing designers to more easily discover non-intuitive (yet realizable) designs that fully leverage new materials and advanced manufacturing approaches now available.  Outcomes from this thrust will improve the speed and accuracy of modeling and simulation, as well as enable management of complexity across DoD devices, parts and systems.  This thrust is an aggregation of programs previously contained in Quantifying Uncertainty in Physical Systems and Knowledge Representation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.678"
                                            },
                                            "Text": {
                                                "val": "-  Began to explore novel mathematical representations that can accommodate the possibilities of new materials for enabling simultaneous design exploration and optimization. \n-  Began to explore novel interfaces for computational design tools that incorporate material structures and physics to enable simultaneous design exploration and optimization under uncertainty. \n-  Began to develop a quantitative framework for analyzing and optimizing human interactions with engineered components in collaborative networks consisting of human-machine systems and systems-of-systems. \n-  Initiated development of novel computational frameworks for modeling non-linear effects in complex systems.  \n-  Designed an open source, benchmarking framework for modeling non-linear effects in complex systems across multiple scales."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.376"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the use of novel representations spanning multiple orders of resolution to capture material architectures at the meso-scale in conjunction with macro-scale shapes.  \n-  Develop techniques to enable efficient computation of integral and differential properties in designs that consider inherent variability.   \n-  Demonstrate the feasibility to exploit the computing capacity offered by nonlinear systems to simulate nonlinear dynamical systems.   \n-  Start to develop analog computing substrates for efficiently simulating systems governed by complex non-linear phenomena.  \n-  Formulate mathematical frameworks to articulate and analyze general machine learning problems and associated limits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Explore techniques to extract promising designs from a vast multi-dimensional design space.   \n-  Demonstrate novel mathematical and computation tools that integrate geometry with materials, including micro-structure architectures, to accelerate design exploration and optimization subject to a single physics.   \n-  Explore alternative representations to describe design problem formulation.   \n-  Begin to construct integrated testbeds with novel hybrid analog and digital computational architectures for simulating complex, non-linear systems.  \n-  Develop machine learning and computational techniques based on topological methods and spectral analysis for identifying and tracking non-equilibrium behavior.  \n-  Analyze limits for several current machine-learning problems and assess the performance of state-of-the-art approaches with respect to these limits. \n-  Propose new methods or principles to guide development of systems based on machine learning."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantifying Uncertainty in Physical Systems"
                                    },
                                    "Description": {
                                        "val": "The Quantifying Uncertainty in Physical Systems thrust will create the basic mathematics needed to efficiently quantify, propagate and manage multiple sources of (parametric and model) uncertainty to make accurate predictions about and also design stochastic, complex DoD systems. In particular, this will include new approaches for scaling Uncertainty Quantification (UQ) methods to multiscale\/multiphysics DoD systems; techniques for correcting model-form uncertainty and for understanding rare events; and new methods for decision making, control, and design under uncertain conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.380"
                                            },
                                            "Text": {
                                                "val": "-  Developed scalable approximation methods with provable error bounds for optimization in the presence of high dimensional uncertain parameters.  \n-  Developed scalable Bayesian inference algorithms for inverse methods with orders of magnitude speed-up incorporating the known physical properties of DoD systems.  \n-  Derived proofs and theoretical treatment of rare event detection algorithms within risk-based optimization framework."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop new mathematical design techniques for high dimensional, multi-physics problems in the presence of high-dimensional uncertainty.  \n-  Initiate design work on a specific DoD multi-fidelity and multi-physics challenge problem.   \n-  Develop new multi-fidelity techniques for model error estimation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop risk-averse stochastic optimization methods to address a complex multi-physics challenge problem and implement the scalable UQ methods as well as the model error estimates in the optimization framework.  \n-  Demonstrate the efficacy of UQ methodologies in a final stochastic design problem."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Big Mechanism"
                                    },
                                    "Description": {
                                        "val": "The Big Mechanism program is creating new approaches to automated computational intelligence applicable to diverse domains such as biology, cyber, economics, social science, and intelligence.  Mastering these domains requires the capability to create abstract yet predictive, ideally causal, models from massive volumes of diverse data generated by human actors, physical sensors and networked devices.  Current modeling approaches are heavily reliant on human insight and expertise, but the complexity of these models is growing exponentially and has now, or will soon, exceed the capacity for human comprehension.  Big Mechanism will create technologies to extract and normalize information for incorporation in flexible knowledge bases readily adapted to novel problem scenarios; powerful reasoning engines that can infer general rules from a collection of observations, apply general rules to specific instances, and generate (and compute the likelihood of) the most plausible explanations for a sequence of events; and knowledge synthesis techniques to derive abstract principles and\/or create models of extreme complexity consistent with huge volumes of data.  Big Mechanism applications will accommodate an operator-in-the-loop by accepting questions posed in human natural language, providing drill-down to reveal the basis for an answer, taking user inputs to improve\/correct derived associations, weightings and conclusions, and querying the operator to clarify ambiguities and reconcile detected inconsistencies.  Big Mechanism techniques will integrate burgeoning data into causal models and explore these models for precise interventions.  The program has adopted cancer modeling as an initial focus because the availability of experimental data and the complexity of the problems are representative of challenges facing the DoD in areas such as cyber attribution and open-source intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.494"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated automated reading of technical literature to extract information and construct models.\n-  Automated testing of machine-generated hypotheses.\n-  Created new modes for visualizing and exploring models of huge scope that in their entirety exceed human cognitive capabilities.\n-  Demonstrated prototype technologies in production mode by identifying drug targets and drugs for specific classes of cancer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.116"
                                            },
                                            "Text": {
                                                "val": "-  Create interfaces and tools to support a web-based resource of machine-curated cancer pathways.\n-  Create utilities to add genomic information to machine-curated cancer pathways.\n-  Publish a high-fidelity simulation of the Ras cancer pathway."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.353"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.353"
                                            },
                                            "Text": {
                                                "val": "-  Apply techniques to other cancer classes and extend techniques to additional problem domains. \n-  Develop and implement scalable algorithms that reveal causality networks in large, complex, heterogeneous datasets. \n-  Develop empirical algorithms for early indications and\/or tracking of medical conditions such as neurological impairment, musculoskeletal injury, and cardio-vascular issues."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Knowledge Representation"
                                    },
                                    "Description": {
                                        "val": "The Knowledge Representation thrust will develop much-needed tools to contextualize and analyze heterogeneous scientific data, facilitating field-wide hypothesis generation and testing. This will be accomplished by focusing on two key efforts: (1) the development of domain-agnostic mathematical tools for representing heterogeneous data and (2) the development of domain knowledge in a unified knowledge framework and domain-specific computational tools to embed observable data within the framework and enable tangible discoveries through computational analysis. To demonstrate the applicability of Knowledge Representation technology to multiple complex systems, the thrust will include validation across multiple disparate scientific and engineering fields. The technology developed under this thrust will revolutionize the process of scientific discovery by efficiently maximizing the potential of large, heterogeneous, multi-scale datasets across numerous complex scientific fields."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.545"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated data input and information extraction within the previously developed mathematical knowledge framework. \n-  Incorporated domain-specific prior knowledge, such as computational models, into the mathematical knowledge framework. \n-  Demonstrated the integration of datasets and prior domain knowledge in one or more scientific and engineering use cases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.784"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate hypothesis generation and steering using newly developed knowledge representation tools on one or more scientific and engineering use cases. \n-  Analyze and optimize knowledge representation system performance in terms of scalability for inference and knowledge ingestion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and test mathematical tools for hypothesis generation testing and model validation. \n-  Demonstrate integrated system that ingests and registers data and knowledge, allows query and recall as well as hypothesis generation and steering, and validated analysis on multiple domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synergistic Discovery and Design (SD2)"
                                    },
                                    "Description": {
                                        "val": "The Synergistic Discovery and Design (SD2) program will develop data-driven methods to accelerate scientific discovery and robust design in domains that lack complete models. Engineers regularly use high-fidelity simulations to create robust designs in complex domains such as aeronautics, automobiles, and integrated circuits. In contrast, robust design remains elusive in domains such as synthetic biology, neuro-computation, and polymer chemistry due to the lack of high-fidelity models. The SD2 program will develop tools to enable robust design despite the lack of complete scientific models. This will involve collecting raw experimental data into a data and analysis hub; developing computational techniques that extract scientific knowledge directly from experimental data; and creating data sharing tools and metrics that facilitate collaborative design.  The program will adopt synthetic biology as the primary application domain.  Alternative domains of interest include chemistry, material science, and neuro-computation.  SD2 builds on techniques being developed under the Probabilistic Programming for Advancing Machine Learning program."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Establish data ingest, indexing, and sharing techniques to enable collaborative analysis of experimental data at scale.\n-  Develop algorithms that reveal nuanced features in raw experimental data to inform the development of new scientific principles.\n-  Develop a computer-readable protocol-capture language to enable assembly of high-quality, integrated experimental data from cellular biochemistry experiments conducted in disparate labs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.000"
                                            },
                                            "Text": {
                                                "val": "-  Improve accuracy of computational techniques that extract scientific knowledge directly from experimental data.\n-  Establish experimental planning tools to facilitate iterative feedback between knowledge-discovery and design.\n-  Develop automated design tools that reduce the impact of variability in experimental conditions across laboratory environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "World Modelers"
                                    },
                                    "Description": {
                                        "val": "The World Modelers program builds on techniques developed in the Big Mechanism program to create explanatory models for natural and human-mediated systems at regional and global scales. The world is highly interdependent, and disruption of natural resources, supply chains, and production systems can have severe consequences, including war. Water and food security are application domains of particular interest, as persistent drought may cause crops to fail, with consequential migration and conflict between peoples. The World Modelers program will develop the capability to model regional and global systems to generate timely indications and warnings with techniques for automating the creation, maintenance, and validation of large-scale integrated models using primary literature (e.g., news and analyst reports, journal articles) as a structuring mechanism and government and commercial data (e.g., remote sensing imagery, commodities futures prices) as quantitative inputs.  Advances in machine reading and learning, semantic technologies, big data analysis, geo-spatial and economic modeling, and environmental simulation bring this strategic capability within reach."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.863"
                                            },
                                            "Text": {
                                                "val": "-  Propose approaches for integrating numerical and semantic techniques in quantitative and qualitative models.\n-  Initiate construction of large-scale data sets for validating models of challenges such as food security and human migration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.800"
                                            },
                                            "Text": {
                                                "val": "- Implement automated machine reading and learning techniques for updating large-scale models using primary literature and government and commercial data.\n- Demonstrate an initial capability to model natural and human-mediated perturbations having the potential to impact theater security such as water shortages, crop failures, and hoarding of critical resources.\n- Test models of regional and global phenomena and initiate formulation of theory to understand model accuracy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Complex Hybrid Systems"
                                    },
                                    "Description": {
                                        "val": "This research thrust is focused on exploring fundamental science, mathematics, and computational approaches to collectives, complex hybrid (e.g., human-machine) systems and systems of systems across a variety of DoD-relevant domains. Efforts include development of foundational, quantitative theories and algorithms for the analysis and design of complex systems, as well as novel testing capabilities for assessing the value of these theories using experimental verification across multiple problem domains. Results from this thrust will better enable the systematic design of complex hybrid systems that can achieve unprecedented resilience and adaptability in unexpected environments. This thrust is an aggregation of programs previously contained in Quantifying Uncertainty in Physical Systems and Knowledge Representation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.346"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the impact of team composition parameters on human-machine system performance. \n-  Begin the development of an experimental environment that can test the impact of variation of human-machine system configuration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Design tools for the measurement and representation of collaborative problem solving performance in human-machine systems and systems-of-systems.  \n-  Demonstrate the use of new knowledge representation tools for modeling and optimizing collaborative problem solving performance in human-machine systems and systems-of-systems.  \n-  Begin the development of design tools for the optimization of collaborative problem solving performance in human-machine systems and systems-of-systems.  \n-  Begin the development of an experimental environment that can test the impact of variation of human-machine system configuration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lifelong Learning Machines (L2M)"
                                    },
                                    "Description": {
                                        "val": "The Lifelong Learning Machines (L2M) program will research and develop fundamentally new machine learning mechanisms, enabling machines that learn continuously as they operate.  Current learning machines are fully configured in advance of deployment, meaning that they have difficulty accounting for in-the-field mission changes or for unexpected deviations in the data being processed.  To overcome this limitation, L2M will pursue learning approaches inspired by biological systems, which continuously learn and improve their skills.  Areas of research will include network structures that improve performance by processing new data seen in the field, learn new tasks without forgetting previous tasks, and incorporate context into their understanding of the environment.  These capabilities could impact a broad array of military applications that require processing and understanding data, particularly in real world environments where unpredictable events may occur."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.100"
                                            },
                                            "Text": {
                                                "val": "-  Identify and define lifelong learning component approaches.\n-  Develop preliminary description of application(s) integrating L2M software components. \n-  Perform first evaluation of lifelong learning software components showing initial capabilities to achieve objectives using test dataset. \n-  Develop description of how new biological mechanism will be proven and measured in software, including preliminary specifications of test data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Probabilistic Programming for Advancing Machine Learning (PPAML)"
                                    },
                                    "Description": {
                                        "val": "The Probabilistic Programming for Advancing Machine Learning (PPAML) program is creating an advanced computer programming capability that greatly facilitates the construction of new machine learning applications in a wide range of domains.  This capability will increase the number of people who can effectively contribute, make experts more productive, and enable the creation of new tactical applications that are inconceivable given today's tools.  The key enabling technology is a radically new programming paradigm called probabilistic programming that enables developers to quickly build generative models of phenomena and queries of interest which a compiler would convert into efficient applications.  PPAML technologies will be designed for application to a wide range of military domains including Intelligence, Surveillance and Reconnaissance (ISR) exploitation, robotic and autonomous system navigation and control, and medical diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.188"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated advanced probabilistic abstractions, inference techniques, and implementations.  \n-  Enriched probabilistic programming systems with stronger probabilistic abstractions and improved integration with solvers and inference engines. \n-  Extended the compilation back end of a probabilistic programming system with support for new inference techniques.\n-  Evaluated the performance of each probabilistic programming system both in terms of the quality of the results and the levels of resources required."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.308"
                                            },
                                            "Text": {
                                                "val": "-  Integrate probabilistic systems within domain-specific contexts to provide tailored functionality.\n-  Build new probabilistic solvers that incorporate state-of-the-art machine learning algorithms that operate at scales at least one order of magnitude greater than currently feasible.\n-  Work with domain experts and transition partners to apply probabilistic programming systems in domains that have military relevance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unconventional Processing of Signals for Intelligent Data Exploitation (UPSIDE)"
                                    },
                                    "Description": {
                                        "val": "The Unconventional Processing of Signals for Intelligent Data Exploitation (UPSIDE) program created a new generation of computing structures, enabling revolutionary advances in real-time sensor data analysis.  To demonstrate the impact of this advance, the program improved the performance and power efficiency of detecting and tracking objects in video streams.  Today, computer-based object detection and tracking requires matching an object of interest to its high-precision digital representation, which is an inherently power-hungry process.  UPSIDE instead employed an approach known as approximate computing which operates very efficiently on both semiconductor-based electronic devices and emerging alternative devices without sacrificing accuracy.  UPSIDE demonstrated five to seven orders of magnitude improvement in the power efficiency and performance of real-time sensor data analysis.  The UPSIDE computing approach was benchmarked against a DoD-relevant image processing pipeline to verify gains in both throughput and power efficiency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.320"
                                            },
                                            "Text": {
                                                "val": "-  Built and completed a test bed for evaluating semiconductor-based electronic devices that perform object identification and tracking.\n-  Established a digital baseline of power consumption, performance, and accuracy for identifying and tracking objects in a surveillance video.\n-  Demonstrated significant power consumption and performance improvements for a semiconductor-based UPSIDE chip, relative to the digital baseline for object identification and tracking applications.\n-  Simulated the potential for conducting image processing applications on non-semiconductor-based emerging devices.  The projections suggested a 1000x improvement in performance and 10,000x reduction in power consumption with no loss of accuracy compared to image processing on conventional devices."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CYS-01"
                    },
                    "ProjectTitle": {
                        "val": "CYBER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "45.431"
                        },
                        "CurrentYear": {
                            "val": "45.000"
                        },
                        "BudgetYearOne": {
                            "val": "41.176"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.176"
                        },
                        "BudgetYearTwo": {
                            "val": "22.355"
                        },
                        "BudgetYearThree": {
                            "val": "10.000"
                        },
                        "BudgetYearFour": {
                            "val": "10.000"
                        },
                        "BudgetYearFive": {
                            "val": "20.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cyber security.  Information technologies enable important new military capabilities and drive the productivity gains essential to U.S. economic competitiveness.  Meanwhile, cyber threats grow in sophistication and number, and put sensitive data, classified computer programs, and mission-critical information systems at risk.  The basic research conducted under the Cyber Sciences project will produce breakthroughs necessary to enhance the resilience of DoD information systems to current and emerging cyber threats.  Promising research results will be transitioned to both technology development and system-level projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Transparent Computing"
                                    },
                                    "Description": {
                                        "val": "The Transparent Computing program is developing technologies to enable the implementation of more effective security policies across distributed systems.  The scale and complexity of modern information systems obscures linkages between security-related events, making it hard to discover attacks such as advanced persistent threats (APTs).  The Transparent Computing program will create the capability to propagate security-relevant information, track complete knowledge of event provenance, and ensure component interactions are consistent with established behavior profiles and policies.  Transparent Computing technologies are particularly important for large integrated systems with diverse components such as distributed surveillance systems, autonomous systems, and enterprise information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.049"
                                            },
                                            "Text": {
                                                "val": "-  Implemented adaptive security policy schemes in software prototypes and performed initial assessments in simulated laboratory and cloud environments.\n-  Developed and implemented behavioral attestation techniques in software prototypes scalable to big data applications.\n-  Developed and implemented causal dependency tracking across software\/hardware abstraction layers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.321"
                                            },
                                            "Text": {
                                                "val": "-  Develop provenance graph analytics algorithms for clustering, role discovery, anomaly detection, root cause analysis and extrapolation.  \n-  Develop integrated provenance tracking mechanisms and a forensic analysis capability for a single system with browser and apps. \n-  Conduct an evaluation against a compromised browser based on an operational APT scenario."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.648"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.648"
                                            },
                                            "Text": {
                                                "val": "-  Incorporate technologies in a comprehensive architectural framework to extend new capabilities across various software layers and systems, with coordination among the different tag-and-track mechanisms.\n-  Implement detection or enforcement at a network element, such as a firewall, to demonstrate the collection and analysis of causally linked activities in near real-time to infer the nature of an attack using realistic APT behavior.\n-  Conduct an evaluation against a sophisticated multi-platform APT that uses different lateral movement techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space\/Time Analysis for Cybersecurity (STAC)"
                                    },
                                    "Description": {
                                        "val": "The Space\/Time Analysis for Cybersecurity (STAC) program is developing techniques to detect algorithmic complexity vulnerabilities and side channel attacks in software.  Historically, adversaries have exploited software implementation flaws through buffer and heap overflow attacks.  Advances in operating systems have largely mitigated such attacks, so now cyber adversaries must find new ways of compromising software.  Algorithmic complexity and side channel attacks are emerging as a new generation of attacks since they depend on intrinsic properties of software algorithms rather than implementation flaws.  The STAC program seeks to develop analysis tools and techniques to detect vulnerabilities to these attacks in the software upon which the U.S. government, military, and economy depend."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.078"
                                            },
                                            "Text": {
                                                "val": "-  Defined the formal semantics of runtime environments in which vulnerable software runs, and encoded the semantics in a form consumable by automated analysis tools.\n-  Produced initial analysis tools that reason about data and control flow paths in computer programs, identified inputs adversaries can use to mount algorithmic complexity attacks, and identified outputs that adversaries can use to mount side channel attacks.\n-  Performed a competitive experiment using prototype analysis tools to find algorithmic complexity vulnerabilities and side channel attacks in a corpus of challenge programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.360"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate more reliable detection of algorithmic resource usage vulnerabilities by incorporating fine-grained semantics of the underlying run-time environment and operating system.\n-  Develop and evaluate tools that identify dangerous conditions, either inputs adversaries could use to mount algorithmic complexity attacks or outputs that adversaries could use to mount side channel attacks.\n-  Identify potential users with a need to demonstrate the absence of vulnerabilities to algorithmic complexity and side channel attacks in mission critical systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.573"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.573"
                                            },
                                            "Text": {
                                                "val": "-  Develop and implement methods for remediating algorithmic resource usage vulnerabilities by automatically generating patches.\n-  Identify the most promising analysis tools for finding vulnerabilities to algorithmic complexity and side channel attacks in a corpus of test programs and integrate these in a best-of-breed prototype.\n-  Engage in experiments or pilot deployments of prototype tools with transition partners and, based on user feedback, improve prototypes to enhance usability in the context of DoD operational needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SafeWare"
                                    },
                                    "Description": {
                                        "val": "The SafeWare program is developing new code obfuscation techniques for protecting software from reverse engineering.  At present, adversaries can extract sensitive information from stolen software, which could include cryptographic private keys, special inputs\/failsafe modes, and proprietary algorithms.  Today's state of the art in software obfuscation adds junk code (loops that do nothing, renaming of variables, redundant conditions, etc.), which is not resilient against automated tools.  Recent breakthroughs in theoretical cryptography have the potential to make software obfuscation into a mathematically rigorous science, very much like what the Rivest-Shamir-Adleman (RSA) algorithm did for the encryption of messages in the 1970's.  In its present form, cryptographic obfuscation incurs too much runtime overhead to be practical.  The SafeWare program will take this very early-stage obfuscation theory and re-tool its mathematical foundations to move it towards becoming practical and efficient."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.304"
                                            },
                                            "Text": {
                                                "val": "-  Explored potentially powerful new primitives for cryptographic program obfuscation such as multilinear maps.\n-  Developed alternate models of obfuscation for specialized aggressor models, and optimized domain-specific algorithms for obfuscation efficiency.\n-  Created an evaluation platform\/environment capable of quantifying runtime efficiency and cryptographic security of the obfuscation algorithms and software implementations, and initiated assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.319"
                                            },
                                            "Text": {
                                                "val": "-  Based on initial assessment results, develop new obfuscation theory and implementations better suited to codes encountered in operational systems.\n-  Use adversarial techniques to identify side channel vulnerabilities in the obfuscation algorithms and software implementations.\n-  Explore specific obfuscation features and capabilities that address use cases relevant to sensitive systems and missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.955"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.955"
                                            },
                                            "Text": {
                                                "val": "-  Develop demonstrations of obfuscation protocols with provable security properties and quantifiable security levels for less simple computational or algorithmic processes.\n-  Create modular approaches to obfuscation in order to be able to restrict obfuscation to the most sensitive parts of computational or algorithmic processes only.\n-  Develop fundamental re-constructions of classic cryptographic protocols using obfuscation as a basic resource for computational security."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ES-01"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONIC SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.806"
                        },
                        "CurrentYear": {
                            "val": "49.553"
                        },
                        "BudgetYearOne": {
                            "val": "86.626"
                        },
                        "BudgetYearOneBase": {
                            "val": "86.626"
                        },
                        "BudgetYearTwo": {
                            "val": "69.546"
                        },
                        "BudgetYearThree": {
                            "val": "52.883"
                        },
                        "BudgetYearFour": {
                            "val": "52.883"
                        },
                        "BudgetYearFive": {
                            "val": "52.883"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is for basic exploration of electronic and optoelectronic devices, circuits, and processing concepts to meet the military's need for near real-time information gathering, transmission, and processing.  In seeking to continue the phenomenal progress in microelectronics innovation that has characterized the last few decades, the project should provide DoD with new, improved, or potentially revolutionary device options for accomplishing these critical functions.  The resulting technologies should help maintain knowledge of the enemy, communicate decisions based on that knowledge, and substantially improve the cost and performance of military systems.  Research areas include analog, mixed signal, and photonic circuitry for communications and other applications; alternative computer architectures; and magnetic components to reduce the size of electromagnetic (EM) and sensing systems.  Other research could support field-portable electronics with reduced power requirements, ultra-high density information storage \"on-a-chip\", and new approaches to nanometer-scale structures, molecules, and devices.\n\nWithin this project, Beyond Scaling programs will support investigations into materials, devices, and architectures to provide continued improvements in electronics performance with or without the benefit of Moore's Law (silicon scaling). Within the next ten years, traditional scaling will start to encounter the fundamental physical limits of silicon, requiring fresh approaches to new electronic systems. Over the short term, DoD will therefore need to unleash circuit specialization in order to maximize the benefit of traditional silicon. Over the longer term, DoD and the nation will need to engage the computer, material, and mechanical sciences to explore electronics improvements through vertical circuit integration for improved computation or non-volatile memory devices that combine computation and memory. Other memory devices could also leverage an emerging understanding of the physics of magnetic states, electron spin properties, topological insulators, or phase-changing materials. Beyond Scaling programs will address fundamental exploration into each of these areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Direct On-Chip Digital Optical Synthesis (DODOS)"
                                    },
                                    "Description": {
                                        "val": "The Direct On-chip Digital Optical Synthesis (DODOS) program will investigate high-performance photonic components for a compact, robust, and highly-accurate optical frequency synthesizer suited to various mission-critical DoD applications.  Frequency synthesis and accurate control of radiofrequency and microwave radiation is the enabling technology for radar, satellite and terrestrial communications, positioning and navigation technology, and many other core DoD capabilities.  Frequency synthesis and control of light or optical waves, however, has been constrained to laboratory experiments due to the size, fragility, and cost of optical frequency synthesizers.  DODOS will leverage recent developments in the field of integrated photonics to enable the development of ubiquitous, low-cost optical frequency synthesizers.  The program could lead to disruptive DoD capabilities, including high-bandwidth optical communications, higher performance light detection and ranging (LiDAR), portable high-accuracy atomic clocks, and high-resolution detection of chemical\/biological threats at a distance.  Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated compact low-threshold octave-spanning combs suitable for DODOS integration.\n-  Demonstrated methods for stabilizing the phase coherence of a microresonator comb across a broad optical bandwidth.\n-  Successfully developed Complementary Metal-Oxide Semiconductor-compatible materials for frequency stabilization of optical combs, facilitating integration with critical photonic components.\n-  Characterized the output of a slave laser locked to a stabilized microresonator comb and evaluated the performance relative to promising DoD applications for DODOS technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate efficient electronic control algorithms to accurately sweep the slave laser across 50 nanometers (nm) of comb bandwidth.\n-  Investigate methods to further reduce threshold of self-referenced combs.\n-  Design and implement on-chip photonic components to mitigate issues associated with excess phase noise, cross talk, back reflection and isolation to achieve integrated DODOS system performance metrics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and implement techniques to improve the laser frequency tuning speed and tuning accuracy using co-integrated electronic and photonic components. \n-  Complete analysis to validate the feasibility of utilizing DODOS technology for a proposed DoD-relevant application."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC)"
                                    },
                                    "Description": {
                                        "val": "The High power Amplifier using Vacuum electronics for Overmatch Capability (HAVOC) program seeks to develop compact radio frequency (RF) signal amplifiers for air, ground, and ship-based communications, sensing, and radar systems.  HAVOC amplifiers would enable these systems to access the high-frequency millimeter-wave portion of the electromagnetic (EM) spectrum, facilitating increased range and other performance improvements.  Today, the effectiveness of combat operations across all domains increasingly depends on DoD's ability to control and exploit the EM spectrum and to deny its use to adversaries.  However, the proliferation of inexpensive commercial RF sources has made the EM spectrum crowded and contested, challenging our spectrum dominance.  Operating at higher frequencies, such as the millimeter-wave, helps DoD to overcome these issues and offers numerous tactical advantages such as high data-rate communications and high resolution and sensitivity for radar and sensors.  HAVOC will fund basic research in vacuum electronics to improve understanding of the various phenomena governing vacuum electronic amplifiers operating at mm-wave frequencies above 75 GHz.  Focus areas will include modeling and simulation techniques, advanced manufacturing methods, novel beam-wave interaction structures, high current density and long-life cathodes, and other relevant topics.  Applied research efforts are funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Researched high-fidelity, three-dimensional, multi-physics, numerically efficient modeling and simulation techniques that lead to first-pass design success.\n-  Investigated advanced manufacturing methods such as Selective Laser Sintering (SLS) and other additive manufacturing methods for beam-wave interaction circuits and other tube components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate a more complete fundamental understanding of electron emission enabling the a priori design of high current-density, long-life cathodes.\n-  Design novel wideband and high-power beam-wave interaction structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Verify and validate the performance of high-fidelity, three-dimensional, multi-physics, numerically efficient modeling and simulation techniques on structures representative of advanced vacuum electronic amplifiers.\n-  Fabricate and test wideband and high-power beam-wave interaction structures, and high current-density cathodes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precise Robust Inertial Guidance for Munitions (PRIGM)"
                                    },
                                    "Description": {
                                        "val": "The Precise Robust Inertial Guidance for Munitions (PRIGM) program aims to identify, investigate, and demonstrate inertial sensor technologies for positioning, navigation, and timing (PNT) in GPS-denied environments.  When GPS is not available, these inertial sensors can provide autonomous PNT information.  The program will exploit recent advances in integrating photonic (light-manipulating) components into electronics and in employing microelectromechanical systems (MEMS) as high-performance inertial sensors for use in extreme environments.  Whereas conventional MEMS inertial sensors can suffer from inaccuracies due to factors such as temperature sensitivity, new photonics-based PNT techniques have demonstrated the ability to reject these inaccuracies.  PRIGM will focus on two areas.  By 2020, it aims to develop and transition a Navigation-Grade Inertial Measurement Unit (NGIMU), a state-of-the-art MEMS device, to DoD platforms.  By 2030, it aims to develop Advanced Inertial MEMS Sensors (AIMS) that can provide gun-hard, high-bandwidth, high dynamic range navigation for GPS-free munitions.  These advances should enable navigation applications, such as smart munitions, that require low-cost, size, weight, and power inertial sensors with high bandwidth, precision, and shock tolerance.  PRIGM will advance state-of-the-art MEMS gyros from TRL-3 devices to a TRL-6 transition platform, eventually enabling the Service Labs to perform TRL-7 field demonstrations.  Applied research efforts are funded in PE 0602716E, Project ELT-01, and advanced technology development for the program is budgeted in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.306"
                                            },
                                            "Text": {
                                                "val": "-  Developed preliminary models to simulate novel chip-scale inertial sensors such as optical waveguide gyroscopes and optically interrogated MEMS gyroscopes and accelerometers.\n-  Developed MEMS and photonic integration processes demonstrating novel approaches to inertial sensing.\n-  Developed an experimental test setup to support short-loop experiments for novel photonic-MEMS gyroscopes and accelerometers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.008"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate laboratory prototype photonic-MEMS inertial sensors with navigation-grade accuracy and stability.\n-  Optimize novel optical and MEMS inertial sensor designs through modeling and simulation after completing initial experimental characterization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "-  Integrate component technology and demonstrate photonic-MEMS inertial sensors with beyond-navigation-grade stability and precision.\n-  Test navigation-grade inertial sensor performance robustness to external perturbations such as vibration and shock."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Signal Processing at RF (SPAR)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of Quantum and Materials Basics\n\nThe Signal Processing at RF (SPAR) program will investigate advanced analog components to process radio frequency (RF) signals for communications, radar, and electronic warfare applications.  Today, electronic components are limited in their ability to distinguish between two or more signals operating at the same frequency when one signal is strong enough to jam the others.  The jamming signal, in this case, saturates the receiver electronics much like loud music drowns out a quiet conversation.  By using advancements in new semiconductor materials, processing, and novel signal interaction mechanisms, SPAR components will be able to pick out friendly RF signals from both intentional and unintentional jamming signals, even when those signals sit on top of one another in frequency.  This capability would enable a range of new applications including communications in contested battlefield RF environments, jamming the RF spectrum while maintaining communication, and full-duplex radio communication.  Other potential applications include equipping mobile radios with SPAR-enabled front ends for simultaneous jam-resistant two-way communication and electronic warfare."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.745"
                                            },
                                            "Text": {
                                                "val": "-  Develop theoretical framework and modeling of RF signal processing components for rejecting in-band RF interference. \n-  Design and fabrication of Phase 1 RF signal processing components capable of collectively rejecting uncooperative in-band jamming by 10 fold and cooperative self-interference by 100 fold.\n-  Design and fabrication of Phase 1 RF circulators to provide an additional 30x isolation between the transmitter and receiver ports."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform measurement of SPAR RF signal processing components meeting Phase 1 performance. \n-  Design Phase 2 RF signal processing components with commercial communications grade performance capable of rejecting uncooperative in-band jamming by 30x and cooperative self-interference by 10,000x."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Magnetic Miniaturized and Monolithically Integrated Components (M3IC)"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of Quantum and Materials Basics\n\nThe Magnetic Miniaturized and Monolithically Integrated Components (M3IC) program aims to integrate magnetic components onto semiconductor materials, improving the size and functionality of electromagnetic (EM) systems for communications, radar, and electronic warfare (EW).  Current EM systems use magnetic components such as circulators, inductors, and isolators that are bulky and cannot be integrated with electronic circuitry.  This limits the utility of the magnetic components as well as their ability to impact overall system performance and function.  Reducing the size, weight, and power (SWaP) of magnetic components and integrating them onto semiconductor chips, however, could enable broader exploitation of magnetic materials and provide new mechanisms for the control and manipulation of EM signals.  For instance, tighter integration could yield smaller radar systems, higher bandwidth communication over longer ranges, improved jam resistance, and more resilient EW systems.  The M3IC program is divided into three technical areas: integration of magnetic materials and systems with semiconductor technology; accurate and efficient modeling of magnetic phenomena from the molecular to the component system level; and exploitation of magnetic phenomena in innovative component designs relevant to DoD EM systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate techniques to grow thick magnetic films on large semiconductor substrates.\n-  Characterize properties and evaluate performance of magnetic films.\n-  Complete modeling tool documentation and demonstrate early concept software.\n-  Define and demonstrate two concepts for innovative component designs that exploit magnetic phenomena."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.426"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.426"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate deposition of magnetic films greater than 100 micrometers thick on semiconductor substrates larger than 50 millimeters in diameter, enabling the creation of integrated magnetic components such as circulators with wide bandwidth and low insertion loss.\n-  Characterize properties and evaluate performance of magnetic films.\n-  Prototype integrated magnetic components.\n-  Demonstrate prototype modeling codes with improved accuracy and efficiency.\n-  Demonstrate optimized and miniaturized magnetic components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "A MEchanically Based Antenna (AMEBA)"
                                    },
                                    "Description": {
                                        "val": "The A MEchanically Based Antenna (AMEBA) program seeks to develop efficient radio frequency (RF) transmitters operating in the Ultra-Low Frequency (ULF) and Very Low Frequency (VLF) ranges, for portable applications in underground and underwater communications.  For classical antennas, the minimum antenna size for efficient transmission is driven by the wavelength of the RF signal.  This fundamental property prevents reducing the size of today's ULF and VLF transmitting antennas, which are up to a mile wide.  Whereas traditional antennas generate electromagnetic waves by driving current through a conductive material, AMEBA takes a novel approach, mechanically moving an electrical charge or magnet to generate electromagnetic waves at ULF and VLF.  This mechanical coupling provides unique advantages over traditional approaches at these frequencies, most notably greater than 1,000x reduction in antenna size.  AMEBA will focus on developing both the materials and precision-controlled electromechanical systems required for an efficient transmitter system.  This new capability would enable a range of applications including hard-to-jam wireless communications for use over very long distances and short-range underground and underwater RF links.  Other potential applications include terrestrial navigation systems for GPS-denied environments and ground-penetrating radar for detecting unexploded ordnance, underground facilities, and tunnels."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop high performance electret and ferroelectric materials able to support high charge density with low charge leakage rates.\n-  Design and develop electromechanical systems and architectures to realize large scale, high-precision mechanical actuation of magnets and electrically charged materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint University Microelectronics Program (JUMP)"
                                    },
                                    "Description": {
                                        "val": "The Joint University Microelectronics Program (JUMP) program is a government-industry joint research program to explore computing, sensing, communication, and data storage innovations for applications beyond the 2030 horizon.  The program recognizes that the densely interconnected microsystems of the future will be built through the use of groundbreaking materials, revolutionary devices, advanced architectures, and unconventional computing.  JUMP will therefore sponsor academic research teams focused on related key technology areas that will impact future DoD capabilities and national security.  The JUMP program will not only push fundamental technology research but also establish long-range microelectronic research themes with greater emphasis on end-application and systems-level computation.  By discovering the science underlying new technologies and overcoming engineering challenges, JUMP will enable DoD applications to exploit the entire electromagnetic spectrum from radio frequency (RF) to terahertz (THz) and to employ both distributed and centralized computing with embedded intelligence and memory."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Launch university research teams to study technical areas with long-term impacts to government and industry.\n-  Explore emerging materials, power efficient radio frequency (RF), terahertz (THz), digital, and storage devices for future microsystems.\n-  Investigate distributed and centralized computing architectures and subsystems for efficient information extraction, processing, and autonomous control applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Semiconductor Technology Advanced Research Network (STARNet)"
                                    },
                                    "Description": {
                                        "val": "The Semiconductor Technology Advanced Research Network (STARNet) program is a government-industry partnership designed to enable the performance requirements of future sensing, communication, computing, and memory applications.  The program sponsors academic research teams focused on technology areas, determined by government and industry experts that impact long-range DoD needs.  The sponsored academic research base includes approximately 46 universities, 188 faculty researchers, 628 students, and more than 112 industry associate personnel.  Industry provides 60% of program funding, with DARPA providing the remaining 40% of funding.  STARNet research is divided into three centers that focus on system issues (design architecture and system design) and three centers that focus on device and materials issues (high-performance and low power devices).  As the projects in the device and materials centers mature, they are expected to be utilized by the system centers to enhance improvements in system design and fabrication."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed novel materials and steep-turn-on transistor devices and designed proof-of-concept circuit blocks for applications such as lower power imagers, pattern recognition, and scavenging self-powered electronics with extremely low energy-delay product.\n-  Developed voltage-controlled magnetic materials and fabrication techniques to enable power efficient spintronics devices for logic and memory applications.\n-  Developed the scalability of silicon-based computing system concepts to meet the performance, power and cost demands of DoD applications.\n-  Discovered and developed bio- and neuro-inspired information processing architecture framework that approaches the efficiency of brain computation, while aligning well with emerging beyond-complementary metal-oxide semiconductor (CMOS) nanoscale fabrics.\n-  Investigated sensor swarm applications for Defense requirements such as warfighter situational awareness and assessed system characteristics and potential advantages."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate low-voltage steep-turn-on transistors beyond traditional CMOS devices and realize the digital, memory, or microwave circuits with extremely low power consumption.\n-  Demonstrate spintronics devices for extremely low-power for logic and non-volatile memory circuits with increased complexity.\n-  Demonstrate heterogeneous and domain accelerated parallel systems by leveraging novel silicon-based computing architecture and integration concepts to enable reliable and secure system designs.\n-  Demonstrate statistical information processing architectures for in-memory computing and in-sensor computing by CMOS and beyond CMOS prototypes.\n-  Demonstrate swarm-based architecture and prototypes by leveraging localization and energy harvesting capabilities with built-in privacy and security to connect everything and enable urban or theater monitoring applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Materials"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Materials program will investigate new materials to support next-generation logic and memory components. Historically, the DoD had taken the lead in shaping the electronics field through research in semiconductor materials, circuits, and processors. However, as DoD focuses on military-specific components and commercial investments eschew the semiconductor space, U.S. fundamental electronics research is stagnant just as an inflection point in Moore's Law (silicon scaling) is about to occur. The Beyond Scaling - Materials program will pursue potential enhancements in electronics that do not rely on Moore's Law, including research not only into new materials but also into the implications of those materials at the device, algorithm, and packaging levels. Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin identifying non-volatile memory solutions that can be integrated on-chip and conduct basic material characterization.\n-  Describe circuit architectures that leverage the unique properties and behaviors of new semiconductor materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Architectures and Designs"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Architectures and Design program will investigate application-specific circuit architectures that ensure continued improvements in electronics performance with or without the benefit of continued scaling in silicon transistors (Moore's Law). Currently, improvements in electronics largely depend on a regular reduction in the size of silicon components. As Moore's Law slows and the nation loses the benefit of free, exponential improvements in electronics performance, DoD will need to maximize the benefits of available silicon technologies through circuit specialization. This program will investigate the potential for lowering the barriers to designing specialized circuits.  Approaches include the use of machine learning and automated design tools to program specialized hardware blocks, integrate them into existing designs, and deploy them in complex systems. Further research would also develop tools to create exact representations of physical hardware. Advances under this program will support a new DoD capability to create specialized hardware and provide benefits by improving electronics systems that do not depend on continued rapid improvements in silicon transistors. Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a mechanism for organically adapting hardware based on the moment to moment performance requirements of the software being executed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Near Zero Energy RF and Sensor Operations (N-ZERO)"
                                    },
                                    "Description": {
                                        "val": "The Near Zero Power RF and Sensor Operations (N-ZERO) program will investigate the innovative technologies required to extend the lifetimes of remotely-deployed sensors from months to years.  Today's state-of-the-art sensors can be pre-placed and remain dormant until awoken by an external trigger or stimulus.  However, the active electronics that monitor for external triggers consume power, limiting sensor lifetimes to between weeks and months.  N-ZERO seeks to replace these electronics with passive or extremely low-power devices that continuously monitor the environment and wake up active electronics upon detection of a specific trigger.  This would eliminate or significantly reduce standby power consumption, ensuring that sensor lifetimes are limited only by the power required to process and communicate confirmed events.  In doing so, N-ZERO could enable wireless sensors with drastically increased mission life and help meet DoD's unfulfilled need for a persistent, event-driven sensing capability.  To enable this possibility, N-ZERO's basic research component will consider highly innovative sensors and sensor architectures as well as signal processing and digitization technologies with near-zero power consumption.  In particular, the program will explore and develop a fundamental understanding of the trade space between power consumption, the minimum detectable signal, and the probability of falsely detecting a trigger.  An applied research component is budgeted under PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Designed and fabricated near zero power digitization technologies for zero power radio frequency (RF) and physical sensor wake-up circuits.\n-  Designed and fabricated passive and extremely low power analog and digital signal processing technologies for low energy processing of RF and physical sensor signatures.\n-  Designed and fabricated innovative RF and physical sensor designs that perform passive voltage amplification and spectral processing.\n-  Demonstrated a passive RF (900 MHz) transformer with a record voltage gain of 40.\n-  Demonstrated a zero power infrared sensor capable of detecting incident infrared power levels less than 1 micro-watt. \n-  Demonstrated the electronic components needed to amplify and digitize (8-bits) acoustic signals while consuming only 7 nW of power."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.800"
                                            },
                                            "Text": {
                                                "val": "-  Experimentally evaluate component technologies.\n-  Design and fabricate improved component technologies enabling the zero power detection and classification of progressively reduced signal level RF and physical sensor signatures.\n-  Investigate transition paths for fundamental technologies into RF communications and physical sensor systems under development in the applied research portion of this project."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "57.890"
                        },
                        "CurrentYear": {
                            "val": "65.609"
                        },
                        "BudgetYearOne": {
                            "val": "75.599"
                        },
                        "BudgetYearOneBase": {
                            "val": "75.599"
                        },
                        "BudgetYearTwo": {
                            "val": "63.780"
                        },
                        "BudgetYearThree": {
                            "val": "83.830"
                        },
                        "BudgetYearFour": {
                            "val": "85.138"
                        },
                        "BudgetYearFive": {
                            "val": "85.138"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides the fundamental research that underpins the design, development, assembly, and optimization of advanced materials, devices, and systems for DoD applications in areas such as robust diagnostics and therapeutics, novel energetic materials, and complex hybrid systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Molecular Systems and Materials Assembly"
                                    },
                                    "Description": {
                                        "val": "The Molecular Systems and Materials Assembly thrust is exploring new approaches for the synthesis, assembly, and characterization of molecules and materials from the atomic to the product scale.  Ultimately, materials and methods developed in this thrust will support a wide range of DoD applications that span therapeutics, energetics and next generation optical materials.  Specific approaches include non-traditional synthetic approaches such as the use of extreme pressure and\/or temperature conditions, as well as the synthesis and rapid screening of many molecules to more quickly identify those with desired functions and\/or properties.  Efforts in this thrust also include assembly of these and other materials into micro-to-macro-scale objects and devices, as well as fundamental studies of the properties and function of molecular ensembles and systems.  This thrust is an aggregation of programs previously contained in Nanoscale\/Bio-inspired and MetaMaterials in addition to Fundamentals of Nanoscale and Emergent Effects and Engineered Devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.585"
                                            },
                                            "Text": {
                                                "val": "-  Developed methods to stabilize extended solids at ambient temperatures and pressures.\n-  Demonstrated synthesis and stability to ambient temperature and pressure of high density extended carbon-based materials (clathrates, allotropes, nitrides, and oxides) at the multimilligram scale. \n-  Explored scalable production methods for fabrication of tough ceramic materials.  \n-  Developed retrosynthetic pathways to fabricate extended solids at reduced pressures based on computational analysis and stabilization results. \n-  Further demonstrated the ability to assemble micron-scale, three dimensional (3D) and multiple material structures from nanoscale material constructs while preserving desirable nanoscale material properties.\n-  Continued to demonstrate pick and place assembly of centimeter-scale materials from micron-scale constructs while preserving desirable nanoscale material properties.\n-  Used non-natural polymer synthesis and screening systems to create affinity reagents against DARPA-defined targets. \n-  Developed strategy to adapt the non-natural polymer synthesis and screening system to modify affinity reagent properties."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.466"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate earlier developed methods to stabilize extended solids at ambient temperatures and pressures. \n-  Demonstrate synthesis and stability of high density extended carbon-based materials (clathrates, allotropes, nitrides, and oxides) at the gram scale. \n-  Demonstrate fabrication of tough ceramic materials at the >100-gram scale and complete validation testing. \n-  Demonstrate synthetic pathways to fabricate extended solids at reduced pressures based on retrosynthetic designs and stabilization results.\n-  Develop nanometer and micron-scale mechanical manipulation tools to support assembly tasks. \n-  Build 1 centimeter or larger structures with controlled internal complexity from feedstock consisting of individual atoms or molecules. \n-  Improve the binding affinity of non-natural polymers against DARPA-defined targets. \n-  Generalize developed non-natural polymer library screening strategies across multiple target classes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.813"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.813"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the production of micron and larger feedstocks with nanoscale features and properties. \n-  Demonstrate unique nanoscale properties for assemblies of micron feedstocks at 1-cm scale or larger. \n-  Demonstrate rapid discovery of affinity reagents to a series of DARPA-defined challenges, including optimization of binding in a target active site. \n-  Design, synthesize and transition affinity reagents for current DoD therapeutic or diagnostic challenges with partners such as the U.S. Army Medical Research Institute for Infectious Diseases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Photon Science"
                                    },
                                    "Description": {
                                        "val": "The Basic Photon Science thrust is examining the fundamental science of photons and their interactions in integrated devices for potential DoD-applications such as communications, signal processing, spectroscopic sensing and imaging.  One focus area is development of novel, chip-scale optical frequency comb sources and associated technologies for spectroscopic sensing, identification, and quantification of multiple trace materials in spectrally cluttered backgrounds.  Additional research will explore development of a complex theoretical framework for maximum information extraction from complex scenes to guide development of new imaging technologies.  Finally, work in this thrust will establish the first-principles limits of photon detector performance in a variety of detector technologies to enable better, more sensitive detectors.  This thrust is an aggregation of programs previously contained in both Basic Photon Science and Nanoscale\/Bio-inspired and MetaMaterials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.305"
                                            },
                                            "Text": {
                                                "val": "-  Designed a rack-mounted package for mode-locked laser based optical frequency division microwave source. \n-  Demonstrated Radio Frequency (RF) photonic bandpass filtering with micro-resonator optical frequency combs. \n-  Demonstrated a remotely operating quartz microwave oscillator slaved via optical frequency comb based free-space (wireless) time and frequency transfer.  \n-  Demonstrated femtosecond time-resolved imaging at the nanometer scale with soft x-rays generated via high harmonic generation (tabletop scale x-ray source).  \n-  Demonstrated stability and characterization capabilities of extreme ultraviolet\/soft x-ray attosecond end-station by measuring and characterizing isolated attosecond (10^-18 seconds) pulses. \n-  Demonstrated proof-of-concept broadband chip-scale comb sources in multiple spectral regions. \n-  Demonstrated proof-of-concept dual-comb quantum cascade lasers on the same chip in mid-infrared. \n-  Demonstrated massively parallel spectroscopy in a lab setting for the detection of trace species in a cluttered environment using chip-scale frequency combs in multiple spectral regions. \n-  Investigated the fundamental limits of photon transduction to enable a mechanistic description of the photodetector trade space including timing, resolution, efficiency and speed.\n-  Initiated development of a theoretical framework based on the Plenoptic function to maximally exploit degrees of freedom of light for extracting information from complex scenes. \n-  Initiated design of experiments to validate theoretical framework and models in complex scenes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.050"
                                            },
                                            "Text": {
                                                "val": "-  Develop a rack mounted package for mode-locked laser-based optical frequency division microwave source and all components for a chip-scale source.\n-  Demonstrate chip-scale RF photonic down conversion and filtering based on optical frequency comb technology.  \n-  Show full integration of laser and end-station to realize a microjoule, isolated attosecond beamline, representing a new capability for research in ultrafast electronics.\n-  Demonstrate tabletop sub-wavelength with nanometer spatial resolution (using tabletop high harmonic x-ray source).  \n-  Improve and tailor to specific DoD environments the performance of broadband chip-scale comb sources in multiple spectral regions. \n-  Develop and characterize two-way time\/frequency transfer protocols applicable to moving platforms.  \n-  Expand bandwidth, stability and robustness of chip-scale comb sources in multiple spectral regions to be compatible with spectroscopy of broadband absorbers such as chemical warfare agents. \n-  Demonstrate proof-of-concept massively parallel spectroscopy in a lab setting for the detection of multiple trace species using chip-scale frequency combs in multiple spectral regions. \n-  Determine a quantitative, first-principles description of photon detector performance for specific DoD platforms.\n-  Improve the Plenoptic function theoretical framework and begin to validate with laboratory experiments to maximally exploit degrees of freedom of light and extract missing information from complex scenes. \n-  Begin to theoretically determine the fundamental limits of maximum light\/scene information extraction from a single viewpoint."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.200"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate operation of rack mounted package for mode-locked laser-based optical frequency division microwave source in relevant operational environments.  \n-  Demonstrate three dimensional (3D) tabletop sub-wavelength and four dimensional (4D) imaging of nanostructured technology with nanometer spatial resolution (using tabletop high harmonic x-ray source). \n-  Demonstrate end-user operation of tabletop attosecond source to study electronic and structural dynamics in molecular and semiconductor systems. \n-  Push two-way time and frequency transfer to free-space distances that could advance DoD capabilities. \n-  Develop simulated field test environments for massively parallel spectroscopy for the detection of multiple trace species in a cluttered environment using chip-scale frequency combs in multiple spectral regions. \n-  Demonstrate cavity-enhanced comb-spectroscopy methods for massively parallel spectroscopy of multiple trace species in a cluttered environment.\n-  Establish and experimentally verify the fundamental trade space for photon detection and create new designs for photon detectors with significant performance metric improvements. \n-  Evaluate the reconstruction of complex 3D scenes based on factors such as fidelity of reconstruction, size of scene, illumination conditions, reconstruction time and projected size, weight and power requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fundamental Limits"
                                    },
                                    "Description": {
                                        "val": "Understanding the fundamental limits (i.e., achievable boundaries) of scientific principles, processes and technologies is critical to better anticipate technological surprise for ourselves and our adversaries.  This thrust explores boundaries across fields such as physics, chemistry, mathematics, biology, and engineering to address critical questions for national security.  This thrust is addressing foundational theory and approaches that include, for example, the fundamental limitations of optical technologies, potential implications of basic biology on national security, and the ability for modeling and simulation to provide a better understanding of complex systems.  This thrust is an aggregation of programs previously contained in both Nanoscale\/Bio-inspired MetaMaterials and Fundamentals of Nanoscale and Emergent Effects and Engineered Devices."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.093"
                                            },
                                            "Text": {
                                                "val": "-  Begin to develop modeling tools for development of system architectures that utilize engineered optical materials. \n-  Develop device design principles to improve the efficiency and bandwidth of engineered optical materials. \n-  Initiate experiments to understand how molecular-level modifications affect interactions with cell processes.\n-  Develop information-theoretic models that efficiently generate representative climate statistics for improving predictability.\n-  Explore the existence of prospective electromagnetic signaling channels within specific biosystems.\n-  Begin to make quantitative predictions of transmit-receive characteristics of candidate bio-antennas in situ.\n-  Begin to explore new approaches to store and process information with molecules."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.586"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.586"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate new design architectures and engineered optical materials on the sub-mm scale.  \n-  Develop plans to extend optical device design and fabrication from sub-mm scale to cm scale. \n-  Evaluate information-theoretic and machine-learning models to measure improved predictions of representative statistics.\n-  Demonstrate the technical capabilities - both theoretical and experimental - required to definitively determine if electromagnetic signaling is occurring in biological systems. \n-  Conduct tests of biosystem electromagnetic signaling.\n-  Validate approaches to represent data in molecular form.\n-  Develop strategies to enable direct-access molecular informatics to include integrating elements to directly process molecular data."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TRS-01"
                    },
                    "ProjectTitle": {
                        "val": "TRANSFORMATIVE SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.547"
                        },
                        "CurrentYear": {
                            "val": "53.070"
                        },
                        "BudgetYearOne": {
                            "val": "59.877"
                        },
                        "BudgetYearOneBase": {
                            "val": "59.877"
                        },
                        "BudgetYearTwo": {
                            "val": "68.337"
                        },
                        "BudgetYearThree": {
                            "val": "73.342"
                        },
                        "BudgetYearFour": {
                            "val": "67.249"
                        },
                        "BudgetYearFive": {
                            "val": "67.941"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in information-intensive subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of the Living Foundries program is to create a revolutionary, biologically-based manufacturing platform for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale and adapt to changing environments and self-repair, biology represents one of the most powerful manufacturing platforms known.  Living Foundries seeks to develop the foundational technological infrastructure to transform biology into an engineering practice, speeding the biological design-build-test-learn cycle and expanding the complexity of systems that can be engineered.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling adaptable, on-demand production of critical and high-value molecules.\n\nLiving Foundries will develop tools to simplify, abstract, and standardize the biological production pathway optimization process.  Additionally, Living Foundries will identify the fundamental design rules that govern the construction and organization of underlying genetic elements in the production pathways.  Research thrusts include developing the fundamental tools, capabilities and methodologies to accelerate the biological design-build-test cycle, thereby reducing the extensive cost and time it takes to engineer new systems and expanding the complexity and accuracy of designs that can be built.  The result will be rapid design, construction, implementation, and testing of complex, higher-order genetic networks with programmable functionality.  Applied research for this program is budgeted in PE 0602715E, Project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.657"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated forward engineering of novel genetic systems using innovative computational design tools.\n-  Implemented evaluation tools for high-throughput testing, validation, and verification of engineered systems.\n-  Advanced novel learning systems that enable iterative design of engineered systems using integrated feedback of results to inform subsequent designs.\n-  Incorporated automated and scalable, large-scale DNA assembly, editing tools and processes into automated, integrated design-build-test-learn technologies for engineering novel biological systems.\n-  Developed new chassis for engineering biology for improved metabolic flux for bioproduction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.702"
                                            },
                                            "Text": {
                                                "val": "-  Improve design tools through incorporation of large-scale process and test data for forward engineering novel genetic systems.\n-  Integrate evaluation tools for high-throughput testing, validation, and verification of engineered systems.\n-  Integrate novel learning systems that enable iterative design of engineered systems using integrated feedback of results to inform subsequent designs.\n-  Optimize integration of design-build-test-learn technologies for high-fidelity, high-throughput, low cost engineering of biological systems.\n-  Implement new biological chassis for improved yield and production of biochemicals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "-  Implement novel learning systems that enable iterative design of microbial systems using integrated feedback of results to inform subsequent designs.\n-  Utilize improved design and evaluation tools to decrease the cost and increase the speed of biological prototyping.\n-  Demonstrate the capability of new biological chassis for improved yield and production of biochemicals.\n-  Improve the predictability of scaling biological reactions from the lab-scale to the bench-scale."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biological Robustness in Complex Settings (BRICS)"
                                    },
                                    "Description": {
                                        "val": "The Biological Robustness in Complex Settings (BRICS) program will leverage newly developed technologies to enable radical new approaches for engineering biology.  An emerging field, engineering biology is focused on developing the tools to harness the powerful synthetic and functional capabilities of biology.  These tools will facilitate design and biological production of new chemicals and materials, sensing capabilities, therapeutics, and numerous other applications.  This rapidly developing technological capability opens the door to new applications that have previously been out of reach, and offers substantial potential advantages in terms of cost and novel functionality.\n\nFundamental work in this area will focus on understanding the underlying principles for engineering robust and safe microbes and microbial communities that perform as designed over the long-term.  This program has applied research efforts funded in PE 0602715E, Project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.580"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated methods to engineer organisms that are functionally stable over time in changing growth conditions.\n-  Demonstrated methods to engineer complex communities of microorganisms with reliably controlled population dynamics.\n-  Demonstrated methods to rationally engineer functional microbial communities of increasing complexity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.735"
                                            },
                                            "Text": {
                                                "val": "-  Combine consortia engineering technologies to develop communities that can be employed to solve specific DoD-relevant problems.\n-  Demonstrate the functional stability of engineered communities in complex environments over relevant time scales.\n-  Demonstrate potential for safe use of engineered consortia under conditions relevant to specific applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.832"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.832"
                                            },
                                            "Text": {
                                                "val": "-  Continue development of design rules for functional engineered microbial communities.\n-  Investigate parameters that contribute to the functional stability of engineered communities over relevant time scales in complex environments.\n-  Define metrics that ensure the stability and safe use of engineered consortia outside of a controlled environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding Biological Complexity"
                                    },
                                    "Description": {
                                        "val": "Biological systems operate over an enormous range of spatial, physical, and temporal scales and span individual cells to multi-organism systems.  This program seeks to enhance the understanding of the basic processes associated with biological network interactions, communication, and control to enable novel approaches and technology development to enhance national security.   Applications range from infectious disease mitigation or prevention, to predicting and leveraging biological systems for managing communities of microorganisms.  Key advances expected from this research will include the identification of approaches to create stable, predictable, and dynamic control mechanisms of biological networks.  Such information will allow the determination of a biosystem's state and enable the prediction of state."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.022"
                                            },
                                            "Text": {
                                                "val": "-  Initiated investigation into predictive design rules and engineering approaches for integrated biosystems. \n-  Initiated research into biological systems with reduced complexity to facilitate predictive design for biological engineering. \n-  Began researching cross-scale biological system responses to varying stimuli to understand defining characteristics of dynamic states."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.250"
                                            },
                                            "Text": {
                                                "val": "-  Initiate efforts to assess the utility of new experimental model systems to inform practical engineering with complex biological systems. \n-  Begin to identify candidate metrics and measurement technology relevant to engineering with complex biological systems. \n-  Investigate synergistic integration of disease vector detection and control strategies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.210"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.210"
                                            },
                                            "Text": {
                                                "val": "-  Investigate engineering approaches for influencing the ability of complex biological systems to be controlled. \n-  Investigate the utility of predictive design rules for engineering complex biological systems.\n-  Assess the feasibility of building engineered controls into biological systems. \n-  Test candidate engineering approaches relevant to control complex biological systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Social Simulation (SocialSim)*"
                                    },
                                    "Description": {
                                        "val": "* Previously Modeling and Forecasting of Social Dynamics (MFSD)\n\nThe Social Simulation (SocialSim) program will develop a computational capability to simulate the spread and evolution of information in the online environment.  The global information environment is radically changing how and at what rate information spreads and evolves, and both nation-state and sub-state actors are incorporating messaging in their operations to great advantage.  Existing approaches to understanding online information spread and evolution are largely based on specialized exercises that take considerable time to orchestrate and execute and have limited accuracy.  A corresponding computational simulation has the potential to enable a deeper and more quantitative understanding of adversaries' messaging campaigns and their likely outcomes, as well as exploration of potential responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.250"
                                            },
                                            "Text": {
                                                "val": "-  Explored applicability of online game environments for understanding online social behavior.\n-  Conducted workshop to explore the ethical and scientific issues surrounding understanding human social behavior online."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.028"
                                            },
                                            "Text": {
                                                "val": "-  Explore alternative approaches for modeling and simulating the spread and evolution of information in online environments.\n-  Develop techniques for ensuring privacy in data assembled for testing simulations.\n-  Develop techniques for testing simulations of online information dynamics using real-world data from a single online environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Test the capability to simulate online phenomena such as cascades and gatekeeping.\n-  Evaluate the performance of the social simulator in diverse scenarios in a single online environment.\n-  Refine the underlying mechanisms to simulate the spread and evolution of information in online environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering Complex Systems"
                                    },
                                    "Description": {
                                        "val": "Engineering Complex Systems will pursue new approaches to engineer complex, multi-cellular systems for enhanced capabilities and function.  Complex biological materials and systems have unique properties (e.g., controlled porosity and high strength-to-weight ratios) not only because of the inherent components but also because of how those components are assembled together across length scales.  Engineering biology tools and techniques are now at a stage to pursue the organization and function of multi-cellular systems for a new class of improved capabilities.  This program will develop underlying technological platforms to enable information driven assembly of hierarchical multi-cellular systems for the development of advanced materials."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.355"
                                            },
                                            "Text": {
                                                "val": "-  Investigate methods for specifying cellular behavior in response to environmental cues and positional information.\n-  Begin development of biological systems that have genetically encoded three-dimensional forms of specified dimensions.\n-  Begin development of gene expression circuits that confer desirable surface properties to a multi-cellular community.\n-  Initiate development of gene expression circuits that confer autonomous pattern formation in a multi-cellular community.\n-  Research methods to join living cells to non-living structural materials for the purpose of creating living building materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.825"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.825"
                                            },
                                            "Text": {
                                                "val": "-  Investigate methods for programming cellular behavior in response to external cues. \n-  Develop and test biological systems that have genetically encoded three-dimensional forms of specified dimensions.\n-  Initiate testing of gene expression circuits that confer desirable surface properties to a multi-cellular community.\n-  Continue development and testing of gene expression circuits that confer autonomous pattern formation in a multi-cellular community.\n-  Demonstrate methods to join living cells to non-living structural materials for the purpose of creating living building materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "New Functionalities for Biological Systems"
                                    },
                                    "Description": {
                                        "val": "Leveraging advances in synthetic biology and bioengineering, this program seeks to investigate novel approaches to identify and transfer biological functions into an organism or between organisms.  Traditional research in this field has been limited to microbial systems and focused on imparting capabilities from one biological system to another. Instead, this work will investigate methods to biologically encode new functionalities in cell-free, multicellular, and\/or multi-organism systems, using innovations from related areas of microbiology as well as micro- and nanotechnology.  New capabilities within biological systems will enable advances in a variety of national security application areas."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.510"
                                            },
                                            "Text": {
                                                "val": "-  Identify intrinsic or novel cell properties and structures that can be used as components of traditionally non-biological systems.\n-  Investigate methods to guide assembly of biological sub-components.\n-  Initiate investigation into novel approaches for transfer or control of biological functions to cell-free, multicellular, and\/or multi-organism systems.\n-  Develop new tools and techniques to rapidly screen organisms or biological systems for traits and mechanisms of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Open Manufacturing program will reduce barriers to manufacturing innovation, speed, and affordability of materials, components, and structures.  This will be achieved by investing in technologies to enable affordable, rapid, adaptable, and energy-efficient manufacturing, to promote comprehensive design, simulation and performance-prediction tools, and exposure to best practices.  The applied research component of this program is funded in PE 0602715E, Project MBT-01 under Materials Processing and Manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.038"
                                            },
                                            "Text": {
                                                "val": "-  Characterized material produced using micro-induction sintering process.\n-  Developed fundamental process modeling tools for micro-induction sintering process.\n-  Demonstrated approach to integrate the Open Manufacturing rapid qualification frameworks into a comprehensive computational tool."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Establish system for model curation, acquire models, and establish data formats for simulation and analysis of process, microstructure, and properties for additive manufacturing.\n-  Assess and quantify the uncertainty in the Open Manufacturing framework model that accurately predicts part performance based on manufacturing method, environment and integrated probabilistic models."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}