{
    "id": "2018-AirForce-PB-3600-MJBOOK-1-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-77",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3A-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0207701F"
        },
        "ProgramElementTitle": {
            "val": "Full Combat Mission Training"
        },
        "R1LineNumber": {
            "val": "105"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "17.290"
            },
            "CurrentYear": {
                "val": "12.051"
            },
            "BudgetYearOne": {
                "val": "16.727"
            },
            "BudgetYearOneBase": {
                "val": "16.727"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "19.480"
            },
            "BudgetYearThree": {
                "val": "19.016"
            },
            "BudgetYearFour": {
                "val": "18.737"
            },
            "BudgetYearFive": {
                "val": "19.047"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Full Combat Mission Training (FCMT) supports Air Force Distributed Mission Operations (DMO) and Live-Virtual-Constructive (LVC) integration. DMO is an operational readiness initiative enabling the USAF to exercise and train at the operational and strategic levels of war while facilitating unit-level training.  Networked LVC components form the integrated DMO battlespace by linking geographically distributed high fidelity combat and combat support training devices, including Command and Control (C2) and Intelligence, Surveillance, and Reconnaissance (ISR) systems. \n\nProject 655012, FCMT, efforts are focused on development, demonstration, and transitioning of critical functions associated with the DMO\/LVC network and linked simulators.  \n\nProject 655354, F-16 Block 40\/50 Mission Training Center (MTC), efforts are focused on development and demonstration of the F-16 Block 40\/50 MTC. Funds will be used to provide capability upgrades such as concurrent OFP software development. In addition, funds may be used to address emerging and short-notice Diminishing Manufacturing and Material Shortage (DMSMS) issues. DMS efforts to include removal of end-of-life software\/hardware within simulators systems and move to a modular, common open system architecture that is sustainable and cyber-resilient.  Implement requirements and standards defined under the Simulator Common Architecture Requirements and Standards (SCARS) initiative.\n\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at enhancing F-16 MTC units."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.082"
                },
                "CurrentYear": {
                    "val": "12.051"
                },
                "BudgetYearOne": {
                    "val": "15.679"
                },
                "BudgetYearOneBase": {
                    "val": "15.679"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.290"
                },
                "CurrentYear": {
                    "val": "12.051"
                },
                "BudgetYearOne": {
                    "val": "16.727"
                },
                "BudgetYearOneBase": {
                    "val": "16.727"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.792"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.048"
                },
                "BudgetYearOneBase": {
                    "val": "1.048"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.158"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.634"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.048"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.048"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "- The FY 2018 funding request was increased by 1.048 million to provide for increases in DMO research and studies."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "655012"
                    },
                    "ProjectTitle": {
                        "val": "Full Combat Mission Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.572"
                        },
                        "CurrentYear": {
                            "val": "2.775"
                        },
                        "BudgetYearOne": {
                            "val": "6.851"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.851"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.885"
                        },
                        "BudgetYearThree": {
                            "val": "6.939"
                        },
                        "BudgetYearFour": {
                            "val": "6.989"
                        },
                        "BudgetYearFive": {
                            "val": "7.060"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Full Combat Mission Training (FCMT) supports Air Force Distributed Mission Operations (DMO) and Live-Virtual-Constructive (LVC) integration.  DMO is an operational readiness initiative enabling the USAF to exercise and train at the operational and strategic levels of war while facilitating unit-level training. FCMT funding provides research in areas benefiting the AF DMO\/LVC environment as a whole.  Provides research and development to facilitate integration of fielded and newly acquired, Air Force owned training devices into DMO\/LVC networks.  Enhances the quality of training for the systems added to the network.  Enables aircrews to network with LVC components to form the integrated DMO battlespace.  Links geographically distributed high-fidelity combat and combat support training devices including Command and Control (C2) and Intelligence, Surveillance, and Reconnaissance (ISR) systems.  Develops, demonstrates and inserts multi-level security capability.  This capability allows the warfighters at home station to exercise and train at the operational and strategic levels of war as well as conduct networked unit-level training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "FCMT Cross Domain Solutions (CDS)"
                                    },
                                    "Description": {
                                        "val": "Development, demonstration and insertion of multi-level security capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.970"
                                            },
                                            "Text": {
                                                "val": "- Started Multi-Level Security (MLS) testbed development and support for MLS testing and implementation on, but not limited to, the F-22 and F-35 Trainers \n- Began development of fourth to fifth generation coalition rule set development for US and UK training integration \n- Initiated evaluation of commercial and government off-the-shelf Cross Domain Solution (CDS) advanced devices and capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.003"
                                            },
                                            "Text": {
                                                "val": "- Continue Multi Level Security (MLS) testbed development and support for MLS testing for fourth and fifth generation trainers.  \n- Continue fourth to fifth generation Cross Domain Solution (CDS) rule set development.  \n- Continue evaluation of commercial and government off-the-shelf CDS devices and capabilities.\n- Begin fourth to fifth generation MLS rule development for routine Live, Virtual and Constructive (LVC) environment integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.251"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.251"
                                            },
                                            "Text": {
                                                "val": "- Complete Multi Level Security (MLS) research testbed development and support for MLS testing for fourth and fifth generation trainers.  \n- Continue fourth to fifth generation Cross Domain Solution (CDS) rule set prototype development. \n- Begin accreditation for coalition rule sets.\n- Conclude evaluation of commercial and government off-the-shelf CDS devices and capabilities.\n- Continue fourth to fifth generation MLS rule development for routine Live, Virtual and Constructive (LVC) environment integration.\n- Perform accreditation for cross domain rule sets\n- Develop gateways and cross domain solutions to integrate high-fidelity trainers with Air Force, joint, and coalition networks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FCMT Develop DMO Capabilities"
                                    },
                                    "Description": {
                                        "val": "Development, demonstrations, studies and insertions of DMO\/LVC related technologies and proficiency based continuation training strategies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.571"
                                            },
                                            "Text": {
                                                "val": "- Started integration of research-developed scenarios and syllabi across DMO environments.\n- Initiated development of in-mission and cross-mission metrics for routine proficiency evaluations of individual and small team readiness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.572"
                                            },
                                            "Text": {
                                                "val": "- Continue integration of research-developed scenarios and syllabi across DMO environments.\n- Continue development of in-mission and cross-mission metrics for routine proficiency evaluations of individual and small team readiness.\n- Create and evaluate alternative data formats for routinely tracking and storing performance and proficiency data.\n- Begin integration of learning management tools into routine Distributed Mission Operations (DMO) training events.\n- Demonstrate learning managed DMO scenario and syllabus adaptation across two Mission Training Centers (MTCs)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Text": {
                                                "val": "- Conclude integration of research-developed scenarios and syllabi across DMO environments.\n- Conclude development of in-mission and cross-mission metrics for routine proficiency evaluations of individual and small team readiness.\n- Continue evaluation of alternative data formats and implement in multiple domains.\n- Verify and validate integration of learning management tools into routine Distributed Mission Operations (DMO) training events.\n- Refine learning managed scenario and integrate with live, virtual, and constructive events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FCMT Validation of warfighter seasoning and development of objective performance enhancements"
                                    },
                                    "Description": {
                                        "val": "Studies to assess and validate warfighter seasoning in continuation training and accreditation of portions of this process; studies to develop objective enhancement and measurement tools for the DMO\/LVC environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.971"
                                            },
                                            "Text": {
                                                "val": "- Initiated training assessment and performance measurement tools for readiness studies.\n- Started studies for training environment credibility assessments for an identified set of ACC Virtual and Constructive environments.\n- Began integration of performance evaluation and After Action Review (AAR) tools for the operational Mission Training Centers (MTCs)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "- Implement training assessment and performance measurement tools for readiness studies.\n- Validate training environment credibility assessments for an identified set of ACC Virtual and Constructive environments.\n- Continue integration of performance evaluation and After Action Review (AAR) tools for the operational Mission Training Centers (MTCs)\n- Begin Validation of integration and demonstration of performance evaluation and after action tools. \n- Begin development of standards for baselining environment credibility of virtual and constructive environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "- Complete integration and demonstration of performance evaluation and after action tools. \n- Complete Validation of training environment credibility assessments for an identified set of ACC Virtual and Constructive environments.\n- Demonstrate persistent performance measurement and readiness assessment in fourth to fifth LVC training events.\n- Develop metrics and tools to measure training proficiency gained during live, virtual, constructive events"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FCMT Other Network Studies"
                                    },
                                    "Description": {
                                        "val": "Research and development to provide for the integration of fielded and newly introduced, Air Force, Joint and Coalition high-fidelity flight and mission trainers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.060"
                                            },
                                            "Text": {
                                                "val": "- Started research and development for the integration of F-35, Joint and Coalition Trainers into the Combat Air Forces (CAF) Distributed Mission Operations (DMO) network.\n- Commenced interoperability studies to evaluate the training value of fifth generation interoperable coalition training on the CAF DMO network."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "- Perform research and development for the integration of F-35, Joint and Coalition Trainers into the Combat Air Forces (CAF) Distributed Mission Operations (DMO) network.\n- Conduct interoperability studies to evaluate the training value of fifth generation interoperable coalition training on the CAF DMO network.\n- Begin development of common Joint and Coalition data standards for secure, interoperable training at joint and coalition levels of analysis.  \n- Begin evaluation of the integration of different data management and tracking methods to support large scale, secure and persistent Joint and Coalition LVC events.\n- Begin evaluation of alternative network architectures and typologies for globally distributed secure LVC training and rehearsal."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Text": {
                                                "val": "- Continue development of common Joint and Coalition data standards for secure, interoperable training at joint and coalition levels of analysis.  \n- Conclude evaluation of the integration of different data management and tracking methods to support large scale, secure and persistent Joint and Coalition LVC events.\n- Demonstrate persistent performance meansurement and readiness assessment in fourth to fifth generation LVC events.\n- Develop rule sets for routine live, virtual, and constructive environment integration.\n- Evaluate network architectures and typologies for distributed secure, live, virtual, constructive events."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Each platform joining the Distributed Mission Operations (DMO)\/Live-Virtual-Constructive (LVC) environment selects its own acquisition strategy based on using Command needs, Economic Analysis (EA) and the magnitude of the training system changes required to provide DMO capability.  The initial systems in the DMO\/LVC environment; F-15C, AWACS, F-16 Block 40\/50 and F-15E, all required new training systems.  In addition, the Operations and Integration capability was created.  The Training Simulation Service (TSS) acquisition strategy was used to meet a portion of these requirements.  In the TSS approach, the contractor owns and provides the simulator equipment, maintains simulator concurrency with weapon systems, and has incentives to keep the equipment up to date with simulator and network technologies. Currently fielded and projected Air Force-owned Flight and Mission Training Systems without DMO\/LVC capability will be modified using Full Combat Mission Training (FCMT) funds to ensure compatibility with the DMO-LVC environment.  To accomplish this, AFRL will conduct research\/studies to Develop\/implement Cross Domain Solutions, develop DMO capabilities, Validate warfighter seasoning and develop objective performance enhancements and conduct other network studies."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "655354"
                    },
                    "ProjectTitle": {
                        "val": "F-16 Block 40\/50 MTC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.718"
                        },
                        "CurrentYear": {
                            "val": "9.276"
                        },
                        "BudgetYearOne": {
                            "val": "9.876"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.876"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "12.595"
                        },
                        "BudgetYearThree": {
                            "val": "12.077"
                        },
                        "BudgetYearFour": {
                            "val": "11.748"
                        },
                        "BudgetYearFive": {
                            "val": "11.987"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "F-16 Block 40\/50 Mission Training Center (MTC) supports the development, acquisition, fielding and integration of high fidelity, Distributed Mission Operations (DMO) capable flight simulators for F-16 Block 40 and 50 weapon systems.  Each MTC includes multiple high fidelity Simulator Cockpits, Instructor Operator Stations, a Threat Server and Brief\/Debrief and Mission Observation capability.  Each is capable of linking to geographically distributed high-fidelity combat and combat support training devices including Command and Control (C2) and Intelligence, Surveillance, and Reconnaissance (ISR) systems.  This capability allows the warfighters at home station to exercise and train at the operational and strategic levels of war as well as conduct networked unit-level training. Funds may be used to address emerging and short-notice Diminishing Manufacturing and Material Shortage (DMSMS) issues. DMS efforts to include removal of end-of-life software\/hardware within simulators systems and move to a modular, common open system architecture that is sustainable and cyber-resilient.  Implement requirements and standards defined under the Simulator Common Architecture Requirements and\nStandards (SCARS) initiative."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "F-16 MTC Modification Development"
                                    },
                                    "Description": {
                                        "val": "Development and testing of modifications to the F-16 MTC to maintain concurrency with F-16 aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.718"
                                            },
                                            "Text": {
                                                "val": "-- Began Development, testing and fielding of F-16 MTC Operational Flight Program (OFP) M7.1+ ensuring the MTC is non-concurrent for only 12 months with the M7.1+ operational capability resident in the aircraft as of 4th quarter FY16. Cost of Development, test and fielding estimated at 12.1M \n-- Defined initial OFP M7.2+ concurrency modifications. Definition of requirements in FY16 ensured the MTC will achieve concurrency with the capabilities resident in the aircraft when the aircraft upgrades to OFP 7.2 2nd quarter of FY19."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.276"
                                            },
                                            "Text": {
                                                "val": "-- Develop, test and field F-16 MTC Operational Flight Plan (OFP) M7.1+ to ensure the MTC achieves concurrency with the M7.1+ operational capability resident in the aircraft as of 4th quarter FY16. -- Begin Development, test, and fielding F-16 MTC Operational Flight Plan (OFP) M7.2+ concurrency modifications. Ensures the MTC will achieve concurrency with the capabilities resident in the aircraft when the aircraft upgrades to OFP 7.2 2nd quarter of FY19."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.876"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.876"
                                            },
                                            "Text": {
                                                "val": "-- Continue to Develop, test, and field F-16 MTC Operational Flight Plan (OFP) M7.2+ concurrency modifications. Ensures the MTC will achieve concurrency with the capabilities resident in the aircraft when the aircraft upgrades to OFP 7.2 2nd quarter of FY19."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item #OTHACF"
                                    },
                                    "Title": {
                                        "val": "Other Aircraft"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.459"
                                        },
                                        "CurrentYear": {
                                            "val": "1.694"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.468"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.468"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.713"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.975"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.011"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.047"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: Line item # 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.279"
                                        },
                                        "CurrentYear": {
                                            "val": "0.214"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.219"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.219"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.212"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.216"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.220"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.224"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "F-16 Block 40\/50 MTCs are being developed, fielded, and modified under a competitively awarded Federal Acquisition Regulation (FAR) Part 15 Supply contract with RDT&E and APAF funds.  The MTCs are sustained by Contract Logistic Support (CLS) using Operations and Maintenance funds.  Physical changes to the MTC cockpits required by any OFP update will be funded in the OTHACF APAF Line."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}