{
    "id": "2018-Navy-PB-1319-JBOOK-7c1f5721a78c701930fe0b135d5a2c8e9035a06c3349419fd1ce0594386dd4aa-48",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA5-U_RDTE_JustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604771N"
        },
        "ProgramElementTitle": {
            "val": "Medical Development"
        },
        "R1LineNumber": {
            "val": "144"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "120.235"
            },
            "PriorYear": {
                "val": "24.658"
            },
            "CurrentYear": {
                "val": "9.221"
            },
            "BudgetYearOne": {
                "val": "9.353"
            },
            "BudgetYearOneBase": {
                "val": "9.353"
            },
            "BudgetYearTwo": {
                "val": "9.613"
            },
            "BudgetYearThree": {
                "val": "9.813"
            },
            "BudgetYearFour": {
                "val": "9.998"
            },
            "BudgetYearFive": {
                "val": "10.195"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The purpose of this program is to develop biomedical equipment and related techniques to reduce morbidity; to enhance the logistic feasibility of modern medical care for combat casualties; to sustain casualties for evacuation to fixed medical facilities for definitive care; and to ensure that personnel are medically qualified for military duty.  Each work unit undertaken in this project has a military requirement.  Efforts are justified based upon military payoff and cost benefit.  There is a strong potential for dual use, technology transfer, and biotechnology firm\/industry participation in the projects."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.291"
                },
                "CurrentYear": {
                    "val": "9.220"
                },
                "BudgetYearOne": {
                    "val": "9.313"
                },
                "BudgetYearOneBase": {
                    "val": "9.313"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.658"
                },
                "CurrentYear": {
                    "val": "9.221"
                },
                "BudgetYearOne": {
                    "val": "9.353"
                },
                "BudgetYearOneBase": {
                    "val": "9.353"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.633"
                },
                "CurrentYear": {
                    "val": "0.001"
                },
                "BudgetYearOne": {
                    "val": "0.040"
                },
                "BudgetYearOneBase": {
                    "val": "0.040"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.633"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.001"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.040"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.040"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0933"
                    },
                    "ProjectTitle": {
                        "val": "Medical\/Dental Equipment Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.959"
                        },
                        "PriorYear": {
                            "val": "9.108"
                        },
                        "CurrentYear": {
                            "val": "9.221"
                        },
                        "BudgetYearOne": {
                            "val": "9.353"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.353"
                        },
                        "BudgetYearTwo": {
                            "val": "9.613"
                        },
                        "BudgetYearThree": {
                            "val": "9.813"
                        },
                        "BudgetYearFour": {
                            "val": "9.998"
                        },
                        "BudgetYearFive": {
                            "val": "10.195"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The purpose of this program is to develop biomedical equipment and related techniques to reduce morbidity; to enhance the logistic feasibility of modern medical care for combat casualties; to sustain casualties for evacuation to fixed medical facilities for definitive care; and to ensure that personnel are medically qualified for military duty.   Each work unit undertaken in this project has a military requirement. Efforts are justified based upon military payoff and cost benefit. There is a strong potential for dual use, technology transfer, and biotechnology firms\/industry participation in the projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical\/Dental Equipment Dev"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.108"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued support of ongoing clinical trial effort to test, for safety and efficacy, a militarily relevant malaria vaccine regimen utilizing a promising vaccine candidate. Initiate validation of Current Good Manufacturing Practices (CGMP) support for vaccine production scale up and development of advanced vaccine production in support of Phase III clinical trials.\n-Continued field user evaluation and validation of Individual Fatigue-Based Scheduling and Countermeasure System that predicts, detects, and prevents or mitigates fatigue during periods of high risk. Individualized performance risk will be predicted and prevented by providing individual fatigue optimized schedules and mitigation strategies for the operating forces.\n-Continue fatigue mitigation and validation of scheduling tools to include validation of an alternative watchstanding schedule on Naval Surface Combatants in support of an individualized fatigue-mitigated scheduling.\n-Continued controlled efficacy study of an intradermal vaccine to an experimental challenge model of Enterotoxigenic Escherichia coli (ETEC). Completed analysis of third clinical trial cohort.\n-Continued development of transitioned Future Naval Capability Program (FNC) products and other efforts for massive hemorrhage control; and completed cerebral perfusion pressure management initiative.\n-Continued Naval Expeditionary Health Service Support. Primary focus includes: 1) Support of shore based and afloat Capabilities-Based Military Treatment Facility consistent with medical mission module evolving concepts; and 2) Enhancing casualty treatment capabilities while reducing the overall logistics burden.\n-Continued joint development projects with MARCORSYSCOM acquisition for medical products and equipment, to include completion of test and evaluation following improved ruggedization of the Mobile Oxygen Ventilation and External Suction (MOVES) Superior Life-Saving Capabilities (SLC) Portable Life Support System.\n-Completing initiative to validate an Electroencephalographic (EEG) system for transition to the clinical settings at the Naval Medical Center, San Diego and to the other Computer Assisted Rehabilitation Environment (CAREN) systems within the Department of Defense.\n-Initiated Authorized Medical Allowance List (AMAL) and Authorized Dental Allowance List (ADAL) design for medical mission module in support of Humanitarian Assistance and Disaster Relief (HADR) mission.\n-Completed integration efforts in wound closure and improvement of diagnostic measures in an Osseo-integration device."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.221"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to augment efforts with the ongoing clinical trial effort to test, for safety and efficacy, a militarily relevant malaria vaccine regimen utilizing a promising vaccine candidate. Continue with validation of manufacturing support for vaccine production scale up.\n-Continue utilization validation of Individual Fatigue-Based Scheduling and Countermeasure System that predicts, prevents, detects, and mitigates periods of high risk associated with fatigue. Individualized performance risk will be predicted and prevented by providing individual fatigue optimized schedules and mitigation strategies.\n-Continue fatigue mitigation and validation of scheduling tools to include validation of an alternative watchstanding schedule on Naval Surface Combatants in support of an individualized fatigue-mitigated scheduling.\n-Continue development of transitioned FNC products and technologies for management and control of moderate to severe hemorrhage.\n-Continue Naval Expeditionary Health Service Support efforts. Primary focus includes: 1) Enhancing casualty treatment capabilities while reducing the overall logistics burden; 2) Continue the extended distances and time considerations; and 3) Continue Enroute care, patient transport and trauma care systems associated with the time distance continuum in a sea base environment.\n-Continue joint development projects with MARCORSYSCOM acquisition for medical products and equipment.\n-Complete Authorized Medical Allowance List (AMAL) and Authorized Dental Allowance List (ADAL) design for medical mission module in support of Humanitarian Assistance and Disaster Relief (HADR) mission and transition to MSC and Fleet Forces.\n-Initiate support of phage therapy to combat antibiotic resistant bacterial infections: 1) Initiate Phase I\/II clinical trials; 2) Coordinate Clinical Research Organization (CRO) over site and management of clinical data; and 3) Initiate scale-up and commercialization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to augment efforts with the ongoing clinical trial effort to test, for safety and efficacy, a militarily relevant malaria vaccine regimen utilizing a promising vaccine candidate. Continue with validation of manufacturing support for vaccine production scale up.\n-Continue utilization validation of Individual Fatigue-Based Scheduling and Countermeasure System that predicts, prevents, detects, and mitigates periods of high risk associated with fatigue. Individualized performance risk will be predicted and prevented by providing individual fatigue optimized schedules and mitigation strategies.\n-Continue fatigue mitigation and validation of scheduling tools to include validation of an alternative watchstanding schedule on Naval Surface Combatants in support of an individualized fatigue-mitigated scheduling.\n-Continue development of transitioned Future Naval Capability Program (FNC) and other products for management and control of moderate to severe hemorrhage.\n-Continue Naval Expeditionary Health Service Support. Primary focus includes: 1) Enhancing casualty treatment capabilities while reducing the overall logistics burden; 2) Completion of the extended distances and time considerations; and 3) Continue Enroute care, patient transport and trauma care systems associated with the time distance continuum in a sea base environment.\n-Continue joint development projects with MARCORSYSCOM acquisition for medical products and equipment.\n-Continue to support phage therapy to combat antibiotic resistant bacterial infections."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy for product lines and products in the Medical Development Program is designed and implemented consistent with the purpose of the particular product and with the nature and size of the investment. The Medical Development Program has a Memorandum of Agreement with the Marine Corps Systems Command (Family of Field Medical Equipment) for co-development of products for procurement by the USMC.  The acquisition strategy for products involves direct partnership with the acquisition and procurement professionals at Marine Corps Systems Command.  \n\nThe major Product Areas in the Medical Development Program are:  1) Equipment, 2) Pharmaceuticals\/Biologics, and 3) Operational Knowledge\/Concepts. The primary Program Areas of Interest are in: 1) Naval Expeditionary Health Services Support (Navy in Terrestrial, Maritime Surface, Submarine, & Aviation Operations), 2) USMC in Expeditionary Operations and 3) Products for battlefield treatment and en route care of Combat Casualties & Combat Trauma, focusing on delivery of care within the seabase and the littoral environment. \n\nFor Product Areas 1 and 2, there are two primary acquisition strategies. The first is to test and evaluate for Naval application commercially-developed medical product or candidates in managed trials with the ultimate goal of Food and Drug Administration (FDA) approval. Partnerships with commercial developers promotes developing products of military interest for procurement by the Operating Forces. A second benefit of this strategy is that products are made available across the DoD, Federal Government, and commercial market, thus reducing overall procurement costs. During development, DoD end users are included in the process to the extent possible.  The second strategy is to drive a collaborative development process with larger DoD program investments. Navy and Marine Corps needs can be met at lower service cost. This process involves developing in-house or industrial prototypes in government-managed programs to meet Naval needs while meeting regulatory requirements for production and fielding.  Both tactics promote development of procurement plans that align product availability with Service integration strategies. \n\nThe Third Product Area (Knowledge\/Concepts) is focused on the introduction of technologies, techniques, and procedures that enhance medical practice and standards of care for effective delivery of health care and casualty care in the Naval operating environment.  These primarily require early involvement of the senior leadership of military medicine, in that the end product of the program is modification of concepts of operations, policy, and\/or doctrine.  While these are often much smaller investments, they can have a substantial impact on the care of Sailors and Marines; Medical Development Program examples include Navy\/USMC Medical Planning Requirement Assessments."
                        },
                        "PerformanceMetrics": {
                            "val": "Successful completion of Milestones\/Demonstration Events for individualized project\/product roadmap, on time and on budget.  Ensuring dependencies across multiple efforts are maintained on schedule are primary metrics."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "101.276"
                        },
                        "PriorYear": {
                            "val": "15.550"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "116.826"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "None"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Adds"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Military Dental Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.895"
                                        },
                                        "Text": {
                                            "val": "Continue efforts in cranio-facial injury surveillance; combat dentistry; treatment of maxillofacial injury; dental disease non-battle injuries; oral\/facial disease and infection in military personnel."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wound Care Research (transferred from Defense Health Program)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.655"
                                        },
                                        "Text": {
                                            "val": "Continue to develop novel diagnostics and treatments to enhance the care of the wounded warfighter."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "None"
                        },
                        "PerformanceMetrics": {
                            "val": "Not required for Congressional adds."
                        }
                    }
                }
            ]
        }
    }
}