{
    "id": "2018-DefenseLogisticsAgency-PB-0400-MJBOOK-0-3-098212f3abb250f23e5fa42591c94c4328a6a93ca6a251dc354a1358630db0b8-1",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603680S"
        },
        "ProgramElementTitle": {
            "val": "Manufacturing Technology Program (ManTech)"
        },
        "R1LineNumber": {
            "val": "49"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "31.259"
            },
            "BudgetYearOne": {
                "val": "40.511"
            },
            "BudgetYearOneBase": {
                "val": "40.511"
            },
            "BudgetYearTwo": {
                "val": "39.658"
            },
            "BudgetYearThree": {
                "val": "39.638"
            },
            "BudgetYearFour": {
                "val": "40.113"
            },
            "BudgetYearFive": {
                "val": "40.837"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency (DLA) Manufacturing Technology (ManTech) Program supports the development of a responsive, world-class manufacturing capability to affordably meet the warfighters’ needs throughout the defense system life cycle.  IP ManTech: Provides the crucial link between invention and product application to speed technology transitions.  The program matures and validates emerging manufacturing technologies to support low-risk implementation in industry and Department of Defense (DoD) facilities, e.g. depots and shipyards.  It addresses production issues early by providing timely solutions, thereby reducing risk and positively impacting system life cycle affordability by providing solutions to manufacturing problems before they occur.  \n\nBeginning in FY 16 DLA ManTech was realigned into three Strategic Focus Areas (SFA): 1) Improving Industrial base Manufacturing Processes; 2) Maintaining Viable Sources of Supply; and 3) Improving Technical and Logistics Information.  \n•\tThe Improving Industrial Base Manufacturing Processes SFA includes efforts to reduce industrial base material costs and production lead-times, while improving the quality of DLA managed products. This SFA subsumed the former supply chain oriented efforts in  Subsistence Network (formerly Combat Rations Network for Technology Implementation), Procurement Readiness Optimization—Advanced Casting Technology (PRO-ACT), Procurement Readiness Optimization—Forging Advance System Technology (PRO-FAST), and Battery Network (BATTNET). New manufacturing processes within the scope of this SFA include emerging technologies such as Additive Manufacturing.  \n•\tMaintaining Viable Supply Sources includes efforts to assure the commercial industrial base can satisfy DLA materiel requirements. This SFA subsumed the Material Acquisition Electronics ManTech efforts.  In the future it will include other DLA efforts to maintain a viable industrial capability in areas such as Strategic Materials. \n•\tThe Improving Technical and Logistics Information SFA include efforts to improve and facilitate the exchange of engineering and logistics information among DLA industry partners and customers. It includes the MANTECH program Military Uniform System Technology (MUST) (formerly Customer Driven Uniform Manufacturing) and the Defense Logistics Information Research Program from P.E. 0603712S.  A primary focus of this SFA is to capitalize on the emerging “Model Based Enterprise” paradigm and the semantic web as an enabler to a logistics system that is smart and connected.    \n\nOver the FY 18- FY 22 Planning Period, funds were realigned within the ManTech PE, from the DLA Log R&D PE (0603712S) and DLA Procurement Defense-Wide Fund.  These funds will address critical shortfalls in the Improving Industrial Base Manufacturing Processes and Maintaining Viable Supply Sources.  The largest requirement was in the Maintaining Viable Supply Sources to develop a long-term, reliable source of linear microcircuits.  These devices are critical to maintaining the readiness of front line weapon system electronics.  High priority requirements in the Improving Industrial Base Manufacturing Processes SFA included additional funding for battery technology, castings and forging manufacturing technology."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "31.259"
                },
                "BudgetYearOne": {
                    "val": "36.483"
                },
                "BudgetYearOneBase": {
                    "val": "36.483"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "31.259"
                },
                "BudgetYearOne": {
                    "val": "40.511"
                },
                "BudgetYearOneBase": {
                    "val": "40.511"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.028"
                },
                "BudgetYearOneBase": {
                    "val": "4.028"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Internal Funds Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.023"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.023"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Pay Increase Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.005"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.005"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "MANTECH was realigned from BA 07 to BA 03 in FY 2017.\n\nA full-year FY 2017 appropriation for this account was not enacted at the time the budget was prepared; therefore, the budget assumes this account is operating under the Continuing Appropriations Resolution, 2017 (P.L. 114-254).  The amounts included for 2017 reflect the annualized level provided by the continuing resolution. BASE: FY17PB ($31.259M) + Request for Additional Appropriations ($0.000M)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "Improving Industrial Base Manufacturing Processes (formerly Material Availability)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "10.924"
                        },
                        "BudgetYearOne": {
                            "val": "16.227"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.227"
                        },
                        "BudgetYearTwo": {
                            "val": "16.251"
                        },
                        "BudgetYearThree": {
                            "val": "16.827"
                        },
                        "BudgetYearFour": {
                            "val": "16.675"
                        },
                        "BudgetYearFive": {
                            "val": "17.034"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Material Availability (MA) Strategic Focus Area (SFA) is an R&D effort undertaken with DLA’s industrial base to reduce material costs, reduce the length and variability of Production Lead-Times, assure the DLA managed products meet requirements, and continuously improve quality and reliability. Benefits of this SFA include lower material costs, lower inventory levels and more predictable Customer Wait Times, fewer quality deficiencies, and lower customer support costs.  This strategic focus area includes within its scope the Subsistence Network, the Battery Network, the Castings\/Forging Programs and Additive Manufacturing programs.  \n\nThe Battery network objective is to develop the next generation of battery manufacturing technologies for cost and price efficiency, longer shelf life, and lighter batteries with higher energy. BATTNET conducts R&D initiatives to address sustainment gaps and bridge technical solutions into higher MRLs for specific groups of batteries.  BATTNET also focuses on projects to develop the production capability for advanced lithium-based non-rechargeable and rechargeable batteries to ensure the prompt and sustained availability, quality, and affordability of batteries. Desired outcomes include: streamlined inventory and associated cost reductions through standardization and improved distribution practices; resolved obsolescence issues; addressed surge and sustainment issues; enhanced security of supply chain; increased competition and manufacturing base; reduced per unit battery cost; and leveraged Service-level (Army, Navy, Air Force) and other governmental (DOE, DOT, NASA) R&D efforts to insert new technology and practices into the existing DLA battery inventory.\n\nDLA is also conducting some short-term (FY17-FY18) manufacturing improvements in the Vacuum Electron Tube supply chain within this Budget Project. Electron tubes are still an essential product in Defense and National Security radar systems. included will be value-added studies and tests of alternative materials for tungsten wire and microwave quality glass to address obsolescence in these material supply chains.\n\nThe Subsistence Network (SUBNET) Program is a Manufacturing Technology Program and is the successor to the CORANET R&D program. SUBNET focuses on solutions to develop and promote manufacturing improvements in the subsistence supply chain. The program's expanded areas of interest includes: combat rations, food equipment, field feeding solutions, food footprint, food innovations, food safety and defense developments, garrison feeding, nutrition and health, storage and packing solutions, surge and sustainment support, and water security. SUBNET forms a community of practice with Military Services, U.S. Department of Agriculture, Natick Soldier Research Development, and Engineering Center; Academia, and Industry to research and promote manufacturing improvements in the Subsistence Supply Chain with the goals of maximizing capability and capacity to produce, and to encourage innovation and modernization needed to leverage the latest technologies. Desired outcomes include measures such as reduced cost, increased efficiencies, enhanced quality, and improved surge demand capabilities.\n\nThe Castings consortium objective is to develop new materials and technologies for the metalcasting industry to help DLA improve the supply of parts that contain castings. Weapon system spare parts managed by DLA that contain castings are responsible for a disproportionate share of DLA’s backorders or unfilled orders (UFOs).  Cast parts are ~2% of National Stock Numbered Class IX parts but represent ~5% of all backorders, and when only the oldest backorders are considered up to 10% are castings.  This program includes tasks to develop new capabilities in the areas of inspection, materials, processes, modeling, and design.  Once developed these capabilities will support the foundry industry, where the technologies will be tested and implemented in conjunction with the industry associations.  These advancements will improve the metalcasting supply chains for the DOD and the DLA to better support the warfighter.  This is achieved through investments in projects aimed at reducing lead-time, reducing cost, and improving quality of castings critical to DOD weapon systems.\n\nThe Forgings consortium objective is to develop new materials and technologies for the forging industry to help DLA improve the supply of parts that contain forgings.  Weapon system spare parts managed by DLA that contain Forgings are responsible for a disproportionate share of DLA’s backorders or unfilled orders (UFOs).  Forged parts are ~2% of National Stock Numbered Class IX parts but represent ~5% of all backorders, and when only the oldest backorders are considered up to 10% are forgings.  This program includes tasks to develop new capabilities in the areas of inspection, materials, processes, modeling, and design.  Once developed these capabilities will support the forging industry, where the technologies will be tested and implemented in conjunction with the industry associations.  These advancements will improve the forging supply chains for the DOD and the DLA to better support the warfighter.  This is achieved through investments in projects aimed at reducing lead-time, reducing cost, and improving quality of forgings critical to DOD weapon systems.\n\nThe Additive Manufacturing (AM) objective is to establish AM as an effective alternative to conventional manufacturing and document the process for AM benefits.  DLA needs to exploit AM technology as a lead-time and inventory reduction enabler."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Industrial Base Manufacturing Processes (formerly Material Availability)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.924"
                                            },
                                            "Text": {
                                                "val": "The Subsistence Network plan in FY17 is to expand to the broader subsistence network; having awarded the Broad Agency Announcement in 2016. DLA will work short term projects (STPs) with the community of practice partners of the military services, industry and academia.  SUBNET plans to improve process capabilities by identifying targets for product, automation and business operation changes, and implementing solutions in the Subsistence Supply Chain to produce such improvements as shorter lead times, higher throughput, reduced inventory and overhead cost, and improved quality. The STPs are required to have a business case, developed in advance to include specific metrics for success as well as return on investment where applicable to ensure that all SUBNET STPs are fully documented, all projects have the potential for implementation in industry; and all projects address a specific DoD\/DLA need.  \n\nThe Castings program will receive a significant increase in funding starting in FY17 to cover most of the unfunded requirements identified during the PBR 17 process. Projects identified will investigate, develop and deploy innovative enterprise and technical solutions to improve casting supply chains for the Department of Defense and the Defense Logistics Agency to support the warfighter.  Contracts will be competitively awarded in FY17.  Proposals are required to include a business case with specific metrics and transition plan for success.\n\nThe Forging program will receive an increase in funding to cover most of the unfunded requirements identified during the PBR17 process.  Proposals are required to include a business case with specific metrics and transition plan for success. The Forging consortium will also pursue additional forging manufacturing advances from successful DLA SBIR projects selected in FY2014.\n\nThe Battery Network funding will be applied to pursue additional projects including production readiness of lithium conformable soldier batteries, military ground vehicle batteries, and aviation batteries; manufacturing transition of legacy and obsolete lead acid and nickel cadmium batteries to advanced lithium-ion batteries; and battery manufacturing automation and optimization technologies. These projects will address pressing supply chain issues by migrating from declining manufacturing to a high growth industrial base, and will achieve cost reduction by optimizing the manufacturing design, assembly, and test processes.\n\nThe Additive Manufacturing plan is for DLA to partner with the Military Services to use AM to produce parts. DLA and the Services will identify candidate parts, convert technical data to 3D format to facilitate AM, procure the parts, and document the process for AM benefits. The Services will review newly created technical data packages (TDP), test the parts, and qualify AM as an acceptable process to produce the parts.\n\nFY 16 – FY 20: Funding for Additive projects will be reallocated from other MA SFA thrusts and classified into the Additive Manufacturing Thrust."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.227"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.227"
                                            },
                                            "Text": {
                                                "val": "The Battery Network will initiate new projects and continue efforts from FY17 for improving the production readiness, transition, and standardization of soldier and system batteries within the DLA supply chain. The Program will also leverage new battery manufacturing technologies for the supply chain that have been developed in SBIR - electrode laser cutting, solvent-free electrode production, low cost materials production or recycling, advanced performance cells. DLA will also complete the initial investments in manufacturing and material improvements for the vacuum electron tube supply base (used in microwave and radar systems) and pursue additional opportunities.\n\nThe Subsistence Network program plans to initiate and execute short-term projects in FY18, and continue efforts from FY17. SUBNET will also continue to pursue Small Business Innovation Research Topics in Subsistence. The Subsistence Network will also continue to work with community partners (military services, industry, and academia) to leverage the latest technologies, encourage innovation and modernization, and promote manufacturing improvements in the subsistence supply chain.\n\nThe Castings program plans to investigate, develop and deploy innovative enterprise and technical solutions to improve casting supply chains for the Department of Defense and the Defense Logistics Agency to support the warfighter. Contracts will be competitively awarded to fulfill those requirements. Projects will be required to include a business case with specific metrics and a transition plan for success. The Casting program will also continue executing projects approved and awarded in prior years. \n\nThe Forging program will also continue executing projects approved and awarded in prior years. In addition, the Forging program will receive an increase in funding to cover the unfunded requirements identified during the PBR17 process. Projects identified will investigate, develop and deploy innovative enterprise and technical solutions to improve casting supply chains for the Department of Defense and the Defense Logistics Agency to support the warfighter. Contracts will be competitively awarded to fulfill those requirements. Project will be required to include a business case with specific metrics and transition plan for success. The Forging program will also continue executing projects that are approved and awarded in FY17.\n\nDLA R&D plans to leverage Industry and the Military Service Engineering Support Activities (via Service-level agreements with the Army, Navy, Marine Corps, Air Force) and the Department of Energy by providing funding for AM work identified under the respective agreements. Desired outcomes include: acceleration of rapid qualification and certification methodologies for AM, identification of AM applications for castings and forging preforms, rapid cast production and repair of castings using AM, exploration of conversion of recyclable materials to AM material, improved reverse engineering processes for AM purposes, and optimization of metal AM production to obtain land, air and sea platform spare parts. These efforts seek to increase the number of AM parts qualified for procurement and achieve savings from the associated lead-time, storage costs, transportation costs, in some cases reduction of fuel consumption due to lighter design and material options. Overall AM efforts will provide alternatives in product realization in order to address unfulfilled Warfighter readiness needs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "Maintaining Viable Supply Sources (formerly High Quality Sources)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "16.923"
                        },
                        "BudgetYearOne": {
                            "val": "17.103"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.103"
                        },
                        "BudgetYearTwo": {
                            "val": "17.568"
                        },
                        "BudgetYearThree": {
                            "val": "18.010"
                        },
                        "BudgetYearFour": {
                            "val": "18.460"
                        },
                        "BudgetYearFive": {
                            "val": "18.886"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The High Quality Sources SFA are projects undertaken to assure that the industrial base can respond to DLA requirements and DLA can fill military customers’ material requirements reliably and consistently.  Benefits include eliminating cancelled requisitions returned to customers as “non-procurable.” This strategic focus area includes within its scope the former Material Acquisition Electronics program.  \n\nThe Material Acquisition Electronics roadmap has four major thrusts in Digital Microcircuits: Advanced Schottky TTL, TTL Compatible CMOS, 512 Kilobit RAM\/ROM and Mega Gate ASIC.  The Roadmap also includes a new major thrust area: Linear Microcircuits.  Over the past several years, obsolescence in this class of microcircuits has greatly increased and has become a significant concern.  These are classes of microcircuits that are expected to become non-procurable in FY 17 and beyond.  Without the technologies planned on the MAE Roadmap, DLA will not be able to support DoD’s requirements for high quality spare parts for critical electronic systems and subsystems.  \n\nStrategic Materials is a new area for the DLA Mantech program.  It is designed to ensure that critical strategic materials are available from domestic sources and that process innovations are in place to efficiently process or recover strategic materials. Domestic capabilities can enhance national security and potentially reduce Defense Stockpile requirements. Targeted requirements will be determined with DLA Strategic Materials."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maintaining Viable Supply Sources (formerly High Quality Sources)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.923"
                                            },
                                            "Text": {
                                                "val": "MAE will continue planning for the specific emulation technology implementations to support specific device family groups in consonance with Customer and Agency requirements. MAE will begin a major new thrust in emulation to address Linear Microcircuits in addition to its traditional focus on Digital.  Several efforts will address basic design, manufacturing, electrical test and quality\/reliability requirements for establishing a basis for product-oriented developments across the FYDP. MAE will also complete development and transition Advanced Schottky TTL Digital Microcircuit Emulation capability into full-scale production increasing DLA’s ability to re-establish sourcing of non-procurable microcircuit NSNs.  The newly transitioned emulation capabilities will address several discontinued device families and will increase the potential emulation production envelope by several hundred NSNs.  MAE will also continue development of additional emulation capabilities including TTL-Compatible CMOS. MAE will also initiate several new implementations including development of a 1 million gate Application-Specific Integrated Circuit (ASIC) and 512K Read-Only and Random-Access Memory Emulation Capabilities. It will complete prototyping 350 nanometer emulation circuitry, bringing emulation capability that re-establishes sources for additional NSNs.\n\nStrategic Materials: A request for white paper proposals was recently added to DLA’s Emerging R&D Requirements BAA for critical initial manufacturing technology requirements in domestic high strength carbon fibers.  Additional targeted requirements will be determined with DLA Strategic Materials.  Targeted requests for proposals will be conducted to address specific needs and opportunities to ensure that critical strategic materials are available from domestic sources and that process innovations are in place to efficiently produce strategic materials. Manufacturing technologies and capabilities are expected to transition to Title III or specific Weapon System Program funds for industrial base qualification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.103"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.103"
                                            },
                                            "Text": {
                                                "val": "MAE will continue planning for the specific emulation technology implementations to support specific device family groups in consonance with Customer and Agency requirements. MAE will continue a major new thrust in emulation to address Linear Microcircuits in addition to its traditional focus on Digital. Several efforts will address basic design, manufacturing, electrical test and quality\/reliability requirements for establishing a basis for product-oriented developments across the FYDP. MAE will also complete development and transition TTL-Compatible CMOS Microcircuit Emulation capability into full-scale production increasing DLA's ability to re-establish sourcing of non-procurable microcircuit NSNs. The newly transitioned emulation capabilities will address several discontinued device families and will increase the potential emulation production envelope by several hundred NSNs. MAE will also continue development of additional emulation capabilities including development of a 1 million gate Application-Specific Integration Circuit (ASIC) and 256K Read-Only and Random-Access Memory Emulation Capabilities. It will begin applying 350 nanometer emulation technology to specific part families for additional NSNs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9"
                    },
                    "ProjectTitle": {
                        "val": "Improving Technical and Logistics Information (formerly Industry and Customer Collaboration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.412"
                        },
                        "BudgetYearOne": {
                            "val": "7.181"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.181"
                        },
                        "BudgetYearTwo": {
                            "val": "5.839"
                        },
                        "BudgetYearThree": {
                            "val": "4.801"
                        },
                        "BudgetYearFour": {
                            "val": "4.978"
                        },
                        "BudgetYearFive": {
                            "val": "4.917"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Improving Technical and Logistics Information Strategic Focus Area (SFA) projects improve and facilitate the communication of technical and logistics information among industry, DLA’s military customers and DLA. This SFA includes Military Unique Sustainment Technology (MUST) and the Defense Logistics Information Research (DLIR) (P.E. 0603712S) within its scope. The movement of the DLIR related work from P.E. 0603712S to the DOD ManTech Program aligns the funding to the critical interface between DLA and industry and away from internal DLA operations.\n\nThe MUST focus addresses GAO Report 12-707 recommendations that DOD to establish a “knowledge-based approach” to collaborate on define and communicate of military unique requirements. DLA has the responsibility to communicate and manage the technical requirements among the Services and the Defense Industrial Base. Currently there is no common environment for collaborating on new requirements among the stakeholders. The strategic objective of the DLA MUST program is to identify, develop and adopt technologies that can significantly reduce the lead-time between Individual Item and Equipment (IIE) development and sustainment from years to months. The Program focuses on technologies that will transform the military IIE supply chain from an “electronic paper” (i.e. PDF\/MS Word) based, manual environment into a knowledge based automated environment. The resulting approach will be a neutral platform that will seamlessly communicate military unique technical requirements throughout the end to end supply chain.\n\nThe DLIR Model Based Enterprise effort will develop capabilities to systematically accept engineering and design data from the Military Services, validate and store item technical data in 3D models. There are two classes of data that must be addressed: newly designed parts for systems still in development and legacy parts for systems that are in sustainment. The problem with newly designed parts is capturing the complete and accurate designs. The legacy parts do not have digital engineering models which recreating the design in contemporary engineering systems.   \n\nThe Technical and Logistical Data Interoperability will pioneer methods to capture data from military Services, Original Equipment Manufacturers (OEMs), and suppliers to form a seamless thread of interoperable and linked data models.\n\nThe Emerging Manufacturing Technology program addresses emerging and out of cycle requirements that always occur as DLA strives to maintain readiness of the aging weapon systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Technical and Logistics Information (formerly Industry and Customer Collaboration"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.412"
                                            },
                                            "Text": {
                                                "val": "Continue the distributed pilots and begin transition of the technology into the supply chain.  Expand the number of companies participating in the pilots and validating the benefits of the knowledge based approach to IIE development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.181"
                                            },
                                            "Text": {
                                                "val": "MUST program will continue pilots, process reengineering and transition of the technology into the supply chain. Begin a schedule for implementations to be initiated in FY19.\n\nDLIR program will continue moving DLA from PDF Tech Data to Smart Data and Engineering Models and leveraging semantic technology to improve logistics data across the DLA Enterprise.\n\nEmerging Manufacturing Technologies addresses the opportunities to start new manufacturing technology developments that occur out of the budget cycle. It is a new start in FY18.  Having an Emerging Technologies line allows DLA to get a head start undertaking new technological advances without disrupting ongoing programs. In other programs DLA R&D has been able to cut 12 to 24 months off project start-up lead-times. Saving the startup lead-time allows the Agency to get advanced technology into the hands of the warfighter earlier that would otherwise be the case and begin to realize the benefits of implementing new technology sooner than would otherwise be the case. It also allows ongoing programs to maintain continuity of funding and activity. SBIR phase III efforts (which can't be funded with SBIR funds) are a prime example of activities that will be funded with these funds, examples include emerging battery technologies, and technologies to address strategic materials shortage\/risk."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "40% of applicable projects (ex. non-studies) will transition."
                        }
                    }
                }
            ]
        }
    }
}