{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-57",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605380A"
        },
        "ProgramElementTitle": {
            "val": "AMF Joint Tactical Radio System (JTRS)"
        },
        "R1LineNumber": {
            "val": "137"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.143"
            },
            "CurrentYear": {
                "val": "5.028"
            },
            "BudgetYearOne": {
                "val": "8.965"
            },
            "BudgetYearOneBase": {
                "val": "8.965"
            },
            "BudgetYearTwo": {
                "val": "44.938"
            },
            "BudgetYearThree": {
                "val": "25.140"
            },
            "BudgetYearFour": {
                "val": "9.018"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Prior to FY 2014, the Airborne Maritime\/Fixed Station (AMF) Joint Tactical Radio System (JTRS) was funded under Navy PE 0604280N, aligned under the Navy JTRS Programs.  In accordance with a July 11, 2012 Acquisition Decision Memorandum (ADM), the JTRS Program of Record transitioned to a Military Department-managed program.  AMF is now managed by Program Executive Office Command, Control and Communications-Tactical, under Project Manager Tactical Radios, and funded by Army PE 0605380A.  On May 2, 2014, the Milestone Decision Authority (MDA), Under Secretary of Defense for Acquisition, Technology, and Logistics (USD AT&L), issued an ADM that designated Small Airborne Link 16 Terminal (SALT) and Small Airborne Networking Radio (SANR) as subprograms under the AMF Program.  In FY 2015, Project EA9 represented the total Airborne Maritime Fixed Small Airborne (AMF-SA, or SALT) RDT&E budget.  In FY 2016, funding was allocated between the SALT (Project EA9) and SANR (Project EG6) subprograms.\n\nOn August 31, 2015, the SALT MDA issued an ADM tasking an orderly close out of the SALT subprogram (Project EA9).  SALT subprogram close out was completed during FY 2016.  Only the SANR subprogram (Project EG6) will be funded in FY 2017 and beyond under AMF JTRS."
        },
        "ProgramElementMissionDescription": {
            "val": "The AMF radios are software programmable, multi-band, multi-mode, mobile ad hoc networking radios, providing simultaneous voice and data communications for Army Aviation platforms.  The radios will operate in networks supporting the Common Operating Picture, Situational Awareness, and interoperability of Mission Command systems throughout the battlefield.  AMF radios will ensure the Soldier's ability to communicate both horizontally and vertically via voice and data within all mission areas and Common Operating Environment.  AMF radios will operate waveforms that are deployed by Joint Forces today, and will introduce networking waveforms to the Aviation community that will enable interoperability between air and ground forces and transport operational and Mission Command information through the tactical network.  AMF radios will help close capability gaps by extending data networking to company and below echelons, enabling network services to the platform and connecting Army Aviation platforms to Army ground and Joint air network domains. \n\nPer MDA direction, the AMF Program will procure radios as Non-Developmental Items.  The MDA, USD AT&L, signed the Acquisition Program Baseline along with an ADM in May of 2014, which identified SALT (Project EA9) and SANR (Project EG6) as subprograms.\n\nOn August 31, 2015, the SALT MDA issued an ADM tasking an orderly close out of the SALT subprogram (Project EA9).  SALT subprogram close out was completed during FY 2016.\n\nTotal FY 2018 RDTE funding is $8.965 million, all of which is allocated to SANR (Project EG6).  This provides funding necessary to continue and complete source selection activities in support of contract award and continuing development of documentation to support Milestone C."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.455"
                },
                "CurrentYear": {
                    "val": "5.028"
                },
                "BudgetYearOne": {
                    "val": "35.927"
                },
                "BudgetYearOneBase": {
                    "val": "35.927"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.143"
                },
                "CurrentYear": {
                    "val": "5.028"
                },
                "BudgetYearOne": {
                    "val": "8.965"
                },
                "BudgetYearOneBase": {
                    "val": "8.965"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.312"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-26.962"
                },
                "BudgetYearOneBase": {
                    "val": "-26.962"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.312"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-26.962"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-26.962"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 program funding was reduced by 26.962 million given contract award is now planned for 2QFY19."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EA9"
                    },
                    "ProjectTitle": {
                        "val": "Airborne Maritime Fixed - Small Airborne (AMF-SA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.113"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.113"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Prior to FY 2014, the Airborne Maritime\/Fixed Station (AMF) Joint Tactical Radio System (JTRS) was funded under Navy PE 0604280N, aligned under the Navy JTRS Programs.  In accordance with a July 11, 2012 Acquisition Decision Memorandum (ADM), the JTRS Program of Record transitioned to a Military Department-managed program.  AMF is now managed by Program Executive Office Command, Control and Communications-Tactical, under Project Manager Tactical Radios, and funded by Army PE 0605380A.  On May 2, 2014, the Milestone Decision Authority (MDA), Under Secretary of Defense for Acquisition, Technology, and Logistics, issued an ADM that designated Small Airborne Link 16 Terminal (SALT) and Small Airborne Networking Radio (SANR) as subprograms under the AMF Program.  In FY 2015, Project EA9 represented the total Airborne Maritime Fixed Small Airborne (AMF-SA, or SALT) RDT&E budget.  In FY 2016, funding was allocated between the SALT (Project EA9) and SANR (Project EG6) subprograms."
                        },
                        "ProjectMissionDescription": {
                            "val": "On August 31, 2015, the SALT MDA issued an ADM tasking an orderly close out of the SALT subprogram.  The SALT subprogram was closed out during FY 2016."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airborne Maritime Fixed Small Airborne (AMF-SA)."
                                    },
                                    "Description": {
                                        "val": "Airborne Maritime Fixed Small Airborne (AMF-SA)\nSmall Airborne Link 16 Terminal (SALT)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.113"
                                            },
                                            "Text": {
                                                "val": "FY 2016 funded PMO Support and System Engineering support.  The SALT subprogram was closed out during FY 2016."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B90902"
                                    },
                                    "Title": {
                                        "val": "Airborne Maritime Fixed - Small Airborne (AMF-SA)"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "SALT subprogram close out was completed during FY 2016."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EG6"
                    },
                    "ProjectTitle": {
                        "val": "Small Airborne Networking Radio (SANR)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.030"
                        },
                        "CurrentYear": {
                            "val": "5.028"
                        },
                        "BudgetYearOne": {
                            "val": "8.965"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.965"
                        },
                        "BudgetYearTwo": {
                            "val": "44.938"
                        },
                        "BudgetYearThree": {
                            "val": "25.140"
                        },
                        "BudgetYearFour": {
                            "val": "9.018"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Prior to FY 2014, the Airborne Maritime\/Fixed Station (AMF) Joint Tactical Radio System (JTRS) was funded under Navy PE 0604280N, aligned under the Navy JTRS Programs. In accordance with a July 11, 2012 Acquisition Decision Memorandum (ADM), the JTRS Program of Record transitioned to a Military Department-managed program. AMF is now managed by Program Executive Office Command, Control and Communications-Tactical, under Project Manager Tactical Radios, and funded by Army PE 0605380A. On May 2, 2014, the Milestone Decision Authority (MDA), Under Secretary of Defense for Acquisition, Technology, and Logistics, issued an ADM that designated Small Airborne Link 16 Terminal (SALT) and Small Airborne Networking Radio (SANR) as subprograms under the AMF Program. In FY 2015, Project EA9 represented the total Airborne Maritime Fixed Small Airborne (AMF-SA, or SALT) RDT&E budget. In FY 2016, funding was allocated between the SALT (Project EA9) and SANR (Project EG6) subprograms.\n\nOnly the SANR subprogram (Project EG6) will be funded in FY 2017 and beyond under AMF JTRS."
                        },
                        "ProjectMissionDescription": {
                            "val": "Per MDA direction, AMF JTRS will procure SANR radios as Non-Developmental Items (NDI).  The SANR is a two-channel, software-defined, National Security Agency Type 1 certified networking radio providing seamless real-time information for operation in mobile and dynamic combat environments that will meet tactical communications requirements as validated by the Army Aviation community.  SANR will provide increased data throughput to Army Aviation platforms via the Soldier Radio Waveform (SRW) and Wideband Networking Waveform (WNW) capabilities, and maintain Single Channel Ground and Airborne Radio System (SINCGARS) capability.  SANR will replace the current SINCGARS radios on Army Aviation platforms.  SANR is planned for implementation on the following platforms: Apache (AH-64E), Black Hawk (UH-60V, UH-60M, HH-60M, and MH-60M), Chinook (CH-47F and MH-47G), and Gray Eagle Unmanned Aircraft System (MQ-1C) aircraft.  SANR will enhance and further enable the ability of the maneuver commander to integrate and synchronize aviation forces with land based operational forces. SANR, employed on Army aviation platforms, will enable aviation combat elements (Combat Aviation Brigades, Theater Aviation Brigades, and Special Operations Aviation Regiment) to better utilize the inherent versatility of airborne communications as a complement to the unique capabilities of the other combat arms.  SANR will give commanders enhanced Situational Awareness and Mission Command in a package that provides a more responsive means of directing aircraft to match changing maneuver forces situations and missions.\n\nFY 2018 provides funding necessary to continue and complete source selection activities in support of contract award and continue development of documentation to support Milestone C."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Small Airborne Networking Radio (SANR)"
                                    },
                                    "Description": {
                                        "val": "Small Airborne Networking Radio (SANR)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.030"
                                            },
                                            "Text": {
                                                "val": "With FY 2016 funding, the SANR subprogram resumed acquisition activities.  The program conducted Market Research; revised the Acquisition Strategy, Capability Production Document (CPD) and associated required documentation; developed and released a Draft Request for Proposal and conducted source selection planning.  The program also planned and resourced a demonstration at the Army Warfighting Assessment 17.1, in accordance with a May 2014 Acquisition Decision Memorandum."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.028"
                                            },
                                            "Text": {
                                                "val": "With FY 2017 funding, the program will continue and complete Acquisition Strategy and Capability Production Document (CPD) revision and staffing, develop documentation to support release of the Request for Proposal, and conduct planning for source selection activities in support of contract award."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.965"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.965"
                                            },
                                            "Text": {
                                                "val": "With FY 2018 funding, the program will continue and complete source selection activities, except for final peer reviews, in support of contract award.  SANR source selection efforts include evaluation of proposals (document review), test article integration and test execution for each offeror (source selection testing), and evaluation of other selection factors.  The program will also continue to develop documentation to support Milestone C."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B90904"
                                    },
                                    "Title": {
                                        "val": "JTRS (AMF) Small Airborne Networking Radio (SANR)"
                                    },
                                    "Funding": {
                                        "BudgetYearThree": {
                                            "val": "65.560"
                                        },
                                        "BudgetYearFour": {
                                            "val": "74.649"
                                        },
                                        "BudgetYearFive": {
                                            "val": "85.048"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The SANR acquisition strategy is to procure small airborne networking radios for the Apache, Blackhawk, Chinook, and Gray Eagle aircraft. SANR will be capable of operating the SRW, WNW, and SINCGARS waveforms.  SANR will replace Army Aviation platform SINCGARS ARC-201D radios.  The SANR acquisition strategy employs full and open competition using an NDI procurement approach that leverages prior industry and Government investment in software-defined radios. The strategy supports a concept in which NDI radios can be selected from a qualified vendor that meet the AMF SANR CPD requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}