{
    "id": "2018-Army-PB-2040-JBOOK-6496f983e90d3a98760d6d2aa09bce01c6733fe7e60bc4ee6b3adbaad3baa8ce-14",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603313A"
        },
        "ProgramElementTitle": {
            "val": "Missile and Rocket Advanced Technology"
        },
        "R1LineNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "102.490"
            },
            "CurrentYear": {
                "val": "52.190"
            },
            "BudgetYearOne": {
                "val": "62.850"
            },
            "BudgetYearOneBase": {
                "val": "62.850"
            },
            "BudgetYearTwo": {
                "val": "64.396"
            },
            "BudgetYearThree": {
                "val": "59.304"
            },
            "BudgetYearFour": {
                "val": "58.254"
            },
            "BudgetYearFive": {
                "val": "54.877"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures, fabricates, and demonstrates advanced rocket, missile, interceptor, and guided munition technologies to enhance weapon system lethality, survivability, agility, deployability, and affordability. Project 206 develops high fidelity simulations for advanced tactical missiles and interceptors. Project 263 demonstrates missile and interceptor systems with capabilities to provide protection against rockets, artillery, and mortars; provide precision weapons for small units in close combat; provide precision long-range fires; and provide minimum smoke propulsion for aviation missiles. Project 704 demonstrates the capability to detect and track rocket, artillery, mortar, and unmanned air vehicles threats. Project NA6 is a congressional increase project.\n \nWork in this PE is complimentary to PE 0602303A (Missile Technology) and is fully coordinated with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603003A (Aviation Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), PE 0603270A (Electronic Warfare Technology), PE 0603734A (Combat Engineering Systems), and PE 0708045A (Manufacturing Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.   \n \nWork in this PE is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC) located at Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "104.449"
                },
                "CurrentYear": {
                    "val": "52.190"
                },
                "BudgetYearOne": {
                    "val": "58.142"
                },
                "BudgetYearOneBase": {
                    "val": "58.142"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "102.490"
                },
                "CurrentYear": {
                    "val": "52.190"
                },
                "BudgetYearOne": {
                    "val": "62.850"
                },
                "BudgetYearOneBase": {
                    "val": "62.850"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.959"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.708"
                },
                "BudgetYearOneBase": {
                    "val": "4.708"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.959"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "4.700"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.700"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.008"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.008"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "206"
                    },
                    "ProjectTitle": {
                        "val": "Missile Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.662"
                        },
                        "CurrentYear": {
                            "val": "2.435"
                        },
                        "BudgetYearOne": {
                            "val": "2.476"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.476"
                        },
                        "BudgetYearTwo": {
                            "val": "2.490"
                        },
                        "BudgetYearThree": {
                            "val": "2.576"
                        },
                        "BudgetYearFour": {
                            "val": "2.626"
                        },
                        "BudgetYearFive": {
                            "val": "2.681"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced modeling and simulation technologies for missile design and analysis. Evaluation of missile technology by means of modeling and simulation provides a cost-effective method that supports missile maturation throughout the weapon system life cycle. This effort permits a reduction in the number of flight tests required for programs of record as well as improves the confidence of flight test readiness and probability of flight test success.  \n\nThis Project support efforts in the Army Science and Technology Lethality portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this Project is performed by the Aviation and Missile Research, Development, and Engineering Center, (AMRDEC) Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Simulation"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced analysis and high fidelity modeling and simulation technologies for advanced missiles and interceptor design and analysis. Evaluation of missile technology through modeling and simulation provides a cost-effective method to support missile maturation throughout the weapon system life cycle. This effort shortens component design timelines, reduces integration activities, enables a reduction of flight tests required for programs of record and improves the confidence of flight test readiness and the probability of flight test success."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.662"
                                            },
                                            "Text": {
                                                "val": "Matured radio frequency (RF) scene generation algorithms and continued hardware\/software integration into hardware-in-the-loop to support testing of advanced millimeter wave radar sensors. Matured a modeling and simulation environment to significantly reduce seeker algorithm design and development timelines. Refined and validated missile life-cycle cost analysis model against existing life-cycle cost information, optimized for use during the science and technology (S&T) phase of technology development to design in cost saving features. Designed and began development of a testbed to explore advanced network integration techniques for emerging air and missile defense weapons reducing hardware integration costs and improving weapons pairing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.435"
                                            },
                                            "Text": {
                                                "val": "Will complete the maturation and demonstration of a modeling and simulation environment to significantly reduce seeker algorithm design and development timelines; complete the maturation of RF scene generation algorithms and continue hardware\/software integration into hardware-in-the-loop to support testing of advanced millimeter wave radar sensors; develop novel methods to address deficiencies in Electro-Optical\/Infrared (EO\/IR) real-time high-bandwidth sensor stimulation for Hardware in the loop, which will meet future needs of large format & high bandwidth\/high fidelity sensor systems; and will continue development of a testbed to explore advanced network integration techniques for emerging air and missile defense weapons reducing hardware integration costs and improving weapons pairing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.476"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.476"
                                            },
                                            "Text": {
                                                "val": "Mature the distributed architecture test bed for air defense weapon behavior exploration; provide a fast running model for use in fragmentation warhead design, insensitive munitions design, and lethality analysis; mature novel methods to address deficiencies in EO\/IR real-time high-bandwidth sensor stimulation for Hardware in the loop; improve modeling and simulation capability to give more accurate lethality credit from blast effects and lower the cost of smaller missile systems; improve algorithms for forecasting air and missile tactical threat maneuvers, improve the missile threat maneuver forecaster, and mature algorithms for engagement tailoring and predicted intercept point (pip) management; mature cost-estimating tools for propulsion systems, software, modular systems, and for converting commercial off-the-shelf cost to military off-the-shelf cost ."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "263"
                    },
                    "ProjectTitle": {
                        "val": "Future Msl Tech Integr(FMTI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.480"
                        },
                        "CurrentYear": {
                            "val": "23.282"
                        },
                        "BudgetYearOne": {
                            "val": "34.725"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.725"
                        },
                        "BudgetYearTwo": {
                            "val": "39.224"
                        },
                        "BudgetYearThree": {
                            "val": "30.177"
                        },
                        "BudgetYearFour": {
                            "val": "31.334"
                        },
                        "BudgetYearFive": {
                            "val": "38.668"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures, fabricates, and demonstrates advanced missile and interceptor technologies, such as seekers, guidance and controls, propulsion, and airframes. The project goal is to reduce the life-cycle costs and cost per kill of precision guided missiles and interceptors. \n\nThis Project support efforts in the Army Science and Technology Lethality and Ground Maneuver portfolios.\n\nThis Project matures technologies from Program Element (PE) 0602303A and directly supports systems managed by the Program Executive Officer for Missiles and Space. Work in this Project is in collaboration with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technologies), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology) and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this Project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Tactical Extended Range Missile"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on maturation, fabrication, and demonstration of technologies for low-cost precision fires missile capable of deep strike engagements. The aim is to provide extended range and expanded target set capability through advanced propulsion, new payload technology, and maintain effectiveness in Global Positioning System (GPS) challenged environments through new and novel navigation technologies. This effort supports the Army need for developing capability enablers in the area of Extended Range Precision Fires."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.255"
                                            },
                                            "Text": {
                                                "val": "Completed simulation trade studies determining subsystem requirements for delivery of enhanced lethal effects to long range targets; matured multi-functional payload technologies to service the broad threat set of targets with one warhead; matured and performed preliminary testing of advanced propulsion technologies that provide low cost energy management to enhance kinematic performance for long range precision fires; matured navigation technologies for GPS challenged environments in order to enhance the precision of long range precision fires in denied environments; designed and fabricated control actuation system hardware, developed navigation algorithms and performed structural analysis for tail controlled long range rockets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.962"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and update the long range fires missile system simulation to reflect the emerging navigation, propulsion, and payload technologies. This system simulation is used to assess improved missile performance provided by these technologies and guide their continued development; continue to refine navigation system concept designs that leverage emerging navigation technologies being developed under PE 0602303A; and continue development and maturation of novel motor technology for long range precision fires - complete preliminary design, conduct design review, and originate static motor testing to assess performance for extended range missile capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.538"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.538"
                                            },
                                            "Text": {
                                                "val": "Will continue to mature and validate the long range fires missile systems simulation to reflect the emerging navigation, propulsion, and payload technologies. This system simulation will be used to assess improved missile performance provided by these technologies and guide their continued development; continue to mature navigation system concept designs that provide alternate precision navigation solutions to GPS that leverage emerging navigation technologies; conduct preliminary design review of candidate technologies; perform lab and bench evaluations; assess system integration and performance evaluations through advanced simulation; continue to develop technologies to increase range to include motor technologies for long range precision fires and light-weight, thermally-protected airframe structures; conduct static motor testing to assess extended range performance; and perform modeling and simulation analysis of advanced materials for thermal management techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection System Interceptor Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates modular hard-kill Active Protection System (APS) technologies with the Hit Avoidance Architecture and APS Common Controller and matures modeling and simulation for system integration and demonstration. Specifically the hardkill APS portion and modeling and simulation efforts will be addressed by the United States (U.S.) Army Aviation and Missile Research, Development and Engineering Center (AMRDEC). This effort supports the Army's APS program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. This effort supports the development of an APS Common Architecture enabling adaptable APS solutions that can be integrated across Army vehicle platforms as required. This effort compliments work being accomplished under PE 0602601A\/Project C05, PE 0602618A\/Project H80, PE 0603004A\/Project 232, PE 0603005A\/Project 221, and PE 0603270A\/Project K16."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.765"
                                            },
                                            "Text": {
                                                "val": "Advanced APS modeling and simulation to configure and evaluate subsystem integration on physical and virtual demonstrator platforms; evaluated mature, hard-kill countermeasure subsystems for adaption to the Modular Active Protection System (MAPS) controller, through the common architecture, allowing hardware integration with a physical demonstrator combat vehicle platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.250"
                                            },
                                            "Text": {
                                                "val": "Continue analysis of APS-countermeasure and fire control sensor alternatives with modeling and simulation; continue maturation and adaptation of a hard-kill countermeasure and fire control sensor in support of developing improved survivability equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.250"
                                            },
                                            "Text": {
                                                "val": "Will improve modeling and simulation of APS countermeasure and fire control sensor alternatives; continue maturation and adaptation of a hard-kill countermeasure and fire control sensor to improve performance of survivability equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Extended Range Precision Missile Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, fabrication, integration, hardware-in-the-loop (HWIL) test, and flight demonstration of technology for an affordable discriminate extended range precision missile to include critical component technologies such as advanced propulsion, seekers, fire control, datalink, guidance and controls, and maneuverable airframes. Critical subsystem technology development transitions to 0603313A\/263 Low Cost Extended Range Missile and 0603313A\/704 Low Cost Extended Range Air Defense and to future fire support efforts for further maturation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.493"
                                            },
                                            "Text": {
                                                "val": "Completed trade studies determining system and subsystems requirements for an affordable discriminate extended range precision missile; advanced development of system-level modeling and simulation to mature and evaluate concepts for system performance predictions; matured key critical subsystem technologies in support of identified system requirements such as propulsion and navigation; matured maneuverable airframe guidance and controls algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.024"
                                            },
                                            "Text": {
                                                "val": "Continue to advance development of system-level modeling and simulation to mature and evaluate concepts for system performance predictions; continue to mature key critical subsystem technologies in support of identified system requirements, and begin to integrate subsystems and perform laboratory evaluations and testing in relevant environments to inform requirements for further maturation of concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.149"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.149"
                                            },
                                            "Text": {
                                                "val": "Will provide high fidelity simulations to improve lethal effects for maritime targets, seeker technology for terminal homing, a datalink for in-flight target updates using system-level trade studies; perform system level integration activities as the subcomponent technologies mature, and will begin integration of an Anti-Radiation Homing (ARH) capability into Guided Multiple Launch Rocket System (GMLRS) airframe. Critical system level attributes will include: target detection, target acquisition, target classification, target tracking, target aim point selection, trajectory management, thermal characterization and lethality assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Close Combat Weapons Technology"
                                    },
                                    "Description": {
                                        "val": "This effort addresses close combat weapon systems technology to include seeker, navigation and materials technology to enable a lightweight command launch unit for the man-portable Javelin weapon system, and system trade studies, and technology maturation and demonstration for a next generation close combat precision missile system for dismounted and mounted maneuver. This effort is coordinated with PE 0602709A\/Night Vision Technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.967"
                                            },
                                            "Text": {
                                                "val": "Finalized fabrication, integration, and testing of reduced weight, advanced composite housing including foam components for Javelin Light Weight Command Launch Unit (LW CLU); fabricated, integrated, and tested an inertial navigation sensor with increased accuracy to include on-the-move capabilities (both targeting and navigation) and reduced size, weight, and power (SWaP) to provide precision for far target location; fabricated, integrated, and tested a target acquisition sensor for the Javelin LW CLU increasing target acquisition range and reducing SWaP; performed system-level trade studies to identify critical technology needs such as seekers, propulsion and guidance for a next generation close combat missile system; matured key technologies for a next generation close combat missile system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.046"
                                            },
                                            "Text": {
                                                "val": "Investigate and evaluate current system capabilities that support emerging requirements for close combat missile systems; perform detailed system designs and effectiveness analyses to shape critical component development that enable increased performance while ensuring affordability for future expeditionary and maneuvering capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.788"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.788"
                                            },
                                            "Text": {
                                                "val": "Will  mature detailed system designs of critical propulsion and warhead components within severe constraints of size, weight, and power, and improve modeling and simulation of man-portable squad\/vehicle crew weapons with fire from enclosure capability, overwhelming precision, and firefight-ending lethality; improve components and flight demonstrate a precision maneuverable missile in a relevant environment; provide an application-based fire control unit for reduced operator load; provide an affordable advanced imaging sensor and advanced autotracker features for increased precision; and provide a datalink for increase range and security, and provide a power system that increases endurance and decreases maintenance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "704"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Missile Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.348"
                        },
                        "CurrentYear": {
                            "val": "26.473"
                        },
                        "BudgetYearOne": {
                            "val": "25.649"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.649"
                        },
                        "BudgetYearTwo": {
                            "val": "22.682"
                        },
                        "BudgetYearThree": {
                            "val": "26.551"
                        },
                        "BudgetYearFour": {
                            "val": "24.294"
                        },
                        "BudgetYearFive": {
                            "val": "13.528"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures advanced missile system concepts and related hardware to enhance weapon system lethality, survivability, agility, versatility, deployability, and affordability for defense against future air and ground, armored and non-armored threats.    \n \nThis Project support efforts in the Army Science and Technology Lethality portfolio.\n\nWork in this Project is in collaboration with Program element (PE) 0602624A (Weapons and Munitions Technologies).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this Project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Counter Rockets, Artillery, Mortars (RAM), Unmanned Aerial Systems (UAS), and Cruise Missile Tracking and Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates system technology to provide 360 degree, near hemispherical coverage for tracking and intercept of RAM, UAS, and\/or Cruise Missile threats. This effort determines the trajectory and location of the incoming RAM, UAS, and\/or Cruise Missile threats and feeds that information to the technical fire control node to generate a firing solution provided to the guidance section of each of the missile interceptors. These efforts will be evaluated through Hardware-in-the-Loop (HWIL) tests and multiple interceptor flights. The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.968"
                                            },
                                            "Text": {
                                                "val": "Tested and refined autopilot algorithms of the active Hit-to-Kill (HTK) interceptor to provide protection against incoming RAM threats that can take target location updates from any applicable fire control sensor; refined and verified aerodynamic performance predictions; and updated the HTK system simulation used for system performance prediction and analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.038"
                                            },
                                            "Text": {
                                                "val": "Develop a surrogate demonstration launcher; begin integration of digital data link technology and ground station components; and begin integration of inertial and network alignment technology; continue to coordinate integration of a mobile multi-purpose detect, decide, and defeat expeditionary technology; and continue to mature software algorithms and perform platform integration of cueing and tracking sensor capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.497"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.497"
                                            },
                                            "Text": {
                                                "val": "Will provide a surrogate demonstration launcher with integrated digital data link and inertial and network alignment technology and ground station components, and demonstrate its missile launch functionality through flight testing in a relevant environment; improve the integration of multi-mission radar input and detect data into a common tactical air picture and focused energy weapon cueing and fire control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-cost Extended Range Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort matures key technologies of a lower-cost interceptor system with a low- to medium-altitude, medium- to long-range capability. This effort will enable lower cost interceptor integration into a net-enabled Air and Missile Defense Task Force for the protection of high value assets. Technologies will address the defeat of air defense threats such as UAS and Cruise Missile threats with secondary capabilities against Large Caliber Rockets (LCR), Short Range Ballistic Missiles (SRBM), and Tactical Air-to-Surface Missiles (TASMS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.535"
                                            },
                                            "Text": {
                                                "val": "Completed design and began static testing of solid rocket motor; completed target generator for hardware-in-the-loop calibration and testing of active radar seeker, guidance electronics, and control system; completed wind tunnel testing and aerodynamic analysis of interceptor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.184"
                                            },
                                            "Text": {
                                                "val": "Continue component development and maturation for low-cost air defense interceptor system; complete static testing and evaluation of solid rocket motor design; continue development of secure digital data link, flight termination system, and control actuation system; complete development, fabrication, and integration of guidance electronics unit (GEU); and begin subsystem test and evaluation; complete hardware-in-the-loop simulation tools and apparatus required to test interceptor navigation instrumentation, data link components, and control system technologies; and evaluate navigation instruments for eventual flight demonstration testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.882"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.882"
                                            },
                                            "Text": {
                                                "val": "Will mature the low-cost air defense interceptor system with integrated solid rocket motor, digital data link, mission computer, power system, and flight termination system and demonstrate in ballistic flight testing; provide system analysis via hardware-in-the-loop flight simulation of the digital data link, mission computer, power system, navigation system, and control actuation system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seeker and Guidance Technology for Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, integration, and fabrication of seeker and guidance technologies supporting air defense missile systems. Technologies addressed enable the defeat of multiple air defense threats such as Rockets, Artillery, and Mortars, UAS, and Cruise Missile threats with secondary capabilities against LCR, SRBM, and TASMS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.845"
                                            },
                                            "Text": {
                                                "val": "Matured active seeker for the Hit-to-Kill interceptor for utilization against RAM threats in the Counter RAM, UAS, and Cruise Missile Tracking and Fire Control effort; matured low-cost active radio frequency (RF) seeker detailed design and begin fabrication and testing of seeker sub-systems for low-cost extended range air defense interceptor; continued maturation of guidance algorithms and navigation technology to support low-cost extended range air defense interceptor; matured low-cost extended range air defense interceptor hardware-in-the-loop simulation and software integration facilities for calibration and testing of active RF seekers, guidance electronics units, and control systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.601"
                                            },
                                            "Text": {
                                                "val": "Will complete development and fabrication of low-cost air defense interceptor seeker and integrate with guidance electronics unit in software integration facility for calibration and testing on flight motion simulator HWIL; continue maturation of guidance algorithms, and navigation technology implementation for accurate mid-course and terminal homing guidance at extended ranges; begin calibration, test, and evaluation of integrated subsystems on flight motion simulator in HWIL."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.267"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.267"
                                            },
                                            "Text": {
                                                "val": "Demonstrate active RF seeker in hardware-in-the-loop flight simulation with GEU and in field testing in a relevant environment; continue maturation of guidance algorithms for accurate mid-course and terminal homing guidance at extended ranges; provide flight control scripts for testing the speed, accuracy, and stability of the flight control system for use in future flight testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Role Missile Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation, fabrication, integration, HWIL development and test, and flight demonstration of critical technology that supports an open systems architecture to enable modular designs of guided and unguided missiles for smaller and lighter missile options with multi-role engagement capabilities reducing the life cycle cost for missiles.  Critical component technologies include advanced propulsion, payload (lethal and non-lethal), seekers, fire control, datalink, guidance and controls, and maneuverable airframes.  This effort matures and demonstrates technology from PE 0602303A, Multi-Role Missile Technology."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.650"
                                            },
                                            "Text": {
                                                "val": "Will continue maturation of component technology development from PE 0602303A (Multi-Role Missile Technology), perform laboratory testing and simulation evaluations; integrate modular missile technology subsystem; and perform ground launched, unguided\/ballistic flight test to verify mechanical and electrical integrity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.003"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.003"
                                            },
                                            "Text": {
                                                "val": "Demonstrate in a ground-launched flight test the guidance and control performance of the guided forward firing configuration and continue maturation of the component technology of the drop\/glide configuration from PE 602303A (Multi-Role Missile Technology) which includes seeker, payload, guidance electronics unit, control actuation subsystem, propulsion subsystem, and subsystem interface bus."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NA6"
                    },
                    "ProjectTitle": {
                        "val": "Missile and Rocket Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "55.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Missile and Rocket advanced technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "55.000"
                                        },
                                        "Text": {
                                            "val": "Program increase for missile and rocket advanced technology development"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}