{
    "id": "2018-Army-PB-2040-JBOOK-6496f983e90d3a98760d6d2aa09bce01c6733fe7e60bc4ee6b3adbaad3baa8ce-23",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603794A"
        },
        "ProgramElementTitle": {
            "val": "C3 Advanced Technology"
        },
        "R1LineNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "36.339"
            },
            "CurrentYear": {
                "val": "35.775"
            },
            "BudgetYearOne": {
                "val": "33.426"
            },
            "BudgetYearOneBase": {
                "val": "33.426"
            },
            "BudgetYearTwo": {
                "val": "28.795"
            },
            "BudgetYearThree": {
                "val": "34.369"
            },
            "BudgetYearFour": {
                "val": "38.451"
            },
            "BudgetYearFive": {
                "val": "38.321"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates technologies to address the integrated tactical communications challenge with distributed, secure, mobile, wireless, and self-organizing communications networks and networked transceivers that must operate reliably in diverse and complex terrains and environments. Efforts demonstrate seamlessly integrated communications and information security technologies across all network tiers, ranging from unattended networks and sensors, through maneuver elements using airborne and space assets. Project EL4 matures and integrates antennas, wireless networking devices, protocols, and software; network operations tools and techniques; and combines these with current fielded networks and systems in a series of command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) network modernization demonstrations to measure their technology readiness levels (TRLs) (up to TRL6) and assess them against currently fielded network architectures in an operationally relevant environment. Project EL5 matures information security devices, techniques, services, software and algorithms to protect tactical wired and wireless networks against modern network attacks; generates and distributes tactical cyber situational awareness; and focuses on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions.\n\nWork in this PE complements PE 0602782A (Command, Control, Communications Technology), and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602783A (Computer and Software Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603270A (Electronic Warfare Technology) and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.816"
                },
                "CurrentYear": {
                    "val": "35.775"
                },
                "BudgetYearOne": {
                    "val": "36.880"
                },
                "BudgetYearOneBase": {
                    "val": "36.880"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "36.339"
                },
                "CurrentYear": {
                    "val": "35.775"
                },
                "BudgetYearOne": {
                    "val": "33.426"
                },
                "BudgetYearOneBase": {
                    "val": "33.426"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.477"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.454"
                },
                "BudgetYearOneBase": {
                    "val": "-3.454"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.477"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.046"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.046"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EL4"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Comms and Networking Technology Int"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.319"
                        },
                        "CurrentYear": {
                            "val": "19.769"
                        },
                        "BudgetYearOne": {
                            "val": "17.346"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.346"
                        },
                        "BudgetYearTwo": {
                            "val": "13.343"
                        },
                        "BudgetYearThree": {
                            "val": "18.430"
                        },
                        "BudgetYearFour": {
                            "val": "20.927"
                        },
                        "BudgetYearFive": {
                            "val": "21.397"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Efforts in this Project were transferred from Program Element (PE) 0603008A Project TR1 beginning in Fiscal Year (FY) 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates key communications and mobile networking technologies, such as antennas, transceivers, transceiver components, networking software and novel techniques to provide secure, reliable, mobile network solutions that function in complex and diverse terrains. This project concentrates on four major goals: to provide a series of technology demonstrations of new and emerging command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) technology enabled capabilities to significantly reduce risk associated with the network-of-networks concept; to lower the size, weight, power and cost of wireless networking systems deployed on Army platforms through hardware and software convergence; to provide critical improvements in the ability to communicate and move large amounts of information in radio frequency (RF) contested environments, in a seamless, integrated manner across the Army's highly mobile manned and unmanned force structure; and to assess the technology readiness level (TRL) of emerging network technologies in an operationally relevant environment. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antenna and Hardware Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates low cost, power efficient communications and electronic warfare (EW) antenna technologies for terrestrial and tactical satellite ground terminals. The focus is to reduce the visual signature and cost of antennas and the number of antennas required on platforms by proving the capability to transmit and receive on multiple frequency bands. This effort also matures small form factor interference mitigation hardware for compatibility between communications and EW systems.  Work accomplished under PE 0602782A\/Project H92 complements this effort. In FY18 a majority of these efforts, along with several efforts currently under Communications Networking Technologies, are reported under a new thrust area entitled “Networking to Improve Maneuver and Expeditionary Operations” in order to better focus related and evolving technologies. A few of the efforts herein are reported under  another new thrust area entitled “Uninterrupted Communications”."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.908"
                                            },
                                            "Text": {
                                                "val": "Performed extensive assessments and demonstrated distributed on-the-move satellite communications (SATCOM) antenna arrays, using both live vehicles traversing test tracks and a sophisticated motion table that emulates the test track motions and other worst case scenarios; finalized a Government standard architecture for distributed SATCOM arrays to enable interoperability between various transceivers and antenna arrays; and developed and matured small form factor RF interference mitigation hardware for compatibility between EW and communications systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.995"
                                            },
                                            "Text": {
                                                "val": "Will develop and release for comment, to industry and other Government partners, a Government standard architecture for distributed SATCOM arrays to enable interoperability between various transceivers and antenna arrays; will fabricate a demonstrator of a digital intermediate frequency (digital IF) common hardware SATCOM terminal to facilitate flexibility and performance improvements, such as porting of SATCOM waveforms to the digital IF terminal."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Interoperability Through Convergence"
                                    },
                                    "Description": {
                                        "val": "This effort designs transceiver hardware and software standards and proof of concept that will reduce size, weight, power and cost of multiple communications and EW systems on tactical platforms.  The standard and proof of concept demonstration takes advantage of common components within the communications and EW systems to define the internal and external interfaces to communications and EW devices. The effort includes implementing and publishing a reference architecture and associated specifications for a modular, open systems approach for integrating military communications and EW devices. Work being accomplished under PE 0603270A\/Project K16 complements this effort. In FY18 this effort is reported under a new thrust area entitled “Networking to Improve Maneuver and Expeditionary Operations” in order to better focus related and evolving technology developments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.320"
                                            },
                                            "Text": {
                                                "val": "Completed the maturation of the radio reference architecture, specification and application program interfaces sufficient to begin detailed design discussions about radio component design and configurations with potential commercial suppliers as well as Military platform developers for integration into their vehicles; continued to expand the reference architecture to include EW systems, and codify in the form of electronics chassis, backplane, wiring, power, mounting, RF, control and topology specification (the A-kit); and provided a more realistic demonstration, moving from a lab table-top environment to a demonstrator vehicle mock-up, possibly using an actual vehicle, and with an expanded demonstration of the radio modules, antennas, filters, switches and radio components (the B-kit)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.144"
                                            },
                                            "Text": {
                                                "val": "Will leverage the radio reference architecture, specification and application program interfaces to begin software application development with commercial suppliers; begin in-house Army development of more sensitive application scenarios, such as applications that leverage coordinated control of communications and EW hardware resources to eliminate interference; mature reference architecture for RF hardware\/software convergence, addressing distribution of RF components across the vehicle; implement Vehicle Integration for Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) \/EW Interoperability (VICTORY) authentication and authorization component types into the RF hardware\/software convergence architecture; mature VICTORY compliant algorithms and complete development of a VICTORY compatible RF switch to direct RF signals between components, such as software defined radios, power amplifiers and antennas, based on radio provided information and other on-platform systems; provide a more realistic RF convergence demonstration, moving from a laboratory vehicle mock-up to an actual demonstrator vehicle, and with an expanded set of C4ISR applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling C4ISR Infrastructure, (formerly called C4ISR On the Move (OTM))"
                                    },
                                    "Description": {
                                        "val": "This effort provides a venue for the demonstration of new and emerging C4ISR technologies. This venue performs field based risk reduction (FBRR) and technology readiness assessments (TRAs) by evaluating the TRLs of candidate Army science and technology (S&T) and best of Industry efforts to support tactical network modernization. The yearly themes for the integrated capabilities event are determined by the maturity of the tech base programs across the Army S&T command, control, communications and intelligence (C3I) portfolio. On an annual basis, those programs at or approaching TRL 6 will be solicited for participation based on their maturity to enter TRA in the FBRR environment located at Joint Base McGuire-Dix-Lakehurst (JB-MDL) (Fort Dix). Upon the completion of technology selection, themes will be developed that inform Army S&T, CERDEC Thrust Areas, Army Warfighting Challenges, Training and Doctrine Command (TRADOC) key technology imperatives, and the overall development of the Mission Command Network of 2025 and beyond."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.501"
                                            },
                                            "Text": {
                                                "val": "Assessed and demonstrated early Operation-Intelligence network convergence concepts in a real field environment using a mix of S&T, Programs Of Record (PORs) and industry offerings to provide early performance feedback to S&T and PORs that rely upon robust tactical networks; applied field based risk reduction techniques to the integration of new S&T technologies as well as adapted\/adopted the best industry products to provide rigorously evaluated demonstrator systems for Soldier assessment; assessed new S&T systems and provided data to determine the appropriate TRL to inform PORs preparing to transition these technologies to assure leadership has the right information to make critical acquisition decisions and provided technical risk reduction to assure that any issues are identified early enough to be corrected before formal testing; and evaluated both Mission Command and Actionable Intelligence S&T products from a performance perspective and validated their TRLs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.849"
                                            },
                                            "Text": {
                                                "val": "Will assess, mature, and demonstrate early operations-intelligence network convergence concepts in a real field environment, provide early performance feedback to S&T programs that require robust tactical networks; apply FBRR techniques to the integration of new technologies developed by Army S&T as well as adapting\/adopting the best commercial products to provide rigorously evaluated systems for soldier assessment; assess and validate the performance of new S&T systems and provide data to determine the appropriate TRL to assure that leadership has the right information to make critical acquisition decisions; serve as a precursor event for S&T efforts that will later participate in Network Integration Evaluations to assure that problems are identified early enough to be corrected before further assessment.  This is in compliance with the Government Accountability Office recommendation for FBRR, citing that money can be saved by doing more \"early\" up front work to reduce risk, which is consistent with the mission of the C4ISR OTM effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.631"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.631"
                                            },
                                            "Text": {
                                                "val": "Will provide event-driven FBRR demonstrations at Joint Base McGuire-Dix-Lakehurst (JB-MDL), NJ; provide early performance feedback to S&T efforts that require robust tactical networks; serve as a precursor event for S&T efforts that will later participate in Network Integration Evaluations to assure that problems are identified early enough to be corrected before further assessment; conduct several events in a Cyber Blitz campaign of learning, teaming with TRADOC, operational units, Program Executive Officer and Project Manager partners in an operationally relevant setting to inform cyber doctrine and requirements and investment decisions as well as demonstrate the technical and operational value of Army cyber S&T capabilities (e.g., Tactical Public Key Infrastructure, Cyber Electromagnetic Activities Situational Awareness Tactical Analytics Framework Science and Technology Objective, cyber analytics, and cyber framework); conduct an Uninterrupted Communications event (i.e., resilient in a contested and congensted environment), exercising advanced directional networking technologies, communications in a global positioning system (GPS)-denied environment, interference management technologies for integrated electronic warfare\/communications systems, and other related technologies; and conduct an integrated Networking to Improve Maneuver\/Expeditionary event (i.e. communications technologies that improve capability while on the move), exercising cellular-enabled communications, Intra-Soldier Wireless, and software-defined network technologies at the tactical edge, and other related technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communication Networking Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates components, software, algorithms and services that enable Army tactical wireless networks to operate more efficiently in both the use of RF spectrum and network resources for terrestrial and SATCOM systems. Efforts also include adapting commercial wireless technology for use in the tactical environment. Work accomplished under PE 0602782A\/Project H92 and PE 0603794A\/Project EL5 complements this effort. In FY18 a majority of these efforts, along with several efforts currently under Antenna and Hardware Technologies, are now reported under a new thrust area entitled “Uninterrupted Communications” in order to better focus related and evolving technologies. A few of the efforts herein are now reported  under a new thrust area entitled “Networking to Improve Maneuver and Expeditionary Operations”."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.708"
                                            },
                                            "Text": {
                                                "val": "Investigated and matured tactical waveform protocols and architectures to support frequency hopping at timeslot boundaries using parameters chosen by the waveform software to improve radio network performance in a dynamic spectrum contested environment; continued to mature tactical multifunction waveform software, algorithms and techniques to optimize coordinated signal scheduling features that allow improved interoperability between RF functions such as communications and EW jamming; continued to mature and began implementation of suitable routing protocols to increase performance of the network; and developed and matured feasible approaches to enable networking in GPS-denied environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.781"
                                            },
                                            "Text": {
                                                "val": "Will mature technologies, such as directional networking, narrowband voice and position\/location information capability, for robust ground communications with efficient use of spectrum in a spectrum contested environment; develop and integrate tactical multifunction waveforms for terrestrial radios enabling coordinated C4ISR\/EW functions that provide improved interoperability between RF functions, robust performance and spectrum efficiency; develop and mature software tools that simulate tactical networking conditions (i.e., latency, delay, jamming, cosite interference) to provide a high fidelity network modeling and simulation environment that enables large-scale tactical network analysis and data collection in realistic operational scenarios."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networking Technologies for Wireless Personal Area Networks (WPAN)"
                                    },
                                    "Description": {
                                        "val": "This effort develops and matures WPAN technology for the Soldier in a manner approved by the National Security Agency (NSA) for up to Secret data traffic. This effort is coordinated with PE 0603001A\/Project J50. In FY18 this effort is reported under a new thrust area entitled “Networking to Improve Maneuver and Expeditionary Operations” in order to better focus related and evolving technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.882"
                                            },
                                            "Text": {
                                                "val": "Completed evaluations of WPAN system designs for performance, reliability and security; finalized specification and architecture development of WPAN hardware interfaces and software; informed WPAN standards for security and interface development; fabricated and coded several candidate WPAN designs; validated WPAN designs for electromagnetic compatibility, low probability of intercept and low probability of detection in the laboratory and RF chamber; and conducted field evaluations of selected design(s) on multiple Soldier Systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will mature and assess low cost small form factor Intra Soldier Wireless (ISW) personal communication system design for performance, reliability and security; implement hardware interfaces, software and standards for security for ISW communication systems; begin efforts to extend the ISW technologies to develop more efficient inter Soldier wireless capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networking to Improve Maneuver and Expeditionary Operations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies and capabilities to provide a range of robust, reliable, scalable, interoperable and resource efficient communications capabilities to expeditionary forces and troops on the move. These capabilities will allow forces to conduct early entry operations, develop situational understanding, and sustain operations while maintaining freedom of movement.  In FY18 this new trust area continues efforts formerly reported under RF Interoperability Through Convergence, Networking technologies for WPAN and the majority of efforts formerly reported under Antenna and Hardware Technologies, the remainder of which have moved to the new thrust area Uninterrupted Communications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.054"
                                            },
                                            "Text": {
                                                "val": "Will complete the design, coding and fabrication of an ISW personal area networking device providing a seamless, wireless capability to the dismounted Soldier in a tactical environment; complete the design for a cellular enabled communications capability that will overcome the current vulnerabilities and limitations of using commercial Long Term Evolution (LTE) cellular technology for tactical operations in an active adversarial RF environment; design a system to enhance the non-SATCOM beyond line of sight (troposcatter) capabilities in terms of expanded RF range, increased data range, robustness, stability, automated antenna alignment and setup; and complete an architecture design for a software defined network (SDN) in support of Army tactical edge networks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Uninterrupted Communications"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates components, software, algorithms and technologies that enable Army tactical wireless networks to operate more efficiently in congested, contested and competitive electromagnetic environments across a multi-domain architecture for mission success. The capabilities developed in this effort provide assured uninterrupted access to critical communications and information links. Efforts will result in robust, reliable and secure terrestrial and satellite communication networks in austere, congested and hostile electromagnetic environments using cost-effective solutions while ensuring that the capability is interoperable and resource efficient. Work accomplished under PE 0602782A\/Project H92 complements this effort.  In FY18 this new trust area continues efforts formerly reported under Communication Networking Technologies and a few of the efforts formerly reported under Antenna and Hardware Technologies, the remainder of which have moved to the new thrust area Networking to Improve Maneuver and Expeditionary Operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.661"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.661"
                                            },
                                            "Text": {
                                                "val": "Will mature advanced Satellite Communication signal processing techniques and algorithms to provide interference suppression for enterprise and tactical ground terminals; mature techniques to improve tactical radio communications by implementing interference cancellation algorithms to provide electronic protection from enemy and unintentional blue force interference; design and brassboard conformal antenna apertures for directional beamforming and integrate them with signal processing algorithms for beamforming to demonstrate them in a simulation environment; mature and demonstrate reduced size, weight, power and cost directional networking beam switching distributed antenna array and mast mounted antenna with network controller; mature modules and algorithms for Highband Networking Waveform version 3.0; mature and implement protocols and algorithms to improve robustness of LTE cellular based tactical communications systems; mature and implement a next generation robust narrowband waveform that operates in RF congested and contested environments; mature a multi-mission networking waveform framework to enable integrated cooperative communication, electronic warfare, position navigation and timing and signal intelligence functionalities; and implement spectrally efficient algorithms with low out-of-band emissions to support dense channel assignments, flexible resource allocation, variable data rate, anti-jam, and low probability of interception and low probability of detection capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EL5"
                    },
                    "ProjectTitle": {
                        "val": "Secure Tactical Information Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.020"
                        },
                        "CurrentYear": {
                            "val": "16.006"
                        },
                        "BudgetYearOne": {
                            "val": "16.080"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.080"
                        },
                        "BudgetYearTwo": {
                            "val": "15.452"
                        },
                        "BudgetYearThree": {
                            "val": "15.939"
                        },
                        "BudgetYearFour": {
                            "val": "17.524"
                        },
                        "BudgetYearFive": {
                            "val": "16.924"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Efforts in this Project were transferred from Program Element (PE) 0603008A\/Project TR2 beginning in Fiscal Year (FY) 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates software, algorithms and services that focus on tactical cyber and cyber electromagnetic activities (CEMA) situational awareness (SA)\/situational understanding (SU), autonomous network defense, cross domain security and encryption solutions to secure the Army's tactical network. Efforts focus on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions. This Project codes, optimizes, and demonstrates software based technologies for intrusion detection, high assurance internet protocol (IP) encryption, seamless communications across security boundaries, as well as information sharing across operations and intelligence functions. These capabilities to automate, protect, monitor, report and access cyber elements of the tactical network are intended to greatly reduce Soldier burden and protect the Army's tactical network by building upon enterprise solutions from commercial, Department of Defense, Department of the Army and other government agencies. This Project cumulatively builds science and technology capabilities in accordance with Army Cyber Material Development Strategy and the Office of the Secretary of Defense Cyber Community of Interest.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Communications Electronics Research Development and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Defensive Cyber"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that create new methods for proactively defending resource constrained tactical wireless networks against cyber-attack using nontraditional methodologies. Work being performed under PE 0602782\/Project H92, PE 0602783\/Project Y10 and PE 0603794A\/Project EL4 complement this effort. Work being accomplished in this effort is fully coordinated with the Army Research Lab Cyber Security Collaborative Research Alliance, PE 0601104A\/Project EA6. In FY18 a majority of these efforts will be organized under a thrust entitled “Cyber \/CEMA Operations, Tactical Cyber Resilient Architectures & Platforms” in order to better focus related and evolving technology developments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.020"
                                            },
                                            "Text": {
                                                "val": "Integrated and matured software to provide a holistic cyber situational awareness picture offering actionable information for the Brigade network assurance team to quickly and accurately assess the cyber battle space, detect\/defend against known cyber weapons being employed against United States (U.S.) Military assets, and enable network adaptation to ensure commander intent can be exercised in theater; designed, fabricated, coded and matured a reprogrammable logic single chip cryptographic engine which includes anti-tamper and security boundary technology (both information security functions and crypto engine) and complies with the National Security Agency (NSA) Crypto Modernization Initiative and the Key Management Infrastructure Program of Record; assessed, developed and matured novel network attack\/defense behavior models for tactical radio routing; matured and integrated novel tactical radio cyber behavior sensors to provide cyber situational awareness for military radio networks; performed analysis of current satellite communications (SATCOM) systems to determine the optimal integration path to achieve protected SATCOM architectures that will support protection methods aimed at hardening the modulation methods, software coding and component redundancy used in SATCOM systems; matured and optimized precision polarization concepts to optimize communications system security by employing multiple communications paths and bandwidth expansion techniques; performed modeling, simulation and emulation of network systems to assess performance in contested environments; and designed and developed security for network protocols."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.006"
                                            },
                                            "Text": {
                                                "val": "Will integrate and mature software tools tailored for the disadvantaged, intermittent and latent (DIL) tactical networking conditions that are sanctioned by NSA to increase software assurance posture while reducing time and cost of delivering secure software products to the tactical warfighter; integrate and mature robust software solutions to identify, prevent and protect role-based tactical systems from insider threats and malicious behaviors and actions; mature threat modeling to predict where and how attackers may react to a network maneuver, integrate and mature software tools and a framework to easily identify vulnerabilities during development and integration with third party software to detect potential vulnerabilities prior to the software being used on Army networks, implement and mature a software based encryption for low\/no size, weight, and power (SWaP) encryption on Army use devices, implement and mature anomaly detection modules to integrate sensors into tactical servers that currently do not support Host Based System Security to complement existing signature based protection capabilities to minimizing impact of zero day attacks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber\/CEMA Operations, CEMA Situational Awareness\/Understanding (formerly titled Cyber Electromagnetic Activity (CEMA) Situational Awareness (SA))"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates software and algorithms that facilitate actionable decision making through mission critical CEMA information knowledge and by applying analysis and judgment to relevant information to help determine the relationships among the operational and mission variables across cyberspace."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Will mature software that employs techniques for data sharing and collaboration between offensive and defensive cyber operations and across security boundaries to enable advanced warning of threats and coordinated defensive and offensive cyber response; develop and mature an integrated suite of analytic algorithms and software tools for blue\/gray\/red CEMA situation awareness; mature and optimize Defensive Cyber Operations (DCO) analytic algorithms and software tools to identify and correlate threats and attacks against Army tactical systems and networks; mature architectural specifications and interfaces for interconnection of cyber sensors, data management and visualization software capabilities, and analysis to inform ongoing DCO SA doctrinal and requirement generation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.004"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.004"
                                            },
                                            "Text": {
                                                "val": "Will code and mature secure data transfer algorithms to efficiently move defensive cyber sensor data across tactical networks for incorporation into common data stores; mature and integrate efficient analytic capabilities to tailor analysis for cyber SA visualization; mature correlation algorithms to fuse defensive cyber, spectrum management, offensive cyber, and Department of Defense Information Network (DoDIN) Operations data to enable brigade combat team (BCT) analysts to perform hunt operations for cyber actors in an incident response friendly environment; mature spectrum and DoDIN operations awareness algorithms to support CEMA domain information fusion and course of action development; mature models and algorithms to reason on adversary intent and predict next action; and mature and implement cyber analysis algorithms to improve SA\/SU of cyber threats and their impacts to mission success for all CEMA elements (electronic warfare (EW), cyber and spectrum management) and allow actionable decisions and enable self-defending qualities within Army networks that can absorb, deflect, evade, and deceive adversarial cyber actions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Public Key Infrastructure (PKI) and Cryptography"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates PKI and cryptographic technologies tailored for the tactical environment. Work being performed under PE  0602782\/Project H92 and PE 0602783\/Project Y10 complement this effort. In FY18 these efforts will be organized under a thrust entitled “Cyber \/CEMA Operations, Trusted Networks” in order to better focus related and evolving technology developments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will develop software to provide Soldiers the ability to automate, monitor, manage, validate and implement public key infrastructure in tactical networks; integrate and mature software based encryption techniques sanctioned by NSA that are tailored for the DIL tactical networking conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber \/CEMA Operations, Tactical Cyber Resilient Architectures & Platforms"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates software, architectures and frameworks to allow systems and networks to withstand cyber-attacks, sustain or recover critical functions, and dynamically reshape cyber systems as conditions\/goals change to escape harm."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.070"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.070"
                                            },
                                            "Text": {
                                                "val": "Will mature, integrate and demonstrate virtual containers on blue force networks to protect mission command applications and prevent the spread of malicious cyber effects and block and restrict the spread of malware within tactical mission command applications; mature, code and fabricate a NSA Type 1 certifiable anti-tamper, reprogrammable cryptographic engine with integrated information security (INFOSEC) functions; mature capabilities to map cyber threats to mission impact to provide traceability between intruder actions and BCT networks, systems, and applications; mature and code algorithms to secure tactical SATCOM against cyber-attacks; mature and integrate tactical radio wide band networking waveform anomalous behavior detection techniques into tactical radio waveforms; mature and integrate anomalous behavior and insider threat detection techniques and algorithms into tactical radio waveforms; design and mature an integrated security architecture that supports convergence across the intelligence, network operations, cyber, electronic warfare operations, fires, and information operations functions within a tactical Command Post; code and mature cyber behavior monitoring algorithms and models for anomalous cyber behavior detection across Soldier Radio Waveform (SRW) and Wideband networking Waveform (WNW) tactical radio networks; and mature a security architecture to support diversity and protection for tactical SATCOM to improve resistance to cyber-attacks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber\/CEMA Operations, Trusted Self Defending Networks & Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates software, architectures and frameworks to support establishment of a known degree of assurance that devices, networks and cyber dependent functions perform as expected, despite attack or error and allow the Warfighter to maintain confidence in network information, resources, and identities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.006"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.006"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate derived virtual identity token and robust wearable non-intrusive tattooed token (removable tattoo worn on the Soldier’s skin) to eliminate physical hardware tokens for secure authentication to tactical networks; mature a tactical identity and access control management capability and techniques supporting both physical and virtual tokens; mature and demonstrate physical and behavioral biometric algorithms to detect and identify malicious insider threat actors and activities; mature robust two factor (i.e. token plus password, password plus biometric, etc.) identity and network access capabilities; mature common tactical public key infrastructure architecture for certificate validation service and token lifecycle management functions (i.e. issue tokens, revoke tokens, reset personal identification number for tokens) and non-person (e.g. computer, router, sensor and etc.) entity lifecycle management capability; and mature data provenance algorithms to track information flows and maintain assured pedigree."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}