{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c43fbf6cbb750060d4e843075183a8e999b0dddb3a2f8fae77d834880adb92d8-58",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305304D8Z"
        },
        "ProgramElementTitle": {
            "val": "DoD Enterprise Energy Information Management (EEIM)"
        },
        "R1LineNumber": {
            "val": "136"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "10.196"
            },
            "PriorYear": {
                "val": "4.289"
            },
            "CurrentYear": {
                "val": "2.703"
            },
            "BudgetYearOne": {
                "val": "3.669"
            },
            "BudgetYearOneBase": {
                "val": "3.669"
            },
            "BudgetYearTwo": {
                "val": "3.584"
            },
            "BudgetYearThree": {
                "val": "3.372"
            },
            "BudgetYearFour": {
                "val": "3.443"
            },
            "BudgetYearFive": {
                "val": "3.516"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "PE 0305304D8Z was established in FY2013 and plays a pivotal role in the Department’s ability to achieve audit readiness, enhance the Department’s goal of energy efficiency, gain a full accountability of Real Property assets, as well as improve data quality and integration across the full spectrum of EI&E business functions.  The PE helped conduct a full Business Process Re-engineering of the processes used to collect energy information, and publishing an EEIM data standard and a additional effort to build out data stores and portal requirements for Energy Conservation Investment Program (ECIP) management.  Funding is also used to support ASD EI&E Senior Real Property Officer accountability requirements by supporting management and oversight of reconciliation efforts and auditability by determining requirements for the department's Real Property inventory records and asset management processes, business rules and associated data standards.  A major component of this capability is an enterprise EI&E Data Analytics & Integration Support (DAIS) platform coupled with a independent verification & validation capability. With access to real time data through services WSDLS, reports generated through business intelligence provide immediate indicators driving improved and quicker decisions.\n\nIn 2015, it was determined that the current state of cyber security of energy-related (and other real property-related) control systems (such as the electronic\/computer controls on heating, ventilation & air conditioning equipment) is deficient, and a $1,000,000 increase in FY2016 funding was allocated above the EEIM baseline to support a multi-year real property-related control systems cyber security initiative."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.406"
                },
                "CurrentYear": {
                    "val": "2.703"
                },
                "BudgetYearOne": {
                    "val": "4.536"
                },
                "BudgetYearOneBase": {
                    "val": "4.536"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.289"
                },
                "CurrentYear": {
                    "val": "2.703"
                },
                "BudgetYearOne": {
                    "val": "3.669"
                },
                "BudgetYearOneBase": {
                    "val": "3.669"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.117"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.867"
                },
                "BudgetYearOneBase": {
                    "val": "-0.867"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.117"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Service Requirement Review Board (SRRB)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.025"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.025"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Management Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.817"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.817"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "DTIC Offset"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.025"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.025"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "SRRB - As part of the Department of Defense reform agenda, the incremental reduction accounts for consolidation and reduction of service contracts.\n\nManagement Realignment - Funding was realigned to O&M for critical statutory requirements. \n\nOther adjustments are the results of departmental efficiencies reduction."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "304"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise Energy Information Management"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.329"
                        },
                        "PriorYear": {
                            "val": "0.779"
                        },
                        "CurrentYear": {
                            "val": "0.553"
                        },
                        "BudgetYearOne": {
                            "val": "0.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.500"
                        },
                        "BudgetYearTwo": {
                            "val": "0.400"
                        },
                        "BudgetYearThree": {
                            "val": "0.372"
                        },
                        "BudgetYearFour": {
                            "val": "0.370"
                        },
                        "BudgetYearFive": {
                            "val": "0.371"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "A key part of DoD’s strategy to meet its energy goals is to develop an energy information management environment that will enable the Services and OSD to track energy production and usage across the real property portfolio.  Information on energy usage is critical for day-to-day management and accountability, troubleshooting building systems, and planning for capital investments.  Integration with accurate Real property asset, Utilization, Military Construction, Environmental, and installation Geospatial data is equally key to ensuring these decisions for planning and reporting are possible.  It also supports development of The geospatial portal for visualizing energy layers with other EI&E data on installation or area maps for improved spatial analysis.  This portal is the DOD aggregated repository for DoD Common Installation Picture layers.  Additionally, the map viewer is customized and easier  for OSD senior staff to manipulate and includes an online catalog of maps, documents and data; and a secure, robust data exchange module. This development supports a range of Joint Staff and OSD customers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enterprise Energy Information Management"
                                    },
                                    "Description": {
                                        "val": "Supports development of an enterprise energy data store and associated standard that will be integrated with other existing and future data stores and visualization capability for a fully integrated and spatially analytical perspective of EI&E mission area information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.779"
                                            },
                                            "Text": {
                                                "val": "Continued development and procurement of an enterprise-wide energy data warehouse that will be integrated with existing and future real property systems.  Fielded a new web-user interface for Defense Installation Spatial Data Infrastructure (DISDI) Portal, including a catalog\/library of available policy & guidance documents as well as finished maps suitable for trip books, Congressional interactions, OSD-level planning, etc."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.553"
                                            },
                                            "Text": {
                                                "val": "Continue work on Energy Conservation Investment Program Data Store and related business intelligence.  Field new map viewer tailored for OSD staff users with a simpler, modern interface and customized map data packages and pre-configured queries of real property asset location data. Begin development of automated data discovery catalog (Voyager)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Support Business Process Re-Engineering effort to update Enterprise Energy Information Model and related Business Enterprise Architecture.  Include updates in energy data store integrated into EI&E Data Analytics & Integration Support warehouse. Complete initial development of automated data discovery catalog in Defense Installation Spatial Data Infrastructure (DISDI) Portal.  This is including data tagging and curation of the current DISDI Portal database and contents. Begin customization of the data catalog based on initial user feedback and complete initial development of data exchange module to connect DISDI Portal to the DoD Components live databases for IGI&S."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "305"
                    },
                    "ProjectTitle": {
                        "val": "Real Property Accountability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.867"
                        },
                        "PriorYear": {
                            "val": "2.570"
                        },
                        "CurrentYear": {
                            "val": "1.404"
                        },
                        "BudgetYearOne": {
                            "val": "2.192"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.192"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.210"
                        },
                        "BudgetYearThree": {
                            "val": "2.030"
                        },
                        "BudgetYearFour": {
                            "val": "2.108"
                        },
                        "BudgetYearFive": {
                            "val": "2.175"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Real Property Inventory fulfills requirements of Executive Order for DoD to achieve and maintain real property accountability.  This is critical both from audit readiness and program management perspectives.  This funding provides the department independent verification and validation needed to reconcile errors to gain the data quality and interoperability needed for decisionable data and processes throughout the lifecycle of real property assets. Oversight and configuration management of business rules and standards are used to determine requirements for the departments Real Property inventory records and proper end to end process steps throughout the lifecycle of an asset from purchase to disposal.  This includes development and procurement of the enterprise data warehouse for integrating existing and future EI&E systems and database needs.  The Real Property Unique Identifier (RPUID) process has also been included in this EI&E enterprise system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Real Property Accountability"
                                    },
                                    "Description": {
                                        "val": "The ASD EI&E is the Senior Real Property Officer for the DoD.  In this role they are responsible for the accountability and utilization of all DoD Real Property Assets.  This funding provides the department a enterprise data warehouse coupled with a independent verification & validation capability.  The DoD Real Property Accountability efforts are mandated by Executive Order and Public Law for improved reporting and utilization of federal real property and verifiable decisionable data is needed for future BRAC deliberations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.570"
                                            },
                                            "Text": {
                                                "val": "Real Property Information Model  8.1 was published and implemented across DoD.  The EI&E enterprise Data Analytics & Integration  Support continued (DAIS) platform development with Military Construction and Energy Conservation Investment Program (ECIP) data Stores."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.404"
                                            },
                                            "Text": {
                                                "val": "Continued reconciliation efforts and determining requirements for the department's Real Property inventory records and asset mgt processes & data requirements.  Auditability support focused on existence and completeness of required documents throughout the lifecycle.  Continued development of DAIS and additional EI&E data stores. Gained accesses to real time data through services WSDLS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.192"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.192"
                                            },
                                            "Text": {
                                                "val": "Continue reconciliation and auditability efforts by determining requirements for the department's Real Property inventory records and asset \naccountability and management processes, business rules and associated data. Continue DAIS implementation with WSDL maturity and improved data quality and integration in preparation for BRAC and other upcoming analysis and decisions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "306"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Security"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.940"
                        },
                        "CurrentYear": {
                            "val": "0.746"
                        },
                        "BudgetYearOne": {
                            "val": "0.977"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.977"
                        },
                        "BudgetYearTwo": {
                            "val": "0.974"
                        },
                        "BudgetYearThree": {
                            "val": "0.970"
                        },
                        "BudgetYearFour": {
                            "val": "0.965"
                        },
                        "BudgetYearFive": {
                            "val": "0.970"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The current state of cyber security of energy-related (and other real property-related) control systems (such as the electronic\/computer controls on heating, ventilation & air conditioning equipment) is deficient, and the adjusted EEIM baseline supports a multi-year real property-related control systems cyber security initiative to address these issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security"
                                    },
                                    "Description": {
                                        "val": "The current state of cyber security of energy-related (and other real property-related) control systems (such as the electronic\/computer controls on heating, ventilation & air conditioning equipment) is deficient. This effort supports a multi-year real property-related control systems cyber security initiative to address these issues.  So far it has generated an updated DoD CIO RMF Knowledge Service Portal with controls systems cyber security implementation guidance for practitioners (templates, key references, step-by-step instructions, look-up tables, etc.)\nControls systems cyber security Tactics, Techniques and Procedures (TTPS) has transitioned from Joint Base Architecture for Secure Industrial Control Systems (J-BASICS).  The department has begun to implement Platform Resilience Mission Assurance (PRMA) assessments across 10 installations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.940"
                                            },
                                            "Text": {
                                                "val": "Initiated real property-related controls cyber security systems risk assessment through MIT labs.  Included development of procedural guides for future training and use by installation staff for conducting their own assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.746"
                                            },
                                            "Text": {
                                                "val": "Began to implement Platform Resilience Mission Assurance (PRMA) assessments across 10 installations.  Also supported specific risk assessments at selected port facilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.977"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.977"
                                            },
                                            "Text": {
                                                "val": "Continue to support multiyear real property-related controls systems cyber security risk assessments and development of guidelines and training manuals for future in house procedures.  Also supports joint initiative with DOE this year."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}