{
    "id": "2018-Navy-PB-1319-MJBOOK-2-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-3",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604215N"
        },
        "ProgramElementTitle": {
            "val": "Standards Development"
        },
        "R1LineNumber": {
            "val": "99"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1129.087"
            },
            "PriorYear": {
                "val": "48.677"
            },
            "CurrentYear": {
                "val": "1.300"
            },
            "BudgetYearOne": {
                "val": "2.722"
            },
            "BudgetYearOneBase": {
                "val": "2.722"
            },
            "BudgetYearTwo": {
                "val": "2.772"
            },
            "BudgetYearThree": {
                "val": "2.828"
            },
            "BudgetYearFour": {
                "val": "2.780"
            },
            "BudgetYearFive": {
                "val": "2.808"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Starting in FY17 the Common Helicopters (PU 2312) and Stores Planning and Weaponeering Module (PU 2311) will be moved to Mission Planning PE (0605215N).\nStarting in FY17 the JT Service\/NV Std Avionics CP\/SB (PU 0572) PE (0604215N) will be moved to a new Common Avionics PE (0605217N)."
        },
        "ProgramElementMissionDescription": {
            "val": "This project provides for the identification, study, design, development, demonstration, test, evaluation, and qualification of standard avionics capabilities for Navy use, and wherever practicable, use across all Services and Foreign Military Sales.  Such air combat electronics developments include communications and airborne networking, navigation and sensors, flight avionics, safety systems, and flight mission information systems for both forward fit and retrofit aircraft. These efforts continue to maintain federated systems while encouraging transition of procurements to support a modular system for enhanced performance and affordability.  Consideration is given up front to reduce acquisition costs through larger procurement quantities that satisfy multi-aircraft customer requirements and that reduce life cycle costs in the areas of reliability, maintainability, and training.  This project also provides a Navy-wide program to develop required calibration standards (hardware) in all major measurement technology areas in support of Navy Hull, Mechanical and Electrical (HM&E) systems as well as Navy Weapons systems, ground and air, throughout the Fleet.  It funds Navy lead-service responsibilities in the Department of Defense and Joint Services Metrology Research and Development program.  This project supports the military requirement to verify the performance of all test systems used to validate the operation of HM&E as well as Navy Weapon Systems with calibration standards traceable to the National Institute of Standards and Technology.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under SYSTEM DEVELOPMENT AND DEMONSTRATION because it includes those projects that have passed Milestone B approval and are conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production decision."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.049"
                },
                "CurrentYear": {
                    "val": "1.300"
                },
                "BudgetYearOne": {
                    "val": "1.913"
                },
                "BudgetYearOneBase": {
                    "val": "1.913"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.677"
                },
                "CurrentYear": {
                    "val": "1.300"
                },
                "BudgetYearOne": {
                    "val": "2.722"
                },
                "BudgetYearOneBase": {
                    "val": "2.722"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.372"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.809"
                },
                "BudgetYearOneBase": {
                    "val": "0.809"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.257"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.115"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.809"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.809"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: \n\n0572:\nTactical Communications: Title corrected from Joint Precision Approach Landing System  Software (S\/W) Integration to Operation Flight Plan S\/W Integration.  \n\nGround Proximity Warning Systems\/Terrain Awareness Warning System (GPWS\/TAWS II):  H-60 TAWS II Software Development extended duration from 4Q\/15 through 4Q\/16 based on projected platform integration schedule.  \n\nMilitary Flight Quality Assurance: Test and Evaluation, MH-53R\/S, M\/CH-53E, AH-1Z, UH-1Y, Phase 2 Test extended from 3Q\/15 to 4Q\/15 due to longer testing required for a number of defects found.  Phase 2 Test Readiness Review moved from 1Q\/15 to 3Q\/15 due to integration test took longer than planned due to number of defects found.  Deliveries for H-60R\/S, CH-53E, AH-1Z and UH-1Y reflect new date of 2Q\/15 to align with F\/A-18 procurement order.\n\n\"Mid Air Collision Avoidance Capability:  Re-planned FY16-FY21 program as a result of the Business Case Analysis to properly aligned program.  Material Development Decision\/Acquisition Strategy Review (MDD\/ASR) moved from 2Q\/16 to 1Q\/17.  Added Capability Development Document (CDD) Draft added in 4Q16.  Added Requirements Development from 1Q\/16 to 4Q\/16.\n\nStarting in FY17 the JT Service\/NV Std Avionics CP\/SB (PU 0572) PE (0604215N) will be moved to a new Common Avionics PE (0605217N).\n\n2311: \nWASP V4.0 Systems Development start was delayed from 4Q16 to 2017 and will be displayed under PE 0605215N.\n\nWASP V3.2 IOC was delayed from 1Q16 to 3Q16 due to the asynchronous release process and requirement for a new build prior to IOC.  \n\nFY17 and out schedule is included in the Mission Planning PE 0605215N.\n\n2312:  \nCommon Helicopters schedule FY17 and out is included in Mission Planning PE 0605215N."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0572"
                    },
                    "ProjectTitle": {
                        "val": "JT Service\/NV Std Avionics CP\/SB"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "930.227"
                        },
                        "PriorYear": {
                            "val": "35.765"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "965.992"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Starting in FY17 the JT Service\/NV Std Avionics CP\/SB (PU 0572) PE (0604215N) will be moved to a new Common Avionics PE (0605217N)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Joint Services\/Navy Standard Avionics Components and Subsystems:  This project provides for the identification, study, design, development, demonstration, test, evaluation, and qualification of standard avionics capabilities for Navy use, and wherever practicable, use across all Services and Foreign Military Sales.  Standard avionics capabilities under development include the Joint Service Review Committee for Avionics Standardization (JSRC-AS), Communication Navigation Surveillance\/Air Traffic Management (CNS\/ATM), Tactical Communications (TACCOM), Ground Proximity Warning System\/Terrain Awareness Warning System (GPWS\/TAWS II), Collaborative Warfare (CW), Avionics Component Improvement Program (AvCIP), Mid Air Collision Avoidance Capability (MCAC), and Avionics Architectures Team (AAT).  Participation in Human Factors Quality Management Board ensures Navy safety upgrades and mandatory safety improvements for naval aircraft."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Service Review Committee for Avionics Standardization (JSRC-AS)"
                                    },
                                    "Description": {
                                        "val": "The JSRC-AS program supports Congressional and Assistant Secretary of the Navy for Research, Development and Acquisition direction to control the growing proliferation of unique avionics and improve coordination among the services through the identification, development, and promotion of investigative and development efforts across the services and U.S. Coast Guard.  The JSRC-AS supports the development, analysis and review of new avionics requirements with potential for joint service application.  The JSRC-AS consists of an O-6 Level principal from each service and U.S. Coast Guard, as well as the appropriate staff, to support joint service working group efforts.  The JSRC-AS reports to the O-7 level tri-service Aviation Common Systems Board who reports to the O-9 level Joint Aeronautical Commanders Group."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.607"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide leadership in support of the Navy's interest to the JSRC-AS tri-service committee promoting commonality and joint programs with focus on interoperability, communications, navigation, Joint Services avionics obsolescence management, and update of the Core Avionics Master Plan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communication Navigation Surveillance\/Air Traffic Management (CNS\/ATM)"
                                    },
                                    "Description": {
                                        "val": "This program will conduct and support CNS\/ATM research, studies, development, integration, demonstration, test and evaluation efforts for naval aviation platforms in development.  Platform integration of Mode Select (S), 8.33 kHz, Reduced Vertical Separation Minimum (RVSM), Required Navigation Performance Area Navigation (RNP\/RNAV) to include M Code, and Automatic Dependent Surveillance-Broadcast Out (ADS-BO) functional integration and certification efforts into naval aircraft.  Assist with insertion of communication, navigation, surveillance, and supporting technologies and conduct capability certification on developmental platforms such as F-35, CH-53K, and Unmanned Air Systems. Capabilities include Mode S, 8.33 kHz, RVSM, RNP\/RNAV, ADS-BO, and other civil and military capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.455"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assist with insertion and integration of CNS\/ATM technologies and certification of developmental platforms.  Evaluate ADS-B (Out) technologies and develop solutions to support platform integrations.  Develop CNS\/ATM Common Components to support Required Navigation Performance Area Navigation (RNP RNAV) developmental platform requirements.  Begin integration\/certification of Mode Select, 8.33 kHz, Reduced Vertical Separation Minimum, RNP\/RNAV, and ADS-B (Out) into CH-53K.  Research and develop Global Positioning System (GPS) enhancements to support CNS\/ATM RNP RNAV improvements.  Research and develop Automatic Dependent Surveillance-Broadcast Out System Design Assurance requirements as well as compatibility with the emerging GPS M Code and its impact on RNP RNAV."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Communications (TACCOM)"
                                    },
                                    "Description": {
                                        "val": "This program will conduct research, studies, development, integration, demonstration, test and evaluation efforts to ensure tactical communication systems and capabilities are developed and available to support naval aviation requirements.  Perform tactical communication platform integration studies and activities to determine technical and cost effective solutions across naval aviation.  Develop tactical communications (voice\/data) requirements, concepts and systems which have application across naval aviation. Support all necessary tasks to ensure evolution of legacy communications systems incorporating programmable Communication Security\/Information Assurance, mandated National Security Agency (NSA) Crypto Modernization initiatives, Combat Net Radio (CNR) Variable Message Format (VMF), Beyond Line-of-Sight, Satellite Communication (SATCOM) Modernization including Mobile User Objective System (MUOS), High Frequency, Second Generation Anti-Jam Tactical UHF Radio for NATO (SATURN) civil interoperability, and Joint Precision Approach Landing System (JPALS) data link into the ARC-210 system.  Support for networking requirements development and prototyping, Integrated Waveform (IW), Intelligence Broadcast System over modern Code Division Multiple Access based satellite channels, Tactical Networks, Data Links, and Link 16."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.108"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate Satellite Communications Modernization and continue development of Digital Interoperability SATCOM Software capability to include Mobile User Objective System (MUOS).  Continue Joint Precision Approach Landing System Software integration with airborne capabilities for a common capabilities release. Initiate design of Crypto Engine.  Complete Joint Interoperability Test Command certification to deliver VMF Software.  Continue development of Air to Ground (VMF Software) Interoperability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Proximity Warning System\/Terrain Awareness Warning System (GPWS\/TAWS II)"
                                    },
                                    "Description": {
                                        "val": "This program will conduct research, studies, development, integration, demonstration, test and evaluation efforts to meet naval aviation GPWS\/TAWS II requirements.  These requirements span all operational modes and operational environments, to include Degraded Visual Environment.  Perform GPWS\/TAWS II platform integration studies and activities to determine technical and cost effective solutions across naval aviation.  Develop GPWS\/TAWS II solutions tailored to platform performance and range of military operations.  Develop simulation models for use at Manned Flight Simulator (MFS) or other simulation environments as required for platform tailoring, including procurement of test article hardware.  Evaluate aircraft simulation models for suitability in Ground Proximity Warning System\/Terrain Awareness Warning System (GPWS\/TAWS II) development effort.  Develop GPWS\/TAWS II algorithms utilizing simulation environments as real-time hardware and pilot in the loop tool.  Develop and evaluate algorithm interfaces necessary for integration of the algorithm within platform host computer.  Develop software code to execute GPWS\/TAWS II algorithm in host platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.681"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Deliver formal software build of TAWS II system to H-60. Complete beta testing of TAWS II in Manned Flight Simulator or other simulation environment.  Complete Phase 1 DT in MH-60R\/S."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Warfare (CW)"
                                    },
                                    "Description": {
                                        "val": "The CW component is a Research & Development effort to identify targeting gaps and determine the warfighting benefit of integrating networked capabilities into naval aircraft to fill those gaps. The CW component also addresses targeting gaps for naval aircraft to operate more effectively with other military services.  The following efforts are included: 1) A comprehensive naval aviation Tactical Networking Requirements Strategy that maps fleet gaps and requirements to cross-platform naval aviation solutions.  The Naval Effects Cross Domain Targeting Capabilities Based Assessment concept refinement Joint Capability Integration Development System activity will be integrated into this effort.  2) Netted sensors proof of concept prototype demonstrations leveraging the Navy's Fleet Experimentation campaign.  3) Support of integration of Netted Sensors\/Sensor Fusion into naval aviation Integrated Capabilities Packages supporting multi-mission capability enhancements to include input to the N81 Offensive Anti-Surface Warfare Targeting and Weapons Control study that ensures naval aviation Intelligence, Surveillance and Reconnaissance delivers a complete kill chain.  4) Provide resource sponsor oversight on an Office of Naval Research Future Naval Capability Enabling Capability for an Advanced Tactical Data Link (ATDL) for naval aviation.  5) Continue work on the Joint Tactical Networking Concept of Employment (JTN CONEMP) that aligns Navy Advanced Tactical Data Link (ATDL) and Joint Aerial Layer Network - Maritime with USAF future strategies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.164"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue executing tactical networking strategy activities to define future Program Objective Memorandums and analytic agendas.  Develop requirements, standards, and architectures in support of new and updated netted-sensors' Concept of Operations and capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Avionics Component Improvement Program (AvCIP)"
                                    },
                                    "Description": {
                                        "val": "Investigate high value Return On Investment component improvement candidate projects in support of NAVAIR Commander's third focus area - Improve \"capital A\" Affordability. Stop operating and sustainment cost growth by reducing costs for fielded systems and implementing life-cycle cost reduction initiatives as part of new systems development.  This program positions resources for next year application to fast-track corrections to existing problematic systems. Projects address critical readiness issues (significant back-orders or impending sustainability failures that threaten to down aircraft), functional performance obsolescence issues (system failing to support mission requirement), and top sustainment cost drivers (out of proportion annual maintenance or repair costs). Resources enable design and development of technology insertion and product redesign or replacement to meet readiness goals, meet mission objectives, or reduce overall sustainment costs. Candidate projects are submitted via a rigorous template, reviewed by a panel of Avionics professionals, and selected based upon urgency, warfighting contributions, breadth of application and scope of Return On Investment. Resources cover non-recurring engineering elements (including design and development, prototypes, platform integration, test and evaluation), program management and associated logistics elements (including technical data preparation, support equipment, provisioning, and training). Analysis shows that funding applied under this program between 2006 and 2014 will enable sustainment and procurement cost avoidances exceeding a five to one margin by 2025."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Address current fleet problem avionics systems (top readiness degraders, cost drivers, obsolescence-driven sustainability, capability loss, fleet head-hurters)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mid Air Collision Avoidance Capability (MCAC)"
                                    },
                                    "Description": {
                                        "val": "This program will conduct research, studies, and development, integration, demonstration, test and evaluation efforts to meet Naval Aviation MCAC requirements.  These requirements span all operational modes and operational environments, to include Degraded Visual Environment.  Perform MCAC platform integration studies and activities to determine technical and cost effective solutions across Naval Aviation.  Develop MCAC solutions tailored to platform performance and range of military operations.  Develop simulation models for use at Manned Flight Simulator (MFS) or other simulation environments as required for platform tailoring, including procurement of test article hardware.  Evaluate aircraft simulation models for suitability in MCAC development effort.  Develop MCAC solutions utilizing simulation environments as real-time hardware and pilot in the loop tools.  Develop and evaluate interfaces necessary for integration of MCAC within platform host environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.125"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin requirements development and draft Capability Development Document (CDD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Avionics Architectures Team (AAT)"
                                    },
                                    "Description": {
                                        "val": "The Avionics Architecture Team (AAT) provides hardware and software (HW\/SW) standards and product line development and management for a common HW\/SW operating environments to establish testable open architecture requirements in accordance with National Defense Authorization Act (NDAA) Section 801 Open Architecture language, DoD Directive 5000.1, N6\/N7 Naval Open Architecture Requirements Letter 9010, Ser. N6N7\/5U916276, and SECNAVINST 5000.2E.  The Future Airborne Capability Environment (FACE) Technical Standard is developed through Navy, Army, Air Force, Industry and Academia collaboration in accordance with Public Law 104-113.  The Hardware Open Systems Technologies (HOST) standard is being developed through government and academia collaboration and will be provided to industry for prototyping efforts.  The AAT provides Subject Matter Experts to define and architect a set of Open Architecture Standards and product lines, design guidance, development and integration tools, acquisition strategy, contracting guidance and cost estimates.  The results will enable Department of Defense (DoD) weapons systems to systematically reuse HW\/SW and deliver scalable, portable and interoperable war fighting capabilities at a faster rate, reducing redundant development costs and increasing competition.  Infrastructure components and frameworks built to these standards will support Communication Navigation Surveillance\/Air Traffic Management (CNS\/ATM) capability upgrades on various platforms by enabling integration of common, non-proprietary applications.  The AAT initiatives enable the government's role as Lead Systems Integrator, per the Weapons System Acquisition Reform Act (WSARA) 2009, and cost effectively manage data rights for reuse across the DoD.\n\nFuture Airborne Capability Environment (FACE) Program Title changed to Avionics Architectures to define Naval open architecture that includes FACE and Hardware Open Systems Technologies (HOST)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.585"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide development support, mission based engineering, systems engineering and program management for design and acquisition strategy implementation guidance. Investigate revisions to the Future Airborne Capability Environment (FACE) and Hardware Open Systems Technologies (HOST) standards to meet emerging technologies and new platform requirements. Assist platforms with strategies for modular functional decomposition and implementation of FACE and HOST standards. Subject Matter Expert support for platform integration and competitive source selection. Academia prototyping and demonstration efforts for FACE and HOST initiatives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APN\/0577"
                                    },
                                    "Title": {
                                        "val": "Common Avionics Changes"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "154.588"
                                        },
                                        "CurrentYear": {
                                            "val": "164.839"
                                        },
                                        "BudgetYearOne": {
                                            "val": "123.507"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "123.507"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "150.881"
                                        },
                                        "BudgetYearThree": {
                                            "val": "109.444"
                                        },
                                        "BudgetYearFour": {
                                            "val": "132.203"
                                        },
                                        "BudgetYearFive": {
                                            "val": "114.976"
                                        },
                                        "CostToComplete": {
                                            "val": "353.447"
                                        },
                                        "TotalCost": {
                                            "val": "3611.398"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Communication Navigation Surveillance\/Air Traffic Management (CNS\/ATM) program is a system of systems.  The program will encompass the integration of various systems which will be procured utilizing existing contracts for integration on forward-fit and retrofit platforms to provide CNS\/ATM functionality.  Tactical Communications (TACCOM) is utilizing a firm fixed price contract to Rockwell Collins for research and development of the ARC-210 Gen 5\/6 and other Navy contract vehicles for integration studies.  The Navy will integrate systems and components to satisfy platform requirements to achieve tactical communication capability as determined by analyses. Ground Proximity Warning System\/Terrain Awareness Warning System (GPWS\/TAWS II) Software Modules will be developed by a Government Software Product Team in collaboration with Industry where required. Avionics Component Improvement Program (AvCIP) will annually review, compete and select candidate component improvement proposals according to urgency, criticality of warfighting contributions, technical risk, breadth of application, and scope of Return On Investment (ROI). Projects are selected by a panel of Avionics management experts, including representatives from OPNAV N98, NAVAIR, NAVICP, and the Fleet. Projects are executed by managers in platform or commodity offices that own the component. The AvCIP program management team manages project selection, allocates funds, monitors multiple project executions against proposed spend plans, and tracks solution performance and achievement of projected ROIs over time using Fleet maintenance and component performance databases. Cost avoidances are coordinated with OPNAV N98 to balance Flying Hour Program costs. Component improvement solutions include modular hardware, software and material upgrades. Resources cover engineering elements (including design and development, prototypes, platform integration, test and evaluation), program management and associated logistics elements (including technical data preparation, support equipment, provisioning, and training).    Mid Air Collision Avoidance Capability (MCAC) is the capability umbrella which encompasses all systems designed and developed which aid in air-to-air collision avoidance.  Systems include but are not limited to Traffic Collision Avoidance Systems and Mid Air Collision Avoidance Systems.  Mid Air Collision Avoidance Capability Software Modules will be developed by a Government Software Product Team in collaboration with Industry where required. Avionics Architectures Team (AAT) will provide acquisition strategy guidance and support to platforms implementing open systems architectures to address open architecture requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Service Review Committee for Avionics (JSRC-AS) - Provide leadership in support of the Navy's interest to the JSRC tri-service committee promoting commonality and joint programs with focus on interoperability, communications, Communication Navigation Surveillance\/Air Traffic Management (CNS\/ATM), Joint Services avionics obsolescence management and the update of the Core Avionics Master Plan.  Support and participate in Naval Aviation Requirements Group panels, Operational Advisory Group, and Human Factors Quality Management Board.\nCNS\/ATM - Successfully complete platform integration, test, and certifications. \nTactical Communications (TACCOM) - Achieve Joint Interoperability Test Command and National Security Agency certifications on system developmental efforts to meet operational requirements. \nGround Proximity Warning System\/Terrain Awareness Warning System (GPWS\/TAWS II) - Develop algorithm and software to meet platform specific requirements, successfully complete flight test, and deliver product on schedule.  Successfully complete Milestone B.    \n\nCollaborative Warfare (CW) - Identify collaborative warfighting capability gaps and ensure the development of the most intelligent, cost effective, and timely solutions to fill those gaps.  \nAvionics Component Improvement Program (AvCIP) - Successful project competition and selection, execution of allocated funds, fielding of solutions, and documentation of component performance enhancement and benefits. \nMid Air Collision Avoidance Capability (MCAC) - Achieve program acquisition milestones on cost and schedule meeting platform requirements.\nAvionics Architectures - Provide leadership in support of the Navy's interest to the Future Airborne Capability Environment (FACE) Consortium. Participate in technical and business working groups within the FACE Consortium to foster solutions that promote interoperable and integrated warfighting capability for all services. Successfully functionally decompose, prototype and demonstrate FACE conformant applications and FACE compatible operating environments.  Develop technical specifications for Hardware Open System Technologies (HOST).  Prototype and demonstrate HOST avionics components."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1857"
                    },
                    "ProjectTitle": {
                        "val": "Calibration Standards"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.146"
                        },
                        "PriorYear": {
                            "val": "1.653"
                        },
                        "CurrentYear": {
                            "val": "1.300"
                        },
                        "BudgetYearOne": {
                            "val": "2.722"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.722"
                        },
                        "BudgetYearTwo": {
                            "val": "2.772"
                        },
                        "BudgetYearThree": {
                            "val": "2.828"
                        },
                        "BudgetYearFour": {
                            "val": "2.780"
                        },
                        "BudgetYearFive": {
                            "val": "2.808"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "OPNAV sponsored (by instruction), Navy-wide program which addresses Metrology related RDT&E issues for navy weapon systems, shipboard platforms, Naval Air, and Fleet Ground Marines.  It supports development of calibration standards (equipment, procedures and technical data) required to resolve Metcal related safety, obsolescence, new and emerging technology support and cost reduction issues. It funds Navy unique and lead service responsibilities in DoD and Joint Services Metrology Research Programs to develop calibration solutions.  The line supports development of measurement requirements to verify performance of all test systems used to validate the operation of Navy weapon Systems with calibration standards traceable to the National Institute of Standards and Technology to calibrate, sustain and ensure performance accuracy.\n\nThis program also provides benefits and efficiencies in a joint collaborative environment within the Tri-Services.  Projects are identified and defined so that they will meet the universal requirement.  Development efforts are integrated in order to achieve the common capabilities required at minimum cost.  This is also a regular and common business practice within the Navy Metrology Community where R&D efforts are communicated and integrated into the multiple testing and Monitoring Systems.  This is done in support of Program Managers, Sponsors, and Principle Executive officers. As a result, common requirements are established, duplication of efforts are eliminated, and best value, high quality Metcal products are produced for the Navy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Calibration Standards"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.653"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "($1.287) Continued development calibration standards in support of electro optical standards (hardware) in support of safety of flight operations.\n\n($.256) Continued development of calibration standards (hardware) in support of Physical Mechanical standards in support of Shipboard Flight Operations and NAVAIR Oxygen systems.\n\n($.110) Continued development of analytical metrology (processes) in support of automated interval and uncertainty analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "($.755) Continue development calibration standards in support of electro optical standards (hardware) in support of safety of flight operations.\n\n($.288) Continue development of calibration standards (hardware) in support of physical mechanical standards in support of Shipboard Flight Operations and NAVAIR Oxygen systems.\n\n($.257) Continue development of analytical metrology (processes) in support of automated interval and uncertainty analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.722"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.722"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "($.860) Finish development and transition (1) calibration standard (hardware) and begin development of (2) calibration standards (hardware) in electro optical measurement technology to support safety of flight and operational readiness.\n\n($.370) Continue the development of (1) calibration hardware standard and begin development of (1) calibration hardware standard for Chemical\/Biological technology to support shipboard safety, safety of flight and Divers Life Support Systems (DLSS).\n\n($.741) Continue development of (1) calibration standards (hardware) in physical mechanical measurement technology to support combat\/operational readiness for submarine periscopes magnetic locks and aircraft tail hook non destructive testing, shipboard safety of flight and operational readiness, and component equipment operational readiness.\n\n($.364) Continue development of (1) calibration standard and begin (1) calibration standard in analytical and metrology bench top technology in support of equipment operational readiness for both air and sea-based operations.\n\n ($.387) Begin development of (1) calibration standard (hardware) in electrical\/electronic measurement technology to support shipboard and submarine operational safety."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Funds provide for in-service engineering initiation of metrology research and developmental efforts of unique non-commercial hardware standards in the development of six key thrust technological areas which correspond to Physical Mechanical, Electro-Optical, Analytical Metrology, Electrical\/Electronic systems,  Chembio Defense, Microwave\/Millimeter wave.  These standards will ensure measurement accuracy in advanced and emerging combat weapon systems and associated test equipment.  These hardware test standards will also provide for cost effective and efficient system maintenance and calibration measurements that reduce wrong test decisions and will result in lower maintenance cost and higher system performance reliability."
                        },
                        "PerformanceMetrics": {
                            "val": "The U.S. Navy Metrology RDT&E Program will transition and continue the research and development of 9 projects in progress of Electro Optical, Chemical\/Biological, Physical Mechanical, Analytical Metrology, Electrical\/Electronic, and technology areas for the purpose of ensuring measurement accuracy in new emerging technology measurement requirements of Navy weapon systems. Success measures will be articulated through program goals and a balance score card strategy system."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2311"
                    },
                    "ProjectTitle": {
                        "val": "Stores Planning and Weaponeering Module"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "168.242"
                        },
                        "PriorYear": {
                            "val": "10.684"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "178.926"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Starting in FY17, the Stores Planning and Weaponeering Module PU 2311 will be moved to Mission Planning PE (0605215N)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Naval Aircraft Weaponeering Components project, now referred to as the Weaponeering and Stores Planning (WASP) components, are integrated software products that allow aircrew to determine the best combinations of weapons and delivery conditions to achieve the desired level of target damage, eliminate weapon delivery solutions that violate aircraft Type\/Model\/Series (T\/M\/S) specific safety-of-flight envelopes, and perform detailed weapons employment planning. WASP is approved by Air Warfare Division (N98) as a flight clearance implementation system for the F\/A-18 A, A+, B, C, D, D (RC), E, F, EA-18G; potential support for other platforms, to include F-35.  WASP components will alert pilots if their planned weapon release conditions meet flight clearance limits, will result in bomb-to-bomb collisions, bomb-to-aircraft collisions, aircraft overstress, or excessive risk of aircraft loss\/damage in the event of fuze early bursts. Weapon employment planning is fundamental to the Joint Capability Area of Force Application and joint mission areas of Strike and Amphibious Warfare.  WASP provides the Navy and Marine Corp with weaponeering capabilities that are critical requirements for Interdiction, Armed Reconnaissance and Close Air Support mission planning.  Therefore, WASP product availability is critical to successful employment of the Joint Mission Planning System (JMPS)  for the F\/A-18 A-F and EA-18G.  The WASP product encompasses a multitude of Government Furnished Information software components and tools (aircraft target maneuver simulations, weapon flyout models, target probability of damage calculators).  WASP products will require updates as emergent requirements for new aircraft T\/M\/S, stores and weapons are approved, and new flight clearances and flight restrictions are issued by Naval Air Systems Command Headquarters (NAVAIRSYSCOM)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Includes associated system engineering design, development, installation, integration and software development for WASP components V3.0A, V3.1, V3.1A, V3.1B, V3.1C, V3.1D, V3.2, V3.2A, V3.2B, V3.3, V4.0 to support F\/A-18 A-F; and V3.1 and later to support EA-18G. Naval Air Warfare Center Weapons Division (NAWCWD), Joint Software Support Activity (JSSA) will develop and maintain the AV-8B Weapons and Release Planning (WARP) tool. Define requirements to integrate WASP components into the JMPS. Provide domain engineering support for weapons separation, aircraft loads, flutter, fuzing and safe escape for application to WASP. Provide analysis of new requirements, allocation of requirements, design oversight,  and life cycle management of the WASP program. Develop new aircraft configuration, aircraft loading, weapon optimization, store release and delivery planning components for F\/A-18 A-F and EA-18G new flight clearances and flight restrictions issued by NAVAIRSYSCOM. Provide configuration management, system administration, quality assurance, documentation, metrics and software risk management for WASP. Acquire, integrate and modify numerous Government Furnished Information (GFI) software components and tools (aircraft target maneuver simulations, weapon flyout models, target probability of damage calculators, etc.) that are used for the WASP software development. Integrate WASP with Joint Standoff Weapon\/Joint Direct Attack Munitions\/Standoff Land-Attack Missile - Expanded Response and other weapons mission planning systems as required."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.248"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete development of V3.3, and release multiple database updates. Define V4.0 requirements which incorporates planned architectural updates, new weapon capabilities, and usability improvements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation (T&E)"
                                    },
                                    "Description": {
                                        "val": "Provide test and evaluation for unit and system level testing; functional qualification testing; safety of flight certification testing; integration and standards compliance testing for WASP versions V3.0A, V3.1, V3.1A, V3.1B, V3.1C, V3.1D V3.2, V3.2A, V3.2B and V3.3. Provide Joint Mission Planning System Mission Planning Environment Integration test support. Provide testing and test support to ensure all (to include internally developed software, externally developed GFI) components comply with Department of Navy (DoN) and Department of Defense (DoD) software mandates and directives. These include Integrated Shipboard Network System IT-21, DoD Information Assurance Certification and Accreditation Process, Navy Marine Corps Intranet (NMCI) and DoD Information Technology Portfolio Repository. All Fleet released software must comply with DoN and DoD software directives or will not be allowed to run on ship Local Area Networks or NMCI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.940"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete test and evaluation of WASP major V3.3 in order to release to fleet in FY17.  Complete test and evaluation of multiple database updates.  Analyze test requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management\/Systems Engineering"
                                    },
                                    "Description": {
                                        "val": "Provide program management and systems engineering support, which includes requirements definition and analysis, compliance with Naval Air Systems Command systems engineering technical review processes, Weaponeering and Stores Planning (WASP) acquisition documentation development and support, cost, schedule and performance management, contracting support (providing contract administration, preparing contract packages for award), compliance with external directives and providing financial support  (accept, obligate, commit, and track funding).  Provide travel for WASP Government personnel.  Continue performing project management support for this program throughout the Future Years Defense Program\/Plan."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue project management and systems engineering support to the WASP for future releases of WASP to the fleet. Additional support will be required for multiple database releases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE\/3858,5302,5380"
                                    },
                                    "Title": {
                                        "val": "Air Force Mission Planning Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "55.835"
                                        },
                                        "CurrentYear": {
                                            "val": "78.323"
                                        },
                                        "BudgetYearOne": {
                                            "val": "75.567"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "75.567"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "75.113"
                                        },
                                        "BudgetYearThree": {
                                            "val": "87.771"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Weaponeering and Stores Planning (WASP) products, delivered annually, were developed in-house by NAVAIR consisting of Naval Air Warfare Center Aircraft Division and Naval Air Warfare Center Weapons Division engineers and support contractors.  The team has now migrated to a smaller government team that provides functional expertise in aircraft safety-of-flight (air-vehicle stores compatibility, weapons separation, aircraft aerodynamic flutter, ground\/flight loads, authorized fuze arm times, aircraft safe escape), guided weapons employment and weapons effects against targets, with the majority of the software development conducted by various contractors. The Government, engineering, test, and support teams (test facilities, functional qualification testing and certification\/accreditation test) are supplemented with contractor labor."
                        },
                        "PerformanceMetrics": {
                            "val": "Average time to plan a flight: Threshold value is < 1 hour average time to plan a flight that includes full aircraft loadout and weapons delivery safe escape planning. Objective value is < 15 minutes average time to plan a flight that includes full aircraft loadout and weapons delivery safe escape planning. End product is a pilot's z-diagram knee board card.  \n\nInteroperability:  Threshold value is 100% stand alone value. \nObjective value is 100% stand alone value."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2312"
                    },
                    "ProjectTitle": {
                        "val": "Common Helicopters"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.472"
                        },
                        "PriorYear": {
                            "val": "0.575"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.047"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In FY17, the Common Helicopters (PU 2312) moved to Mission Planning PE (0605215N).  Automated mission planning systems to date have focused on developing planning capabilities for fixed-wing aircraft, while the unique planning requirements for helicopters have not been fully addressed.  The unique and enhanced automated mission planning requirements that must be developed and implemented for helicopters include: data loading, an enhanced route editor (serpentine routing, hover), manipulation of higher fidelity (smaller scale) maps and imagery, enhanced performance tools (performance in and out of ground effect, performance degradation due to atmospheric conditions & elevation), and enhanced fidelity of landing zone, target zone, and threat analyses. The following type\/model\/series aircraft are supported by this PU: AH-1W\/Z, UH-1N\/Y, H-46\/E, H-53E, H-60H\/R\/S and V-22.  Common helicopter functionality will be developed for implementation in Joint Mission Planning System (JMPS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Common Helicopters"
                                    },
                                    "Description": {
                                        "val": "Development of Common Helicopter functionality and integration with JMPS Framework Versions 1.3.5 and 64 bit Operating System.  Common Components include Common Mission Data Loader (CMDL), Weapon Employment Zone Overlays Tool (WEZOT) and Point Selection Tool (PST)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.575"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of the CMDL, WEZOT and PST to operate with next JMPS FW and 64 bit Operating System."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE\/3858,5302,5380"
                                    },
                                    "Title": {
                                        "val": "Air Force Mission Planning Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "55.835"
                                        },
                                        "CurrentYear": {
                                            "val": "78.323"
                                        },
                                        "BudgetYearOne": {
                                            "val": "75.567"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "75.567"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "75.113"
                                        },
                                        "BudgetYearThree": {
                                            "val": "87.771"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE\/2213"
                                    },
                                    "Title": {
                                        "val": "Naval Mission Planning Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "38.993"
                                        },
                                        "CurrentYear": {
                                            "val": "21.779"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.570"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.570"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.477"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.335"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.782"
                                        },
                                        "BudgetYearFive": {
                                            "val": "22.216"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Export Mission Data to Data Transfer Device: Threshold value is < 12 minutes to transfer navigation, communication, weapon system initialization settings and intelligence data.\n\nInteroperability:  Threshold value is 100% of top level Information Exchange Requirements (IERs) designated critical will be satisfied.   \nObjective value is 100% of top level IERs will be satisfied."
                        }
                    }
                }
            ]
        }
    }
}