{
    "id": "2018-AirForce-PB-3600-MJBOOK-1-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-93",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3A-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "1206441F"
        },
        "ProgramElementTitle": {
            "val": "Space Based Infrared System (SBIRS) High EMD"
        },
        "R1LineNumber": {
            "val": "121"
        },
        "MdapCode": {
            "val": "210"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "9827.288"
            },
            "PriorYear": {
                "val": "291.510"
            },
            "CurrentYear": {
                "val": "218.766"
            },
            "BudgetYearOne": {
                "val": "311.844"
            },
            "BudgetYearOneBase": {
                "val": "311.844"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "345.460"
            },
            "BudgetYearThree": {
                "val": "275.873"
            },
            "BudgetYearFour": {
                "val": "236.578"
            },
            "BudgetYearFive": {
                "val": "275.571"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This program, BA 05 PE 1206441F, project 657106, Evolved SBIRS, is a new start.\n\nIn FY2018, PE 0604441F, Space Based Infrared System (SBIRS) High EMD efforts were transferred to PE 1206441F, Space Based Infrared System (SBIRS) High EMD due to the creation of a new Major Force Program for Space.  FY2016 and FY2017 funding is now documented in the exhibits for PE 1206441F.\n\nPrior Years: Total Program Element above includes $39.831M for Project 65A040 Commercially Hosted Payload funded in FY 2011 and FY 2012.  MDAP PNO 210 includes only Project 653616 SBIRS High EMD."
        },
        "ProgramElementMissionDescription": {
            "val": "The SBIRS RDT&E FY 2018 budget justification exhibits describe three elements of the SBIRS program: 1) the SBIRS Engineering and Manufacturing Development (EMD) program of record PNO 210 MDAP, 2) the Space Modernization Initiative (SMI) (non-MDAP) and the 3) Evolved SBIRS follow-on (pre-MDAP PNO 499).\n\n1. SBIRS EMD:  The Space-Based Infrared System (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS enhances detection and improves reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance over legacy systems in order to meet requirements in Air Force Space Command's (AFSPC) Operational Requirements Document (ORD). The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. Three HEO payloads and three GEO satellites are on-orbit.  Two of the three GEO and two of the three HEO satellites have completed AFSPC and USSTRATCOM operational acceptance and are certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations.  HEO-3 is in a storage\/residual operational mode and GEO-4 (Flight 3) is proceeding through on-orbit checkout and infrared sensor tuning following the Jan 2017 launch. The program of record ground segment development exploits both the new scanner and starer sensor data through software processing and builds user messages for missile warning and missile defense. Also, data exploitation efforts enable access to raw and processed data to expand capabilities for battlespace awareness and other applications.  FY 2018 funds support ground segment development.  The baseline requirement document is the 1996 SBIRS ORD. Enterprise systems engineering and integration (SE&I) provides intra- and inter-program requirements development, enterprise master planning, validation and verification, specialty engineering, and architecture development. \n\n2. SMI:  The primary objective of SMI is to enable and inform future decisions to maintain and evolve a capable, resilient, and affordable OPIR architecture by maturing technologies and mitigating risk areas to facilitate OPIR modernization within the Department's constrained resources. SMI supports the Program of Record (PoR) by assessing future parts and material obsolescence and designing future space and ground modifications focused on affordability and capability while simultaneously maximizing the effectiveness of existing system data products. SMI funds engineering activities to reduce both production and future system costs through manufacturing and producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements.  The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current PoR SBIRS constellation, reduce production timelines, and reduce recurring production costs. Based on the outcome of these studies and technology development, the Sensor Ground Demonstration will develop capability for current, next generation sensors, processors, and algorithms.  SMI funded data exploitation efforts include OPIR mission data processing, data fusion, data dissemination, algorithm development, network connectivity, efficient interfaces and sensor performance assessments to enable greater exploitation of SBIRS PoR and other data sources. SMI exploitation efforts build upon PoR capabilities and inform the PoR decision process. The data exploitation efforts identify affordable, responsive and resilient measures to improve technical intelligence and battlespace awareness processing and data dissemination tools to enhance OPIR support to the warfighters and other data users. The SMI Hosted Payloads and Wide Field of View (WFOV) Testbed activities explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture. Hosted Payloads and WFOV Testbeds support maturation of mission data processing algorithms for tactical and strategic applications which are critical demonstration efforts to enhance PoR capabilities and to reduce program risks for future OPIR systems, whether new systems or evolutions of the PoR.  Collection of on-orbit WFOV data is critical to develop algorithms to process large data sets generated by emerging large format focal planes and to reduce risk for possible SBIRS follow-on architectures.  SBIRS Enterprise Ground Services (EGS) infrastructure modernization efforts under SMI will introduce Telemetry, Tracking and Command systems (TT&C) and Ground Control automation, Future Operationally Resilient Ground Evolution (FORGE) mission data processing as well as competition into SBIRS Ground with an emphasis to on-ramp to EGS as soon as practical.  SMI activities are balanced and phased to enable an expanded tradespace and improve the competitive environment.\n\n3.  The Evolved SBIRS RDT&E FY 2018 budget justification exhibits describes the SBIRS Next-Generation OPIR program (pre-MDAP PNO 499). This program, BA 05 PE 1206441F, project 657106, EVOLVED SBIRS, is a new start.\n\nSBIRS Next-Gen OPIR: The SBIRS’ primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS enhances detection and improves reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. The SBIRS Next-Gen OPIR will provide improved strategic missile warning coverage and increased resiliency in a strategic constellation to meet the requirements laid out in the Air Force draft Capability Development Document (CDD) based on the AFSPC Space Warfighter Construct (SWC) in response to the Space Enterprise Vision (SEV). The SBIRS Next Gen OPIR systems includes both the space and ground elements. The Next Gen OPIR space segment will consist of  GEO and HEO satellites, providing real-time persistent global infrared coverage using a highly resilient bus with modernized payloads. The space segment will begin development of HEO space vehicles in FY21.  FORGE and EGS are infrastructure modernization efforts also aligned with AFSPC SWC. The FORGE effort will implement an open framework for mission data processing and migration of C2 of satellite operations to integrate with EGS. FORGE and EGS efforts will provide the flexibility to integrate new mission data processing capabilities and more efficiently allow the system to meet evolving warfighter needs.\n\nThis program element is in Budget Activity 5, System Development and Demonstration (SDD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "291.510"
                },
                "CurrentYear": {
                    "val": "181.966"
                },
                "BudgetYearOne": {
                    "val": "444.177"
                },
                "BudgetYearOneBase": {
                    "val": "444.177"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "291.510"
                },
                "CurrentYear": {
                    "val": "218.766"
                },
                "BudgetYearOne": {
                    "val": "311.844"
                },
                "BudgetYearOneBase": {
                    "val": "311.844"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "36.800"
                },
                "BudgetYearOne": {
                    "val": "-132.333"
                },
                "BudgetYearOneBase": {
                    "val": "-132.333"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "36.800"
                                },
                                "BudgetYearOne": {
                                    "val": "-132.333"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-132.333"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2017: Request for Additional Appropriation (RAA) funded SMI FORGE (+$16.800M), and EMD Cyber Enhancements (+$20.000M). NOTE: RAA adjustments added to project 653616, but SMI FORGE funding will be realigned to project 657009.\n\nFY2018: +57.200M for SMI Data Exploitation and Space Warfighter Construct efforts; +$26.306M to fund SBIRS ground cyber security enhancements; -$215.839M realigned SBIRS 7&8 to Space Procurement and SBIRS Evolved RDT&E to new PE."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "653616"
                    },
                    "ProjectTitle": {
                        "val": "SBIRS High Element Emd"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9827.288"
                        },
                        "PriorYear": {
                            "val": "202.929"
                        },
                        "CurrentYear": {
                            "val": "145.690"
                        },
                        "BudgetYearOne": {
                            "val": "121.760"
                        },
                        "BudgetYearOneBase": {
                            "val": "121.760"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "38.015"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10335.682"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "4"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Note: The quantity of RDT&E articles above reflects delivery of GEO-1 in FY 2011, GEO-2 in FY 2012, HEO-1 in FY 2004, and HEO-2 in FY 2005.\n\nThe Space-Based Infrared System (SBIRS) primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS enhances detection and improves reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. SBIRS supports Missile Defense, Battlespace Awareness, and Technical Intelligence missions by providing reliable, accurate, and timely data to Unified Combatant Commanders, Joint Task Force (JTF) Commanders, the intelligence community, and other users. SBIRS provides increased detection and tracking performance over legacy systems in order to meet requirements in Air Force Space Command's (AFSPC) Operational Requirements Document (ORD). The SBIRS system includes both space and ground elements. The space segment consists of Geosynchronous Earth Orbit (GEO) satellites, payloads hosted on satellites in Highly Elliptical Orbit (HEO), and Defense Support Program (DSP) satellites. The ground segment consists of both fixed and mobile data processing elements, communications infrastructure, and relay ground stations serving all SBIRS space elements. The three HEO payloads and two GEO satellites are on-orbit.  Both GEO and two of the three HEO satellites have completed AFSPC and USSTRATCOM operational acceptance and are certified for Integrated Tactical Warning\/Attack Assessment (ITW\/AA) missile warning operations and technical intelligence operations.  HEO-3 is in a storage\/residual operational mode.  The program of record ground segment development exploits both the new scanner and starer sensor data through software processing and builds user messages for missile warning and missile defense. Also, data exploitation efforts enable access to raw and processed data to expand capabilities for battlespace awareness and other applications.  SBIRS ground system cyber defense increases resiliency by resolving legacy DSP network architecture issues and establishes an active cyber defense capability. FY 2018 funds support ground segment development.  The baseline requirement document is the 1996 SBIRS ORD. Enterprise systems engineering and integration (SE&I) provides intra- and inter-program requirements development, enterprise master planning, validation and verification, specialty engineering, and architecture development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SBIRS EMD"
                                    },
                                    "Description": {
                                        "val": "Continued EMD contracts for Space and Ground segment development, concept studies\/activities for obsolescence issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "202.929"
                                            },
                                            "Text": {
                                                "val": "Continued Ground System Development (Block 10) and pre certification use of the staring sensor for Technical Intelligence. Block 10 provides significantly enhanced missile warning capabilities for our nation and allies by exploiting both scanner and starer sensor data with the improved ability for quicker detection and warning against a wider-ranging number of smaller missiles that are proliferating around the globe. Continued Block 20 Ground System Development, System Engineering and Program Management, HEO host program office support, Technical Intelligence activated, Data Processing\/Exploitation\/ground integration activities, Combined Task Force (CTF) support activities, systems integration and test studies. Block 20 adds ground processing that will exploit starer data via auto-cues on theater launches to enhance burnout surveillance and improve impact point prediction. Continued enterprise SE&I. Began operational utility evaluation and trial period for Block 10. Began cyber defense improvement to SBIRS ground system architecture in Block 10."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "145.690"
                                            },
                                            "Text": {
                                                "val": "Complete Block 10 Operational Acceptance and ITW\/AA certification (including GEO-1\/2 Starers). Block 10 acceptance significantly enhances missile warning capabilities for our nation and allies by exploiting both scanner and starer sensor data with the improved ability for quicker detection and warning (for Combatant Commanders and the National Command Authority) against a wider-ranging number of smaller missiles that are proliferating around the globe. Complete Increment 1 operations support activities. Continue Block 20 Ground System Development, System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/ Exploitation\/ground integration activities, systems integration and test studies. Block 20 adds ground processing that will exploit starer data via auto-cues on theater launches for enhanced burnout surveillance and improved impact point prediction.  Continue developing and fielding Command & Control, Technical Intelligence, and Battlespace Awareness operations to leverage residual capability for HEO 1\/2 post-transition. Continue enterprise SE&I. Continue cyber defense improvements to SBIRS ground system architecture in Block 20 in response to deficiencies identified during operational testing. Increase resiliency by resolving legacy DSP network architecture issues and establish an active cyber defense capability for SBIRS to keep pace with evolving threat."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "121.760"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "121.760"
                                            },
                                            "Text": {
                                                "val": "Continue Block 20 Ground System Development, System Engineering and Program Management, HEO host program office support, Technical Intelligence activities, Data Processing\/ Exploitation\/ground integration activities, systems integration and test studies. Continue developing and fielding Command & Control, Technical Intelligence, and Battlespace Awareness operations to leverage residual capability for HEO 1\/2 post-transition. Will continue enterprise SE&I. Continue cyber defense improvements to SBIRS ground system architecture in Block 20 to address identified deficiencies during operational testing. Continue Program Office and other related support activities that may include, but are not limited to studies, technical analysis, etc."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "SPAF, BA 01, Line # 13, MSSBIR"
                                    },
                                    "Title": {
                                        "val": "SBIR High (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "542.713"
                                        },
                                        "CurrentYear": {
                                            "val": "362.504"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1113.429"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1113.429"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "547.664"
                                        },
                                        "BudgetYearThree": {
                                            "val": "659.317"
                                        },
                                        "BudgetYearFour": {
                                            "val": "739.234"
                                        },
                                        "BudgetYearFive": {
                                            "val": "545.076"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The pre-SDD SBIRS contracts were competed in full and open competition.  Two contracts were awarded to Lockheed\/Loral\/Aerojet and Hughes\/TRW in 1995 for the pre-SDD phase.  A single contract was awarded to Lockheed Martin in 1996 for the SDD phase.  This contract is still ongoing and will incrementally deliver the ground segment.  Production contracts are discussed in the procurement budget exhibits."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Award dates represent date of first award of the funds for that fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Pre-EMD (LMMS & Hughes)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Hughes Aircraft Company"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "159.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "159.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "159.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS EMD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Prime: Lockheed Martin Sunnyvale, CA; Sub: Northrop Grumman, Azusa, CA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8789.290"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "149.809"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "119.578"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "104.275"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "104.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "29.916"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9192.868"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9130.475"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise SE&I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "The Analytical Sciences Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Andover, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "53.983"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.897"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.979"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.971"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.971"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.582"
                                                    },
                                                    "TotalCost": {
                                                        "val": "64.412"
                                                    },
                                                    "TargetValue": {
                                                        "val": "64.412"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SBIRS Pre-SDD Contract Adjustment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.780"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.780"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.780"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various : Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.600"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.600"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Phenomenology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various : Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.350"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.350"
                                                    },
                                                    "TargetValue": {
                                                        "val": "17.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sensor Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sandia National Lab"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Albuquerque, NM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEO Command & Control (C2) Ground Expansion"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "36.259"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "36.259"
                                                    },
                                                    "TargetValue": {
                                                        "val": "36.259"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Mission Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.163"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.706"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.104"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.164"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.164"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.657"
                                                    },
                                                    "TotalCost": {
                                                        "val": "22.794"
                                                    },
                                                    "TargetValue": {
                                                        "val": "22.794"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "HEO 1\/2 Residual Capability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "14.600"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbed Concept Study"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millennium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Various Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.942"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.942"
                                                    },
                                                    "TargetValue": {
                                                        "val": "11.942"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Award dates represent date of first award of the fiscal year."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aerospace Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "452.619"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.156"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.817"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.817"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "1.964"
                                                    },
                                                    "TotalCost": {
                                                        "val": "471.006"
                                                    },
                                                    "TargetValue": {
                                                        "val": "471.006"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "159.379"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.181"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.733"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.824"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.824"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.896"
                                                    },
                                                    "TotalCost": {
                                                        "val": "174.013"
                                                    },
                                                    "TargetValue": {
                                                        "val": "174.013"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "110.323"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "15.580"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.846"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.709"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.709"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.986"
                                                    },
                                                    "TotalCost": {
                                                        "val": "136.444"
                                                    },
                                                    "TargetValue": {
                                                        "val": "136.007"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Integration & Test at MCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 10 Integration & Test at MCSB"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B10.3 Completed and ITW\/AA Certified"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 20 Integration & Test at MCSB"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 20 Operational Utility Evaluation and Initial Operational Test & Evaluation with AFOTEC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "B20 Completed and ITW\/AA Certified"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657009"
                    },
                    "ProjectTitle": {
                        "val": "Space Mod Initiative"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "88.581"
                        },
                        "CurrentYear": {
                            "val": "73.076"
                        },
                        "BudgetYearOne": {
                            "val": "173.537"
                        },
                        "BudgetYearOneBase": {
                            "val": "173.537"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "211.406"
                        },
                        "BudgetYearThree": {
                            "val": "232.853"
                        },
                        "BudgetYearFour": {
                            "val": "209.576"
                        },
                        "BudgetYearFive": {
                            "val": "183.340"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The primary objective of SMI is to enable and inform future decisions to maintain and evolve a capable, resilient, and affordable OPIR architecture by maturing technologies and mitigating risk areas to facilitate OPIR modernization within the Department's constrained resources. SMI supports the Program of Record (PoR) by assessing future parts and material obsolescence and designing future space and ground modifications focused on affordability and capability while simultaneously maximizing the effectiveness of existing system data products. SMI funds engineering activities to reduce both production and future system costs through manufacturing and producibility enhancements and through technology insertion. SMI will also mature potential technology upgrades at the component and system level for future space and ground architecture affordability and capability enhancements.  The SBIRS OPIR SMI plan includes studies and risk reduction activities to evolve the current PoR SBIRS constellation, reduce production timelines, and reduce recurring production costs. Based on the outcome of these studies and technology development, the Sensor Ground Demonstration will develop capability for current, next generation sensors, processors, and algorithms.  SMI funded data exploitation efforts include OPIR mission data processing, data fusion, data dissemination, algorithm development, network connectivity, efficient interfaces and sensor performance assessments to enable greater exploitation of SBIRS PoR and other data sources. SMI exploitation efforts build upon PoR capabilities and inform the PoR decision process. The data exploitation efforts identify affordable, responsive and resilient measures to improve technical intelligence and battlespace awareness processing and data dissemination tools to enhance OPIR support to the warfighters and other data users. The SMI Hosted Payloads and Wide Field of View (WFOV) Testbed activities explore technology maturation, qualification of new components, and subsystem\/component prototyping to evolve the OPIR architecture. Hosted Payloads and WFOV Testbeds support maturation of mission data processing algorithms for tactical and strategic applications which are critical demonstration efforts to enhance PoR capabilities and to reduce program risks for future OPIR systems, whether new systems or evolutions of the PoR.  Collection of on-orbit WFOV data is critical to develop algorithms to process large data sets generated by emerging large format focal planes and to reduce risk for possible SBIRS follow-on architectures.  SBIRS Enterprise Ground Services (EGS) infrastructure modernization efforts under SMI will introduce Telemetry, Tracking and Command systems (TT&C) and Ground Control automation, Future Operationally Resilient Ground Evolution (FORGE) mission data processing as well as competition into SBIRS Ground with an emphasis to on-ramp to EGS as soon as practical.  SMI activities are balanced and phased to enable an expanded tradespace and improve the competitive environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technology Maturation"
                                    },
                                    "Description": {
                                        "val": "Formerly titled Evolved SBIRS.  Perform Trade and Design Studies to assess obsolescence, affordability, and capability design modifications to the PoR. Assess technology needs to support resiliency of PoR assets as well as Space Warfighting Construct architectures in response to the Space Enterprise Vision (SEV). Based on study outcomes, mature technologies and manufacturability to reduce cost, schedule, and technical risk for new component and subsystem designs which may be used in the next production block. Develop brassboards, breadboards, and engineering model prototypes for hardware\/software integration and testing to reduce risk and mature technologies applicable to PoR and new system alternatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.800"
                                            },
                                            "Text": {
                                                "val": "Advanced engineering designs for low Size Weight and Power (SWaP), high data flow crosslink and downlink communications upgrade and space-environmental monitoring detectors.  Completed phase one of nBn focal plane characterization and initiated phase two for focal plane technology characterization.  Completed digital focal plane test articles.  Improved resilient processing algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.030"
                                            },
                                            "Text": {
                                                "val": "Develop ground prototype hardware, perform ground-based demonstrations, and reduce risk for optical resilience hardware, intrinsically-hardened Focal Plane Arrays (FPAs), multispectral and resilient processing algorithms, affordable pointing mirrors, space processors, as well as other critical emerging technologies, as required by PoR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "61.309"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "61.309"
                                            },
                                            "Text": {
                                                "val": "Continue prototyping resiliency hardware and maturing technologies critical to current and future PoRs which include large format Focal Plane Arrays (FPAs), intrinsically-hardened FPAs, resilient processing algorithms, pointing mirrors, threat warning sensors, and next generation space processors. Continue to develop technology options to address emerging threats and stressing targets to current and future OPIR systems. Continue to develop and space qualify ground and on-orbit prototypes to reduce risk for SBIRS and other OPIR programs. Continue to demonstrate system resiliency and advanced technology concepts via ground and on-orbit demonstrations in order to validate performance and prove enhanced system capabilities. Support efforts towards Air Force Space Command's Space Warfighting Construct (SWC) in response to the Space Enterprise Vision (SEV)..  Continue program office and other related support activities that may include, but are not limited to studies, technical analysis, etc."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Exploitation"
                                    },
                                    "Description": {
                                        "val": "Exploit existing OPIR data sources (DSP, SBIRS HEO, SBIRS GEO Scanner, SBIRS GEO Starer, Commercially Hosted Infrared Payload (CHIRP), and other classified sources) through data collection, processing, fusion, data dissemination, algorithm development and testing, network connectivity, and sensor performance assessments. SBIRS and other sensors provide a rich data set for exploitation. SMI data exploitation enables access to raw and processed data for data analysts and application developers to expand capabilities for battlespace awareness and other applications. SMI data exploitation efforts are complementary to, and enhance, the exploitation capabilities delivered by the PoR and inform future PoR exploitation efforts.  SMI will develop tools and algorithms to enable users to apply OPIR data to support their mission needs. Data exploitation efforts are also evaluating tools for command and control, mission management, and mission data processing for risk reduction to support evolution of the SBIRS PoR ground system to an open architecture that could support PoR and other future satellites and payload alternatives. SMI ground system development activities seek to demonstrate the performance of an evolved ground system architecture capable of supporting multi-satellite, multi-payload, multi-mission management and data processing for any IR payload to achieve lower operating costs with enhanced net-centric and service oriented features along with a flexible expansion capability that was not designed into the current PoR ground system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.434"
                                            },
                                            "Text": {
                                                "val": "Continued to provide enhanced ground segment capability and tools for command and control, data collection, mission processing, and data dissemination to enhance data exploitation of SBIRS and other OPIR data.  Continued to collaborate with Intelligence Community (IC) and Missile Defense Agency (MDA) to enhance Joint OPIR Ground (JOG) initiatives.  Completed Critical Design Review (CDR) for WFOV Command and Control (C2) ground station in Jun 2016.  Procured WFOV Mission Data Processing equipment and completed hardware installation at Schriever AFB in Apr 2016.  Continued WFOV Mission Data Processing software development.  Continued development of an open architecture ground command and control and Virtual Mission Management operations for expanded data exploitation of the SBIRS HEO sensors.  Opened an initial data exploitation laboratory to support experimentation, technology maturity and evolution of exploitation algorithms in Apr 2016.  Continued development of a Battlespace Awareness real-time capability that will integrate applications and services matured in the data exploitation government lab."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.269"
                                            },
                                            "Text": {
                                                "val": "Continue to provide enhanced ground segment capability and tools for command and control, data collection, mission processing, and data dissemination to enhance data exploitation of SBIRS and other OPIR data.  Continue to collaborate with IC and MDA to enhance JOG initiatives. Continue WFOV Mission Data Processing software development. Continue WFOV C2 ground station and software development.   Continue planning for the WFOV payload calibration and test campaign.  Continue data exploitation laboratory capability to support experimentation, technology maturity and evolution of exploitation algorithms.  Continue Battlespace Awareness real-time capability that will integrate applications and services matured in the data exploitation government lab. Develop capability to operate two residual SBIRS HEO payloads and transition command and control to EGS to continue to provide HEO data to the Intelligence Community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "59.346"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "59.346"
                                            },
                                            "Text": {
                                                "val": "Continue to provide enhanced ground segment capability and tools for command and control, data collection, mission processing, and data dissemination to enhance mission resiliency and data exploitation of SBIRS and other OPIR data.  Continue to collaborate with IC and MDA to enhance JOG initiatives.  Continue WFOV Mission Data Processing software development. Continue WFOV C2 ground station and software development. Continue planning for the WFOV payload calibration and test campaign.  Complete building and expanding data exploitation laboratory capability into its final location to support experimentation, technology maturity and evolution of exploitation algorithms.  Continue development and expansion of a Battlespace Awareness real-time capability and facility that will integrate applications and services matured in the data exploitation government lab.  Develop and demonstrate the performance of an evolved ground system architecture to support multi-satellite, multi-payload, multi-mission management and data processing for any IR payload with enhanced net-centric and service oriented features along with a flexible expansion capability. Continue program office and other related support activities that may include, but are not limited to studies, technical analysis, etc."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hosted Payloads"
                                    },
                                    "Description": {
                                        "val": "Hosted Payloads mature WFOV technology and demonstrate multi-mission capabilities including the potential for a single sensor to simultaneously perform both the strategic and tactical missions. On-orbit data is required in order to develop and validate WFOV algorithms and on-board mission data processing throughput requirements for the Strategic Missile Warning Mission. These payload risk-mitigation efforts support the potential to field future Strategic Missile Warning and\/or multi-mission systems and potentially increase capability of the PoR starer. WFOV payloads are a part of all evolved and new architecture alternatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Procured long-lead parts and materials and continued to build payload. Continued planning for WFOV payload ground calibration and testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.200"
                                            },
                                            "Text": {
                                                "val": "Continue to build, integrate and checkout the WFOV payload. Continue planning for the payload calibration and test campaign."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.600"
                                            },
                                            "Text": {
                                                "val": "Complete final payload integration and checkout. Deliver payload to the calibration and test facility. Conduct the payload calibration and test campaign. Deliver payload to bus contractor to begin space vehicle integration. Initiate post-calibration ground analysis.  Continue program office and other related support activities that may include, but are not limited to studies, technical analysis, etc."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WFOV Testbeds"
                                    },
                                    "Description": {
                                        "val": "WFOV Testbeds are satellite platforms offering opportunities to demonstrate mission capabilities on-orbit and mitigate development risks for employing WFOV sensors. WFOV Testbeds include contractual options to integrate, test, and launch prototype, developmental WFOV payloads with a Government-owned free-flyer spacecraft or on a host government or commercially owned satellite. The WFOV Testbed will host the WFOV payload to demonstrate on-orbit mission performance.  On-orbit data from the WFOV payload hosted on the WFOV Testbed is essential to develop and validate WFOV algorithms and on-board mission data processing throughput requirements for the Strategic Missile Warning mission.  These two critical risk mitigation efforts support the potential to field future Strategic Missile Warning and\/or multi-mission WFOV systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.500"
                                            },
                                            "Text": {
                                                "val": "Completed bus build and integration in Aug 2016 and continued testing. Continued SEIT activities, including requirements management, risk management, and test planning. Completed WFOV program-level System Requirements Review (SRR) and Critical Design Review (CDR) in Sep 2016."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.972"
                                            },
                                            "Text": {
                                                "val": "Risk reduction activities prior to storage of WFOV spacecraft bus until FY18 due to payload schedule slip. Continue execution of program-level SEIT systems engineering processes.  Continue SEIT system test plan and information assurance (IA) accreditation plan.  Begin early launch integration studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.500"
                                            },
                                            "Text": {
                                                "val": "Begin payload-to-bus integration. Continue SEIT activities, including inter-segment testing and IA accreditation approval.  Begin launch integration and analysis. Procure launch parts and materials.  Continue program office and other related support activities that may include, but are not limited to studies, technical analysis, etc."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Ground Demonstration"
                                    },
                                    "Description": {
                                        "val": "Based on previous study outcomes, design and build test capability for next generation sensors, processors and algorithms. Develop modeling and simulation software (M&S), breadboards\/brassboards, test equipment, and data reduction software. Perform ground demonstration of candidate focal plane arrays, on-board processors, and other payload components for future SBIRS satellites to ensure demonstrated technical maturity for the next-generation payload development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A, No Funding in FY16"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.798"
                                            },
                                            "Text": {
                                                "val": "Complete detailed design of sensor demonstration experiments, including requirements for M&S and test equipment. Initiate M&S development work, such as threat\/scene generation capability and predictive effects for threat engagement. Develop an experimental optical breadboard, leveraging focal plane maturation efforts to create a focal plane interface. Procure test equipment, such as thermal control system and dewar."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "Initiate the fabrication of the sensor ground demonstration test bed. Integrate M&S scenes to the demo test bed to begin scene projection on demo sensors. A test will be designed and conducted to expose a test sensor to a directed energy source. The test results will feed into an iterative process with the M&S scenes to refine and mature the design. The demo test bed will be used to validate resiliency options identified by resiliency studies to inform the SBIRS Next-Gen OPIR program.  Continue program office and other related support activities that may include, but are not limited to studies, technical analysis, etc."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise System Engineering and Integration"
                                    },
                                    "Description": {
                                        "val": "System of Systems engineering and integration (SE&I) activities to evolve to future architectures."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Provide SE&I support for OPIR Enterprise analysis and integration of potential mission capabilities with existing OPIR Architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.056"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Text": {
                                                "val": "Provide SE&I support for OPIR Enterprise analysis and integration of potential mission capabilities with existing OPIR Architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management Services"
                                    },
                                    "Description": {
                                        "val": "Provide Program office and other related support activities that may include, but not limited to Federally Funded Research and Development Center (FFRDC), System Engineering Technical Assistance (SETA), studies, technical analysis, etc."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.847"
                                            },
                                            "Text": {
                                                "val": "Provided Program office and other related support activities that included, but not limited to Federally Funded Research and Development Center (FFRDC), System Engineering Technical Assistance (SETA), studies, technical analysis, etc."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.707"
                                            },
                                            "Text": {
                                                "val": "Provide Program office and other related support activities that may include, but not limited to Federally Funded Research and Development Center (FFRDC), System Engineering Technical Assistance (SETA), studies, technical analysis, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.726"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.726"
                                            },
                                            "Text": {
                                                "val": "Provide Program office and other related support activities that may include, but not limited to Federally Funded Research and Development Center (FFRDC), System Engineering Technical Assistance (SETA), studies, technical analysis, etc."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise Ground Services (EGS)"
                                    },
                                    "Description": {
                                        "val": "EGS is envisioned to provide a robust enterprise ground architecture for Air Force space systems, which leverages mission commonality and automation to reduce sustainment costs and re-focus manpower on warfighting capabilities.  In addition, EGS will enable a near-real-time common operating picture of enterprise-wide tactical health, status, indications, and warnings for Air Force satellites.  The end-state will be a modern technical infrastructure which is cyber-secure and resilient against the Advanced Persistent Threat and employs streamlined architecting, acquisition, and operational processes.  Through early architecture studies and prototyping, the government will establish clear ownership of the technical baseline to meet Better Buying Power principles as the EGS effort evolves through development.  This effort provides focus and expertise for the development, test, certification and enforcement of standards and interfaces for all AFSPC satellite ground systems to enable transition planning for legacy ground systems, new capability demonstrations, and systems acquisition leading to an enterprise ground architecture for Air Force space systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Conduct developmental planning, mature technologies, and develop initial small-scale prototype capability for the enterprise ground architecture.  Efforts in 2017 will include, but not be limited to, systems engineering, special studies, cybersecurity planning and implementation, standards and interface development and codification, integration and test efforts in support of demonstrations, and operational architecture planning.  In addition, this effort will build the technical and programmatic roadmap to enable a phased enterprise transition in the future."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY18, Enterprise Ground Services has been migrated to Space and Missile Test Evaluation Center PE 1203173F for core functions and continues in Evolved SBIRS BPAC 657106 in PEs 1206441F and 1206442F for SBIRS unique activities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "SPAF, BA 01 Line #13"
                                    },
                                    "Title": {
                                        "val": "MSSBIR: SBIR High (Space)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "542.713"
                                        },
                                        "CurrentYear": {
                                            "val": "362.504"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1113.429"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1113.429"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "547.664"
                                        },
                                        "BudgetYearThree": {
                                            "val": "659.317"
                                        },
                                        "BudgetYearFour": {
                                            "val": "728.302"
                                        },
                                        "BudgetYearFive": {
                                            "val": "545.076"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program office will use a variety of acquisition approaches to execute various concept studies, technology maturation efforts, testbed\/prototype demonstrations, and data exploitation initiatives and projects. The program office will collaborate with appropriate contracting agencies to support each individual effort. Data exploitation efforts in the laboratory and the Battlespace Awareness center will leverage existing external contracts, as well as new internal competitive contracts.   Activities, such as SBIRS obsolescence and affordability enhancements to the existing satellite design, will leverage existing Program of Record contracts. Technology maturation and component prototyping and\/or qualification could leverage existing contracts; in fact many are planned in collaboration with AFRL and other government agencies.  Where practical, other efforts could be competed.  FFRDC and SETA contractors will also be used to conduct and support studies.  New technology, replacement components, and system designs will be acquired with government data rights to the maximum extent to allow their incorporation into any future OPIR satellite production or system development.  Contracting partnerships with other agencies will also be used to study, develop, demonstrate and prove emerging capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technology Maturation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "17.030"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "61.309"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "61.309"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Exploitation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "27.434"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "31.269"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "59.346"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "59.346"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hosted Payloads"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "L3 Communications"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wilmington, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "20.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "WFOV Testbeds"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Millenium Space Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "21.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.972"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "23.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "23.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sensor Ground Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.798"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "14.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "14.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise SE&I"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.056"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.056"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Enterprise Ground Services (EGS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.100"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "FFRDC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.898"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.572"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.098"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.098"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.568"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "A & AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.017"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.035"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.035"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.949"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.118"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.593"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.593"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Technology Maturation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Data Exploitation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Wide Field of View Starer Payload"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Wide Field of View Testbed"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Sensor Ground Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657106"
                    },
                    "ProjectTitle": {
                        "val": "Evolved SBIRS"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "16.547"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.547"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "96.039"
                        },
                        "BudgetYearThree": {
                            "val": "43.020"
                        },
                        "BudgetYearFour": {
                            "val": "27.002"
                        },
                        "BudgetYearFive": {
                            "val": "92.231"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This program, BA 05 PE 1206441F, project 657106, Evolved SBIRS, is a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Evolved Space-based Infrared System (SBIRS) RDT&E FY18 budget justification exhibits describes the SBIRS Next Generation Overhead Persistent Infrared (Next-Gen OPIR) program (pre-MDAP PNO 499) and the ground modernization effort for Evolved SBIRS.\n\nSBIRS Next-Gen OPIR: The SBIRS’ primary mission is to provide initial warning of a ballistic missile attack on the US, its deployed forces, and its allies. SBIRS enhances detection and improves reporting of intercontinental ballistic missile launches, submarine launched ballistic missile launches, and tactical ballistic missile launches. The SBIRS Next-Gen OPIR will provide improved strategic missile warning coverage and increased resiliency in a strategic constellation to meet the requirements laid out in the Air Force draft Capability Development Document (CDD) based on the Air Force Space Command (AFSPC) Space Warfighting Construct (SWC) in response to the Space Enterprise Vision (SEV).\n\nThe SBIRS Next Gen OPIR systems includes both the space and ground elements. The Next Gen OPIR space segment will consist of Geostationary Earth Orbit (GEO) and Highly Elliptical Orbit (HEO) satellites, providing real-time persistent global infrared coverage using highly resilient bus with modernized payloads. The space segment will begin development of HEO space vehicles in FY21. The Future Operationally Resilient Ground Evolution (FORGE) and Enterprise Ground Services (EGS) are infrastructure modernization efforts to meet requirements laid out in the AFSPC SWC. The FORGE effort will implement an open framework for mission data processing and migration of C2 of satellite operations to integrate with EGS. FORGE and EGS efforts will provide the flexibility to integrate new mission data processing capabilities and more efficiently allow the system to meet evolving warfighter needs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Description": {
                                        "val": "The Next-Gen OPIR focuses on development of ground segment that will include EGS\/FORGE in incremental development. The Space segment development consists of resilient HEO and GEO satellites with modernized payloads. The FORGE effort will implement an open framework for mission data processing and migration of C2 of satellite operations to integrate with EGS. FORGE and EGS efforts will provide the flexibility to integrate new mission data processing capabilities and more efficiently allow the system to meet evolving warfighter needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.547"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.547"
                                            },
                                            "Text": {
                                                "val": "Begin infrastructure modernization of Future Operationally Resilient Ground Evolution (FORGE) and Enterprise Ground Services (EGS). The FORGE effort will implement a Government owned open framework for mission data processing and migrate C2 of satellite operations onto a common platform, EGS. FORGE and EGS platforms provide enhanced flexibility and scalability which will allow for more efficient integration of new mission data processing and C2 capabilities, standardized C2 interfaces across multiple space missions, a resilient cyber defense, and a system that is prepared to meet evolving user and warfighter needs.\n\nBegin risk reduction phase and engage industry in maturing payload designs that meet new missile warning requirements, balancing affordability, capability, and resiliency requirements. The risk-reduction phase is intended to develop a PDR-level design, plan for integration onto EGS, perform ground-based demonstrations, and will reduce risk for optical resilience hardware, intrinsically-hardened Focal Place Arrays (FPAs), multispectral and resilient processing algorithms, affordable pointing mirrors, and space processors.\n\nContinue program office and other related support activities that may include, but not limited to studies, technical analysis, etc."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA05: PE 1206442F"
                                    },
                                    "Title": {
                                        "val": "Evolved SBIRS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "71.018"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "71.018"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.766"
                                        },
                                        "BudgetYearThree": {
                                            "val": "139.812"
                                        },
                                        "BudgetYearFour": {
                                            "val": "558.940"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1015.241"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize existing SMC contracts to transition SBIRS C2 satellite operations to EGS. Compete a mission data processing framework provider and mission data processing applications.  For Next Gen OPIR space segment, the program office intends to conduct full and open competition for industry-wide participation and lowering overall program cost."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evolved SBIRS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "16.547"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "16.547"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "SBIRS Future Ground Evolution\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}