{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-66",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0210609A"
        },
        "ProgramElementTitle": {
            "val": "Paladin Integrated Management (PIM)"
        },
        "R1LineNumber": {
            "val": "146"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "136.353"
            },
            "CurrentYear": {
                "val": "41.498"
            },
            "BudgetYearOne": {
                "val": "6.112"
            },
            "BudgetYearOneBase": {
                "val": "6.112"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "183.963"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Paladin Integrated Management (PIM) is an ACAT 1C Acquisition Program. The program will replace the current fleet of M109 Family of Vehicles (FoV) consisting of the M109A6 Paladin Self Propelled Howitzer and M992A2 Field Artillery Ammunition Supply Vehicle (FAASV). PIM is an Army Modernization Program that addresses a critical capability gap created by the Non-Line of Sight Cannon termination in June of 2009 as well as obsolescence and Space, Weight,and Power (SWAP) issues in the M109 FoV current fleet. The PIM system integrates current Bradley Fighting Vehicle suspension and drive train items, Future Combat Systems (FCS) developed Electric Gun Drive systems and current fleet (M109A6) fire control systems into a new chassis providing better force protection, survivability and increases in electrical power over the current fleet. PIM is a two vehicle system:  The M109A7 Self Propelled Howitzer (SPH) and the M992A3 Carrier Ammunition Tracked (CAT).  The SPH has all characteristics listed above.  The CAT utilizes all of these same components and traits except those related directly to the cannon system. The PIM system replaces the current M109 FoV on a one for one basis, in the cannon fires battalions in the Armored Brigade Combat Team Formations and the Echelons above Brigade (EAB). The overall intent is to increase Soldier force protection, vehicle survivability, provide an appropriate amount of SWAP capacity to add future capabilities, increase vehicle reliability, reduce life cycle costs and extend the life of the M109 FoV through FY 2050."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "152.288"
                },
                "CurrentYear": {
                    "val": "41.498"
                },
                "BudgetYearOne": {
                    "val": "6.112"
                },
                "BudgetYearOneBase": {
                    "val": "6.112"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "136.353"
                },
                "CurrentYear": {
                    "val": "41.498"
                },
                "BudgetYearOne": {
                    "val": "6.112"
                },
                "BudgetYearOneBase": {
                    "val": "6.112"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-15.935"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-9.900"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.035"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "ED8"
                    },
                    "ProjectTitle": {
                        "val": "Paladin Integrated Management (PIM)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "136.353"
                        },
                        "CurrentYear": {
                            "val": "41.498"
                        },
                        "BudgetYearOne": {
                            "val": "6.112"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.112"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "183.963"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Paladin Integrated Management (PIM) is an ACAT 1C Acquisition Program. The program will replace the current fleet of M109 Family of Vehicles (FoV) consisting of the M109A6 Paladin Self Propelled Howitzer and M992A2 Field Artillery Ammunition Supply Vehicle (FAASV). PIM is an Army Modernization Program that addresses a critical capability gap created by the Non-Line of Sight Cannon termination in June of 2009 as well as obsolescence and Space, Weight, and Power (SWAP) issues in the M109 FoV current fleet. The PIM system integrates current Bradley Fighting Vehicle suspension and drive train items, Future Combat Systems (FCS) developed Electric Gun Drive systems and current fleet (M109A6) fire control systems into a new chassis providing better force protection, survivability, and increases in electrical power over the current fleet. PIM is a two vehicle system:  The M109A7 Self Propelled Howitzer (SPH) and the M992A3 Carrier Ammunition, Tracked (CAT).  The SPH has all characteristics listed above.  The CAT utilizes all these same components and traits except those related directly to the cannon system. The PIM system replaces the current M109 FoV on a one for one basis, in the cannon fires battalions in the Armored Brigade Combat Team Formations and the Echelons above Brigade (EAB). The overall intent is to increase Soldier force protection, vehicle survivability, provide an appropriate amount of SWAP capacity to add future capabilities, increase vehicle reliability, reduce life cycle costs, and extend the life of the M109 FoV through FY 2050."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Paladin\/FAASV Integrated Management (PIM) Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following contractor developmental efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "74.873"
                                            },
                                            "Text": {
                                                "val": "Funding provided contractor support for the execution of the final Engineering and Manufacturing Development (EMD) testing for the M109A7 Self Propelled Howitzer (SPH) and the M992A3 Carrier Ammunition, Tracked (CAT).   These tests included Production Qualification Test (PQT), Initial Operational Test and Evaluation (IOT&E), Full Up System Live Fire (FUSL), Threshold 2 (T2) and Under Belly Armor characterization testing.  Threshold 1 (T1) is the base vehicle configuration without add-on armor.  T2 is the vehicle with add-on armor kits to increase force protection\/survivability.  These events were conducted at various test sites throughout the US including Yuma Proving Grounds (YPG), Aberdeen Proving Grounds (APG), White Sands Missile Range (WSMR), and the Cold Regions Test Center (CRTC).  Software Phase III maintenance and Training Aids, Devices, Simulators and Simulations (TADSS) development was also conducted.  New Equipment Training (NET) Programs of Instruction (POI) development and execution to support IOT&E was accomplished.  All of the listed events were required to complete the various documentation requirements and test reports that will determine the operational suitability of the system and support the Full Rate Production decision in 4th QTR FY 2018."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.504"
                                            },
                                            "Text": {
                                                "val": "Funding provides contractor support for the execution of the final Engineering and Manufacturing Development (EMD) testing for the M109A7 Self Propelled Howitzer (SPH) and the M992A3 Carrier Ammunition, Tracked (CAT).   These tests include Production Qualification Test (PQT), Initial Operational Test and Evaluation (IOT&E), Full Up System Live Fire (FUSL), and Under Belly Armor characterization testing.  The reduced funding level from FY 16 to FY 17 reflects the culmination of the test events and writing of the test reports, addressing any issues discovered during test and the shift of the actual IOT&E test event into the 1st QTR FY17.  These events will be conducted at various test sites throughout the US including Yuma Proving Grounds (YPG), Aberdeen Proving Grounds (APG), White Sands Missile Range (WSMR), and the Cold Regions Test Center (CRTC).  Software Phase III maintenance and Training Aids, Devices, Simulators and Simulations (TADSS) development will also be conducted this year.  New Equipment Training (NET) Programs of Instruction (POI) development and execution to support IOT&E will be accomplished this year.  All of the listed events are required to complete the various documentation requirements and test reports that will determine the operational suitability of the system and support the Full Rate Production decision in 4th QTR FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.755"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.755"
                                            },
                                            "Text": {
                                                "val": "Funding enables the government to complete all efforts on the M109 FOV Program to include the close out of the existing EMD work effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following Government test efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "49.609"
                                            },
                                            "Text": {
                                                "val": "Funding provided program support and execution of the final EMD testing for the M109A7 Self Propelled Howitzer (SPH) and the M992A3 Carrier Ammunition, Tracked (CAT).   These tests included Production Qualification Test (PQT), Initial Operational Test and Evaluation (IOT&E), Full Up System Live Fire (FUSL), T2 and the DAE directed Underbelly characterization testing.  T2 is the vehicle with add-on armor kits to increase force protection\/survivability.  These events were conducted at various test sites throughout the US including Yuma Proving Grounds (YPG), Aberdeen Proving Grounds (APG), White Sands Missile Range (WSMR), and the Cold Regions Test Center (CRTC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.973"
                                            },
                                            "Text": {
                                                "val": "Funding provides program support and execution of the final EMD testing for the M109A7 Self Propelled Howitzer (SPH) and the M992A3 Carrier Ammunition, Tracked (CAT).   These tests include Production Qualification Test (PQT), Initial Operational Test and Evaluation (IOT&E), Full Up System Live Fire (FUSL), T2 and the DAE directed Underbelly characterization testing.  T2 is the vehicle with add-on armor kits to increase force protection\/survivability.  These events will be conducted at various test sites throughout the US including Yuma Proving Grounds (YPG), Aberdeen Proving Grounds (APG), White Sands Missile Range (WSMR), and the Cold Regions Test Center (CRTC)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following program management support:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.365"
                                            },
                                            "Text": {
                                                "val": "Continued Government System Engineering and Program Management for the total program including: Original Equipment Manufacturer (OEM) management consisting of weekly, monthly, and quarterly program management reviews; continued contract execution management for the EMD phase contract.  Managed Government Developmental System Test and Evaluation program as it enters the LRIP testing phase.  Management of the program cost, schedule, and performance metrics including making programmatic trade-off decisions.  Management of Other Governmental Agencies (OGAs) that supported the PIM program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.295"
                                            },
                                            "Text": {
                                                "val": "Continue the Government System Engineering and Program Management for the total program including: Original Equipment Manufacturer (OEM) management consisting of weekly, monthly, and quarterly program management reviews; continue contract execution management for the EMD phase contract until completion of all efforts in FY 2018.  Manage Government Developmental System Test and Evaluation program as it enters the LRIP testing phase.  Management of the program cost, schedule, and performance metrics including making programmatic trade-off decisions.  Management of Other Governmental Agencies (OGAs) that support the PIM program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.579"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.579"
                                            },
                                            "Text": {
                                                "val": "Continue the Government System Engineering and Program Management for the total program including: Original Equipment Manufacturer (OEM) management consisting of weekly, monthly, and quarterly program management reviews; continue contract execution management for the EMD phase contract until completion of all efforts in FY 2018.  Manage Government Developmental System Test and Evaluation program as it enters the LRIP testing phase.  Management of the program cost, schedule, and performance metrics including making programmatic trade-off decisions.  Management of Other Governmental Agencies (OGAs) that support the PIM program."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following training government and contractor efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.796"
                                            },
                                            "Text": {
                                                "val": "Completed final development of training support packages and POI's to support IOT&E and LOG verification events.  Completed Training Aids, Devices, Simulators and Simulations for Operational Test units in support of IOT&E."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.726"
                                            },
                                            "Text": {
                                                "val": "Complete final development of training support packages and POI's to support IOT&E and Full Rate Decision.  Complete Training Aids, Devices, Simulators and Simulations for Operational Test units in support of IOT&E."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.778"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.778"
                                            },
                                            "Text": {
                                                "val": "Funding provides for the review of current training support packages, training aids and devices based on the EMD effort for cannon system development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following data contractor efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.710"
                                            },
                                            "Text": {
                                                "val": "Maintained Contractor Technical Data Packages.  Continued the validation of Technical Publications that will support IOT&E and the future Active and Reserve component units during fielding."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Paladin Integrated Management"
                                    },
                                    "Title": {
                                        "val": "Paladin Integrated Management"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "273.850"
                                        },
                                        "CurrentYear": {
                                            "val": "594.489"
                                        },
                                        "BudgetYearOne": {
                                            "val": "772.149"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "646.413"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "125.736"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "511.069"
                                        },
                                        "BudgetYearThree": {
                                            "val": "602.194"
                                        },
                                        "BudgetYearFour": {
                                            "val": "627.204"
                                        },
                                        "BudgetYearFive": {
                                            "val": "603.010"
                                        },
                                        "CostToComplete": {
                                            "val": "2332.024"
                                        },
                                        "TotalCost": {
                                            "val": "6315.989"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The PIM Program was initiated on 16 August 2007 under the BAE Systems, Inc., System Technical Support (STS) Contract W56HZV-07-C-0096.  Subsequent work directives were awarded under BAE STS contract W56HZV-07-C-0256 to further define the configuration of the PIM vehicles.  On 14 August 2009, a Research, Development, Test and Evaluation (RDT&E) Contract W56HZV-09-C-0550 was awarded to BAE Systems Inc. for the Prototype Development and Fabrication of 7 prototype vehicles (5 PIM Self Propelled Howitzer (SPH) Systems and 2 PIM Carrier Ammunition, Tracked (CAT) vehicles).  A Comprehensive Contract Modification (CCM) award to the RDT&E contract was accomplished on 6 January 2012.  This modification allows for the completion of the design engineering and initial developmental test portion of the Engineering and Manufacturing Development (EMD) Phase and transfers the system responsibility for the program from the Government to BAE Systems Inc.   An additional modification to the EMD contract was awarded on 18 July 2014 to extend the contract until 31 March 2017 to cover contractor support to Production Qualification Testing (PQT), the Logistics Demonstration, and Initial Operational Test & Evaluation (IOT&E).  The awarded Low-Rate Initial Production (LRIP) contract is of a Fixed Price Incentive Firm Target (FPIF) contract type for procurement of vehicles with a period of performance running from November 2013 through approximately June 2019.  The LRIP contract will provide for three LRIP years with the initial base year including 19 SPHs and 18 CATs and the remaining three option years with 18 sets, 30 sets and 48 sets, respectively (each set consisting of one each SPH and CAT) of PIM vehicles.  The Full Rate Production (FRP) contract is planned as a FPIF contract with the option to convert to a Firm Fixed Price (FFP) contract after the first year of FRP.  The FRP contract provides for the remaining PIM vehicles to fulfill the requirement up to the Army Acquisition Objective of 580 sets."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}