{
    "id": "2018-Navy-PB-1319-JBOOK-a7cc640ffed4392d95d7f988b4b952d94a6133d0328e6a89c81644204d772893-12",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602750N"
        },
        "ProgramElementTitle": {
            "val": "(U)Future Naval Capabilities Applied Research"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "172.511"
            },
            "CurrentYear": {
                "val": "165.103"
            },
            "BudgetYearOne": {
                "val": "156.805"
            },
            "BudgetYearOneBase": {
                "val": "156.805"
            },
            "BudgetYearTwo": {
                "val": "158.197"
            },
            "BudgetYearThree": {
                "val": "156.435"
            },
            "BudgetYearFour": {
                "val": "169.481"
            },
            "BudgetYearFive": {
                "val": "182.961"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) address the Applied Research associated with the Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the Navy Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are identified by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders. The Enabling Capabilities (ECs) and associated technology product investments of the FNC Program are competitively selected by a 3-star Technology Oversight Group (TOG), chartered by the S&T Corporate Board and representing the requirements, acquisition, research and fleet\/forces communities of the Navy and the Marine Corps."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "179.538"
                },
                "CurrentYear": {
                    "val": "165.103"
                },
                "BudgetYearOne": {
                    "val": "175.233"
                },
                "BudgetYearOneBase": {
                    "val": "175.233"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "172.511"
                },
                "CurrentYear": {
                    "val": "165.103"
                },
                "BudgetYearOne": {
                    "val": "156.805"
                },
                "BudgetYearOneBase": {
                    "val": "156.805"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.027"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-18.428"
                },
                "BudgetYearOneBase": {
                    "val": "-18.428"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.570"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.457"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-18.428"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-18.428"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 funding request was reduced by -$6.8 million as required for the Department of the Navy to comply with the Bipartisan Budget Act of 2015.\n\nTechnical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "(U)Future Naval Capabilities Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "172.511"
                        },
                        "CurrentYear": {
                            "val": "165.103"
                        },
                        "BudgetYearOne": {
                            "val": "156.805"
                        },
                        "BudgetYearOneBase": {
                            "val": "156.805"
                        },
                        "BudgetYearTwo": {
                            "val": "158.197"
                        },
                        "BudgetYearThree": {
                            "val": "156.435"
                        },
                        "BudgetYearFour": {
                            "val": "169.481"
                        },
                        "BudgetYearFive": {
                            "val": "182.961"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "FNC investments are typically 3-5 years in duration.  They provide a continuance of basic research by maturing technologies from a Technology Readiness Level (TRL) of 3 or 4 to a TRL of 6.  All FNC products require BA2 and BA3 funded technology development, which is coordinated to ensure tangible technology products are delivered upon completion of each investment.  Each year the TOG refreshes the FNC Program by approving new ECs and technology products as older ones get delivered.  After transition to an acquisition program, FNC products are further engineered, integrated and, ultimately, delivered to the warfighter. The development and delivery of each FNC product is guided by a Technology Transition Agreement (TTA) that is signed by the requirements and acquisition sponsors, as well as the S&T developer.\n\nThis project supports the naval pillars of Capable Manpower, Enterprise and Platform Enablers, Expeditionary Maneuver Warfare, Force Health Protection, Forcenet, Power and Energy, Sea Basing, Sea Shield and Sea Strike.  Each of these pillars is listed as a separate R-2 Activity, as is FNC Management.  Under each R-2 Activity, the BA 6.2 accomplishments and plans for every Enabling Capability (EC) and Technology Product in the FNC Program are listed.  ECs are composed of one or more interrelated technology products, so for clarity, each product is shown under its EC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CAPABLE MANPOWER (CMP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Capable Manpower (CMP) FNC pillar.  The CMP Pillar develops deliverable technologies that provide new capabilities in manpower and personnel management, training and education, and human-systems integration for more intuitive systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.934"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY12-01 LIVE, VIRTUAL, & CONSTRUCTIVE TRAINING FIDELITY\n- Complete Cognitive Fidelity Synthetic Environment - Develop optimal characteristics for virtual simulations to elicit the appropriate perceptual-cognitive responses for Naval aviation training.\n- Complete Tactics & Speech Capable Semi-Automated Forces - Conduct applied research to develop learner-aware semi-autonomous forces.\n- Complete Virtual-Constructive Representations on Live Avionics Displays - Develop design guidelines for effective and safe representation of virtual and constructive assets on live displays.\n\nEC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Optimize manpower variables (task allocation, job and occupation codes, billets, and training) to better estimate the manpower components of ship total ownership cost.\n- Continue Platform Design and Acquisition Toolset - Develop assessment reporting tools that identify the dependencies, drivers, and risks associated with different platform designs and manning configurations.\n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue Dynamic, Adaptive & Modular Training for UAS - Expand the activity learning capability to allow automatic matching between UAS operator training objectives, specific training contexts, and computer generated force behaviors.\n- Continue Selection for UAS Personnel (SUPer) - Develop mission scenarios to enable testing for the knowledge, skills and abilities required to operate Navy unmanned aircraft systems and integrate them into an appropriate UAS simulator.\n- Continue UAS Control Station Human Machine Interface - Develop metrics that assess UAS Operator performance in terms of the likelihood of leading to successful unmanned aircraft system operation.\n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Continue Decision Making-Learning Management System (DM-LMS) - Develop new technology solutions for decision making, instructional method guidelines, and software products to plan, assess, and track decision making skill development.\n- Continue Digital Integrated Representation of Tactical Environment (DIRTE) - Develop new technology solutions for classroom and sustainment training and develop rapid terrain modeling and sketchpad software products to enable small unit leaders and instructors the ability to create effective decision making environments and scenarios.\n- Continue Simulation Tailored Training and Assessment (ST2A) - Develop new technology solutions for situated tutor techniques and unobtrusive monitoring techniques, and develop software and hardware prototypes to execute a decision making program of instruction and scenarios in simulation.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\n- Continue Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Investigate and develop an approach to an objective, metrics-driven training and experimentation capability for Fast Attack Craft and Mine Warfare threats.\n\nEC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Initiate Operational Planning Tool - Develop decision support analytic tools that enhance collaborative planning for generating and executing safe and effective navigation & operational plans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.753"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Develop measures and metrics to assess variable work packaging, improved manpower variables (task allocation, job and occupation codes, billets, and training), and estimate manpower, personnel, and training costs to better understand ship Total Ownership Cost.\n- Complete Platform Design and Acquisition Toolset - Deliver new manpower and system response metrics that report on the balance between system design and manpower requirements.\n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue UAS Control Station Human Machine Interface - Define the priority autonomy capabilities needed by operators for the Supervisory Control of next generation unmanned systems.\n- Complete Selection for UAS Personnel (SUPer) - Evaluate and refine tests for the selected knowledge, skills, and abilities required to operate Navy unmanned aircraft systems.\n- Complete Dynamic, Adaptive & Modular Training for UAS - Analyze the generalization process of pattern-of-life for computer generated forces to novel activities, locations, and scenarios.  \n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Continue Digital Integrated Representation of Tactical Environment (DIRTE) - Develop a Graphical User Interface (GUI) for environment generation and the capture of relevant environmental context, including maps and terrain, to train individual Marines, small unit leaders, and company level staff.\n- Continue Simulation Tailored Training and Assessment (ST2A) - Develop new technology solutions for situated tutor techniques and unobtrusive monitoring techniques, and develop software and hardware prototypes to execute a decision making program of instructional scenarios in simulation.\n- Continue Decision Making-Learning Management System (DM-LMS) - Define Kill Probability (KP) Measures (including non-performance) of decision making mastery for ground infantry squad leaders in order to reliably measure acquisition of expertise in psychomotor, cognitive\/metacognitive, and affective domains.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\t\n- Continue Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Assess Artificial Intelligence-enabled activities in the Electromagnetic Spectrum (EMS) reflecting presence of non-combatant entities in the EMS and a representation of Opposition Forces tailored to training audience proficiency and learning objectives.\n\nEC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Continue Operational Planning Tool - Develop a systematic understanding of distributed, near-real time collaboration and decision making applicable for planning and operational staff.\n\nEC: CMP-FY17-02 FUTURE INTEGRATED TRAINING ENVIRONMENT (FITE)\n- Initiate Future Integrated Training Environment (FITE) - Investigate and assess technologies and methods to improve the ability to conduct Live, Virtual, and Constructive training events for the Marine Air-Ground Task Force (MAGTF)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.929"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.929"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n-  Complete Manpower Planning and Optimization Toolset - Demonstrate the new analytics to measure variable work packaging, optimize manpower variables (task allocation, job and occupation codes, billets, and training), and estimate manpower, personnel, and training costs to better characterize manpower components of overall ship total ownership cost.\n\nFNC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Complete UAS Control Station Human Machine Interface - Validate the human machine interface design concepts for supervisory control and for documenting design lessons learned from user experimentation.\n\nFNC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Complete Decision Making-Learning Management System (DM-LMS) - Research and design measures of decision making mastery for ground infantry squad leaders in order to reliably measure acquisition of expertise.\n- Complete Digital Integrated Representation of Tactical Environment (DIRTE) - Design the Graphical User Interface (GUI) for environment generation and the capture of relevant environmental context, including maps and terrain, to train individual Marines, small unit leaders, and company level staff.\n- Complete Simulation Tailored Training and Assessment (ST2A) - Assess feasibility and design solutions for situated tutor techniques and unobtrusive monitoring techniques, and develop software and hardware prototypes to execute adaptive decision making scenarios in simulation.\n\nFNC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS, TRAINING & EXPERIMENTATION (EDUCAT2E)\t\n- Complete Environment Designed to Undertake Counter A2AD Tactics, Training & Experimentation (EDUCAT2E) - Finish modeling of the pacing threat denied and degraded effects on the unit sensors of blue, joint and partner nations in a distributed, virtual\/constructive training, and certification\/mission rehearsal environment.\n\nFNC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Continue Operational Planning Tool - Develop new capabilities to support, plan, brief, execute, and assess the Navy planning process in order to facilitate real-time situational awareness and rapid re-planning. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-01 under a new Information Warfare R-2 Activity)\n\nFNC: CMP-FY17-01 MANPOWER, PERSONNEL & TRAINING STRATEGIC PLANNING APPLICATION\n- Initiate Manpower, Personnel & Training Planning Application - For this FNC, delayed one year to start in FY18, develop a fundamental understanding of the risks and uncertainties underlying Manpower, Personnel, and Training interconnections and performance drivers, including potential impact points, time delays, and pathways of decisions across the enterprise. \n\nFNC: CMP-FY17-02 FUTURE INTEGRATED TRAINING ENVIRONMENT (FITE)\n- Continue Future Integrated Training Environment (FITE) - Assess feasibility and design solutions for a single world-like representation of available terrain databases, making them easily available to exercise planners, and develop initial requirements to link ground and air simulation trainers. \n\nFNC: CMP-FY18-01 LEARNING CONTINUUM AND PERFORMANCE AID (LCAPA)\n- Initiate Learning Continuum and Performance Aid (LCaPA) - Develop a fundamental understanding of the skills, training, and performance measures necessary to manage individualized learning and performance tracking. \n\nFNC: CMP-FY18-02 MANNED AND UNMANNED COMMON PLANNING PICTURE\n- Initiate Manned and Unmanned Common Planning Picture - Develop software heuristics and automated rule sets for future integration into a single Commander's intent planner. (In FY19, this FNC Product will be realigned within this PE to UW-FY18-01 under a new Undersea Warfare R-2 Activity)\n\nFNC: CMP-FY19-03 Fleet Training Technologies (FleeT2)\n- Initiate FleeT2 - Conduct analyses of representational techniques, model dynamics, and high computational tractability. (In FY19, this FNC Product will be realigned within this PE to SW-FY19-04 under a new Surface Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENTERPRISE AND PLATFORM ENABLERS (EPE)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Enterprise and Platform Enablers (EPE) FNC pillar.  The EPE Pillar develops cross-cutting, deliverable technologies that provide new capabilities for naval service platforms that lower acquisition, operations and maintenance costs, improve system safety and availability, and improve platform survivability.   \n\nThe FY 2016 to FY 2017 decrease was due primarily to the completion of EPE-FY12-01 and EPE-FY13-01, and the planned ramp-down of EPE-FY14-02 and EPE-FY15-02.\n\nThe FY 2017 to FY 2018 increase was due primarily to the ramp up EPE-FY15-03 New Material(s) Development & Lab Characterization, which will evaluate new material mitigation technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.196"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT\n- Continue Integrated Thermal Management System Design - Conduct small scale testing of thermal management panels.\n\nEC: EPE-FY12-01 CORROSION MITIGATION TECHNOLOGIES\n- Complete Corrosion Resistant Surface Treatment - Determine best Corrosion Resistant Surface Treatment among carbon, nitrogen, and carbonitration approaches.\n- Complete Sprayable Acoustic Damping Systems - Investigate and develop spray applied damping systems for improved structural vibration control.\n\nEC: EPE-FY12-02 INTEGRATED HYBRID STRUCTURAL MANAGEMENT SYSTEM (IHSMS)\n- Complete IHSMS Fleet Structural Health Management Decision Tool - Optimize physics and statistical based structural health models, rotor hot-spot sensors and integration technologies, and finalize risk reduction experiments.\n\nEC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Complete Tools for Predicting Array Operational Loading & Distribution - Develop a predictive model of the magnitude and distribution of hydrodynamic forces on a towed array and the effect of the forces on array internal components.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Investigate and develop advanced corrosion control and thermal load reduction coatings and surface treatment\/repair technologies for improved corrosion and cracking resistance on aluminum substrates.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Develop a sensitization detection tool hardware and refine the prediction algorithm for determining the rate of sensitization.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Develop and evaluate a set of alloys and coatings to support higher temperature capable gas turbine operation.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Develop new hull treatment materials for submarines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.903"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT\n- Complete Integrated Thermal Management System Design - Analyze data of flight deck thermal management system during at-sea test.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Develop coating and repair tools for final testing.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Assess the robustness of the Degree of Sensitization (DoS) prediction algorithm and refine the algorithm for integration into the DoS detection tool.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Develop advanced marinized coatings for higher temperature service, marinized single crystal alloys, and disk coatings for oxidation and corrosion resistance.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Develop new materials mitigation technology for submarines.\n\nEC: EPE-FY16-01 ADVANCED TOPCOAT SYSTEM (ATS)\n- Initiate Advanced Topcoat Systems for Air Vehicle (ATS-AV) - Conduct formula optimization and modification development of advanced protective coating constituent combinations and preliminary material property validation towards TRL 6 formulas.\n\nFNC:  EPE-FY19-04 Signature Management System (SMS)\n- Initiate SMS - Conduct applied research for submarine applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.708"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.708"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Conduct a final assessment of the aluminum coating to minimize radiant heat build-up and an evaluation of aluminum repair tools.  (In FY19, this FNC Product will be realigned within this PE to SW-FY14-01 under a new Surface Warfare R-2 Activity)\n- Complete Aluminum Alloy Corrosion Prediction Tool - Conduct an assessment of aluminum corrosion prediction software integrated with the developed Degree of Sensitization (DoS) detection tools. \n\nFNC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Complete university hot corrosion and mechanical testing of materials and down-select the best materials for hardware development. (In FY19, this FNC Product will be realigned within this PE to SW-FY15-01 under a new Surface Warfare R-2 Activity)\n\nFNC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Evaluate new material mitigation technology. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-01 under a new Undersea Warfare R-2 Activity)\n\nFNC: EPE-FY16-01 ADVANCED TOPCOAT SYSTEM (ATS)\n- Continue Advanced Topcoat Systems for Air Vehicle (ATS-AV) - Conduct formula optimization and modification development of advanced protective coating constituent combinations and preliminary material property validation toward TRL 6 formulas.  (In FY19, this FNC Product will be realigned within this PE to AW-FY16-01 under a new Air Warfare R-2 Activity)\n\nFNC: EPE-FY19-04 Signature Management System (SMS)\n- Continue SMS - Continue applied research technology development for submarine applications. (In FY19, this FNC Product will be realigned within this PE to UW-FY19-01 under a new Undersea Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPEDITIONARY MANEUVER WARFARE (EMW)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Navy funded Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Expeditionary Maneuver Warfare (EMW) FNC Pillar.  The EMW Pillar develops deliverable technologies that provide new capabilities in expeditionary maneuver warfare, including naval ground forces, with special emphasis on regular and irregular warfare in urban environments and combating terrorism.  \n\nThe FY 2016 to FY 2017 decrease was due primarily to the planned ramp down of EMW-FY12-02 and the continuation of EMW-FY14-01 and EMW-FY16-01 in PE 0602131M.\n\nThe FY 2017 to FY 2018 decrease was due primarily to the completion and transition to acquisition of EMW-FY12-02 Future Joint Counter Radio-Controlled IED Electronic Warfare (JCREW) and the continuation of EMW-FY17-01 High Reliability DPICM Replacement (HRDR) in PE 0602131M Marine Corps Landing Force Technology, which was funded in this PE in FY17."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.015"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Continue Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Refine radio frequency situational awareness techniques and distributed resource allocation on multiple ground-based Electronic Warfare systems by providing automated tactical-level distributed jamming.\n- Continue Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Enable the simultaneous transmission and reception of blue-force and  Electronic Warfare communication waveforms by finalizing the components and techniques.\n\nEC:  EMW-FY13-01 AZIMUTH AND INERTIAL MICRO-ELECTRO-MECHANICA SYSTEM (MEMS) NAVIGATION SYSTEM\n- Complete Micro-Electro-Mechanical System (MEMS) Inertial Navigation System - Complete optimization of MEMS  sensor performance to reduce target location error in the Navigation System of hand-held targeting systems.\n\nEC: EMW-FY14-01 SPECTRAL AND RECONNAISSANCE IMAGERY FOR TACTICAL EXPLOITATION (SPRITE)\n- Complete Automated Processing for Spectral Exploitation and Dissemination (APSED)  - Develop an Electro-Optical (EO) and Hyper-Spectral Imagery (HSI) Image Processing architecture that includes EO to HSI cross-correlation and fusion, image archiving and retrieval, and exploitation product generation.\n- Complete Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS) - Develop preliminary hardware design for a wide-area intelligence, surveillance and reconnaissance capability with simultaneous high spatial and spectral resolution.\n\nEC: EMW-FY16-01 DENSIFIED PROPELLANT FIRE FROM ENCLOSURE - CONFINED SPACE (FFE\/CS) PROPULSION TECHNOLOGIES\n- Initiate Densified Propellant Fire From Enclosure - Confined Space (FFE\/CS) Propulsion Technologies - Refine tungsten-propellant mix, grain dimensions and configuration, and the fabrication process to reach suitable rocket nozzle exit velocities and sound pressure levels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.959"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Complete Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Conduct final testing of Radio Frequency (RF) situational awareness techniques and distributed resource allocation on multiple ground-based Electronic Warfare (EW) systems by providing automated tactical-level distributed jamming.\n- Complete Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Finalize the components and techniques to allow simultaneous transmission and reception of blue-force and Electronic Warfare (EW) communication waveforms.\n\nEC: EMW-FY16-01 DENSIFIED PROPELLANT FIRE FROM ENCLOSURE - CONFINED SPACE (FFE\/CS)\nPROPULSION TECHNOLOGIES\n- Continued in PE 0602131M\n\nEC: EMW-FY17-01 HIGH RELIABILITY DPICM REPLACEMENT (HRDR)\n- Initiate High Reliability DPICM Replacement - Define High Reliability Dual-purpose Improved Conventional Munitions Master Safe and Arm Device hardware design and system architecture to transfer all arming, safing, and communication signals to\/from the projectile's 56 sub-munition fuzes in under 6 seconds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: EMW-FY17-01 HIGH RELIABILITY DPICM REPLACEMENT (HRDR)\n- Continued High Reliability DPICM Replacement in PE 0602131M."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FNC MANAGEMENT"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity includes the Science and Technology (S&T) analyses and studies required to take new Future Naval Capabilities (FNC) Program Enabling Capabilities (ECs) approved by the Technology Oversight Group and produce the detailed technology specifications and performance metrics needed to procure the component level technologies that must be developed and tested in order to deliver technology products to the acquisition community.  This activity includes development and implementation of innovative and dynamically changing technology management business processes required to manage FNC investments supporting the naval capability pillars."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC MANAGEMENT\n- Continue FNC Management - New Start Preparations - Conduct technology analysis and studies to support the development and validation of technology performance specifications to ensure new enabling capabilities are able to commence execution in a timely manner.\n- Continue FNC Management - Support\/OPS Analysis - Conduct warfighter sustainment Applied Research and analysis, including technology management of FNC investments supporting the naval capability pillars."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.385"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC MANAGEMENT\n- Continue FNC Management - New Start Preparations - Conduct technology analysis and studies to support the development and validation of technology performance specifications to ensure new enabling capabilities are able to commence execution in a timely manner.\n- Continue FNC Management - Support\/OPS Analysis - Conduct warfighter sustainment Applied Research and analysis, including technology management of FNC investments supporting the naval capability pillars."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.056"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC MANAGEMENT\n- Continue FNC Management - New Start Preparations - Conduct technology analysis and studies to support the development and validation of technology performance specifications to ensure new enabling capabilities are able to commence execution in a timely manner.\n- Continue FNC Management - Support\/OPS Analysis - Conduct warfighter sustainment Applied Research and analysis, including technology management of FNC investments supporting the naval capability pillars."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE HEALTH PROTECTION (FHP)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Force Health Protection (FHP) FNC pillar.  The FHP Pillar develops deliverable technologies that provide new capabilities that provide Sailors and Marines with the best possible protection from operational threats by reducing morbidity and mortality when casualties occur.\n\nThe FY 2016 to FY 2017 decrease was due primarily to the completion of FHP-FY11-01 and FHP-FY12-02, and the planned ramp-down of FHP-FY14-01 and FHP-FY14-03.\n\nThe FY 2017 to FY 2018 decrease was due primarily to the completion of FHP-FY12-01 Automated Critical Care System (ACCS), which finished the development of the prototype hardware\/software that monitors and maintains combat causalities with minimal human intervention, and the planned ramp down of 1) FHP-FY14-01 Acute Care Cover for Severely Injured Limbs (ACCSIL), which in FY18 is finishing the final elements of efficacy testing of innovative pharmaceutical solutions and novel materials that will enhance the bandage system for management of complex limb trauma, and 2) FHP-FY14-03 Blast Load Assessment Sense and Test (BLAST), which will finish S&T development in FY18 with the completion of algorithm predictions, the integration of data and power management technologies, and the validation of the neuro-functional assessment device that estimates Traumatic Brain Injury (TBI)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.331"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY11-01 MULTIFUNCTIONAL BLOOD SUBSTITUTE (MFBS)\n- Complete Multifunctional Blood Substitute (MFBS) - Finalize animal testing of optimal blood component mixture.\n\nEC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM\n- Continue Automated Critical Care System (ACCS) - Formulate autonomous hardware and software system to monitor and maintain combat casualties with minimal human intervention during a 2-6 hour Casualty Evacuation scenario. \n\nEC: FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n- Complete SEMPer Fi for Land Blast Kit - Determine window of therapeutic intervention and dosing with hypothermia for immediate treatment of blast overpressure in small and large animals, including injury to the brain or internal organs.\n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Conduct assembly of the sensor suite to detect and predict the onset of hypoxia and integrate mitigation strategies for individuals operating in high altitudes or Casualty Evacuation missions in unpressurized aircraft.\n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Develop a fieldable wound cover comprising outer cover materials and an internal pharmaceutical coating that improves the clinical outcome of severe wounds.\n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Algorithm - Collect experimental data for use in algorithm development that relates integrated blast intensity with cognitive impairment to predict the likelihood of brain injury after single or multiple blast exposures.\n- Continue Neuro-Functional Assessment Tool - Conduct experimental development of a non-psychometric device that detects and estimates the severity of traumatic brain injury.\n- Continue Sensor - Demonstrate a self-powered blast sensor in bench and laboratory testing for sensitivity to acceleration, pressure and impulse."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.730"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM\n- Complete Automated Critical Care System (ACCS) - Complete technology development of hardware\/software to monitor and maintain combat causalities with minimal human intervention during a 2-6 hour Casualty Evacuation (CASEVAC) scenario.  \n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH\n- Continue Hypoxia Alert and Mitigation System - Continue efforts to predict the onset of hypoxia and integrate mitigation strategies for individuals operating in high altitudes or Casualty Evacuation missions in unpressurized aircraft.  \n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Conduct efficacy testing of innovative pharmaceutical solutions and novel materials for use in an enhanced bandage system for management of complex limb trauma.  \n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Blast Load Assessment: Sense and Test (BLAST) (formerly sensor, algorithm, and neurofunctional assessment tool) - Model the relationship between the injurious forces from blast incidents and the medical outcomes experienced by exposed warfighters, conduct validation of a Neuro-Functional Assessment Tool that provides a simple evaluation for Traumatic Brain Injury, and refine the self-powered, head-mounted, micro sensor being developed to detect the blast over-pressure and acceleration forces that cause traumatic brain injury.\n\nEC: FHP-FY16-01 INCAPACITATION PREDICTION FOR READINESS IN EXPEDITIONARY DOMAINS - AN INTEGRATED COMPUTATIONAL TOOL (I-PREDICT)\n- Initiate I-PREDICT - Begin development of an integrated, in-silico, morphomentrically-scalable model of the human being that estimates the injury response from external forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.308"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.308"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH\n- Continue applied research efforts to exploit methods of detecting individual-specific challenges associated with combating casualties in warfighters operating at altitude.\n\nFNC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Complete Acute Care Cover for Severely Injured Limbs (ACCSIL) - Conduct efficacy testing of innovative pharmaceutical solutions and novel materials that will enhance the bandage system for management of complex limb trauma.\n\nFNC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Complete Blast Load Assessment: Sense and Test (BLAST) - Finish algorithm predictions, integrate data and power management technologies, and validate the neuro-functional assessment device to estimate Traumatic Brain Injury.\n\nFNC: FHP-FY16-01 INCAPACITATION PREDICTION FOR READINESS IN EXPEDITIONARY DOMAINS - AN INTEGRATED COMPUTATIONAL TOOL (I-PREDICT)\n- Continue I-PREDICT - Develop an integrated, in-silico, morphometrically scalable model of the human being to estimate injury response from external forces (i.e., blunt, blast and vibratory forces)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCENET (FNT)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Forcenet (FNT) FNC Pillar.  The FNT pillar develops deliverable technologies that provide new capabilities in Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR), networking, navigation, sensors, decision support, cyber-space, intelligence, and space technologies that will provide the architectural framework for naval warfare in the information age.  \n\nThe FY 2016 to FY 2017 increase was due primarily to the planned ramp-up of FNT-FY15-02 and FNT-FY16-02, and the initiation of FNT-FY17-01, FNT-FY17-02, and FNT-FY17-04.\n\nThe FY 2017 to FY 2018 decrease was due primarily to the ramp down of 1) FNT-FY15-02 Data Focused Naval Tactical Cloud, which will Mature Naval Tactical Cloud platform services for streaming, serial ingest and data management within an all source\/adaptive data  ecosystem, with additional focus on development of federated query and analytic services, to include Expeditionary Warfare readiness and course-of-action recommendations, and 2) FNT-FY16-02 Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT), which will conduct high resolution sensor algorithm development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.085"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FNT-FY12-01 ADVANCED TACTICAL DATA LINK (ATDL)\n- Complete Mission-Based Waveform Controls & Networking - Develop Anti-Access\/Area Denial enhancements to waveforms, along with advanced networking techniques, and validate performance through emulation.\n\nEC: FNT-FY12-02 AUTONOMOUS PERSISTENT TACTICAL SURVEILLANCE\n- Complete Autonomous Information-Based Surveillance Control - Complete algorithm development for information based Unmanned Aerial Vehicle (UAV) routing and pathing.\n- Complete Contextual Enterprise Information - Develop and demonstrate the analytical services framework, including enterprise exploitation services, for situation context between relevant theater sensor collections and exploitation products. \n- Complete Mobile Autonomous ISR to C2 Synchronization - Transition to MARCORSYSCOM a set of services that can automate the mapping of mission relevant information requirements to information fulfillments or deficits, and provide a sensor tasking recommendation to resolve deficits.  \n\nEC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE \n- Continue EW Battle Management (EWBM) - Develop automation techniques for multiple Electronic Warfare systems across multiple ships, including network layer monitoring.\n\nEC: FNT-FY13-03 SILK THREAD\n- Continue Silk Thread Product 1 - Conduct applied research.\n- Continue Silk Thread Product 2 - Conduct applied research.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Continue Adaptive Multi-Int Correlation & Identification (AMICA) - Research and analyze algorithms to enable cross-domain information fusion and optimize use of remote sensing assets.\n- Continue Detection & Classification Algorithms (DCA) - Research and analyze algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Develop and evaluate the performance of methods that are context aware and determine the value of the information for an ASW mission.\n- Continue Data Exfiltration and Networked Platform Interaction - Develop digital radio components and waveforms directed toward host platforms with limited size, weight, and power and with the desired communication range and performance.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Develop techniques to improve E-2D Advanced Hawkeye electronic protection.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud (formerly called Naval Tactical Cloud Analytics) - Conduct the data science activities to ingest all relevant data into the Naval Tactical Cloud to enable efficient decision support analytics for enhanced ASW, IAMD and EXW situational awareness and improved mission execution effectiveness.  \n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Develop scalable and modular, low Size, Weight and Power (SWaP) components and techniques for multi-function Radio Frequency processing on SWaP restricted platforms.\n- Continue Electronic Warfare Tactical Decision Aid (EW-TACAID) - Create an intuitive display with good user-centered design practices that has adaptive instructional content to suit an individual's aptitudes, learning preferences, and learning styles.\n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Investigate techniques that facilitate the processing and high speed data conversion between digital processing and Radio Frequency collection systems.\n\nEC: FNT-FY16-01 BUGLE\n- Initiate Bugle - Develop algorithms that enable Battle Group communications. \n\nEC: FNT-FY16-02 COMBINED EO\/IR SURVEILLANCE AND RESPONSE SYSTEM (CESARS)\n- Initiate Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Investigate multiband laser, window, and sensing technologies as well as advanced countermeasure techniques for shipboard defense.\n- Initiate Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Investigate small pixel Mid-Wave Infrared (MWIR) Focal Plane Array (FPA) technologies and innovative approaches for seamless stitching of multiple FPAs to create large format, high pixel-count imagers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.489"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE\n- Continue EW Battle Management (EWBM) - Develop automated queuing\/attack techniques and tactical use of cross domain data for multiple Electronic Warfare (EW) systems across multiple ships.\n\nEC: FNT-FY13-03 SILK THREAD\n- Continue Silk Thread Product 1 - Conduct applied research.\n- Continue Silk Thread Product 2 - Conduct applied research.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Complete Adaptive Multi-Int Correlation & Identification (AMICA) - Research and analyze algorithms to enable cross-domain information fusion and optimization of theater and tactical battlespace assets to conduct anti-surface warfare.\n- Complete Detection & Classification Algorithms (DCA) - Research and analyze algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Develop advanced techniques for automated, high accuracy, low error rate, adaptive processing.\n- Continue Data Exfiltration and Networked Platform Interaction - Integrate and conduct initial demonstration of the radio components and waveforms in a host platform in a simulated environment.\n\nEC: FNT-FY14-03 EXCHANGE OF ACTIONABLE INFORMATION AT THE TACTICAL EDGE (EAITE)\n- Continue from PE 0602131M Actionable Information Tactical Applications from PE 0602131M - Develop natural language processing lexicon algorithms to enable machine understanding of a user defined information requirement.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Develop techniques to improve Advanced Hawkeye (E2-D) electronic protection capability.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud - Mature Naval Tactical Cloud platform services for streaming, serial ingest and data management within an all source\/adaptive data ecosystem, with additional focus on development of federated query and analytic services, to include Expeditionary Warfare readiness and course-of-action recommendations.\n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Investigate new techniques\/functionality  focusing on Electronic Warfare\/Intelligence, Surveillance, Reconnaissance\/Electronic INTelligence (EW\/ISR\/ELINT) collection and processing techniques for the modular functionality payload.\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Develop a modular payload bay and modular Radio Frequency (RF) front end bay for small\/medium sized unmanned undersea vehicles.\n- Continue Electronic Warfare Tactical Decision Aid (EW-TACAID) - Develop new user interface concepts to mitigate shortcomings and issues associated with the Electronic Warfare environment and develop a deeper understanding of the nature of the Electronic Warfare domain content that is most suited for instruction via adaptive training.\n\nEC: FNT-FY16-01 BUGLE\n- Continue Bugle - Develop algorithms that enable battle group communications in communication-challenged, forward-deployed environments.\n\nEC: FNT-FY16-02 Combined EO\/IR Surveillance and Response System (CESARS)\n- Continue Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Begin high fidelity tracking algorithm development.\n- Continue Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Begin high resolution sensor algorithm development.\n\nEC: FNT-FY17-01 COMMUNICATIONS AND INTEROPERABILITY FOR INTEGRATED FIRES (CIIF)\n- Initiate Communications as a Service (CaaS) - Develop distributed optimization algorithms and Quality of Service (QoS) protocols for heterogeneous data link networks.\n- Initiate Mission-Based Networking for DDS (MiND) - Develop forward error correction and directional networking algorithms.\n\nEC: FNT-FY17-02 SUBMARINE SIMULTANEOUS TRANSMIT AND RECEIVE (SUBSTAR)\n- Initiate Submarine Simultaneous Transmit and Receive (SubSTAR) - Develop a submarine broadband antenna enabling simultaneous transmit and receive capability.\n\nEC: FNT-FY17-04 RESILIENT HULL\/INFRASTRUCTURE MECHANICAL & ELECTRICAL SECURITY (RHIMES)\t\n- Initiate SCRAM - Develop software algorithms that protect naval Hull, Mechanical and Electrical (HM&E) systems against cyber threats.\n- Initiate SCAMM - Develop information shaping cyber capabilities for tactical platforms.\n\nFNC: FNT-FY18-02 NON-GPS AIDED POSITIONING NAVIGATION AND TIMEKEEPING FOR SURFACE AND SUBSURFACE (NoGAPSS)\n- Initiate Adaptive Broadband Navigation Sonar System (ABNSS) \n- Begin development of a modular processing framework, algorithms, and software for broadband velocity estimation.\n\nFNC: FNT-FY18-05 ADVANCED COORDINATION TECHNIQUES FOR DISTRIBUTED EW\n- Initiate Coordinated Radio Frequency EW (CRFEW) - Conduct an analysis of precision geo-location and coordinated engagement techniques to support netted sensor battlespace emitter geo-location and coordinated Electronic Warfare (EW) operations. \n- Initiate Next Generation Surface Electronic Warfare User Interface - Conduct a task analysis of surface EW to inform the user requirements of single and cross-ship sensor correlation, disambiguation and fixing, and tactical decision making. \n- Initiate Propagation Channel Assessment and Prediction (PCAP) - Analyze real-time techniques for assessing radio frequency propagation channels in support of naval operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "41.368"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "41.368"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE\n- Complete EW Battle Management (EWBM) - Integrate combat system data with cross domain data to automate tactical Electronic Warfare (EW) decision making across multiple ships.\n\nFNC: FNT-FY13-03 SILK THREAD\n- Complete Silk Thread Product 1 - Finish applied research efforts for this classified program.\n- Complete Silk Thread Product 2 - Finish applied research efforts for this classified program.\n\nFNC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Complete Adaptive TCPED for ASW Services - Complete the development of advanced techniques for automated high accuracy, low error rate, adaptive processing.\n- Complete Data Exfiltration and Networked Platform Interaction - Integrate radio components and waveforms in a host platform.\n\nFNC: FNT-FY14-03 EXCHANGE OF ACTIONABLE INFORMATION AT THE TACTICAL EDGE (EAITE)\n- Continue Actionable Information Tactical Applications - Research and design natural language processing algorithms to enable machine understanding of an information requirement. (In FY19, this FNC Product will be realigned within this PE to IW-FY14-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Implement real-time AEW Electronic Protection improvements within the airborne prototype. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-01 under a new Air Warfare R-2 Activity)\n\nFNC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud - Perform applied research in machine learning analytics to support automated enemy course-of-action predictions based on all-source intelligence for integrated fires and integrated air and missile defense. (In FY19, this FNC Product will be realigned within this PE to IW-FY15-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Perform laboratory effectiveness testing to evaluate the RF design, which includes communications, cyber, information operations and electronic warfare operational performance requirements. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-02 under a new Undersea Warfare R-2 Activity)\n- Complete Electronic Warfare Tactical Decision Aid (EW-TACAID) - Conduct analyses of efficient operator interfaces in support of netted sensor and coordinated EW operations.  \n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Conduct laboratory analysis of temporal, spectral and resource allocation management techniques for optimized resource sharing. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-02 under a new Undersea Warfare R-2 Activity)\n\nFNC: FNT-FY16-01 BUGLE\n- Continue Bugle - Continue applied research efforts supporting advanced waveforms. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY16-02 COMBINED EO\/IR SURVEILLANCE AND RESPONSE SYSTEM (CESARS)\n- Continue Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Finalize development of the high resolution sensor algorithms, laser hardware, and countermeasure algorithms and techniques. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-03 under a new Information Warfare R-2 Activity)\n- Continue Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Develop, assess and analyze algorithms, noise performance, resolution and sensitivity technology, and software for data capture, recording, processing and display. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-03 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY17-01 COMMUNICATIONS AND INTEROPERABILITY FOR INTEGRATED FIRES (CIIF)\n- Continue Communications as a Service (CaaS) - Validate and test distributed optimization algorithms and quality-of-service protocols. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-01 under a new Information Warfare R-2 Activity)\n- Continue Mission-Based Networking for DDS (MiND) - Conduct simulation and system engineering of waveform coding\/modulation, adaptive link management and Data Distribution System (DDS) networking\/quality of service. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-01 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY17-02 SUBMARINE SIMULTANEOUS TRANSMIT AND RECEIVE (SUBSTAR)\n- Continue Submarine Simultaneous Transmit and Receive (SubSTAR) - Develop and prototype initial broadband simultaneous transmit and receive antenna designs. (In FY19, this FNC Product will be realigned within this PE to UW-FY17-01 under a new Undersea Warfare R-2 Activity)\n\nFNC: FNT-FY17-04 RESILIENT HULL\/INFRASTRUCTURE MECHANICAL & ELECTRICAL SECURITY (RHIMES)\t\n- Continue SCAMM - Develop information sharing capabilities for tactical platforms. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-02 under a new Information Warfare R-2 Activity)\n- Continue SCRAM - Develop resilient software for integrated control systems, including those without redundant processors. (In FY19, this FNC Product will be realigned within this PE to SW-FY17-01 under a new Surface Warfare R-2 Activity)\n\nFNC: FNT-FY18-04 NANOSAT COMMUNICATIONS FOR A2AD OPERATIONS\n- Initiate Nanosat Communications Payloads - Develop and prototype a nanosat communication payload in UHF- and X-bands. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity)\n- Initiate Shipboard Integration - Develop and integrate shipboard networking in UHF- and X-bands with Digital Mobile Radio and Navy multiband terminal. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY18-05 ADVANCED COORDINATION TECHNIQUES FOR DISTRIBUTED EW\n- Continue Coordinated Radio Frequency EW (CRFEW) - Continue analyzing precision geo-location and coordinated engagement techniques to support netted sensor battlespace emitter geo-location and coordinated Electronic Warfare (EW) operations. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity)\n- Continue Next Generation Surface Electronic Warfare User Interface - Continue the analysis of surface EW to inform user requirements of single and cross-ship sensor correlation, disambiguation and fixing, and tactical decision making. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity)\n- Continue Propagation Channel Assessment and Prediction (PCAP) - Continue analyzing real-time techniques for assessing radio frequency propagation channels in support of naval operations. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "POWER AND ENERGY (P&E)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Power and Energy (P&E) FNC pillar.  The P&E Pillar develops deliverable technologies that provide new capabilities in energy security, efficient power and energy systems, high energy and pulse power.   \n\nThe FY 2016 to FY 2017 increase was due to the initiation of P&E-FY17-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.494"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-01 RENEWABLE-SUSTAINABLE EXPEDITIONARY POWER\n- Complete Renewable Thermal Engine - Finish final design and fabrication of full-scale tactical power system prototype, incorporating all features to be exercised in a TRL 6 demonstration.\n\nEC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Continue Air Independent Propulsion System - Conduct final design of Phase II fuel cell energy system and coordinate test planning.\n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Conduct modelling, simulation and cost analyses of Phase II circuit protection designs and prepare test and safety plans for Phase II circuit protection devices.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Continue Compact High Density Tactical Energy Storage - Develop tactical multifunction Energy Storage Module subcomponent technology and designs.\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop final designs, which integrate ship energy storage module component technologies into a subscale system, and develop subscale system test plans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.795"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Complete Air Independent Propulsion System - Conduct final design of Phase II fuel cell energy system and coordinate test planning.\n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Transition the modeling and simulation and technology development effort from an initial 1kV voltage level to the final 20kV voltage level.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Continue Multi-Function High Density Shipboard Energy Storage - Demonstrate the capability of subscale energy storage component technologies and perform an analysis of the ship impact of multifunction energy storage with high pulse loads.\n- Continue Compact High Density Tactical Energy Storage - Complete development of  tactical multifunction Energy Storage Module subcomponent technology and continue  analysis of tactical multifunction Energy Storage Module technology designs.\n\nEC: P&E-FY17-02 TORPEDO ADVANCED PROPULSION SYSTEM (TAPS)\n- Initiate Torpedo Advanced Propulsion System (TAPS) - Initiate safety analyses and system modeling concepts for each technology identified in the Analysis of Alternatives (AoA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.038"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.038"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Complete High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Transition a knowledge product with relevant voltage, current and protection ratings to the acquisition sponsor.\n\nFNC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Complete Compact High Density Tactical Energy Storage - Complete module subsystem modeling, analysis, and development.\n- Continue Multi-Function High Density Shipboard Energy Storage - Conduct an analysis of the ship impact of multifunction energy storage technology with high pulse loads. (In FY19, this FNC Product will be realigned within this PE to SW-FY15-02 under a new Surface Warfare R-2 Activity)\n\nFNC: P&E-FY17-02 TORPEDO ADVANCED PROPULSION SYSTEM (TAPS)\n- Continue Torpedo Advanced Propulsion System (TAPS) - Complete safety and cost analyses of the technology solutions being developed. (In FY19, this FNC Product will be realigned within this PE to UW-FY17-02 under a new Undersea Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA BASING (BAS)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Basing (BAS) FNC pillar.  The BAS Pillar develops deliverable logistics, shipping and at-sea transfer technologies that provide new capabilities for projecting expeditionary force from the sea base and providing sea based joint operational independence through improved connector, at-sea transfer and shipboard logistical capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.063"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EC: BAS-FY11-01 CONNECTORS AND THE SEA BASE\n- Complete Environmental Ship Motion Forecasting - Develop environmental and ship motion sensor and forecasting components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA SHIELD (SHD)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE that are aligned to the Sea Shield (SHD) FNC pillar.  The SHD Pillar develops deliverable technologies that provide new capabilities in theater air and missile defense, anti-submarine warfare, mine countermeasures, defensive surface warfare, global defensive assurance, anti-terrorism, and fleet\/force protection.  \n\nThe FY 2016 to FY 2017 decrease was due primarily to the completion of SHD-FY10-01, SHD-FY10-03, SHD-FY11-01, SHD-FY12-01 and SHD-FY12-03, the planned ramp-down of SHD-FY13-07, SHD-FY14-02, SHD-FY14-04, SHD-FY14-08 and SHD-FY15-07, and the movement of SHD-FY16-OSD out of the FNC Program into PE 0602782N.\n\nThe FY 2017 to FY 2018 decrease was due primarily to the ramp down of 1) SHD-FY15-07 Hyper Velocity Projectile, which will demonstrate the component technology required to support a hypervelocity launch with common interfaces for powder gun and railgun launch conditions, 2) SHD-FY16-05 Surface Ship Periscope Detection and Discrimination (SSPDD), which will develop specialized interface hardware for technology components, and 3) SHD-FY16-06 Next Generation Airborne Passive System (NGAPS), which will develop algorithms and hardware for field communications, control, health monitoring, mission planning and contact separation and correlation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "50.619"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: SHD-FY10-01 ANTI-SHIP MISSILE DEFENSE TECHNOLOGIES\n- Complete Enhanced Lethality Guidance Algorithms (ELGA) - Optimize the guidance algorithm to increase the probability of kill against an expanded threat set.\n- Complete Enhanced Maneuverability Missile Airframe (EMMA) - Mature the technologies associated with the dual pulse rocket motor and integrated thrust vector control, incorporating risk reduction schemes.\n\nEC: SHD-FY10-03 ADVANCED SONAR TECHNOLOGY FOR HIGH CLEARANCE RATE MCM\n- Complete Long Range LFBB Sonar (AUV Platform Option) - Finalize software configuration and perform final data collection.\n\nEC: SHD-FY11-01 TORPEDO COMMON HYBRID FUZING SYSTEM\n- Complete Torpedo Common Hybrid Fuzing System - Conduct final at-sea data collection, testing and demonstration of Technology Readiness Level #6.\n\nEC: SHD-FY12-01 FORCE LEVEL RADAR RESOURCE MANAGEMENT FOR INTEGRATED AIR AND MISSILE DEFENSE (IAMD)\n- Complete Radar Resource Manager for IAMD - Refine, mature, and test advanced algorithms for ballistic missile defense track coordination.\n\nEC: SHD-FY12-03 SONAR AUTOMATION\n- Complete Active Sonar Automation - Evaluate and deliver algorithms to improve active sonar operator performance in detecting submarines while reducing false contact rates.\n- Complete Passive Sonar Automation - Evaluate and deliver algorithms that improve Passive Sonar operator performance against quiet submarines in the presence of clutter.\n\nEC: SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Achieve low False Alarm Rate with advanced data fusion techniques.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR \n- Continue Cooperative Networked Radar - Develop techniques for cross platform radar operation.\n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Continue Next Generation Multistatic Active Capability (NGMAC) - Develop algorithms for use in the Multistatic Active Capability system that improve performance, reduce operator workload, and allow for use in all ocean environments.\n- Complete Unmanned Targeting Air System (UTAS) - Update vehicle noise models and coordinate with Magnetic Anomaly Detection algorithms.\n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Continue MCM Payload Automation for Data Analysis - Develop probabilistic Enemy Course of Action models and update algorithms supporting Net-centric Sensor Analysis for MIW (NSAM).\n- Continue MCM Payload Automation for Planning - Develop probabilistic Enemy Course of Action models and update algorithms supporting Mine-warfare Environmental Decision-Aid Library (MEDAL).\n- Continue Single Sortie MCM Detect-to-Engage Payload - Develop the architecture, command and control algorithms, planning algorithms, and hardware design options.\n- Continue USV-based Mine Neutralization - Develop low-cost sensing, navigation, and battle damage assessment solutions, algorithms, and associated autonomy technology.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE \n- Continue Concept C Countermeasure - Commence array re-design to correct technical issues discovered during testing.\n- Continue ATT Timeline Compression (ATTTC) - Develop algorithms and real time code for guidance enhancements.\n- Complete HVU Mounted Sonar - Develop an array hull-mount and baffling mechanism, and model the resultant acoustic performance.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Autonomous Threat Detection and Localization - Model system node positioning algorithms and mission planning improvements, and conduct simulation testing.\n- Continue Remote Command & Control - Model and assess improved integrated system communications configuration protocols and algorithms.\n- Continue Tactical Positioning & Fire Control - Develop an improved sensor node architecture and conduct evaluation modeling of detection, classification, localization and targeting capabilities.\n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S (formerly Terminator E, S and R) - Develop fire control algorithms for implementation in the Ship Self-Defense System (SSDS).\n\nEC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Initiate MCM Task Force Planning - Develop algorithmic approaches for optimal tailoring of heterogeneous MCM assets.\n- Initiate Expeditionary MCM Automated Data Analysis - Investigate the applicability of physics-based approaches to performance estimation.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Continue Hyper Velocity Projectile - Demonstrate the component technology required to support a hypervelocity launch and common interfaces for powder gun and railgun launch conditions.\n\nEC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Initiate Ship-launched EW Extended Endurance Decoy (SEWEED) - Develop preliminary vehicle, payload, rocket, and launcher conceptual designs and sizing.\n\nEC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Initiate Surface Ship Periscope Detection and Discrimination (SSPDD) - Develop specialized interface hardware for technology components.\n\nEC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Initiate Next Generation Airborne Passive System (NGAPS) - Develop an 'A-size' deep, long-duration, passive sonobuoy for area surveillance that takes advantage of Reliable Acoustic Path detection against modern quiet submarines and is tethered to a surface float containing a radio. \n\nEC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Initiate Softkill Performance and Real-Time Assessment (SPARTA) - Develop and establish design criteria, system requirements and software requirements.\n\nEC: SHD-FY16-OSD MODULAR UNDERSEA EFFECTORS (MUSE)\n- Initate Modular UnderSea Effectors (MUSE) - Develop acoustic propagation modeling, algorithms for tracking and tracking, and algorithms to exploit the acoustic communications environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.097"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Use additional environmental data to validate advanced data fusion techniques and low False Alarm Rates.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Continue Cooperative Networked Radar - Develop software algorithms and techniques for cross-platform radar operation that deliver enhanced sensitivity.\n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Complete Next Generation Multistatic Active Capability (NGMAC) - Finish applied research efforts in support of a demonstration of the Next Generation Multistatic Active Capability sonobuoys in a relevant at sea Navy environment.\n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Complete USV-Based Mine Neutralization - Finalize low-cost sensing and navigation solutions, algorithm development, and associated autonomy.\n- Complete Single Sortie MCM Detect-to-Engage Payload - Finalize command and control technology and planning algorithms, and implement them on the MCM hardware.\n- Complete MCM Payload Automation for Data Analysis - Finish algorithm development and description.\n- Complete MCM Payload Automation for Planning - Finalize risk calculation software integration and documentation.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE\n- Continue ATT Timeline Compression (ATTTC) - Modify the algorithms based on test results.\n- Continue Concept C Countermeasure - Continue with array re-design to correct technical issues discovered during testing.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Tactical Positioning & Fire Control - Develop enhanced fire control solution algorithms and technology for advanced minefield planning.\n- Continue Autonomous Threat Detection and Localization - Model improved sensor node algorithms and updated software.\n- Continue Remote Command & Control - Develop final gateway buoy design and adaptive acoustic communications protocols.\n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S (formerly Terminator E, S and R) - Develop fire control algorithms for implementation in the Ship Self-Defense System (SSDS).\n\nEC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Continue MCM Task Force Planning - Formulate core algorithms that provide mathematical foundation for effects based application of risk, re-planning, and incorporation of legacy and emerging MCM systems.\n- Continue Expeditionary MCM Automated Data Analysis - Develop performance estimation and environmentally-adaptive Automatic Target Recognition (ATR) algorithms.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Continue Hyper Velocity Projectile - Demonstrate the component technology required to support a hypervelocity launch with common interfaces for powder gun and railgun launch conditions.\n\nEC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Continue Ship-launched EW Extended Endurance Decoy (SEWEED) - Develop preliminary vehicle, payload, rocket, and launcher conceptual designs and sizing.\n\nEC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Continue Surface Ship Periscope Detection and Discrimination (SSPDD) - Develop specialized interface hardware for technology components.\n\nEC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Continue Next Generation Airborne Passive System (NGAPS) - Develop Algorithms and hardware for field communications, control, health monitoring, mission planning and contact separation and correlation.\n\nEC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Continue Softkill Performance and Real-Time Assessment (SPARTA) - Develop and establish design criteria, system requirements, and software requirements.\n\nEC: SHD-FY16-OSD MODULAR UNDERSEA EFFECTORS (MUSE)\n- Continued in PE 0602782N\n\nEC: SHD-FY17-02 AUTONOMOUS UNMANNED SURFACE VEHICLES FOR MINE WARFARE (MIW)\n- Initiate Autonomous Situational Awareness and Hazard Avoidance System for USVs - Develop perception and route-planning autonomous control for Unmanned Surface Vehicles (USVs).\n- Initiate High Temperature Superconducting (HTS) Magnetic Influence Sweep Payload for USVs - Develop superconducting technology for the mine influence sweep payload on Unmanned Surface Vehicles (USVs).\n- Initiate Underway Refueling and Data Transfer for USVs and RMMVs - Develop technology for underway refueling of Unmanned Surface Vehicles (USVs) and Remote Multi-Mission Vehicles (RMMVs) and conduct data transfer from an RMMV.\n\nEC: SHD-FY17-05 DEEP RELIABLE ACOUSTIC PATH EXPLOITATION SYSTEM (DRAPES)\n- Initiate Deep Reliable Acoustic Path Exploitation System (DRAPES) - Develop algorithms for undersea communications, health monitoring, and contact separation and correlation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.074"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.074"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Complete Compact Modular Sensor-Processing Suite (CMSS) - Finish developing an extension of the software and algorithms to include interaction with the seabed necessary for the new three dimensional cameras.\n\nFNC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Complete Cooperative Networked Radar - Finish developing software algorithms and techniques for cross-platform radar operation that deliver enhanced sensitivity.\n\nFNC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE\n- Continue ATT Timeline Compression (ATTTC) - Continue development of bi-static and acoustic communication algorithms. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-03 under a new Surface Warfare R-2 Activity)\n- Continue Concept C Countermeasure - Conduct electronic subsystem software integration. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-03 under a new Surface Warfare R-2 Activity)\n\nFNC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Complete Autonomous Threat Detection and Localization - Finalize and document algorithm development and detection, classification, localization, and tracking performance.\n- Complete Remote Command & Control - Finalize and document algorithm development and command and control functionality.\n- Complete Tactical Positioning & Fire Control - Finalize and document system autonomy and fire solution algorithms.\n\nFNC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S - Develop fire control algorithms for implementation in the Ship Self-Defense System (SSDS). (In FY19, this FNC Product will be realigned within this PE to SW-FY14-04 under a new Surface Warfare R-2 Activity)\n\nFNC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Continue Expeditionary MCM Automated Data Analysis - Develop fusion algorithms for low frequency sonar and acoustic color with high frequency imaging systems. (In FY19, this FNC Product will be realigned within this PE to EMW-FY15-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue MCM Task Force Planning - Refine re-planning algorithms and integrate them with algorithms for the effects-based application of risk. (In FY19, this FNC Product will be realigned within this PE to EMW-FY15-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n\nFNC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Complete Hyper Velocity Projectile - Demonstrate the component technology required to support a hypervelocity launch and develop common interfaces for powder gun and railgun launch conditions.\n\nFNC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Continue Ship-launched EW Extended Endurance Decoy (SEWEED) - Conduct design development of the demonstrator vehicle and payload bay, and continue documentation of design and interface control. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-04 under a new Information Warfare R-2 Activity)\n\nFNC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Continue Surface Ship Periscope Detection and Discrimination (SSPDD) - Continue development of the generation 2.5 government-reference prototype sensor, data fusion system, and pre-planned product improvement options.\n\nFNC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Continue Next Generation Airborne Passive System (NGAPS) - Model and test algorithms and hardware for field communications, control, health monitoring, mission planning and contact separation\/correlation. (In FY19, this FNC Product will be realigned within this PE to AW-FY16-02 under a new Air Warfare R-2 Activity)\n\nFNC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Continue Softkill Performance and Real-Time Assessment (SPARTA) - Develop and establish design criteria, system requirements, and software requirements. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-05 under a new Information Warfare R-2 Activity)\n\nFNC: SHD-FY17-02 AUTONOMOUS UNMANNED SURFACE VEHICLES FOR MINE WARFARE (MIW)\n- Continue Autonomous Situational Awareness and Hazard Avoidance System for USVs - Develop autonomous situational awareness and hazard avoidance system components for Unmanned Surface Vehicles (USVs) that enable avoidance of fixed and moving hazards, while providing the ability to regain track and revisit missed areas using a low bandwidth control link. (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue High Temperature Superconducting (HTS) Magnetic Influence Sweep Payload for USVs - Develop magnetic, mine-influence, sweep system technology components that can be integrated on an Unmanned Surface Vehicle (USV) enabling a sweep capability that is self-contained and capable of unmanned tactical operations. (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue Underway Refueling and Data Transfer for USVs and RMMVs - Develop automated underway refueling technology for Unmanned Surface Vehicles (USVs) and unmanned semisubmersible vehicles that is capable of conducting unmanned\/automated refueling operations and data download\/upload in up to sea state 3, away from a host refueling ship. (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n\nFNC: SHD-FY17-05 DEEP RELIABLE ACOUSTIC PATH EXPLOITATION SYSTEM (DRAPES)\n- Continue Deep Reliable Acoustic Path Exploitation System (DRAPES) - Develop algorithms for undersea communications, health monitoring, and contact separation\/correlation. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-03 under a new Information Warfare R-2 Activity)\n\nFNC: SHD-FY18-08 FORCE-LEVEL INTEGRATED FIRES REAL-TIME ENGAGEMENT COORDINATION AND PERFORMANCE ESTIMATION (FIRECAPE)\n- Initiate FIRECAPE Algorithms - Begin development of performance estimation and coordination algorithms and validate their performance using Monte Carlo analysis against complex threat raids. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-04 under a new Information Warfare R-2 Activity)\n\nFNC:  SHD-FY19-07 (IW-FY19-03) Theater ASW Commander Battle Management (TASWC BaM TDA)\n- Initiate TASWC Battle Management TDA - Establish protocol and setup for Measures of Effectiveness analysis. (In FY19, this FNC Product will be realigned within this PE to IW-FY19-03 under a new Information Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA STRIKE (STK)"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Future Naval Capabilities (FNC) Program Enabling Capability (ECs) investments in this PE.  The Sea Strike (STK) FNC pillar develops deliverable technologies that provide new capabilities in power projection and deterrence, precise and persistent offensive power, weapons, aircraft, and expeditionary warfare.\n\nThe FY 2017 to FY 2018 decrease was due primarily to the ramp down of 1) STK-FY13-03 Anti-Surface Warfare (ASuW) Weapon Upgrade, which will develop algorithms, 2) STK-FY15-02 Helicopter Active RPG Protection (HARP), which will design and develop prototype concepts and new processes for a Rocket Propelled Grenade (RPG) hard-kill defense for rotorcraft, and 3) STK-FY17-04 ALPO, which will continue developing advanced signal processing system algorithms for the advanced signal processing system; and the completion of 1) STK-FY14-01 Bank Shot, which will continue to study passive sensor phenomenology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.184"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: STK-FY12-01 SUBMARINE SURVIVABILITY - ELECTRONIC WARFARE\n- Complete Coherent Electronic Attack for Submarines (CEAS) - Conduct experiments of the waveform interactions and spectrum processing that occurs between advanced Electronic Warfare and radar systems in order to assess the effectiveness of new electronic support detection and electronic attack countermeasure techniques.    \n\nEC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Develop algorithms for moving maritime Radio Frequency identification.\n\nEC: STK-FY13-02 HOSTILE FIRE (HF) SUPPRESSION\n- Complete Hostile Fire Suppression System - Demonstrate real-time muzzle flash detection and tracking.\n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Develop relevant algorithms.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Evaluate and model advanced kinematic technology improvements for a future Air-to-Air missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Bank Shot - Study and understand passive sensor phenomenology.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Design, develop, and improve weapon-to-weapon communications, coupled with algorithms for limited weapon autonomy, that address the surface warfare mission area.\n- Continue Collaborative Electronic Attack (CEA) - Develop adaptable Electronic Warfare mission prioritization and collaborative classification algorithms to enable U.S. Naval forces the ability to conduct Anti-Surface Warfare. \n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Develop algorithms and techniques to improve synthetic aperture radar electronic protection.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Design and develop prototype concepts and new processes for a Rocket Propelled Grenade (RPG) hard-kill defense for rotorcraft.\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Conduct modeling and simulation to define countermeasure sources and expendables requirements for rotary wing aircraft defense against advanced multi-spectral Electro-Optical\/Infrared (EO\/IR) Man Portable Air Defense Systems (MANPADS).\n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Downselect an autonomy suite prototype.\n- Continue MUHV Sensors, Navigation and Guidance - Conduct fiber optic development.\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Design, develop, and improve prototypes and processes that address extended range targeting and fire control.\n\nEC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Initiate Reactive Electronic Attack Measures (REAM) - Develop signal detection and classification techniques that can recognize new and agile radar threats.\n\nEC: STK-FY17-04 ALPO\n- Continue ALPO - Commence development of advanced signal processing system algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.992"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Develop algorithms for achieving Radio Frequency (RF) identification of moving maritime contacts.\n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Refine the subsystem design and development plan.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Evaluate and model advanced kinematic technology improvements for a future Air-to-Air missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Complete Bank Shot - Evaluate and model sensor phenomenology.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Design, develop, and improve weapon-to-weapon communications, coupled with algorithms for limited weapon autonomy that address the surface warfare mission area.\n- Continue Collaborative Electronic Attack (CEA) - Develop and prototype highly synchronized collaborative multiple platform Electronic Attack (EA) techniques.\n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Develop of algorithms and techniques to improve synthetic aperture radar electronic protection.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Design and develop prototype concepts and new processes for a Rocket Propelled Grenade (RPG) hard-kill defense for rotorcraft.\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Develop Infra-Red CounterMeasures (IRCM) Electro-Optic\/Infra-Red (EO\/IR) techniques for both flare and jammer, used alone and in combination, while utilizing Navy developed Hardware-In-The-Loop (HITL).  \n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Develop autonomy algorithms for mission planning, waypoint navigation, and vehicle health assessment.\n- Continue MUHV Sensors, Navigation and Guidance - Develop multiband and hybrid sonar, inertial navigation, and fiber optic systems.\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Design, develop, and improve prototypes and processes that address extended range targeting and fire control.\n\nEC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Continue Reactive Electronic Attack Measures (REAM) - Adapt machine learning algorithms from the Adaptive Radar Countermeasures (ARC) program to support offensive Electronic Warfare Support (ES) and Electronic Attack (EA) capabilities, including integrated unknown emitter characterization and response.\n\nEC: STK-FY17-04 ALPO\n- Continue ALPO - Continue developing advanced signal processing system algorithms for the advanced signal processing system.\n\nFNC: STK-FY18-01 PRECISION ELECTRONIC ATTACK TECHNOLOGIES (PEAT)\n- Initiate Multi-platform Retro-directive EW - Conduct analysis of synchronized Electronic Warfare (EW) effects across multiple platforms and EW systems. \n- Initiate Single Platform Coherent Arrays - Conduct analysis of synchronized EW effects across intra-platform EW components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.324"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.324"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Complete Long Range Find, Fix and ID - Improve Long Range ID algorithm performance within unanticipated maritime phenomenology.\n\nFNC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Complete Anti-Surface Warfare (ASuW) Weapon Upgrade - Develop and verify algorithms for Phase II.\n\nFNC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Complete SMOKE - Evaluate and model advanced kinematic technology improvements for a future air-to-air missile.\n\nFNC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Complete Collaborative Anti-Surface Warfare Engagement (CASE) - Design, develop, and improve weapon-to-weapon communications, coupled with algorithms for limited weapon autonomy addressing the surface warfare mission area.\n- Continue Collaborative Electronic Attack (CEA) - Perform applied research in cognitive electronic warfare to produce next generation electronic jamming effects. (In FY19, this FNC Product will be realigned within this PE to IW-FY14-03 under a new Information Warfare R-2 Activity)\n\nFNC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Implement real-time electronic protection improvements within the airborne test bed. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-03 under a new Air Warfare R-2 Activity)\n\nFNC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Design and develop prototype concepts and new processes for a Rocket Propelled Grenade (RPG) hard-kill defense for rotorcraft. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-04 under a new Air Warfare R-2 Activity)\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Refine, test and finalize Infra-Red Countermeasures (IRCM) Electro-Optic\/Infra-Red (EO\/IR) techniques for flares and jammers using simulation and laboratory tests. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-04 under a new Air Warfare R-2 Activity)\n\nFNC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Continue implementation and refinement of the autonomy architecture and algorithms for mission planning, waypoint navigation and vehicle health. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-03 under a new Undersea Warfare R-2 Activity)\n- Continue MUHV Sensors, Navigation and Guidance - Continue development and maturation of multiband and hybrid sonar, inertial navigation, and fiber-optic systems. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-03 under a new Undersea Warfare R-2 Activity)\n\nFNC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Complete Extended-Range Targeting (E-RAT) - Design, develop, and improve prototypes and processes that address extended range targeting and fire control. \n\nFNC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Continue Reactive Electronic Attack Measures (REAM) - Implement and assess real-time reactive electronic attack algorithms in a representative environment. (In FY19, this FNC Product will be realigned within this PE to AW-FY16-04 under a new Air Warfare R-2 Activity)\n\nFNC: STK-FY17-04 ALPO\n- Complete ALPO - Establish the initial feasibility and practicality solution for an advanced signal-processing system.\n\nFNC: STK-FY18-01 PRECISION ELECTRONIC ATTACK TECHNOLOGIES (PEAT)\n- Continue Multi-platform Retrodirective EW - Continue analyzing synchronized Electronic Warfare (EW) effects across multiple platforms and EW systems. (In FY19, this FNC Product will be realigned within this PE to AW-FY18-01 under a new Air Warfare R-2 Activity)\n- Continue Single Platform Coherent Arrays - Continue analyzing synchronized EW effects across intra-platform EW components. (In FY19, this FNC Product will be realigned within this PE to AW-FY18-01 under a new Air Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of FNC technology products within this PE.  In all cases, these technology products support the Department of the Navy FNC Program and are managed at the Office of Naval Research.  All FNC investments in this PE are subjected to management oversight by 2-star chaired Integrated Product Teams (IPTs) that control the naval pillars of Sea Shield, Sea Strike, Sea Basing, Forcenet, Naval Expeditionary Maneuver Warfare, Enterprise and Platform Enablers, Power and Energy, Capable Manpower, and Force Health Protection.  Each EC is aligned to a pillar and each technology product is aligned to an EC.  At the lowest level, each technology product is measured against both technical and financial milestones on a monthly basis.  Annually, each technology product is reviewed in depth for technical performance and development status by the Chief of Naval Research against goals that have been approved by the Navy's 3-star Technology Oversight Group (TOG).  Also annually, each technology product is reviewed by its 2-star chaired pillar IPT for transition planning adequacy and transition commitment level.   Products must meet TOG required transition commitment levels for S&T development to continue.  Transition issues and required adjustments are reported annually by the Chief of Naval Research to the TOG, which establishes investment priorities for the FNC Program."
                        }
                    }
                }
            ]
        }
    }
}