{
    "id": "2018-Navy-PB-1319-JBOOK-fe1eec95104582d193bf5355bc1db676512bb4c9cf46c1c868d9cdf4053d3024-37",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_JustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305204N"
        },
        "ProgramElementTitle": {
            "val": "Tactical Unmanned Aer Vehicles"
        },
        "R1LineNumber": {
            "val": "237"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "244.866"
            },
            "PriorYear": {
                "val": "8.550"
            },
            "CurrentYear": {
                "val": "8.436"
            },
            "BudgetYearOne": {
                "val": "7.770"
            },
            "BudgetYearOneBase": {
                "val": "7.770"
            },
            "BudgetYearTwo": {
                "val": "10.070"
            },
            "BudgetYearThree": {
                "val": "9.209"
            },
            "BudgetYearFour": {
                "val": "9.394"
            },
            "BudgetYearFive": {
                "val": "9.582"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides for development and capability requirements for Tactical Unmanned Aerial Vehicles.  Project is a Joint Military Intelligence Program.  \n \nThe Tactical Control System (TCS), a component of the MQ-8 System, provides for the joint tactical MQ-8 Fire Scout System.  TCS, integrated into the MQ-8 Mission Control System, provides the warfighters with the capability for day\/night aerial Intelligence, Surveillance and Reconnaissance, Target Acquisition, voice, data and command and control communications\/relay, and mine detection and localization.  Additionally, TCS provides a multi-level, scalable, and flexible operator control of the air vehicles and payloads, as well as direct receipt and dissemination of unmanned aerial vehicle sensor data."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.550"
                },
                "CurrentYear": {
                    "val": "8.436"
                },
                "BudgetYearOne": {
                    "val": "8.897"
                },
                "BudgetYearOneBase": {
                    "val": "8.897"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.550"
                },
                "CurrentYear": {
                    "val": "8.436"
                },
                "BudgetYearOne": {
                    "val": "7.770"
                },
                "BudgetYearOneBase": {
                    "val": "7.770"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.127"
                },
                "BudgetYearOneBase": {
                    "val": "-1.127"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.035"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.035"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.092"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.092"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2018 funding request was reduced by $1.050M to account for the availability of prior year execution balances.\n\nCost: FY18-FY20 resources were adjusted to align with TCS to Common Control System (CCS) transition.  \n\nSchedule: Updated TCS schedule and software improvements to coincide with MQ-8 Fire Scout schedule milestones.    \n    \nMQ-8 related milestones revised:  Updated Milestone C decision, test requirements, and IOC for the restructured MQ-8 Fire Scout program.\n\nTechnical: None"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2478"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Control System"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "244.866"
                        },
                        "PriorYear": {
                            "val": "8.550"
                        },
                        "CurrentYear": {
                            "val": "8.436"
                        },
                        "BudgetYearOne": {
                            "val": "7.770"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.770"
                        },
                        "BudgetYearTwo": {
                            "val": "10.070"
                        },
                        "BudgetYearThree": {
                            "val": "9.209"
                        },
                        "BudgetYearFour": {
                            "val": "9.394"
                        },
                        "BudgetYearFive": {
                            "val": "9.582"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The TCS program supports the MQ-8 Fire Scout System and is a standards-based system, which provides interoperability and commonality for Command and Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) interfaces of Unmanned Aircraft Systems (UAS). TCS software, operating on Mission Control System (also referred to as a Ground Control Station) hardware, utilizes North Atlantic Treaty Organization (NATO) Standardization Agreements (STANAG)-4586 architecture to communicate across a Tactical Common Data Link.  \n\nTCS provides a full range of scalable UAS capabilities from passive receipt of air vehicle and payload data to full air vehicle and payload command and control. TCS offers the warfighter a common core operating environment to simultaneously receive, process, and disseminate data from different UAS types for intelligence, reconnaissance, surveillance, and combat assessment.\n\nThis program supports enhancements and updates to TCS in order to continue to meet supported air vehicle enhancements, incorporation of new technologies that will be used to enhance overall system performance, incorporate new payloads and payload capabilities (such as advanced sensors and weapons), incorporate multi-vehicle control, incorporate NATO  STANAG-4586 and Command, Control, Communications, Computers and Intelligence enhancements, and alignment with OSD direction for UAS control segments.\n\nTCS software is incorporated into the MQ-8 Fire Scout System and fields in conjunction with MQ-8. TCS software addresses MQ-8 requirements validated by the Joint Requirements Oversight Council in the MQ-8 Capability Production Document (Nov 2016) and multiple Joint Emergent Operational Need\/Urgent Operational Needs statements.  TCS is supported by an Operational Requirements Document (Feb 2000).  \n\nTCS maximizes the use of contractor and government off-the-shelf hardware and software whenever possible and incorporates software\/hardware enhancements where appropriate to maintain growth potential and minimize hardware and operating system dependence.  TCS software is interoperable and is compliant with the OSD Command and Control, Communications, Intelligence Joint Technical Architecture, Distributed Common Ground System standards, Global Command and Control System, and NATO standards.  TCS hardware and software upgrades support the Navy's Common Control System migration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TCS Development and Integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued TCS integration and test with MQ-8 development.  Continued new TCS capabilities to support requirements for Littoral Combat Ship (LCS) efforts.  Continued TCS STANAG 4586 compliance. Continued TCS C4ISR interface integration and testing for MQ-8 systems.  Continued hardware and operating system independence initiatives.  Continued Radar and payload integration, MQ-8C integration, and continue preparations for Common Control System integration and demonstrations.  Completed TCS Version 5 Linux transition, continued TCS Version 6 technology refresh, and continued TCS Version 7 service oriented architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.752"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue TCS integration and test with MQ-8 development.  Continue new TCS capabilities to support requirements for LCS efforts.  Continue TCS STANAG 4586 compliance. Continue TCS C4ISR interface integration and testing for MQ-8 systems.  Continue hardware and operating system independence initiatives.  Continue Radar and payload integration, MQ-8C integration, and continue preparations for Common Control System integration and demonstrations.  Commence TCS Version 7 Common GCS transition preparation and TCS Version 8 Common GCS transition initiation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.038"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.038"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue TCS integration and test with MQ-8 development.  Continue new TCS capabilities to support requirements for LCS efforts.  Continue TCS STANAG 4586 compliance. Continue TCS C4ISR interface integration and testing for MQ-8 systems.  Continue hardware and operating system independence initiatives.  Continue Radar and payload integration and test, MQ-8C integration, and continue preparations for Common Control System (CCS) integration and demonstrations.  Continue TCS Version 8 Common GCS transition and initiate TCS Version 9 CCS preparations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical and Engineering Services"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.668"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued government engineering support, contractor support, program support, and travel for the TCS program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.684"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue government engineering support, contractor support, program support, and travel for the TCS program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue government engineering support, contractor support, program support, and travel for the TCS program."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Tactical Control System (TCS) program is government owned, non-proprietary software that currently supports the MQ-8 Fire Scout System.  The TCS program continues to focus on Navy requirements and standards-based architecture\/software to support interoperability.  The government-owned TCS software development toolkit is available to all UAS developers and manufacturers that allows a low-cost integration into the open architecture non-proprietary TCS system.  TCS provides software modules to the Navy Common Control System (CCS) and the TCS tech refresh hardware supports migration to CCS software."
                        },
                        "PerformanceMetrics": {
                            "val": "Successfully complete Navy payloads integration, to include Coastal Battlefield Reconnaissance and Analysis (COBRA).  Support MQ-8C Endurance Upgrade, Radar, and future capabilities.  Successfully complete Littoral Combat Ship Integration. Complete Developmental and Operational Test."
                        }
                    }
                }
            ]
        }
    }
}