{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c43fbf6cbb750060d4e843075183a8e999b0dddb3a2f8fae77d834880adb92d8-83",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0804767D8Z"
        },
        "ProgramElementTitle": {
            "val": "COCOM Exercise Engagement and Training Transformation (CE2T2)"
        },
        "R1LineNumber": {
            "val": "182"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "195.875"
            },
            "PriorYear": {
                "val": "41.735"
            },
            "CurrentYear": {
                "val": "34.384"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This program transfers to the Joint Staff (PE 0804767J) beginning in FY 2018."
        },
        "ProgramElementMissionDescription": {
            "val": "These programs support readiness of the joint force by creating a Joint Training Environment to replicate the complex and changing operational environment.  The funding increase beginning in FY 2016 represents planned growth and internal reprogramming decisions to accelerate development of a cloud-enabled joint training environment.  These investments directly support defense strategic guidance and enhance joint warfighting readiness by building training capabilities that support the operational readiness of the force.  The elements associated with this coordinated effort consist of:\n\n- Joint National Training Capability (JNTC)\n- Joint Simulation System (JSS)\n- Joint Knowledge Development & Distribution Capability (JKDDC)\n- U.S. Forces Korea Training & Exercise Support (USFK)\n- Air Force Joint National Training Capability (JNTC)\n- Navy Joint National Training Capability (JNTC)\n\nJNTC:  The mission of the Joint National Training Capability (JNTC) program is to advance joint capabilities and interoperability by concentrating on emerging joint training requirements through collective training experiences using a managed set of globally distributed capabilities and activities. The program resources Service and SOF joint training and enabling capabilities that improve interoperability and realism of tactical and operational joint training between the Services and USSOCOM. JNTC enables joint collective training for Combatant Commands and Services by developing relevant joint training content and ensuring global distributed access. The enabling capabilities support the Services and USSOCOM in their requirement to provide trained and ready forces in support of Combatant Command operational requirements. This program will focus efforts on improving, rather than consuming, readiness and create a ready surge force consistent with Chairman’s guidance.\n\nJSS:  The Joint Simulation System (JSS) provides a low cost, distributed or deployable, web-based joint training capability with a small technical and operator footprint.  The JSS funding provides warfighters with joint simulations and tools that enhance and enable Joint training across Services, Combatant Commands, Combat Support Agencies, NATO and multinational partners. The Joint simulations and tools provided by JSS funding are critical enablers that support the delivery of trained, capable, and interoperable joint forces.  JSS’s intent is to maintain a capability to share simulation environments with coalition partners.\n\nJKDDC:  Joint Knowledge Development & Distribution Capability (JKDDC) Joint Knowledge Online (JKO) is the JS J7 program of record for online joint training that implements and operationalizes the OSD T2 JKDDC.  JKO directly supports the CE2T2 program by developing, delivering, tracking, and reporting online training for Combatant Command exercises; Combatant Command required training; doctrinally based Joint Operations Core Curriculum; multinational, coalition, IA training; and OSD required training (externally funded).  JKO also expends funding for leading edge technology review, market research, and integration to directly enhance specific aspects of the training capability as required for J7 support to Combatant Commanders. JKO satisfies all requirements necessary to provide the CE2T2 stakeholders with a distributed learning capability and access to web-based training content.\n\nUSFK:  FY 2015 is the last year for dedicated funding within the overall program.  The U.S. Forces Korea (USFK) Training & Exercise Support program develops simulations capable of satisfying all joint exercise training requirements in the Korean Theater of Operations.  Interoperability with the Republic of Korea-developed Korean Simulation System (KSIMS) is a critical and unique requirement of this USFK RDT&E program.  This solution will be capable of interoperating in a common battle space that realistically represents the operating environment to all levels of training audiences -- tactical to strategic -- in Korean theater exercises.  While supporting USFK’s specific requirements, this solution will contain enhancements that will benefit other combatant commander training programs that use the aging Joint, Live, Virtual, and Constructive (JLVC) simulations and the emerging JLVC 2020 simulations.  \n\nAir Force JNTC:  The Air Force JNTC funding provides a focused upgrade to develop models for space-based capabilities for integration into the JLVC environment.  The Air Force supports development of cross-domain solutions that enable the integration of systems with disparate security requirements, and significantly increases the training audience to additional joint and coalition participants.  \n\nNavy JNTC:  These funds enable the Navy to develop unique maritime capabilities that integrate JLVC elements into a seamless joint training environment. The Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems.  Additionally, the program develops cross-domain architectures for U.S. and Coalition Forces and ensures sister service modeling\/simulation and instrumentation efforts follow a unified standard."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "42.679"
                },
                "CurrentYear": {
                    "val": "34.384"
                },
                "BudgetYearOne": {
                    "val": "46.241"
                },
                "BudgetYearOneBase": {
                    "val": "46.241"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "41.735"
                },
                "CurrentYear": {
                    "val": "34.384"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.944"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-46.241"
                },
                "BudgetYearOneBase": {
                    "val": "-46.241"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.944"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.741"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.741"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Program Transfer"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-44.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-44.500"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The CE2T2 program transfers to the Joint Staff (PE 0804767J) beginning in FY 2018."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "758"
                    },
                    "ProjectTitle": {
                        "val": "Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "106.642"
                        },
                        "PriorYear": {
                            "val": "28.846"
                        },
                        "CurrentYear": {
                            "val": "25.495"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "CE2T2 Project 758: Joint National Training Capability transfers from USD-PR PE 0804767D8Z to Joint Staff PE 0804767J in fiscal year 2018"
                        },
                        "ProjectMissionDescription": {
                            "val": "Investment in the Joint National Training Capability (JNTC) program will enable Service and Combatant Commands to train as they operate.  The funding requested continues development of exercise Scenario Management Tools and services that support planning and execution of joint training, and continued maturation of a single integrating architecture for Joint Training.  Funding supports the development of cloud-enabled modular training application services.  Program intent is to reduce dependence on touch labor, and mitigate the impact of reductions in operation and sustainment funding.  Focus must be maintained to deliver operationally relevant training environments and respond to changes in the warfighter’s operational environment.  JNTC enables the Department of Defense to be responsive to the warfighters’ pace of changing operational concepts, threat environments, and best practices. In FY 2017, this investment continues expanding access for Service and Combatant Command trainers to plan and execute joint training.  Funds support improved relevance and realism of training by providing capabilities that replicate the contemporary and future operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "JNTC provides the technical standards, architecture (blueprint), and development processes required to integrate\/link joint training programs.  The Joint Training Environment is envisioned as an integrated network of training sites and nodes, and accessible joint training and force development services.  By leveraging existing training programs and initiating specific actions, JNTC develops credible opposing force capabilities and expanded access to assets typically unavailable to the training audience.  This enhances the integration of joint training objectives into Service training events.  Funding in this account supports the technical integration of Joint and Service modeling and simulation training capabilities.  Technical integration enables selective aggregation of training audiences at the Combatant Command, Joint Task Force, and Component Command Headquarter levels.  The funding supports modernization of the Joint Training Environment (JTE) to increase warfighter access to automated training enablers within the Joint Training Synthetic Environment (JTSE) through web-based and cloud capabilities. \n\nThe Adaptive Training Capability Program (ATCP) is a subordinate component of JNTC that enables the Joint Force to be responsive to the warfighters’ pace of changing operational concepts, threat environments, and best practices.  ATCP funding advances joint capabilities and interoperability by addressing emerging joint training requirements through a managed set of globally distributed JLVC enablers.  ATCP funding promotes joint context to Service training programs and joint enablers supporting Combatant Command training requirements and CJCS High Interest Training Issues identified in the Chairman’s Annual Training Guidance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.846"
                                            },
                                            "Text": {
                                                "val": "• Released Joint Live Virtual Constructive version 0.8 in February 2016.  Conducted (3) development events, (3) software integration events, (3) Korea Command Bridge tests to support the Pacific theater, (1) verification event and  and (2) validation events in preparation for Joint Live Virtual Constructive v1.0 due for release December 2016.\n• Transitioned from DoD Information Assurance Certification and Accreditation process to Risk Management Framework.  This increased cybersecurity focus came with additional requirements adopted in the development effort and sustainment of current capabilities. \n• In May 2016, published the Joint Training Synthetic Environment Modeling and Simulation Roadmap that implements the Joint training project plan outlined in the Information Systems -Initial Capabilities Document.  The roadmap codifies various use cases, capability gaps, capability requirements, and functional requirements. \n• Integrated security services into the newly developed Joint Training Tools establishing a single sign-on capability supporting most joint Training Enterprise Network services. \n• Released Joint Training Data Services version 4.2 which includes a web-enabled, enhanced Order of Battle Service and a new Terrain Generation Service capability.  Order of Battle Service provides enhanced capability to produce simulation ready force data. Terrain Generation Services provides individual users' ability to request and receive simulation ready terrain for several simulations with plans to support more simulations.  Terrain Generation Service also provides the ability to layer content over standard geographic maps to enrich the standard information available on the map.\n•  Completed the overarching and comprehensive data model supporting the new web-services based Joint Training Tool software architecture.\n•Within a cloud construct, leveraged current technologies to lessen the burden of specific physical machines and allow quicker build and tear-down of systems through virtualization.  Explored public cloud offerings in alignment with the DoD Chief Information Officer's Cloud Computing Strategy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.495"
                                            },
                                            "Text": {
                                                "val": "• Continue the annual requirement for Service  simulation integration by providing direction, specification, standards, and testing environments to enable the integration of Service, Joint Combatant Command and Agency simulations, services and tools. \n•  Invest in IT capabilities that continue to modernize Joint Staff J-7's Suffolk data center to support virtualized, cloud-enabled delivery of training capabilities to Services and Combatant Commands.  Investments support the shift to a joint training strategy whereby more realistic training is available as the joint force more heavily relies on training from home station. \n•  Continue development of Joint Training Environment tools\/services that support reduction in out-year training operations and sustainment costs, for planning, designing, provisioning, and executing Combatant Command and Service joint training activities.  \n•  Continue development of cloud management services that provide on demand, auto-initiated, and load-balanced Joint Training Environment services (i.e., data, simulation, planning tools, virtualized command and control, etc.).\n•  Release beta version of the new Joint Training Tool software that uses the modernized IT architecture. \n•  Develop role-play capability in Joint Training Tools such that users are able to access only their particular software capability and data, (e.g., a red force planner has access to red force laydown). \n•  Investigate opportunities to use the Joint Information Environment Mission Partner Environment to meet coalition training requirements. \n•  Continue to align IT infrastructure with Joint information Environment requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "-"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "36.341"
                                        },
                                        "CurrentYear": {
                                            "val": "35.880"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on the performance metrics below.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; access, cost, realism, relevance and technology as defined below:\n\n•  Access – Develop design standards that enable participation across DoD and, as applicable, with Coalition Partners. Make the environment available to meet user demands.\n•  Cost – Enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow. \n•  Realism – Enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow.\n•  Relevance – Maintain operational relevance through adaptation to the changing operational environment.\n•  Technology – Sustain the training environment network through developments for distributed home station training that include modular cloud-enabled training services.\n\nMeasures:\n•  Cost- Vendors provide ordered hours and project costs remain within 10 percent of government estimates. \n•  Schedule- Task completions (software enhancements, bug fixes, and cyber security requirements) delivered within 6 months of government estimate. \n•  Performance- Product results, outcomes, or milestones meet specific requirements and successfully pass more than 80 percent of operational assessment test cases. \n•  DoD Demand- Number of Commands, Services, and Agencies using Joint Staff developed training products. \n•  Partner Nation Demand- Number of partner nations using Joint Staff developed training products."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "761"
                    },
                    "ProjectTitle": {
                        "val": "Joint Simulations Systems (JSS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "15.150"
                        },
                        "PriorYear": {
                            "val": "2.139"
                        },
                        "CurrentYear": {
                            "val": "1.016"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "CE2T2 Project 761: Joint Simulations Systems (JSS) transfers from USD-PR PE 0804767D8Z to Joint Staff PE 0804767J in fiscal year 2018"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Simulation System (JSS) will decompose, harvest, and reuse DoD investment in joint simulations to develop cloud-enabled modular services (CEMS), reaching Initial Operating Capability in FY 2016.  JSS will further development of existing Joint Conflict and Tactical Simulation (JCATS) and Joint Theater Level Simulation (JTLS) as required, to remain relevant and responsive to meet Combatant Command training requirements as the Joint Training Environment is implemented.  JSS will provide design and development of web-based applications used as services in CEMS environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Simulation System (JSS)"
                                    },
                                    "Description": {
                                        "val": "This effort provides warfighters with joint simulations and tools that enhance and enable Joint training across Services, Combatant Commands, agencies and coalition partners.  These joint simulations and tools are part of an overall JLVC baseline of training capabilities.  They represent a set of training enablers, and “certified systems” that are interoperable and acceptable for usage within the joint training environment.  The joint simulations and tools provided by JSS are critical enablers that support the delivery of trained, capable, and interoperable Joint Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.139"
                                            },
                                            "Text": {
                                                "val": "• Met joint training requirement gaps with joint simulation and tools that enhance and enable Joint training across the Services, Combatant  Commands, agencies and Coalition partners. \n• Provided low cost capability to Combatant Commands, Services, NATO training venues, and 30 international partners (NATO's primary training simulation0 enabling increased interoperability and cooperation between the U.S. and our NATO allies. \n• Developed the Air Tasking Order Generator and an Air Tasking Order Translator web-based modular services from legacy models, leading change throughout the DoD to a globally distributed, cloud based joint training capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.016"
                                            },
                                            "Text": {
                                                "val": "• Continue to enhance existing tools and accelerate the development of web-based modular services in support of the Joint Training Synthetic Environment from legacy tools\/capabilities enhancing joint training effectiveness, affordability, and security.\n• Continue to meet the joint training capability requirements of Combatant Commands, Services, agencies and coalition partners with globally-focused, multi-domain multi-command, low cost, low overhead, and secure capabilities. \n• Operationalize the developed Air Tasking Order Generator and Air Tasking Order Translator web-based module services for Combatant Command, Services, agencies and coalition training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "JSS O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.927"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of Joint Force Trainer capabilities synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, cost, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Cost- Vendors provide ordered hours and project costs remain within 10 percent of government estimates. \n• Schedule-Task completions (software enhancements, bug fixes, and cyber security requirements) delivered within 6 months of government estimate. \n• Performance- Produce results, outcomes or milestones meet specified requirements and successfully pass more than 80 percent of operational assessment test cases. JTLS and JCATs availability of use in support of all training activities remains above 95 percent. \n• DoD Demand- Number of exercises\/events supported by JTLS\/JCATS.\n• Partner Nation Demand- Number partner nations using Joint Staff developed training products (active foreign military sales cases)."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "769"
                    },
                    "ProjectTitle": {
                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.792"
                        },
                        "PriorYear": {
                            "val": "3.593"
                        },
                        "CurrentYear": {
                            "val": "3.756"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "CE2T2 Project 769: Joint Knowledge Development & Distribution Capability (JKDDC) transfers from USD-PR PE 0804767D8Z to Joint Staff PE 0804767J in fiscal year 2018"
                        },
                        "ProjectMissionDescription": {
                            "val": "Joint Knowledge Online (JKO) is the DoD unique and authoritative source for online joint training.  JKO is tasked to develop a DoD enterprise-wide, Joint Individual Training Toolkit of web-enabled individual and small group training products, services and enabling training technology.  Products and services are developed in response to OSD(P&R) CE2T2 Program Goals & Objectives guidance, CJCS High Interest Training Issues, Joint Staff J7 training priorities, and JKO Stakeholder (Combatant Commands, Services, and Combat Support Agencies) prioritized training requirements.  JKO supports a career-long joint learning continuum, joint professional military education, and tailored common training standards to Service members for tasks that are jointly executed, resulting in trained, capable, and interoperable joint forces.  JKO research and development will improve all components of the Joint Content Management Architecture including: \n•  JKO Learning Content Management System (LCMS): Development and enhancement is required to integrate advanced individual and staff training technologies and methodologies with larger scale, collective training exercises, and modernize military  training capability with a DoD enterprise-wide online training toolkit.  JKO LCMS is necessary to develop, host and deliver JKO courses and track\/report students' progress, completions and survey results more effectively and efficiently.  JKO LCMS extends web-based, distributed access to mission-critical joint training requirements.  There are currently over 2.7 million registered users of the JKO LCMS. \n•  Small Group Scenario Trainer (SGST) desktop modeling and simulation based training: This JKO capability trains and prepares thousands of military and civilian personnel deploying to Combatant Command theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets. Specifically, C\/JTF ‘battle staffs’ will be adequately trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise.  JKO integration of SGST simulation exercise scenarios and pre-requisite JKO courses enable blended learning training support to large-scale, collective training exercises that augment the Joint Event Learning Cycle and in meeting combatant commanders exercise objectives. \n•  JKO mobile application training device development: Development and enhancements facilitate the global distribution of web-based joint training content on portable, hand-held platforms (cell pones and tablets). JKO Mobile App extends access to training courses and learning resources to personal use of mobile phones and tablets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Knowledge Development & Distribution Capability (JKDDC)"
                                    },
                                    "Description": {
                                        "val": "JKDDC Joint Knowledge Online (JKO) advanced technology initiatives primarily include the JKO Learning Content Management System (LCMS) application, Small Group Scenario Trainer (SGST) desktop modeling and simulation based training capability, and mobile courseware training devices..  These capabilities facilitate the training and preparation of tens of thousands of military and civilian personnel deploying to Combatant Command (CCMD) theaters of operation prior to serving in their assigned Combined\/Joint Task Force (C\/JTF) billets.  Specifically, JKO LCMS development and enhancements are required to host and deliver JKO courses and track\/report students’ completions more effectively and efficiently.  C\/JTF “battle staffs” will be better trained, as individuals and the staffs collectively, based on SGST development and implementation throughout the joint training enterprise.  JKO mobile courseware training device development facilitates the global distribution of web-based joint training content on portable, hand-held platforms (cell phones and tablets) for DoD personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.593"
                                            },
                                            "Text": {
                                                "val": "•Developed, tested, and delivered a major conversion of JKO LCMS code base to harden the system for cybersecurity compliance, resulting in a more effective and efficient online training management application that is interoperable with DoD personnel management systems.  Requirements were derived from  CCMD user feedback and DoD training priorities directed by the Deputy Assistant Secretary of Defense for Readiness (DASD(R) for JKO to \"develop content for pre-exercise training and support-as required by the Army, Marine Corps and supported GCCs and support individual and unit training for REF\/SP-MAGTF missions.\" These enhancements have improved the ease of use for the current ~40,000 daily log-ins and ~450,000 monthly course completions by DoD personnel.  Improvements to the JKO LCMS reflect the software requirements needed to ensure cyber security. Improvements also benefited thousands of individuals by easing their requirement to complete mandatory join individual web-based training as a precursor to their participation in numerous CCMD exercise training events. \n• Developed, tested and delivered multiple JKO Small Group Scenario Trainer (SGST) desktop modeling and simulation application releases resulting in a more effective and efficient training capability integrated within the LCMS. JKO updated products and services are derived from practical application in the field.  CCMD  user feedback contributes to a more effective and efficient training capability, improving the OSD endorsed Blended Learning Training component of CCMD collective training exercises.   The JKO SGST capability was leveraged to prepare individuals serving on CCMD required small functional teams and C\/JTF 'battle staffs' in preparation for USTRANSCOM's, USNORTHCOM's, USSOUTHCOM's, USPACOM's, and USEUCOM's collective training exercises.  Individual training proficiency improvement  was measured and quantified  as a key component of the exercise design.  DoD mandated network cyber security enhancements were successfully integrated in the release. \n• Assessed, refined and continued executing JKO's comprehensive plan to develop mobile training device capabilities focused on JKO's entire Joint Individual Training Toolkit. Provided  JKO courseware and video conversions to portable hand-held devices (cell phones and tablets).  Leveraged and ported numerous other DoD agency, interagency and multinational training courseware to JKO Mobile app.  A good example is OSD's Transition Veterans Program Office training on JKO Mobile which benefited military members significantly in transitioning to civilian life.  JKO developed, converted, tested, and delivered  ~120 mobile training courses, eBooks, Podcasts, job aids, and videos via the JKO Mobile App on both Apple and Android platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.756"
                                            },
                                            "Text": {
                                                "val": "• Develop, test and deliver two JKO Learning Content Management System (LCMS) releases resulting in a more effective and efficient online training management application that is interoperable with DoD personnel management systems.  JKO will continue to test, evaluate, and provide enhancements to ensure compliance with cybersecurity of all Joint Content Management Architecture (JCMA) components. Requirements will be derived from CCMD user feedback and DoD training priorities directed by DASD(R) for JKO to “develop content for pre-exercise training and support—as required by the Army, Marine Corps and supported GCCs—and support individual and unit training for REF\/SP-MAGTF missions.”  JKO anticipates these enhancements will improve cybersecurity and the ease of use for the current 40,000 daily log-ins and 450,000 monthly course completions by DoD personnel.  Improvements to the JKO LCMS will directly benefit thousands of individuals by easing their requirement to access, complete and retain mandatory joint individual web-based training. Additionally, this retention benefits them as a precursor to their participation in numerous CCMD exercise training events.  JKO must continue to evaluate and enhance its architecture to maintain performance standards and remain on the leading edge of distant learning technology as we confront an austere fiscal environment and the tremendous demand of JKO capabilities.  \n• Develop, test, and deliver 4 JKO Small Group Scenario Trainer (SGST) desktop modeling and simulation application releases resulting in a more effective and efficient training capability integrated within JKO Learning Content Management System (LCMS).  JKO anticipates these enhancements will improve the quality of the training experience for CCMD exercise participants.  The SGST will be used as part of the OSD endorsed Blended Learning Training component in approximately 8 CCMD collective training exercises to prepare individuals serving on CCMD required small functional teams and C\/JTF ‘battle staffs’.  Individual training proficiency improvement will be measured and quantified as part of the exercise design.  Additionally, SGST is expected to support enhancement of  the SEJPME training by enabling synchronous and asynchronous CAPSTONE-type capability.  JKO will continue to enhance functionality based on user experience and feedback. \n• JKO will assess, refine, and continue executing its comprehensive plan to develop mobile training device capabilities focused on JKO’s entire Joint Individual Training Toolkit.  Planned components include existing JKO courseware and video conversions to portable, hand-held devices, emerging FY 2017 training courseware requirements interoperable with portable, hand-held devices while leveraging of other DoD agencies, interagency, and multinational training courseware for delivery on the JKO Mobile App. JKO plans develop or convert approximately 150 training courses, eBooks, Podcasts, job aids, and videos resulting in the reduction in costs for classroom training and thousands of hours delivered onsite and on demand to DoD personnel mobile platforms worldwide.  JKO will continue to enhance its mobile capability based on user experience and feedback."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804768D8Z"
                                    },
                                    "Title": {
                                        "val": "JKDDC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.038"
                                        },
                                        "CurrentYear": {
                                            "val": "5.286"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Staff prescribed performance metrics include, but are not limited to; time, cost, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Identify, develop, test and implement 15 or more cybersecurity, operational, and functional JKO LCMS requirements. \n• Identify, develop, test and implement 12 or more cybersecurity, operational and functional JKO SGST requirements. \n• Identify, develop, test and implement 6 or more cybersecurity, operational and functional JKO Mobile App requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "770"
                    },
                    "ProjectTitle": {
                        "val": "U.S. Forces Korea Training and Exercise Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "33.908"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "33.908"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "2015 was the last year for dedicated funding of the CE2T2 project 770: U.S. Forces Korea Training and Exercise Support."
                        },
                        "ProjectMissionDescription": {
                            "val": "The U.S. Forces Korea (USFK) Training & Exercise Support program developed simulations capable of satisfying all joint exercise training requirements in the Korean Theater of Operations.  Interoperability with the Republic of Korea-developed Korean Simulation System (KSIMS) was a critical and unique requirement of this USFK RDT&E program.  This solution is capable of interoperating in a common battle space that realistically represents the operating environment to all levels of training audiences -- tactical to strategic -- in Korean theater exercises.  While supporting USFK’s specific requirements, this solution contains enhancements that will benefit other combatant commander training programs that use the aging Joint, Live, Virtual, and Constructive (JLVC) simulations and the emerging JTSE (previously JLVC 2020) simulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "USFK Training & Exercise Support"
                                    },
                                    "Description": {
                                        "val": "This program provided Joint Training Environment support to the 2015 stand-up of KORCOM as a sub-unified command under USPACOM.  This program developed a jointly accredited, supported, and funded federation of constructive models and simulations which are capable of satisfying all joint exercise training requirements in the Korean Theater of Operations (and which is interoperable with KSIMS).  While supporting U.S. Forces Korea specific training requirements, this solution was inextricably linked to the JTSE modeling and simulation capability via Cloud-Enabled Modular Services.  It provided a common, interoperable simulated battlespace which realistically represents the operating environment to all levels of training audiences (tactical to strategic) in Korean theater exercises and across the Combatant Commands, Services, and coalition Partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This program provided a Joint Training Environment comprised of  jointly accredited, supported, and funded federation of constructive models and simulations that are capable of satisfying all joint exercise training requirements in the Korean Theater of Operations (and which is interoperable with KSIMS). \n\nFY2015 was the last year for dedicated funding of USFK T&E support program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "U.S. Forces Korea Training & Exercise Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.299"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of Joint Force Trainer capabilities synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, cost, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Develop software for interoperability of JLVC versions along with initial integration of the Army’s Multi-Resolution Federation (MRF). Additionally, provide a validated approach for Cross Domain Information Sharing technologies and Korea Battle Simulation Center (KBSC) simulations to the joint training enterprise that meets USFK technical training requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "701"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9.524"
                        },
                        "PriorYear": {
                            "val": "2.643"
                        },
                        "CurrentYear": {
                            "val": "2.524"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "CE2T2 Project 701: Air Force Joint National Training Capability (JNTC)  transfers from USD-PR PE 0804767D8Z to Joint Staff PE 0804767J in fiscal year 2018"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force JNTC funding provides a focused upgrade to develop models for space-based and cyber capabilities for integration into the Joint Live, Virtual, Constructive (JLVC) environment.  The Air Force supports development of cross-domain solutions that enable the integration of systems with disparate security requirements, and significantly increases the training audience to additional joint and coalition participants."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Force Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "The Air Force JNTC  assists in the engineering, development, and deployment of Joint Cross Domain Information Sharing (JCDIS) Enterprise Network Architecture which will enable joint and coalition participants to train while protecting classified information.  Furthermore, the Air Force is creating cyber-contested environments in the distributed mission operations setting to challenge the joint exercise\/training audience.  Finally, comprehensive space effects are being integrated into the Joint, Live, Virtual and Constructive (JLVC) federation of models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.643"
                                            },
                                            "Text": {
                                                "val": "•  Cyber Simulation: Increased fidelity to more accurately model adversary networks and Blue offensive cyber effects on those adversary networks.  Effort was extended and culminated in a module that will allow full effects of blue cyber activities within ACE IOS.  Developed a Cyber Simulator environment generator compatible with the DoD LVC training environment and cyber weapon systems. \n• Joint CDIS Enterprise Network Architecture: completed development and certification\/accreditation of robust GOTS Cross Domain Solution. \n• DMO Improvement- Developed an Intelligence, Surveillance and Reconnaissance and Synthetic Aperture Radar Battle Damage Assessment tool at the DMOC for joint\/coalition warfare use. \n• Space Simulations: Improved the capability of the GPS Environment Generator (GEG).\n• JLVC Improvements:  Integrated a LVC training solution into joint training federation environment that provided a AAR data collection and reporting capability, monitoring of the simulated network\/federation, accurately calculated the savings delivered by the simulation, and provided relevant financial information in real time showing total costs by category."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.524"
                                            },
                                            "Text": {
                                                "val": "• Cyber Simulation:  Modify the ACE-IOS M&S suite to simulate adversary networks (C2, IADs communications networks, telecommunications, power grid, etc.), simulate Blue tactical offensive kinetic and cyber effects on adversary networks. \n• Space Simulation:  Develop Virtual\/Constructive infrared missile defense and special events presentation through the Space Based Infrared System (SBIRs) trainer system data.\n• Space Simulation: Improve the fidelity to GPS Environment Generator (GEG) by upgrading the presentation of GPS jammer signal characteristics I JNTC exercises, improving\/updating receivers in model, providing GPS satellite signal status and conducting automatic precision guided weapon miss distance adjudication. \n• Space Simulation: Develop a Red Console Space Adversary Station, or Red Console, to create a method for live aggressors to interact with a virtual constructive environment using validated tools to replicate threats to space systems. \n• Space Simulation: Perform system engineering and integration with JNTC systems and networks. \n• OPFOR Development: Develop requirements and prototypes for advanced tactical-level threat simulators that are robust\/mobile enough to maneuver in conjunction with OPFOR forces over rough terrain, capable of providing real-time shot data assessment and real-time kill removal, that replicates near-peer A2AD systems.\n• LVC Integration: Perform a USAF and US Army Live Virtual Constructive (LVC) interoperability study to determine the necessary steps to integrate US Army systems (simulators), such as Multiple Integrated Laser Engagement System (MILES) into Polygone's LVC architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Air Force JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.514"
                                        },
                                        "CurrentYear": {
                                            "val": "9.636"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the development of Joint Force Trainer capabilities synchronize with warfighter requirements.  Performance metrics include, but are not limited to; time, cost, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\nMeasures:\n• Cyber: Establish a persistent simulation environment that can be configured rapidly and accurately to reflect the desired operating environment of the training audience.  Also, create an ability to reflect cyber activities against a live Integrated Air Defense system.\n• Space: A fully operational GPS environment which allows space operators to actively participate in Distributed Mission Operations-Space LVC missile warning, GPS disruption and Infrared special events. Also develop space models to model Space as a contested environment to accurately portray impacts of adversary actions in the Space domain.\n• OPFOR: A prototype for a next generation tactical surface to air threat simulator emulating modern fielded threats fielded with potential adversary maneuver elements. \n• A plan for integrating Army ground instrumentation within the Air Force run Polygon range complex."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "772"
                    },
                    "ProjectTitle": {
                        "val": "Navy Joint National Training Capability (JNTC)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.859"
                        },
                        "PriorYear": {
                            "val": "2.514"
                        },
                        "CurrentYear": {
                            "val": "1.593"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "CE2T2 Project 772: Navy Joint National Training Capability (JNTC) transfers from USD-PR PE 0804767D8Z to Joint Staff PE 0804767J in fiscal year 2018"
                        },
                        "ProjectMissionDescription": {
                            "val": "These funds enable the Navy to develop unique maritime capabilities that integrate Joint Live, Virtual, and Constructive (JLVC) elements into a seamless joint training environment. The Navy program activities include conducting research, development, test and evaluation, and cross-service architecture certification on joint-capable systems.  Additionally, the program develops cross-domain architectures for U.S. and Coalition Forces and ensures sister service modeling\/simulation and instrumentation efforts follow a unified standard."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy Joint National Training Capability (JNTC)"
                                    },
                                    "Description": {
                                        "val": "Develops unique maritime capabilities that integrate Joint Live, Virtual, and Constructive (JLVC) elements into a seamless joint training environment.  Using a scientific and phased approach that focuses on modeling ground, air, space, and maritime capabilities, this program researches new technology and methods that provide a crucial technology-based foundation that supports all JNTC Training Transformation (T2), JLVC Federation, and Combatant Commanders Exercise and Engagement (CE2) operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.514"
                                            },
                                            "Text": {
                                                "val": "• Ensured alignment of Navy LVC training standards with JLVC training Standards. \n• Minor enhancements to the ballistic missile defense models in support of Aegis Ashore Team Trainer (AATT) and EUCOM\/CENTCOM exercise requirements.\n• Sustained with minor enhancements maritime models in support of Coalition Partner nation capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.593"
                                            },
                                            "Text": {
                                                "val": "• Continue alignment of Navy LVC training standards with JLVC training standards.\n• Conduct research and development of integrated capabilities between Navy tactical training ranges and synthetic training capabilities in support of Navy LVC efforts.\n• Conduct limited research and development of combat identification training simulation as an enabler for spectrum operations in support of the information warfare commander (IWC). \n• Minimal exploration of technologies to enable Integrated Air and Missile Defense (IAMD) and other combined warfare area and joint training with coalition partners in the Pacific Fleet (PACFLT) Area of Responsibility including Japan, Korea and Australia. \n• Continue collaborative development with Service and Agency partners to improve the realism and relevancy of tactical to operational level of war training capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0804767D8Z"
                                    },
                                    "Title": {
                                        "val": "Navy JNTC O&M Funding"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.877"
                                        },
                                        "CurrentYear": {
                                            "val": "7.770"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "RDT&E development efforts are evaluated based on performance metrics.  This ensures the Joint Force Trainer capabilities development effort synchronizes with warfighter requirements.  Performance metrics include, but are not limited to; time, money, realism, and fidelity as defined below:\n\n• Time – Will the effort enable the Joint Force Trainer to prepare and execute training more timely than current capabilities allow?\n• Cost – Will the effort enable the Joint Force Trainer to prepare and execute training at a more effective and efficient cost than current capabilities allow?\n• Realism – Will the effort enable the Joint Force Trainer to create a training environment that is closer to the real world environment than current capabilities allow?\n• Fidelity – Will the effort enable the Joint Force Trainer to create more detailed capabilities in the training environment than current capabilities allow?\n\n• The Navy will produce one Navy Training Baseline (NTB) software release to include documentation; will design and implement upgrades to Joint Semi-Automated Forces (JSAF) consistent with approved requirements and CRs and document the effects of JSAF capabilities (robustness) and stability.  Will design, implement, test, and integrate NTB enhancements in accordance with requirements.\n\n• For JSAF, Joint Simulation BUS (JBUS) reliability, scalability, and tactical control, the Navy will continuously update the Common Operational Picture (COP) during large scale JLVC exercises."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "079"
                    },
                    "ProjectTitle": {
                        "val": "USSTRATCOM SPACE CYBER"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "CE2T2 Project 079: USSTRATCOM SPACE CYBER transfers from USD-PR PE 0804767D8Z to Joint Staff PE 0804767J in fiscal year 2018"
                        },
                        "ProjectMissionDescription": {
                            "val": "These funds enabled USSTRATCOM to provide funding to architecture and analysis support to Space Security and Defense Program (SSDP) and the JOINT SPACE OPERATIONS CENTER (JICSpOC) through Modeling, Simulation and Analysis (MS&A); Trade-Off Analysis; Concept Development; Scenario Development; and Military Utility Analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "USSTRATCOM SPACE CYBER"
                                    },
                                    "Description": {
                                        "val": "The USSTRATCOM CYBER funding provided architecture and analysis support to SPACE Security and Defense Program (SSDP) and the JOINT SPACE OPERATIONS CENTER (JICSpOC) through Modeling, Simulation and Analysis (MS&A); Trade-Off Analysis; Concept Development; Scenario Development; and Military Utility Analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "• USSTRATCOM conducted exercises which included degraded or denied space environments and included contested cyber environments and required USSTRATCOM Joint Cyber Center to synchronize actions with USCYBERCOM in order to integrate cyber lines of operations.\n• USSTRATCOM exercises sustained integration with interagency and international partners. \n• USSTRATCOM exercises provided opportunities to integrate and synchronize Joint Ballistic Missile Defense."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "All USSTRATCOM missions were exercised during the two Global series exercises during fiscal year with a specific emphasis placed on UCP missions to include: Strategic Deterrence (including Nuclear Commend and Control processes), Space Operations, and Cyberspace Operations. Additional focus areas included USSTRATCOM supporting plans.  The entire command, to include components and task forces participated with the goal to meet over 95% of exercise and training objectives. \n• Complete TPAs in JTIMs IAW CJCSI 3500.01 with a goal of over 75 percent rated T.\n• Insure Command readiness across all UCP-assigned missions leading up to major training events with a goal of 100 percent of B2C2WG and battle roster augmentees trained. \n• All USSTRATCOM missions exercised with a specific emphasis on Nuclear Command and Control processes. Entire USSTRATCOM command, to include components and task forces, participating in two GLOBAL series exercises per FY.  Goal was met in 1st and 2nd quarter."
                        }
                    }
                }
            ]
        }
    }
}