{
    "id": "2018-Army-PB-2040-JBOOK-8aa6116a07f4d60601a05c4a1332e7f28609a7e32c0f8c7666562466c33015eb-3",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0607131A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Product Improvement Programs"
        },
        "R1LineNumber": {
            "val": "181"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.678"
            },
            "CurrentYear": {
                "val": "19.617"
            },
            "BudgetYearOne": {
                "val": "15.738"
            },
            "BudgetYearOneBase": {
                "val": "15.738"
            },
            "BudgetYearTwo": {
                "val": "13.599"
            },
            "BudgetYearThree": {
                "val": "7.544"
            },
            "BudgetYearFour": {
                "val": "5.787"
            },
            "BudgetYearFive": {
                "val": "6.174"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Project ER2: The Close Combat Technology program includes development efforts to upgrade Close Combat technologies, energetics, and munitions, such as counter explosives, grenades, demolitions, shoulder launched munitions, pyrotechnic simulators, countermeasure flares, non-lethal ammunition\/systems, networked munitions and mines, that have been fielded or have received approval for full rate production.  This program will identify, characterize, study, analyze, test and develop technologies to resolve close combat munition reliability, safety, environmental, storage, standardization, obsolescence and manufacturing\/producibility issues.\n\nFY 2018 funds will be used to support the following efforts: MK3A2 Offensive Hand Grenade, Countermeasure Flare Decoy Formulations, and AN-M82A Obscuration Grenade.\n\nProject ER5: The Indirect Fire and Fuze Technology project includes product improvement development efforts to upgrade indirect fire weapon systems and munitions that have already been fielded and\/or are in production.  Indirect Fire Weapons and Munitions Product Improvement Projects include improved target engagement, increased reliability, availability, maintainability, and safety, standardization and interoperability with weapons and munitions of Allied Nations, defense exportability features, reduction of failure mechanisms, and supply chain risk through introduction of new and alternative technology and materiel solutions, improvement of manufacturing methods and their associated production and life cycle support processes, new capabilities in response to the evolving and emerging threats and countermeasures, and reduction\/elimination of potential environmental and health risks associated with these products.   \n\nFY 2018 funding supports testing to demonstrate fuze setback spring interface improvements, engineering tests to prove-out the mortar fuze electronics upgrades, studies on medium caliber fuzes to improve throughput and reduce costs, testing to prove-out impact switch upgrades, evaluations on transceiver component replacement prototype devices for indirect fire and direct fire fuzes, studies on second source MEMS-based G-switches for medium and large caliber applications, and 81mm M821A3E1 HE IM Mortar completion of safety\/environmental test and analysis and full arena testing and analysis of test data.\n\nProject ER6: The Munitions, Survivability and Logistics program funding will be used to support direct fire ammunition from small caliber ammunition, 40mm grenade, medium caliber cannon ammunition and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy and general product improvements.\n\nFY 2018 funds are used for a more lethal and safer design for 40mm grenades that will be built and tested. Warhead improvement and primer improvement for the 30mm Apache ammunition are also under development. A number of studies on potential improvements for training ammunition and environmentally friendly primers will be conducted. Potential improvements to 105mm and 120mm ammunition will be examined."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.945"
                },
                "CurrentYear": {
                    "val": "14.517"
                },
                "BudgetYearOne": {
                    "val": "7.001"
                },
                "BudgetYearOneBase": {
                    "val": "7.001"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.678"
                },
                "CurrentYear": {
                    "val": "19.617"
                },
                "BudgetYearOne": {
                    "val": "15.738"
                },
                "BudgetYearOneBase": {
                    "val": "15.738"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.733"
                },
                "CurrentYear": {
                    "val": "5.100"
                },
                "BudgetYearOne": {
                    "val": "8.737"
                },
                "BudgetYearOneBase": {
                    "val": "8.737"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.733"
                                },
                                "CurrentYear": {
                                    "val": "5.100"
                                },
                                "BudgetYearOne": {
                                    "val": "8.737"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.737"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "ER2"
                    },
                    "ProjectTitle": {
                        "val": "Close Combat Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.836"
                        },
                        "CurrentYear": {
                            "val": "4.300"
                        },
                        "BudgetYearOne": {
                            "val": "3.774"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.774"
                        },
                        "BudgetYearTwo": {
                            "val": "0.612"
                        },
                        "BudgetYearThree": {
                            "val": "0.171"
                        },
                        "BudgetYearFour": {
                            "val": "0.174"
                        },
                        "BudgetYearFive": {
                            "val": "1.500"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.367"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program includes development efforts to upgrade Close Combat technologies, energetics, and munitions, such as counter explosives, grenades, demolitions, shoulder launched munitions, pyrotechnic simulators, countermeasure flares, non-lethal ammunition\/systems, networked munitions and mines, that have been fielded or have received approval for full rate production.  This program will identify, characterize, study, analyze, test and develop technologies to resolve close combat munition reliability, safety, environmental, storage, standardization, obsolescence and manufacturing\/producibility issues.\n\nFY 2018 funds will be used to support the following efforts: MK3A2 Offensive Hand Grenade, Countermeasure Flare Decoy Formulations, and AN-M82A Obscuration Grenade."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Claymore Force-on-Force Training Aids, Devices, Simulators, and Simulations (TADSS) Trainer"
                                    },
                                    "Description": {
                                        "val": "Develop an improved Claymore Force-on-Force Training Aids, Devices, Simulators, and Simulations (TADSS) Trainer.  The Claymore does not have a TADSS trainer with sight, sound & Multiple Integrated Laser Engagement System (MILES) capability.  Development of an improved Claymore trainer will allow Claymore to be trained at Combat Training Centers (CTCs) and will provide more realistic and effective training for the user when they are training Claymore as an end item and when training Claymore as initiated by Spider."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.353"
                                            },
                                            "Text": {
                                                "val": "Designed and tested the Non-Pyro Claymore Simulation (NPCS), finalized the design and tested the Fireset Board and the Multiple Integrated Laser Engagement System (MILES) Emitting Unit. Conducted a Systems Requirements Review (SRR), a Preliminary Design Review (PDR), and performed a User Assessment and Demonstration of the System."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.950"
                                            },
                                            "Text": {
                                                "val": "Design and test Fireset Board, Non-Pyro Claymore simulation and Multiple Integrated Laser Engagement System (MILES) Emitting Unit. Conduct a Preliminary Design Review, perform user assessments and demonstrations and a preliminary Drop and Loose Cargo test. Conduct a Systems Verification Test. All efforts will lead to delivery of a production representative prototype Claymore TADSS trainer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MK3A2 Replacement, Offensive Hand Grenade Effort"
                                    },
                                    "Description": {
                                        "val": "The Current MK3A2 Offensive Hand Grenade can expose the warfighter to toxic levels of asbestos and is restricted for use in Continental United States and Outside Continental United State (CONUS\/OCONUS).  The warfighter cannot safely employ this grenade.  Alternate munitions do not satisfy user requirements for incapacitating the enemy.  This effort incorporates modern materials and insensitive explosives to provide a safer, producible offensive grenade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.483"
                                            },
                                            "Text": {
                                                "val": "Finalized the design of the grenade as well as its training device."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.926"
                                            },
                                            "Text": {
                                                "val": "Production Qualification Testing (PQT) will be conducted in addition to Insensitive Munitions testing and other testing required to support Type Classification (TC).  The final report will be generated.  TC documentation will be generated in preparation for TC in 3QFY19."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.867"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.867"
                                            },
                                            "Text": {
                                                "val": "Both Production Qualification and Arena testing will be conducted as well as documentation for Type Classification (TC) (planned for 3QFY19)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Countermeasure Flare Decoy Formulations"
                                    },
                                    "Description": {
                                        "val": "Improve the producibility of countermeasure (CM) decoy formulations in order to increase the production safety and functional reliability to protect aircraft against multiple threat systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.480"
                                            },
                                            "Text": {
                                                "val": "Develop prototypes and conduct developmental testing.  Effort will result in a production representative prototype countermeasure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.635"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.635"
                                            },
                                            "Text": {
                                                "val": "Improve the producibility of countermeasure (CM) decoy formulations and solutions in order to increase the production safety and functional reliability and performance improvement of solutions to protect aircraft against multiple threat systems. Develop prototype solutions and conduct testing. Effort will result in a production representative prototype countermeasure solutions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AN-M8A2 Obscuration Grenade"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Type Classification \/ Production Prove Out of a new obscurant grenade that provides the warfighter with three times the performance of the current M83 without exposing the soldier to the carcinogens of the AN-M8.  Use of the AN-M8 Obscuration Grenade has been discontinued in Continental United State and Outside Continental United State (CONUS\/OCONUS) due to restrictions of Hexachlorethane on the battlefield.   The M83 is incapable of providing smoke duration or density at the required performance level of the AN-M8, so the current warfighter strategy is to utilize two M83 Obscuration Grenades to replace the performance of the AN-M8."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Effort during FY17 will include finalizing grenade design, producing test quantity, and beginning TC\/FMR documentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.272"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.272"
                                            },
                                            "Text": {
                                                "val": "Validation of the Starter Cup design, and temperature testing of the final AN-M82 (HX) Obscuration Smoke Grenade."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Lethal Ammunition Obsolescence"
                                    },
                                    "Description": {
                                        "val": "Due to advancement in technology, electronic components of fuzed items are rapidly becoming obsolete.  Obsolescence slows or even stops production and delays delivery of systems to inventory which impacts warfighter readiness.  This effort will fund the replacement of obsolete chips on the BA39, XM1112 Tactical Non Lethal Munition 40MM projectile.  Qualification testing will also be required to ensure that the functionality of the round is unchanged."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.144"
                                            },
                                            "Text": {
                                                "val": "This effort will study alternatives to the obsolete components.  A contract will be issued to build prototype components for initial testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable for these items."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ER5"
                    },
                    "ProjectTitle": {
                        "val": "Indirect Fire and Fuze Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.651"
                        },
                        "CurrentYear": {
                            "val": "0.883"
                        },
                        "BudgetYearOne": {
                            "val": "2.268"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.268"
                        },
                        "BudgetYearTwo": {
                            "val": "2.653"
                        },
                        "BudgetYearThree": {
                            "val": "2.646"
                        },
                        "BudgetYearFour": {
                            "val": "2.648"
                        },
                        "BudgetYearFive": {
                            "val": "2.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Indirect Fire and Fuze Technology project includes product improvement development efforts to upgrade indirect fire weapon systems and munitions that have already been fielded and\/or are in production.  Indirect Fire Weapons and Munitions Product Improvement Projects include improved target engagement, increased reliability, availability, maintainability, and safety, standardization and interoperability with weapons and munitions of Allied Nations, defense exportability features, reduction of failure mechanisms, and supply chain risk through introduction of new and alternative technology and materiel solutions, improvement of manufacturing methods and their associated production and life cycle support processes, new capabilities in response to the evolving and emerging threats and countermeasures, and reduction\/elimination of potential environmental and health risks associated with these products.   \n\nThis supports the identification, study, analysis, and development of fuzing technologies and safe arm devices in production and in the field.  This project will implement technologies into fuzing systems to preclude obsolescence, maximize standardization, enhance performance, and improve the safety and exportability of existing munitions.  The project addresses two major areas: (1) analysis and (2) block upgrades.  Analysis efforts will identify second sources for fuzing systems that may reduce cost by providing competition, and maintain production when sources or parts are no longer available.  It will also allow for the performance enhancement of current ammunition items by conducting studies of major fuze components to detect and identify latent defects.  The second major area is block upgrades, which will identify and perform studies on improvements to fuzes, increase commonality of fuze components and requirements.  Block upgrades will enable the introduction of the latest technologies into fuzing, keep the fuzing design current to avoid obsolescence issues, and add capabilities.\n\nThis supports the implementation of IM improvements to the 81mm Mortar Cartridge while meeting all other Key Performance Parameters, namely lethality.  The M821A3 IM cartridge does not meet lethality requirements as outlined in the User Requirements (Capability Production Document (CPD)).  This project is to design an 81mm Mortar (M821A3E1) with pre-formed fragmentation to increase the lethality.  The M821 series of 81mm Mortars is the primary 81mm go-to-war round for U.S. Army and USMC.  This project will provide users a safer round, improving the IM technology and reducing the risk of unplanned stimuli.  This project will also provide enhanced lethality over the M821A3, increasing the capability of the 81mm system.  RDT&E funding is required to develop, test and qualify the pre-formed fragmentation design on the 81mm IM round and ensure that lethality performance requirements are met.\n\nFY 2018 funding supports testing to demonstrate fuze setback spring interface improvements, engineering tests to prove-out the mortar fuze electronics upgrades, studies on medium caliber fuzes to improve throughput and reduce costs, testing to prove-out impact switch upgrades, evaluations on transceiver component replacement prototype devices for indirect fire and direct fire fuzes, studies on second source MEMS-based G-switches for medium and large caliber applications, and 81mm M821A3E1 HE IM Mortar completion of safety\/environmental test and analysis and full arena testing and analysis of test data."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fuze Technology Improvements (FTI)"
                                    },
                                    "Description": {
                                        "val": "Activities include maturation, validation, and risk reduction of fuze technology and fuze component alternatives to increase sources of supply, improve performance, increase safety, and lower cost.  Activities also include integration of fuze initiation improvements to increase reliability and lower fuze costs, evaluation of fuze electronic upgrades to improve safety and increase performance reliability, assessment of inductive fuze setting improvements to lower costs, and evaluation of medium caliber fuze setback interface improvements for increased safety."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.336"
                                            },
                                            "Text": {
                                                "val": "Block Upgrades: Completed the Micro Electro Mechanical Systems (MEMS) component packaging improvements for increased performance and lower cost.  Completed the mortar fuze delay primer improvements and implemented into production via Engineering Change Proposal (ECP).  Conducted fuze setback spring interface modeling and simulation.  Completed prototype fuze cover designs for evaluations of inductive setter interface and initialization of large caliber indirect fire munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.625"
                                            },
                                            "Text": {
                                                "val": "Block Upgrades: Conduct engineering tests to prove-out the mortar fuze delay primer improvements.  Conduct engineering tests to evaluate impact switch performance against mortar target sets.  Conduct engineering tests to evaluate fuze setback spring interface improvements.  Conduct tests to demonstrate fuze setter interface and initialization improvements.  \n\nAnalysis\/Risk Mitigation: Conduct studies on electronic component replacement prototypes for indirect and direct fire fuzes due to component obsolescence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.818"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.818"
                                            },
                                            "Text": {
                                                "val": "Block Upgrades: Will conduct tests to demonstrate fuze setback spring interface improvements.  Will conduct engineering tests to prove-out the mortar fuze electronics upgrades.  Will conduct studies on medium caliber fuzes to improve throughput and reduce costs.  Will conduct tests to prove-out impact switch upgrades.  \n\nAnalysis\/Risk Mitigation: Will conduct evaluations on transceiver component replacement prototype devices for indirect fire and direct fire fuzes.  Will conduct studies on second source MEMS-based G-switches for medium and large caliber applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "81mm M821A3E1 HE IM Mortar Program"
                                    },
                                    "Description": {
                                        "val": "Activities include the maturation of the lethality through modeling and simulation as well as testing to ensure the 81mm will meet all user requirements.  Activities also include ballistic testing to ensure safe and effective firing of the 81mm Mortar.  This will also include modeling to ensure the contour of the round will ensures stable interior and exterior ballistics.  Activities will also focus on maturation of the manufacturability of the round to ensure unit cost is as low as possible, this will be executed through loading studies and other Design of Experiments (DOE)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.315"
                                            },
                                            "Text": {
                                                "val": "Completed ballistic flight testing and also arena lethality analysis which demonstrated the round can meet lethality and range requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.258"
                                            },
                                            "Text": {
                                                "val": "Activities include refining the design to minimize unit cost impacts.  The Program will conduct additional ballistic testing and lethality analysis to refine design and ensure it will meet all requirements.  The program will also test Mortar assets to safety\/environmental extremes to ensure the round will be safe and effective."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "Program will complete safety\/environmental test and analysis.  Activities will include full arena testing and analysis of test data."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Fuze Technology Improvement (FTI) will improve current production munitions by exploiting existing fuzing technologies and inserting them into current fielded and\/or production fuzes, providing safer, more producible, and more lethal fuzing solutions.  FTI develops second source suppliers and resolves component obsolescence issues to mitigate risk and prevent production interruptions in order to continue to provide safer, more reliable munitions for the Warfighter with significant risk reduction to production fuzes also benefiting the U.S. Taxpayer.  The effort is a continuation of studies, analysis, evaluations, and development of fuzing technologies and safe and arm devices in production and in the field.  This program will implement these technologies into fuzing systems to preclude component obsolescence, maximize standardization, enhance performance, and improve the safety and exportability of existing munitions.\n\nThe 81mm M821A3E1 HE IM Mortar Project utilizes the DoD Ordnance Technology Consortium (DOTC) to conduct loading studies and produce test samples.  The initiatives emphasize improving the manufacturability of the M821A3E1 to minimize unit cost burden in the future.  Follow-on production of the M821A3E1 will utilize the component break-out strategy where the Office of the Project Manager (PM) Combat Ammunition Systems (CAS) will be the Systems Integrator in order to maximize efficiencies."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ER6"
                    },
                    "ProjectTitle": {
                        "val": "Direct Fire Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.191"
                        },
                        "CurrentYear": {
                            "val": "14.434"
                        },
                        "BudgetYearOne": {
                            "val": "9.696"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.696"
                        },
                        "BudgetYearTwo": {
                            "val": "10.334"
                        },
                        "BudgetYearThree": {
                            "val": "4.727"
                        },
                        "BudgetYearFour": {
                            "val": "2.965"
                        },
                        "BudgetYearFive": {
                            "val": "2.174"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Munitions, Survivability and Logistics program funding will be used to support direct fire ammunition from small caliber ammunition, 40mm grenade, medium caliber cannon ammunition and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy and general product improvements.  \n\nFY 2018 funds are used for a more lethal and safer design for 40mm grenades that will be built and tested.  Warhead improvement and primer improvement for the 30mm Apache ammunition are also under development.  A number of studies on potential improvements for training ammunition and environmentally friendly primers will be conducted.  Potential improvements to 105mm and 120mm ammunition will be examined."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Ammo Design Qualification & NATO Mission Support"
                                    },
                                    "Description": {
                                        "val": "This program ensures complete interchangeability of small caliber and automated cannon-caliber, and 40mm grenade ammunition and weapons among NATO countries to achieve the associated logistic, strategic and tactical advantages."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.065"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work supported NATO small arms ammunition interchangeability group meetings, documentation and test operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lightweight Ammunition"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and qualify a Lightweight Small Caliber Ammunition (LSCA) 7.62mm, 5.56mm, and .50 cal capability that will provide an ammunition weight savings of ten to fifty percent to the M2, M240, M4A1, and M249 gunner, assistant gunner, and ammo bearer."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.264"
                                            },
                                            "Text": {
                                                "val": "FY 2017 funds used to perform government testing and continued improvement of candidate designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.855"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.855"
                                            },
                                            "Text": {
                                                "val": "FY 2018 funds supports continuation of government testing and improvement of candidate designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lead Free Primer"
                                    },
                                    "Description": {
                                        "val": "Automate and Integrate environmental friendly lead free primary explosives within the small caliber family of ammunition.  Addresses health concerns of lead intake during firing by removing lead styphnate from small caliber primers.  Automated pilot line combined with new mix reduces human exposure, improves quality, improves safety and reduces environmental waste in manufacturing process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.151"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work supported optimizing primer mix for 5.56mm, 7.62mm, and .50 cal primers, developed master test plan for cartridge qualification, tested 5.56mm cartridges for compatibility as mix and process matures, completed design of automated pilot line to include mixing, dispensing, and drying of lead free primers, and began building pilot line process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will support complete optimization of 5.56mm, 7.62mm, and .50 cal primer mix, test multiple 7.62mm cartridges and remaining 5.56mm cartridges for compatibility as pilot line process matures, begin Energetic Munition Qualification Board (EMQB) processes, complete development of pilot line process, and complete prove-out test plans for pilot line equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "FY 2018 will complete the build for the 5.56mm primer qualification and initiate the 7.62mm and .50 caliber pilot lines.  Finalize the Technical Data Packages for the three calibers and complete the EMQB process.  Finally, refine and optimize the automation of the manufacturing process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support Sniper Ammunition Integration Into Army Standard Sniper Weapons"
                                    },
                                    "Description": {
                                        "val": "Modify existing sniper ammunition to support integration into new Army standard sniper weapons. Maintain compatibility with legacy sniper weapons while improving operational availability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will test and evaluate sniper ammunition improvements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.360"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.360"
                                            },
                                            "Text": {
                                                "val": "FY 2018 work continues to test and evaluate sniper ammunition improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support Improvements in Direct Fire Propulsion Systems"
                                    },
                                    "Description": {
                                        "val": "Improve Direct Fire Propulsion Systems to increase user survivability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will explore additional sources of supply in the National Technology and Industrial Base (NTIB) to reduce the dependence on foreign suppliers and pursue improvements to address temperature sensitivities of energetics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "FY 2018 work will continue to explore additional sources of supply in the National Technology and Industrial Base (NTIB) to reduce the dependence on foreign suppliers and pursue improvements to address temperature sensitivities of energetics and primer ballistics.  Work will also include technology improvements to reduce muzzle flash."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved M789 Lethality, Warhead Fragmentation Improvement"
                                    },
                                    "Description": {
                                        "val": "Improve 30mm M789 warhead lethality by performing trade studies and implementing advanced warhead and fuze technologies to promote more efficient fragmentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.083"
                                            },
                                            "Text": {
                                                "val": "FY 2016 baselined M789 vs. improved M789 arena, shaped charge, and lethality data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will support Request for Proposal (RFP), Solicitation, Contract Award, and Qualification Build."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "FY 2018 work will support the completion and implementation of trade studies following testing, TDP updating, and preparing for manufacturability and qualification build."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "M433 Warhead Improvement"
                                    },
                                    "Description": {
                                        "val": "40mm: Improve lethality (fragmentation) of the M433 grenade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.773"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work included conducting a demonstration of subsystem and system maturity with two integrated system demonstration tests.  Testing confirmed integration maturity and enabled improvements in system manufacturing.  Contracting actions were awarded to find a source to manufacture developmental test and evaluation hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.220"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will conduct Developmental Testing (DT) \/ Pre Production Qualification Test (PPQT) build."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.570"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.570"
                                            },
                                            "Text": {
                                                "val": "FY 2018 work finishes Pre Production Qualification Tests (PPQT), perform Materiel Release (MR)\/Engineering Change Proposal (ECP) actions, and support contracting actions to transition new Technical Data Package (TDP) into Full Rate Production (FRP)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Practice Spotter Technology Insertion"
                                    },
                                    "Description": {
                                        "val": "Training Cartridge with impact initiated spotting charge. Goal is visible signature upon impact under all conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "FY 2016 work finalized the program.  Determined technology insertion is not feasible at this time."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "20mm C-RAM Ammo Improvement"
                                    },
                                    "Description": {
                                        "val": "As per JUON CC-0562 for enhanced lethality, M940 20mm ammunition requires research and development efforts to increase the lethality effects of the land-based Phalanx Weapon System (LPWS) against larger rocket threats.  This effort will increase the current capability of the M940 by incorporating design features to provide improvement to probability of Kill."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "FY 2017 funding will support the design and testing of multiple improved M940 concepts aimed at quickly providing enhanced lethality effects against large rocket threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.580"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Text": {
                                                "val": "FY 2018 funding will continue to support the design and testing of multiple improved M940 concepts aimed at quickly providing enhanced lethality effects against large rocket threats.  Concurrently, an optimized concept will be designed and tested to provide a more permanent solution with enhanced lethality and significant improvement to probability of kill."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stryker 30x173mm and Apache 30x113mm Airburst Munitions"
                                    },
                                    "Description": {
                                        "val": "Increase anti-personnel lethality and lethality within Military Operations in an Urban Terrain (MOUT) structures compared to current Army medium caliber solutions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.653"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.653"
                                            },
                                            "Text": {
                                                "val": "FY 2018 funding supports the study of the 30x173mm airburst capable cartridge and programming\/communication unit which interfaces with Stryker Infantry Carrier Vehicle (ICV) and\/or Army Future Fighting Vehicles.  Funding supports the 30x113 airburst capable cartridge and unit programming.  Efforts will try to establish commonality for these key systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tank Ammunition Improvements"
                                    },
                                    "Description": {
                                        "val": "Develop and test potential improvements to 105mm and 120mm gun system ammunition."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.450"
                                            },
                                            "Text": {
                                                "val": "FY 2018 work will include various efforts for 105mm and 120mm tank ammunition, including chemical tracer improvements, combustible cartridge case design and fabrication improvements, and non-developmental cartridge testing for the M68 cannon."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "40mm M576 Improvement Study"
                                    },
                                    "Description": {
                                        "val": "40mm M576 product improvement will provide the warfighter with the ability to quickly defeat closed-in personnel targets"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.178"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.178"
                                            },
                                            "Text": {
                                                "val": "FY 2018 funding will be used to baseline the current M576 capabilities and explore improved candidate designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Door Breach Munition"
                                    },
                                    "Description": {
                                        "val": "Product improved door breach munition to allow rapid breaching beyond current capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.069"
                                            },
                                            "Text": {
                                                "val": "Qualified improved door breach munition to meet user requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Single Crystal Tungsten Evaluation"
                                    },
                                    "Description": {
                                        "val": "Testing will be conducted to determine the effectiveness of single crystal tungsten penetrators against armored targets."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "FY2018 work will include testing to determine the effectiveness of single crystal tungsten penetrators against armored targets."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0603639A Project EL8"
                                    },
                                    "Title": {
                                        "val": "Lightweight Cartridge Case for Small Caliber Ammunition"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "1.280"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.500"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.500"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0654802A Project EP6"
                                    },
                                    "Title": {
                                        "val": "Lightweight Cartridge Case for Small Caliber Ammunition"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "1.290"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The funding lines continue work for 7.62mm ammunition and the follow-on effort for the .50 Cal starting in FY 2022."
                        },
                        "AcquisitionStrategy": {
                            "val": "All contracts will be full and open competition firm fixed price."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}