{
    "id": "2018-TheJointStaff-PB-0400-MJBOOK-0-0-bc089b85e97abbbc11ea38fc58c96b94903acf8980ac0e2f4ed647500a99c5be-2",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-TJS-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0204571J"
        },
        "ProgramElementTitle": {
            "val": "Joint Staff Analytical Support"
        },
        "R1LineNumber": {
            "val": "171"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "13.516"
            },
            "PriorYear": {
                "val": "5.983"
            },
            "CurrentYear": {
                "val": "7.464"
            },
            "BudgetYearOne": {
                "val": "7.712"
            },
            "BudgetYearOneBase": {
                "val": "7.712"
            },
            "BudgetYearTwo": {
                "val": "6.870"
            },
            "BudgetYearThree": {
                "val": "5.135"
            },
            "BudgetYearFour": {
                "val": "5.134"
            },
            "BudgetYearFive": {
                "val": "5.134"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for The Joint Staff (TJS) and Combatant Commands (CCMDs).  JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulates the results to best assist the Chairman in fulfilling his statutory responsibilities.  Key deliverables provided by JSAS include development and implementation of Joint Concepts, wide-ranging force structure assessments, course of action development for the Joint Force environment, analyses and studies to aid in decision-making, and other analysis efforts to implement timely, low-cost joint force development initiatives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.983"
                },
                "CurrentYear": {
                    "val": "7.464"
                },
                "BudgetYearOne": {
                    "val": "6.312"
                },
                "BudgetYearOneBase": {
                    "val": "6.312"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.983"
                },
                "CurrentYear": {
                    "val": "7.464"
                },
                "BudgetYearOne": {
                    "val": "7.712"
                },
                "BudgetYearOneBase": {
                    "val": "7.712"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.400"
                },
                "BudgetYearOneBase": {
                    "val": "1.400"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Additional support for Global Force Management Data Initiative (GFM DI)"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.400"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.400"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018: Increase in funding to P003 GFM DI to complete development and fielding of Joint Planning Services pilot that is fully integrated with Joint Planning and Execution Services Framework.\n\nFY 2019 thru FY 2022: Decrease in funding for FY 2019 thru FY 2022 is a result of mandated 25% Management Headquarters Activities (MHA) reductions prescribed by the 2016 NDAA."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Future Joint Force Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.410"
                        },
                        "PriorYear": {
                            "val": "5.983"
                        },
                        "CurrentYear": {
                            "val": "5.564"
                        },
                        "BudgetYearOne": {
                            "val": "5.712"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.712"
                        },
                        "BudgetYearTwo": {
                            "val": "5.470"
                        },
                        "BudgetYearThree": {
                            "val": "5.135"
                        },
                        "BudgetYearFour": {
                            "val": "5.134"
                        },
                        "BudgetYearFive": {
                            "val": "5.134"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Staff Analytical Support (JSAS) program supports the Chairman of the Joint Chiefs of Staff (CJCS) Title 10, Section 153 statutory responsibilities that directs the analytical support, management, development, evaluation, and implementation of joint concepts in order to advance the operational effectiveness of the future Joint Force and enable the introduction of new capabilities.  The Joint Concepts Program assists the CJCS in the formulation of “best military advice” by providing a long-term (out to 20 years) vision of how the Joint Force will be developed to respond to the future operating environment characterized by trans-regional, multi-domain, and multi-functional challenges.    Key deliverables include:  The Joint Operating Environment (JOE); Capstone Concept for Joint Operations (CCJO); identification, development, and implementation of Joint Concepts necessary to address future operating environment challenges and achieve objectives of the National Military Strategy (NMS); and CJCSI 3010 Guidance for Development and Implementation of Joint Concepts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Joint Force Development"
                                    },
                                    "Description": {
                                        "val": "FY 2016 efforts focused on supporting the President’s “Sustaining U.S. Global Leadership Priorities for the 21st Century Defense” with emphasis on concept assessment of the Chairman’s Capstone Concept for Joint Operations, implementing the Joint Operational Access Concept, and developing new operational concepts to support achievement of the NMS. Specific work focused on joint concept development, implementation, and assessment through the Iron Crucible Wargaming series resulting in joint capability gap analysis and recommendations for non-materiel solutions that will improve current and future joint force capability including operating in anti-access and area denial (A2\/AD) environments, joint command & control, counterterrorism, and defeating threats in all domains, including cyber."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.983"
                                            },
                                            "Text": {
                                                "val": "FY 2016 efforts focused on completing the update of the Capstone Concept for Joint Operations: Joint Force 2030 (CCJO) (in draft with the CJCS at the end of FY 2016), publishing the Joint Operating Environment 2035 (JOE), developing a new Family of Joint Concepts framework aligned with the NMS, and developing five new Joint Concepts with the Joint Concept Community to guide and shape future joint force development.  Active implementation included 14 Joint Concepts into Doctrine, Organization, Training, Materiel Leadership and Education, Personnel, Facilities, and Policy (DOTMLPF-P) processes during FY 2016 resulting in 3 studies, 5 Capabilities-Based Assessments (CBA), 14 DOTMLPF-P Change Requests (DCR), 1 Initial Capabilities Document (ICD), 3 Capability Development Documents (CDD), 1 Capability Production Document (CPD), and development of 3 Joint Knowledge Online (JKO) courses. The final update for the Joint Operational Access Concept Implementation Plan was signed May 2016 signaling that appropriate DOTMLPF-P processes are developing capabilities critical to addressing Anti-Access\/Area Denial (A2\/AD) challenges.  18 legacy concepts were approved by the Director of the Joint Staff for archival.  The CJCSI 3010 was approved Aug 2016 with improved terminology and process descriptions to guide joint concept development and implementation.  Initiated the pilot year of the DepSecDef directed Warfighting Lab Incentive Fund (WLIF) program, resulting in 13 OSD-funded projects designed to spur and support warfighting field experiments, demonstrations, and operational user input to develop innovative capabilities, and new operational and organizational constructs to address emerging warfighter challenges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.564"
                                            },
                                            "Text": {
                                                "val": "Complete CJCS approval of the CCJO.  In partnership with selected CCMDs and the Services, begin developing the approved Family of Joint Concepts needed to address the 4+1 strategic challenges expressed in the NMS, out to 2035.  Continue futures study to inform our understanding of the challenges of the future operating environment. Complete development of 5 new Joint Concepts from FY 2016 and initiate 2 new Joint Concepts aligned to the National Military Strategy (NMS).  Continue implementing approved Joint Concepts IAW CJCSI 3010.  Expand multinational partnerships in futures and concept development.  Support Joint Staff 2017 efforts by integrating Joint Concepts across the Joint Staff to inform capability development decisions.  Continue to lead execution and oversight of the DepSecDef directed WLIF program to spur innovative force development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.712"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.712"
                                            },
                                            "Text": {
                                                "val": "Continue support for CJCS's NMS and CCJO.  In partnership with selected CCMDs and the Services, continue developing the approved Family of Joint Concepts needed to address the 4+1 strategic challenges expressed in the NMS, out to 2035.  Continue futures study to inform our understanding of the challenges of the future operating environment. Complete development of 2 new Joint Concepts from FY 2017 and initiate 2 new Joint Concepts aligned to the NMS. Continue implementing approved Joint Concepts IAW CJCSI 3010.  Continue multinational partnerships in futures and concept development.  Continue integrating Joint Concepts across the Joint Staff to inform capability development decisions.  Continue to lead execution and oversight of the DepSecDef directed WLIF program to spur innovative force development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Concept development performance metrics are derived from the Chairman’s Title 10 responsibilities and CJCSI 3010.02E Guidance for Developing and Implementing Joint Concepts and, as such, support the purpose of informing the Department’s senior leadership by examining military problems and providing an azimuth for future joint force development. \n\nPerformance measure 1 – Identify and develop Joint Concepts to examine military challenges and propose innovative joint solutions and associated capabilities in support of defense needs and priorities.\nMetrics: Aligns with and informs the NMS. Informed by rigorous futures analysis. Creates relevance and advocacy among operations, plans, and force development communities.  \n\nPerformance measure 2 – Lead the development of Joint Concepts in collaboration with joint and multinational partners.\nMetrics: Joint Concepts governance system promotes “best military advice” for the CJCS.  Ideas and solutions are rigorously and objectively evaluated within a joint and multinational context.  Joint concepts are continually monitored to ensure consistency, relevancy, and utility throughout their life cycle.  \n\nPerformance measure 3 – Implement Joint Concepts. \nMetrics:  Transition plans promote informed decisions for joint force development.  Leverage, integrate or inform related capability development programs for maximum efficiency and effectiveness."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P002"
                    },
                    "ProjectTitle": {
                        "val": "Global Force Management Data Initiative (GFM DI)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9.106"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for the Joint Staff (TJS) and Combatant Commands (CCMDs).   JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulates the results to best assist the Chairman in fulfilling his statutory responsibilities.   Under the umbrella of analytical support tools are the Automated Global Force Management Tool (AGT) and the Collaborative Issue Resolution Tool (CIRT), both which will meet requirements set forth in Title 10 U.S.C. and the Unified Command Plan (UCP) for automating the Global Force Management Implementation Guidance Forces For (Assignment and Apportionment) tables.  Additionally, the Joint Organizational Server (JOS) will be the enabler system for Joint Staff personnel to be entered, near-real-time, into the automated Forces For Process.\n\nRDT&E efforts for GFM DI ended in FY 2015."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "GFM DI Enterprise Force Structure (EFS) Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.900"
                        },
                        "BudgetYearOne": {
                            "val": "2.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.400"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Global Force Management Data Initiative (GFM DI) Enterprise Force Structure (EFS) integration effort provides the next steps for GFM Mission Application enhancements intrinsic to balancing global force demand against the total military force. This complex and multi-variant task requires modernized technologies that must provide integrated information by linking authoritative force structure data (derived from the GFM DI Organizational Servers) to C2 data (resident in GFM mission applications). The Joint Staff Operations Directorate is responsible for GFM Allocation and is the Functional Manager of the GFM mission applications. Accordingly, the Joint Staff Operations Directorate will employ a joint strategy for efficiently fulfilling Enterprise Force Structure (EFS) data utility.\n\nThe DoD must quickly transition from legacy systems that promulgate data disparity across the Defense enterprise in order to meet National military objectives that have evolved from large force scenarios to operations that include small-to-full scale activities. As stated in both the NSS and NMS, our adversaries demonstrate the ability to readily transition from non-kinetic to kinetic means. Consequently, Information Technology (IT) superiority, capabilities, and recognition of associated vulnerabilities are an operational imperative. Yet, warfighters, strategic planners and GFM decision makers are unable to seamlessly exchange information in a manner that keeps pace with globally changing threats to rapidly and accurately accomplish force sourcing activities to support SecDef allocation decisions. TJS is mandated to utilize the Service Org Server (OS) EFS data to enhance managing, assessing, and displaying the worldwide disposition of U.S. Forces. Key deliverables include incrementally developed, operationally realistic capability enhancements focused on Resource-Informed Planning and GFM sourcing functionality required by JROCMs, the Capability Development Document (CDD) for GFM DI; Joint Command and Control (JC2) Capability Definition Package (CDP); Joint Operation Planning Process (JOPP) and Assessment CDP; and Force Planning & Deployment Planning\/Execution CDP."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Critical upgrades to GFM Mission Applications directly supporting Enterprise Force Structure Integration."
                                    },
                                    "Description": {
                                        "val": "The GFM Mission DI EFS integration effort requires RDT&E funds to upgrade GFM Mission Applications in order to operationalize the force structure data from the Service's Organizational Servers to actual forces for employment within the purview of Allocation and Joint Command and Control. This GFM DI effort within the Joint Staff Analytical Support (JSAS) family of programs: will immediately streamline the SECDEFs \"Forces for Unified Commands\" memorandum Assignment Tables. RDT&E efforts for Assignment and Apportionment functions ended in FY 2015 with the declaration of the Automated Global Force Management Tool (AGT) Full Operation Capability (FOC). In order to complete the GFM DI tasks, efforts must begin as early as possible to ensure all GFM DI planned milestones, reflected in Section E, are realized and thereby enable a Global Visibility Capability. GFM applications managed by the Joint Staff are used by the JSAS family of programs. This effort to fund critical upgrades is a precondition to GFM DI EFS Integration."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Text": {
                                                "val": "Specific RDT&E work will focus on development of a Joint Force Capabilities Catalog (JFCC) that draws upon authoritative Service force structure and GFM data aggregated in a prototype Global Laydown Server (GLS). This approach is essential in a budget constrained environment to fulfill the DoD CIO \"DoD Cloud Way Forward\" focused on service-oriented architecture that flattens the legacy \"Silos of Databases\" paradigm by leveraging decentralized infrastructure services. It will enable DoD CIO foundational IT changes with enhanced cybersecurity that provides information sharing within the Joint Command and Control mission partner environment without redundant or duplicative resources. The strategy will result in initial incremental development of the Joint Force Capability Catalog (JFCC) virtual application with a Force Element Inventory Predictive Analysis Tool (FEI PAT) utilizing dynamic force visibility that provides timely, accurate and dynamic data representing U.S. Forces in motion for the 34 GFM leading indicators and Combatant Commanders initial force requirements as identified in the NMS priority OPLANS.  The Initial Operating Capability (IOC) will be achieved by first aggregating the Service Org Server data into the Global Laydown Server to link Service generated Organization Unique Identifiers (OUIDs) for  force elements identified to establish the Joint C2 relationships to the Allocation process (OPCON and TACON Links). This will provide the capability to establish the OUID\/ Unit Identification Code (UIC) linkages in Joint Operation Planning and Execution System (JOPES) Time-Phased Force Deployment Data (TPFDDs), then map them to GFM allocation information (Force Tracking Number [FTN], Request for Forces [RFF], Deployment Order\/Line Number [DEPORD\/LNR]), and Assignment of the Forces For Unified Commands"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Specific RDT&E work will focus on the continued incremental development of the Joint Force Capabilities Catalog (JFCC) that will operationalize the DoD directed GFM DI by linking full DoD Service force structure to dynamic GFM factors (Capabilities, Readiness, Availability, Employment\/Location) within the GLS thereby providing a dynamic representation of the disposition of all military forces. The GLS algorithms will enable the GFM mission applications to present meaningful information required for timely and accurate decision making to assist the Chairman in providing best military advice. The JFCC will serve as a user interface that uses the GLS algorithms to streamline operations planning and GFM execution in support of CCMD Warfighter requirements. The FY 2018 strategy will focus on a Unit Type Capabilities registration functionality within the JFCC that will unify the unit-based readiness and unit type reporting process by obtaining on-hand forces (personnel and equipment) via the EFS (GFM DI) standard format. The FY 2018 incremental development of the JFCC virtual application and associated dynamic force visibility will provide the true inventory of force availability based on Service employable entities (Unit Types) and sustainability factors, to enable the use of on-hand Service Force capabilities identified down to the Service-defined lowest deployable entities (Unit Types) for executive decision making and GFM mission execution."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The JSAS efforts will result in a Global Laydown Server and Joint Force Capabilities Catalog that supports a Global Visibility Capability (GVC) allowing for enhanced GFM and Joint future force integration along with implementation of concepts to meet the information requirements needed to support timely and dynamic response to combatant commanders’ unforeseen contingency requirements. This is a cost-effective yet full spectrum approach to support and assist the Chairman in fulfilling his statutory responsibilities while improving current and future joint force management, and are measured by the following:\n\n(1)\tMeet IOC that enables rapid generation of GFM decision-making information for Policy-makers and warfighting Combatant Commands based on authoritative Service force capability, readiness, availability and current employment data.\n\n(2)\tReducing the manual process of assembling Capability, Readiness, Availability, Employment (CRAE) data, is the first step to providing enhanced force management decision-making. Mining this data is currently a labor-intensive, time-consuming process and significantly impedes rapid response capabilities. Automating this data aggregation requires EFS Data services and Web Service Interfaces supporting a Joint Force Capabilities Catalog (JFCC) as described in the EFS Capability Package (CP) and is critical to operationalizing the force structure data and achieve GFM DI Next Steps Allocation.\n\n(3)\tServices, CCMDs, Joint Staff and OSD will be able to efficiently manage (collect and analyze) force generation data supporting GFM in far less time than the current process, and with an authoritative common view of the sourcing-to-employment tracking of forces. This is accomplished by the automated linking of the Organization Unique Identifier (OUID) attributes from the GFM DI Org Servers (OS) to the Unit Identification Code (UIC) resident in JOPES.\n\n(4)\tThe JFCC will enable the rapid generation of information when making time-sensitive decisions and allow a Joint Planner to inculcate the association of standard and consistent force structure instance data and consistently applied data \"types\" with force structure data referenced over time in the GFM sourcing solution generation and deployment planning, execution, and distribution processes.\n\n(5)\tAbility to meet the VCJCS guidance to meet the GFM DI Full Operating Capability (FOC) by FY 2020 for GFM Allocation."
                        }
                    }
                }
            ]
        }
    }
}