{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-55",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605053A"
        },
        "ProgramElementTitle": {
            "val": "Ground Robotics"
        },
        "R1LineNumber": {
            "val": "135"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "70.760"
            },
            "BudgetYearOneBase": {
                "val": "70.760"
            },
            "BudgetYearTwo": {
                "val": "88.117"
            },
            "BudgetYearThree": {
                "val": "94.121"
            },
            "BudgetYearFour": {
                "val": "70.089"
            },
            "BudgetYearFive": {
                "val": "35.662"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "358.749"
            }
        },
        "ProgramElementNote": {
            "val": "In FY2018 funding for the Man Transportable Robotic System (MTRS) Inc II transitions from PE 0604808A Landmine Warfare\/Barrier - Eng Dev, Project 415 Mine Neutral\/Detection to PE 0605053A Ground Robotics, Project FB2 Man Transportable Robotic System (MTRS) Inc II; Robotics Architecture will transition from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB3 Robotics Architecture; Common Robotics Systems (CRS) transitions from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB4 Common Robotic Systems; Robotic Enhanced Program (REP) will transition from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB7 Robotic Enhanced Program, Squad Multipurpose Equipment Transport (SMET) will transition from PE 0604641A Tactical Unmanned Ground Vehicle Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB6 SMET."
        },
        "ProgramElementMissionDescription": {
            "val": "The Man-Transportable Robotic System (MTRS) Inc II is a modular system providing a multitude of standoff capabilities through different payloads for the Army. These capabilities include detect and confirm presence, identify disposition, and counter hazards by providing a platform for payloads in support of current and future mission requirements. Additionally, MTRS Inc II will support current and future payload missions for the engineer's route clearance platoons, Special Operational Forces (SOF) detachments, Chemical Biological Radiological and Nuclear (CBRN), and Explosive Ordnance Disposal (EOD) units. \n\nRobotic Architecture (RA) provides the engineering and development resources to manage the overarching architecture for robotic systems that are both modular and interoperable across the Joint Force in order to facilitate future modernization efforts. It will manage the interoperability standards, modular payload interface, common software and common architecture for universal controllers. RA includes the construction of program specific Interoperability Profiles (IOP) (i.e. Squad Multi-Equipment Transport (SMET), Leader\/Follower (LF), Route Clearance Interrogation System (RCIS) Type II, Common Robotics System (Vehicle) (CRS(V)), Common Robotics System (Individual) (CRS(I)) Inc II, Common Robotics System (Heavy) (CRS(H)), EOD Robotic Payload (ERP), Light Reconnaissance Robot (LRR), Robotic Wingman, etc.) and new standards addressing emerging requirements (i.e. Cyber Security, Information Assurance, new autonomous behaviors, new payloads, etc).\n\nThe Common Robotic System - Individual (CRS(I)) will be a man-packable, small (<25lbs), highly mobile, unmanned robotic system with advanced sensors\/mission modules for dismounted Service Members. The CRS(I) will be designed so the operator can quickly re-configure for other various missions by adding or removing modules and\/or payloads. The CRS(I) will also include the Army universal controller used by all unmanned ground and aerial vehicles within the battalion formation providing interoperability, logistics, and training efficiencies. The CRS(I) will provide interrogation, detection, confirmation, and neutralization capabilities employed to support a wide spectrum of mobility missions for current and future forces. This capability provides commanders the ability to persistently monitor the operating environment (OE) while protecting and sustaining the force. The CRS(I) complements the Joint Integrated Warfighting Force by providing standoff to the Warfighter during major combat, stability, and homeland security operations.\n\nSquad Multipurpose Equipment Transport (SMET) will help to reduce the load on the Soldier by transporting mission specific equipment, resupply equipment, and supplies required for extended operations.  The SMET  will be capable of carrying the equipment currently required to support Infantry and Engineer Platoons in the Infantry Brigade Combat Team (IBCT) for a 72 hour mission without resupply. The SMET will reduce Soldier load, increase squad mobility during combat operations and dismounted maneuvers. SMET will have open architectures, operator control units and support casualty evacuation, power generation\/offload and chemical\/biological payloads.\n\nThe Robotics Enhancement Program (REP) uses a \"buy, try, and inform\" methodology to evaluate Commercial Off the Shelf (COTS), Government Off the Shelf (GOTS) and Non-Developmental Item (NDI) robotics products that have the potential to enhance Soldier combat effectiveness. Actual operational user feedback and evaluation results obtained will inform emerging capabilities and requirements documents in support of a Cost-Benefit Analysis to support future Army decision making.\n\nThe Soldier Borne Sensor (SBS) provides a near term solution to three Army Warfighting Challenges at the Infantry Squad level: develop situational understanding, conduct air-ground reconnaissance, and conduct joint combined arms maneuver.  The SBS provides the Squad organic “quick look” capability when higher echelon assets are unavailable and time is of the essence.  The system is simple to use, expendable, and deployable in a matter of seconds to support the squad leader’s decision-making process.  The system allows Soldiers to obtain local situational awareness and understanding of their immediate surroundings while remaining in covered or concealed positions.\n\nThe MTRS Standardization project provides the platforms to support integration and testing of payloads and technology for non-standard unmanned ground robotics systems used by Army Engineers, Explosive Ordnance Disposal (EOD), Chemical, Biological, Radiological, and Nuclear (CBRN) and Special Operational Forces (SOF) units.  Current system characteristics include the following: a remote controlled articulated arm with a gripper, operating range up to 800m, multiple illuminated cameras, a pan\/tilt surveillance camera, two-way radio, and a ruggedized operator control unit.  The platforms provided will support development and testing of the following capabilities:  High Dexterous Manipulation System (HDMS), Multi-Spectral Image Fusion System (MIFS), and Precision Aimed Multishot Disruptor (PAMD).  The use of robotics allows the first approach, to potentially explosive hazards, to be made by a robot rather than a Soldier.\nThis project will also supports the development of a library of robot parts that can be 3D printed via additive manufacturing.  The funding will also test the operational compatibility of the 3D printed parts with robot platforms."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "70.760"
                },
                "BudgetYearOneBase": {
                    "val": "70.760"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "70.760"
                },
                "BudgetYearOneBase": {
                    "val": "70.760"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "66.759"
                                },
                                "BudgetYearOneBase": {
                                    "val": "66.759"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.003"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "4.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.004"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 delta is attributable to various projects (i.e., FB2, FB3,  FB4, FB6, FB7, FB8, FB9, FG8) within this program element being new starts in FY 2018.\n\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\nIn FY2018 funding for the Man Transportable Robotic System (MTRS) Inc II transitions from PE 0604808A Landmine Warfare\/Barrier - Eng Dev, Project 415 Mine Neutral\/Detection to PE 0605053A Ground Robotics, Project FB2 Man Transportable Robotic System (MTRS) Inc II; Robotics Architecture transitions from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB3 Robotics Architecture; Common Robotics Systems (CRS) transitions from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB4 Common Robotic Systems; Robotic Enhanced Program (REP) transitions from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB7 Robotic Enhanced Program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FB2"
                    },
                    "ProjectTitle": {
                        "val": "Man Transportable Robotic System (MTRS) Inc II"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.780"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.780"
                        },
                        "BudgetYearTwo": {
                            "val": "4.690"
                        },
                        "BudgetYearThree": {
                            "val": "4.700"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.170"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY2018 funding for the Man Transportable Robotic System (MTRS) Inc II will transition from PE 0604808A Landmine Warfare\/Barrier - Eng Dev, Project 415 Mine Neutral\/Detection to PE 0605053A Ground Robotics, Project FB2 Man Transportable Robotic System (MTRS) Inc II"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Man-Transportable Robotic System (MTRS) Inc II is a modular medium-sized system providing a multitude of standoff capabilities through different payloads for the Army. These capabilities include detect and confirm presence, identify disposition, and counter hazards by providing a platform for payloads in support of current and future mission requirements.  MTRS Inc II will support current and future payload missions for the Engineer's route clearance platoons, Special Operational Forces (SOF) detachments, Chemical Biological Radiological and Nuclear (CBRN), and Explosive Ordnance Disposal (EOD) Units."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MTRS Inc II RDTE"
                                    },
                                    "Description": {
                                        "val": "MTRS Inc II RDTE funding to support OPA requirements"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.780"
                                            },
                                            "Text": {
                                                "val": "Funding will be used to acquire First Article Test hardware for test, test site, and test site support, fund design efforts to include Critical Design Review (CDR) and contract data, along with program management costs to include salaries, travel and miscellaneous expenses associated with the MTRS Inc II RDTE program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "R67050"
                                    },
                                    "Title": {
                                        "val": "Man-Transportable Robotic Sys Inc II (MTRS Inc II)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "5.471"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.700"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.250"
                                        },
                                        "BudgetYearFour": {
                                            "val": "39.451"
                                        },
                                        "BudgetYearFive": {
                                            "val": "38.250"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "109.122"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The MTRS Inc II acquisition strategy will execute an abbreviated Engineering Manufacturing Development (EMD) phase followed by a Production Deployment phase to integrate available payloads into the MTRS Inc II materiel solution. This EMD\/Production Deployment award will be based on a selection from a full and open competition. The contract will be a Firm Fixed Price contract and award will execute a Preliminary Design Review (PDR), Critical Design Review (CDR), design integration, and pre-production build phase of First Article Test assets, Low Rate Initial Production (LRIP) and Full Rate Production (FRP). Pre-production assets will be used to evaluate performance to performance specifications derived from the MTRS Inc II Capability Production Document (CPD) requirement. Upon completion of this phase, the program will proceed to LRIP and Full Rate Production."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FB3"
                    },
                    "ProjectTitle": {
                        "val": "Robotics Architecture"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.003"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.003"
                        },
                        "BudgetYearTwo": {
                            "val": "2.044"
                        },
                        "BudgetYearThree": {
                            "val": "3.086"
                        },
                        "BudgetYearFour": {
                            "val": "4.128"
                        },
                        "BudgetYearFive": {
                            "val": "5.193"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.454"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY2018 funding for Robotics Architecture will transition from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB3 Robotics Architecture."
                        },
                        "ProjectMissionDescription": {
                            "val": "Robotic Architecture (RA) provides the engineering and development resources to manage the overarching architecture for robotic systems that are both modular and interoperable across the Joint Force in order to facilitate future modernization efforts. It will manage the interoperability standards, modular payload interface, common software and common architecture for universal controllers. RA includes the construction of program specific Interoperability Profiles (IOP) (i.e. Squad Multi-Equipment Transport (SMET), Leader\/Follower (LF), Route Clearance Interrogation System (RCIS) Type II, Common Robotics System (Vehicle) (CRS(V)), Common Robotics System (Individual) (CRS(I)) Inc II, Common Robotics System (Heavy) (CRS(H)), EOD Robotic Payload (ERP), Light Reconnaissance Robot (LRR), Robotic Wingman, etc.) and new standards addressing emerging requirements (i.e. Cyber Security, Information Assurance, new autonomous behaviors, new payloads, etc)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotics Architecture"
                                    },
                                    "Description": {
                                        "val": "Provide architecture tools and support for current Program of Record (PoR) to allow for interoperability within the Joint community for Robotics Autonomous Systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.003"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.003"
                                            },
                                            "Text": {
                                                "val": "FY 2018 funding for Robotics Architecture will complete and update Interoperability Profile (IOP) and tools to evaluate and assess Route Clearance Interrogation System (RCIS), Man-Transportable Robotic System (MTRS) Inc II, Common Robotic System (Individual) (CRS(I)), and initial tools for emerging PoR Leader Follower (LF) and Squad Multipurpose Equipment Transport (SMET) requirements. It will initiate the development of IOP V4 which will provide interfaces for near term emerging programs such as LF, CRS(H), EOD Robotic Payload (ERP), Robotic Wingman and RCIS Type II."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In FY2018 the Robotics Architecture line funds the Science & Technology (S&T) community and PM FP personnel to develop IOP tools and supporting infrastructure. It leverages intellectual capital and products which allows for Joint interoperability and helps meet Army Program of Record (PoR) cost and schedule while delivering high quality products for fielding.  The architecture and tools developed under this line are central to the Army’s acquisition philosophy of a modular open systems approach between the major subsystems of robotics and autonomous systems."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FB4"
                    },
                    "ProjectTitle": {
                        "val": "Common Robotic Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "31.252"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.252"
                        },
                        "BudgetYearTwo": {
                            "val": "29.824"
                        },
                        "BudgetYearThree": {
                            "val": "28.942"
                        },
                        "BudgetYearFour": {
                            "val": "12.229"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "102.247"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY2018 funding for Common Robotic Systems (CRS) will transition from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB4 Common Robotic Systems."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Common Robotic System - Individual (CRS(I)) will be a man-packable, small (>25 lbs.), highly mobile, unmanned robotic system with advanced sensors\/mission modules for dismounted Service members. The CRS(I) will be designed so the operator can quickly re-configure for other various missions by adding or removing modules and\/or payloads. The CRS(I) will also include the Army universal controller used by all unmanned ground and aerial vehicles within the battalion formation providing interoperability, logistics, and training efficiencies. The CRS(I) will provide interrogation, detection, confirmation, and neutralization capabilities employed to support a wide spectrum of mobility missions for current and future forces. This capability provides commanders the ability to persistently monitor the Operating Environment (OE) while protecting and sustaining the force. The CRS(I) complements the Joint Integrated War-fighting Force by providing standoff to the War Fighter during major combat, stability, and homeland security operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CRS(I) Engineering Manufacturing Design (EMD)"
                                    },
                                    "Description": {
                                        "val": "Up to two vendors will enter the Engineering & Manufacturing Design (EMD) Phase and support activities up to the Critical Design Review (CDR) to include providing robots to test during the Government run-off."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.252"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.252"
                                            },
                                            "Text": {
                                                "val": "Up to two vendors will participate in Preliminary Design Review (PDR), Critical Design Review (CDR), and provide CRS(I) systems to participate in a Government run-off that includes a series of tests the robots must perform.  Information provided in the Government run-off will assist in a down-select, where one vendor is chosen to continue in the EMD phase.  Funding supports both vendors, equipment for the Government run-off, Government run-off tests, and program management."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "G99595"
                                    },
                                    "Title": {
                                        "val": "Common Robotics System (Individual)  (CRS(I))"
                                    },
                                    "Funding": {
                                        "BudgetYearTwo": {
                                            "val": "3.200"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.400"
                                        },
                                        "BudgetYearFour": {
                                            "val": "28.958"
                                        },
                                        "BudgetYearFive": {
                                            "val": "45.291"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "85.849"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The CRS(I) acquisition strategy includes awarding a contract for up to two vendors to enter at MS B and conduct Preliminary Design Review (PDR), Critical Design Review (CDR) and a \"Government run-off\".  Upon completion of the Government run-off, a down-select will occur and one vendor will continue in the Engineering & Manufacturing Development (EMD) Phase to integrate available payloads and test the universal control unit. Following a successful EMD, the CRS(I) will achieve a MS C decision with Low Rate Initial Production approval to support the Product Verification Testing, Initial Operational Test & Evaluation (IOT&E) and Logistics Development.  Upon completion of these events, the CRS(I) will transition to Full Rate Production, Full Material Release, and fielding of the systems."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Combat Support - Combat Service Support"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.780"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.780"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.780"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Risk Mitigation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.378"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.378"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.378"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Subject Matter Expert (SME) Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Manufacturing & Design"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "tbd"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "tbd"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "21.122"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "21.122"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.122"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix & Common Support Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.862"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.862"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.862"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ATEC Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test Engineering Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.110"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.110"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.110"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-96.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "CRS(I) Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CRS(I) Preliminary Design Review (PDR) (x2)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CRS(I) Critical Design Review (CDR) (x2)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CRS(I) Post-CDR Design\/Competitive Downselection (to one vendor)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CRS(I) Engineering and Manufacturing Development (EMD) 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CRS(I) Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CRS(I) Production Qualification Testing (PQT)\/Limited User Testing (LUT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CRS(I) Full Rate Production Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CRS(I) LOG Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FB6"
                    },
                    "ProjectTitle": {
                        "val": "Squad Multipurpose Equipment Transport (SMET)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "16.802"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.802"
                        },
                        "BudgetYearTwo": {
                            "val": "19.345"
                        },
                        "BudgetYearThree": {
                            "val": "24.357"
                        },
                        "BudgetYearFour": {
                            "val": "24.107"
                        },
                        "BudgetYearFive": {
                            "val": "14.425"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "99.036"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Squad Multipurpose Equipment Transport (SMET) program funded on PE 0605053A Ground Robotics, Project FB6 is a new start in FY2018."
                        },
                        "ProjectMissionDescription": {
                            "val": "Squad Multipurpose Equipment Transport (SMET) will help to reduce the load on the Soldier by transporting mission specific equipment, resupply equipment, and supplies required for extended operations. The SMET will be capable of carrying the equipment currently required to support Infantry and Engineer Platoons in the Infantry Brigade Combat Team (IBCT) for a 72 hour mission without resupply. The SMET will reduce Soldier load, increase squad mobility during combat operations and dismounted maneuvers.  SMET will have open architectures, operator control units and support casualty evacuation, power generation\/offload and chemical\/biological payloads."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SMET"
                                    },
                                    "Description": {
                                        "val": "Squad Multipurpose Equipment Transport (SMET)"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.802"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.802"
                                            },
                                            "Text": {
                                                "val": "Funding will be used to acquire systems from multiple vendors to conduct a User Operational Excursion, Aberdeen Test Center support, and associated logistics support. Program management costs to include salaries, travel and miscellaneous expenses associated with the SMET program will also be funded."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "R12154"
                                    },
                                    "Title": {
                                        "val": "Squad Multipurpose Equipment Transport (SMET)"
                                    },
                                    "Funding": {
                                        "BudgetYearThree": {
                                            "val": "8.876"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.025"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.788"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Squad Multipurpose Equipment Transport (SMET) architectures and analysis effort was completed as part of the Robotics Development effort under the Tactical Unmanned Ground Vehicle (654641DV7) funding line in FY2017. This supported a rapid start to performance specification development and other Request For Proposal (RFP) documents in support of a Directed Requirement. The Directed Requirement will begin with User Assessment and down select of 4 vendors in FY17 as part of the Robotic Enhanced Program under the Tactical Unmanned Ground Vehicle (654641DV7) funding line. In FY18 the 4 vendors will participate in an User Operational Excursion. This Excursion will guide the development of the Capability Production Document (CPD) in 3QFY19 leading to a program of record with anticipated Milestone C in 4QFY19 and First Unit Equipped (FUE) 1QFY21.\n\nIt is the Army's intent to maximize the use of an Open Systems Architecture (OSA), as well as the approved Unmanned Ground Vehicle (UGV) interoperability profiles for SMET. The PdM plans to procure sufficient technical data during the SMET contract to allow for future competition of production systems and spare parts, or seek cost savings by incorporating the developed SMET technology into other programs. Throughout the life of the program, the Army will continue to survey the marketplace to identify opportunities for technology insertion and competition."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM FP"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Purchase 80 systems and support for year long Excursion with Soldiers for Concept of Operations (CONOPS) and Tactics, Techniques & Procedures (TTP) Development.  Capability developer intends to use Excursion data to inform the CPD with intention to enter at Milestone C in FY19."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Directed Requirement Excursion"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Year Long Excursion"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Materiel Battle Lab \/ TARDEC Excursion Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Materiel Battle Lab, TARDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Testing includes safety release at a minimum for year long Excursion, followed by additional Reliability, Availability, Maintainability (RAM) testing and technology inserts as a result of requirement shaping from Excursion activities."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ATEC Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Test Engineering Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.802"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.802"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.802"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-97.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "SMET"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET Milestone Decision Document (MDD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET Excursion Asset Acquisition"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET Analysis of Alternatives (AoA)\/MS C Preparation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET ATEC Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET 1 Year Excursion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET RFP and Performance Spec Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET Milestone C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET Low Rate Initial Production (LRIP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET Full Rate Production (FRP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SMET First Unit Equipt (FUE)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FB7"
                    },
                    "ProjectTitle": {
                        "val": "Robotics Enhanced Program (REP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.989"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.989"
                        },
                        "BudgetYearTwo": {
                            "val": "9.841"
                        },
                        "BudgetYearThree": {
                            "val": "10.138"
                        },
                        "BudgetYearFour": {
                            "val": "10.376"
                        },
                        "BudgetYearFive": {
                            "val": "10.557"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "48.901"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY2018 funding for Robotic Enhanced Program (REP) will transition from PE 0604641A Tactical Unmanned Ground Vehicle, Project DV7 Small Unmanned Ground Vehicle to PE 0605053A Ground Robotics, Project FB7 Robotic Enhanced Program."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Robotics Enhanced Program (REP) uses a \"buy\/lease, try and inform\" methodology to evaluate Commercial Off the Shelf (COTS), Government Off the Shelf (GOTS) and Non-Developmental Item (NDI) robotics products that have the potential to enhance Soldier combat effectiveness. Actual operational user feedback and evaluation results obtained will inform emerging capabilities and requirements documents in support of a Cost-Benefit Analysis to support future Army decision making."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotic Enhanced Program (REP)"
                                    },
                                    "Description": {
                                        "val": "Annual funding for the REP is broken up into two iterations occurring each fiscal year. RDTE funds are utilized in an experimental effort to inform Center of Excellence (CoE) determined requirements as outlined in the Robotic and Autonomous Systems (RAS) Strategy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.989"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.989"
                                            },
                                            "Text": {
                                                "val": "FY 2018 funding for the REP will be utilized to fund Iteration 18.1 and 18.2 which will fund salaries, travel, ATEC support, RDECOM support, CoE support, Battle Lab support, and associated experiments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Robotic Enhanced Program (REP) is not a Program of Record."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FB8"
                    },
                    "ProjectTitle": {
                        "val": "Soldier Borne Sensor (SBS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.289"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.289"
                        },
                        "BudgetYearTwo": {
                            "val": "3.506"
                        },
                        "BudgetYearThree": {
                            "val": "1.530"
                        },
                        "BudgetYearFour": {
                            "val": "1.227"
                        },
                        "BudgetYearFive": {
                            "val": "1.266"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.818"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Soldier Borne Sensor (SBS) provides a near term solution to three Army Warfighting Challenges at the Infantry Squad level: develop situational understanding, conduct air-ground reconnaissance, and conduct joint combined arms maneuver.  The SBS provides the Squad organic “quick look” capability when higher echelon assets are unavailable and time is of the essence.  The system is simple to use, expendable, and deployable in a matter of seconds to support the squad leader’s decision-making process.  The system allows Soldiers to obtain local situational awareness and understanding of their immediate surroundings while remaining in covered or concealed positions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Borne Sensor (SBS)"
                                    },
                                    "Description": {
                                        "val": "The SBS provides the small unit a \"quick look\" capability providing Situational Awareness (SA) of routes, building, tunnels, obstacles blocking line of sight, and similar concealed threat locations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.289"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.289"
                                            },
                                            "Text": {
                                                "val": "Conduct Production Qualification Testing (PQT), Initial Operational Test and Evaluation (IOT&E) of SBS Increment 1, and initiate integration of Increment 2 technology insertions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "W63798"
                                    },
                                    "Title": {
                                        "val": "Soldier Borne Sensor"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "3.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.824"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.531"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.454"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.823"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Soldier Enhancement Program (SEP) was leveraged to initiate the Soldier Borne Sensor (SBS) program allowing for a Rapid Fielding of capabilities to the field.  The SBS intends to leverage commercially available technologies every three years as tech insertions to allow the warfighter to have the most current technology on the market."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FB9"
                    },
                    "ProjectTitle": {
                        "val": "MTRS Standardization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.645"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.645"
                        },
                        "BudgetYearTwo": {
                            "val": "15.867"
                        },
                        "BudgetYearThree": {
                            "val": "20.168"
                        },
                        "BudgetYearFour": {
                            "val": "16.822"
                        },
                        "BudgetYearFive": {
                            "val": "3.021"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "59.523"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The MTRS Standardization project is considered a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The MTRS Standardization project provides the platforms to support integration and testing of payloads and technology for non-standard unmanned ground robotics systems used by Army Engineers, Explosive Ordnance Disposal (EOD), Chemical, Biological, Radiological, and Nuclear (CBRN) and Special Operational Forces (SOF) units.  Current system characteristics include the following: a remote controlled articulated arm with a gripper, operating range up to 800m, multiple illuminated cameras, a pan\/tilt surveillance camera, two-way radio, and a ruggedized operator control unit.  The platforms provided will support development and testing of the following capabilities:  High Dexterous Manipulation System (HDMS), Multi-Spectral Image Fusion System (MIFS), and Precision Aimed Multishot Disruptor (PAMD).  The use of robotics allows the first approach, to potentially explosive hazards, to be made by a robot rather than a Soldier.\n\nThis project will also supports the development of a library of robot parts that can be 3D printed via additive manufacturing.  The funding will also test the operational compatibility of the 3D printed parts with robot platforms.\n\nThis project is a new start."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platform to Support Payload Developement & Test"
                                    },
                                    "Description": {
                                        "val": "Testing of multi-shot disruptor and fire set for EOD robotics systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Provide platforms to be used in the development and testing of the following payloads: High Dexterous Manipulation System (HDMS), Multi-Spectral Image Fusion System (MIFS), and Precision Aimed Multishot Disruptor (PAMD)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Other Transactional Authority"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.145"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.145"
                                            },
                                            "Text": {
                                                "val": "Funding will support the establishment of a library of robot parts which can be 3D printed via additive manufacturing.  Funds will also test the operational capability of 3D printed parts with robot platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Procure mobility platforms from existing IDIQ contract.  Utilize Other Transactional Authority contract for additive manufacturing effort."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FC9"
                    },
                    "ProjectTitle": {
                        "val": "Battery Modernization & Interface Standardization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "There is no FY 18 PB Request."
                        },
                        "ProjectMissionDescription": {
                            "val": "There is no FY 2018 PB Request."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FG8"
                    },
                    "ProjectTitle": {
                        "val": "Common Robotic Controller"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.000"
                        },
                        "BudgetYearThree": {
                            "val": "1.200"
                        },
                        "BudgetYearFour": {
                            "val": "1.200"
                        },
                        "BudgetYearFive": {
                            "val": "1.200"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.600"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project does not have any FY 2018 PB funds programmed."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}