{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-13",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603288D8Z"
        },
        "ProgramElementTitle": {
            "val": "Science and Technology (S&T) Analytic Assessments"
        },
        "R1LineNumber": {
            "val": "37"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "13.299"
            },
            "PriorYear": {
                "val": "14.145"
            },
            "CurrentYear": {
                "val": "12.048"
            },
            "BudgetYearOne": {
                "val": "13.154"
            },
            "BudgetYearOneBase": {
                "val": "13.154"
            },
            "BudgetYearTwo": {
                "val": "16.676"
            },
            "BudgetYearThree": {
                "val": "16.604"
            },
            "BudgetYearFour": {
                "val": "16.873"
            },
            "BudgetYearFive": {
                "val": "17.228"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) directly supports the development of innovative capabilities to meet the emerging threats from the diverse range of state and non-state actors confronting the Unites States.  These capabilities include: space and terrestrial-based indications and warnings systems, integrated and resilient Intelligence, Surveillance, Reconnaissance (ISR) platforms, strategic lift, long-range precision strike weapons, missile defense technologies, undersea systems, remotely operated vehicles and technologies, special operations forces, the Cyber Mission Force, ground systems, and others outlined in the 2015 National Military Strategy.  Analytic assessments are informed comprehensive Kill Chain Analysis (KCA) across all domains and the time continuum from 2015-2035 to identify prioritized operational issues and associated actionable technology focus areas and help to support detailed analyses and assessments to inform and influence programmatic decisions regarding technology development and procurement plans.  The science and technology (S&T) analytic assessments performed under this budget item include the following activities:\n\n-  Technical threat assessments building on intelligence community products for identifying gaps in U.S. capability for critical threats.\n-  Independent assessment of critical capability and technology development.\n-  Architecture development and evaluation to develop new U.S. capability.\n-  Development of strategic analytic tools enabling the analysis and evaluation of critical capability and technology development.\n-  Quantitative analysis of potential new technology and concepts to address capability gaps and counter emerging threat technologies. \n\nDue to the complexity of these challenges, the process for developing and executing these analytic assessments span fiscal years and may have multiple phases.  The emerging nature of the problem sets makes identification of studies beyond the budget year unlikely.  Typically, the ratios of resources applied to quick reaction studies, strategic analysis, and development of analytic tools will be roughly 30\/50\/20 percent.  The first step in the process is to quickly assess gaps and options to fill those gaps; second, produce detailed analysis quantifying key attributes of the challenge, assess options, and provide an operational value assessment; and finally, develop analytic tools to help understanding of complex and longer term challenges. Implementation of this process could span multiple years causing the portfolio to cascade from year to year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.645"
                },
                "CurrentYear": {
                    "val": "12.048"
                },
                "BudgetYearOne": {
                    "val": "13.166"
                },
                "BudgetYearOneBase": {
                    "val": "13.166"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.145"
                },
                "CurrentYear": {
                    "val": "12.048"
                },
                "BudgetYearOne": {
                    "val": "13.154"
                },
                "BudgetYearOneBase": {
                    "val": "13.154"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.500"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.012"
                },
                "BudgetYearOneBase": {
                    "val": "-0.012"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.500"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.012"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.012"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P328"
                    },
                    "ProjectTitle": {
                        "val": "Science and Technology Analytic Assessments"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.299"
                        },
                        "PriorYear": {
                            "val": "14.145"
                        },
                        "CurrentYear": {
                            "val": "12.048"
                        },
                        "BudgetYearOne": {
                            "val": "13.154"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.154"
                        },
                        "BudgetYearTwo": {
                            "val": "16.676"
                        },
                        "BudgetYearThree": {
                            "val": "16.604"
                        },
                        "BudgetYearFour": {
                            "val": "16.873"
                        },
                        "BudgetYearFive": {
                            "val": "17.228"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) directly supports the development of innovative capabilities to meet the emerging threats in the diverse range of state and non-state actor’s threats confronting the Unites States.  These capabilities include: space and terrestrial-based indications and warnings systems, integrated and resilient Intelligence, Surveillance, Reconnaissance (ISR) platforms, strategic lift, long-range precision strike weapons, missile defense technologies, undersea systems, remotely operated vehicles and technologies, special operations forces, the Cyber Mission Force, ground systems, and others outlined in the 2015 National Military Strategy.  The science and technology (S&T) analytic assessments performed under this budget item include the following activities:\n\n-  Technical threat assessments building on intelligence community products for identifying gaps in U.S. capability for critical threats.\n-  Independent assessment of critical capability and technology development.\n-  Architecture development and evaluation to develop new U.S. capability.\n-  Development of strategic analytic tools enabling the analysis and evaluation of critical capability and technology development.\n-  Qualitative analysis of potential new technology and concepts to address capability gaps and counter emerging threat technologies. \n\nDue to the complexity of these challenges, the process for developing and executing these analytic assessments span fiscal years and may have multiple phases.  The emerging nature of the problem sets makes identification of studies beyond the budget year unlikely.  Typically, the ratios of quick reaction studies, strategic analysis, and development of analytic tools will be roughly 30\/50\/20 percent.  The first step in the process is to quickly assess gaps and options to fill those gaps; second, produce detailed analysis quantifying key attributes of the challenge, assess options, and provide an operational value assessment; and finally, develop analytic tools to help understanding of complex and longer term challenges. Implementation of this process could span multiple years causing the portfolio to cascade from year to year with each effort moving through the phases of study, experiment, and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Science and Technology Analytic Assessments"
                                    },
                                    "Description": {
                                        "val": "Science and Technology Analytic Assessments supports the development of innovative capabilities to meet the emerging threats in the diverse range of state and non-state actor’s threats confronting the Unites States.  These capabilities include: space and terrestrial-based indications and warnings systems, integrated and resilient Intelligence, Surveillance, Reconnaissance (ISR) platforms, strategic lift, long-range precision strike weapons, missile defense technologies, undersea systems, remotely operated vehicles and technologies, special operations forces, the Cyber Mission Force, ground systems, and others outlined in the 2015 National Military Strategy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.145"
                                            },
                                            "Text": {
                                                "val": "In an effort to grow a balanced program, the planned ratio of quick reaction studies, strategic analysis, and analytic tool development will be 30\/50\/20 percent.  The activities in FY 2016 were more heavily weighted towards studies which may later mature into development of analytic tools.  In general, the following activities were executed:\n\nQuick Reaction Studies: \n-  Quick Reaction Analytic efforts responded to critical questions related to potential vulnerabilities in current and future US systems to identify opportunities or challenges related to developing adversary capabilities.\n-  Engineered feasibility assessment of developing missiles threats.\n-  Engineered feasibility assessment of options for electronic warfare capability applied to missile defense.\n-  Assessed options to counter adversary Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR).\n-  Conducted a quick-look assessment of future US Army aviation options to support ground combat.\n-  Conducted a quick-look effort to build a desktop compendium of US technology efforts focused on countering unmanned undersea vehicles.\n-  Assessed future plans and options for Active Protection Systems for ground combat armored vehicles.\n-  Conducted quick-look independent assessment of Long Range Precision Fires vulnerability in support of Milestone A decision.\n-  Assessed land combat area denial options excluding mines and cluster munitions.\n-  Assessed of future missile warning systems capability against emerging rocket technology.\n\nStrategic Analysis:\n-  Quantified distributed electronic warfare capabilities achievable in an Integrated Air Defense Systems (IADS) region.\n-  Identified future threat detection and identification capabilities for future electronic support systems.\n-  Generated techniques for proactive offensive electronic warfare.\n-  Conducted system and technology assessments for surface and sub-surface warfare.\n-  Assessed options for electronic attack against missiles.\n-  Assessed technologies to counter adversary electronic warfare.\n-  Completed the assessment of Multi-Axis\/Multi-Threat Raids against U.S. Naval and land based assets.\n-  Assessed counters to Unmanned Aerial Vehicle (UAV) threat capability.\n-  Assessed options for protection of airborne high value air assets (HVAAs).\n-  Assessed options for countering adversary Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR).\n-  Assessed options to counter adversary SIGINT.\n-  Explored feasibility and potential of next generation electronic warfare technologies.\n-  Assessed options and identify similarities in countering unmanned systems in all domains.\n-  Assessed options to counter strategic unmanned air vehicle threats.\n\nAnalytic Tools:\n-  Continued development of a reconfigurable airborne multi-band radar test bed designed to emulate the seekers of emerging threat missile systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.048"
                                            },
                                            "Text": {
                                                "val": "In order to accomplish a balanced program, the target ratios of quick reaction studies, strategic analysis, and analytic tool development is planned to be 30\/50\/20 percent.  Accordingly, the following activities are planned for FY 2017:\n\nQuick Reaction Studies: \n-  Quick Reaction Analytic efforts responding to critical questions related to potential vulnerabilities in current and future US systems to identify opportunities or challenges related to developing foreign capabilities.  These short studies typically focus on the following capability areas: foreign, integrated air and missile defense capabilities; options for US electronic warfare and capability to counter adversaries; resiliency in US Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems and options to counter adversaries C4ISR capabilities; ground combat offensive and defensive capabilities, air dominance and missile defense, and undersea engagements.\n\t\nStrategic Analysis:\n-  Evaluation of options to counter foreign missile capabilities.\n-  Analysis of options for area denial capability.\n-  Explore feasibility and potential of next generation electronic warfare technologies.\n-  Quantify distributed electronic warfare capabilities achievable in an Integrated Air Defense Systems (IADS) region.\n-  Identify future threat detection and identification capabilities for future electronic support systems.\n-  Generation of techniques for proactive offensive electronic warfare.\n-  Experimental data collection applied to a wider range of ISR capabilities.\n-  System and technology assessments for surface and sub-surface warfare.\n-  Evaluate options for a U.S. land based defense against a cruise missile raid.\n-  Evaluate architecture options for countering Unmanned Aerial Vehicles (UAVs).\n-  Evaluate efficacy of passive systems and counters to passive systems.\n\t\t\t\t\t\nAnalytic Tools:\n-  Development of analytic tools to inform and evaluate new technologies’ potential to counter emerging threats and exploit adversary vulnerabilities from air, land, sea, and space domains. \n-  Continue testing and data collection of the reconfigurable airborne multi-band radar test bed.\n-  Development of analytic tools to assess and underpin capabilities used in war gaming.\n-  Development of analytic tools to provide inform and provide decision support to resourcing recommendations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.154"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.154"
                                            },
                                            "Text": {
                                                "val": "To fully inform the analytic assessments, maintenance and expansion of the Kill Chain Analysis analytic foundation will be included in this effort.  This will include improvements in the underlying data fidelity and breadth, and in all aspects of display, analysis, assessment, integration, entity relationships and interactions.  Specific tasks that will be executed within the Kill Chain Analysis area include:\n-  Continued research of new, emerging and modified Blue and Red platforms and components and integration into the Kill Chain Analysis data environment.\n-  Conduct a data refresh at the platform and component level of detail to ensure the KCA database is populated with the latest intelligence and technical data.\n-  Updated Kill Chain and Target Set assessments in support of the overall Operational Analysis within KCA.\n-  Continued development of threat agnostic Operational and Technical Issues and integration into the KCA environment.\n-  Expansion of the scope of Operational and Technical Issues into new Warfare Areas.\n-  Integration of Science and Technology elements (initiatives, potential solutions, technologies etc) into the KCA environment (Operational and Technical Issues, Kill Chains, Target Sets etc.).\n-  Continued development, enhancements, and upgrades to the entire Kill Chain Analysis Toolset including the Kill Chain Analysis Results Display System.\n\nIn order to accomplish a balanced program of assessments, the target ratios of quick reaction studies, strategic and operational analysis, and analytic tool development is planned to be 20\/60\/20 percent.  Accordingly, the following activities are planned for FY 2017:\n\nQuick Reaction Studies: \n-  Quick Reaction Analytic efforts responding to critical questions related to potential vulnerabilities in current and future US systems to identify opportunities or challenges related to developing foreign capabilities.  These short studies typically focus on the following capability areas: foreign, integrated air and missile defense capabilities; options for US electronic warfare and capability to counter adversaries; resiliency in US Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems and options to counter adversaries C4ISR capabilities; ground combat offensive and defensive capabilities, air dominance and missile defense, and undersea engagements.\n\t\nStrategic and Operational Analysis:\n-  Evaluation of options to counter foreign missile capabilities.\n-  Analysis of options for area denial capability.\n-  Explore feasibility and potential of next generation electronic warfare technologies.\n-  Quantify distributed electronic warfare capabilities achievable in an Integrated Air Defense Systems (IADS) region.\n-  Identify future threat detection and identification capabilities for future electronic support systems.\n\n-  System and technology assessments for surface and sub-surface warfare.\n-  Evaluate options for land based defense against a cruise missile raid.\n-  Evaluate efficacy of passive systems and counters to passive systems.\n-  Assess emerging operational scenarios against future red and blue capability timelines.\n-  Update existing Kill chain analyses based on emerging red and blue capability assessments.\n-  Conduct Kill Chain analysis on new threat scenarios and projected threat capabilities.\n\n\t\t\t\t\t\nAnalytic Tools:\n-  Development of analytic tools to inform and evaluate new technologies’ potential to counter emerging threats and exploit adversary vulnerabilities from air, land, sea, and space domains.\n-  Development of analytic tools to provide inform and provide decision support to resourcing recommendations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "-  Critical gaps in U. S. capability are identified.\n-  Gaps in U. S. technology development are identified.\n-  New architectures and evaluation criteria for developing U. S. capability are identified.\n-  Analytic tools to evaluate new technologies’ potential to mitigate and counter emerging threats and exploit adversary vulnerabilities are developed."
                        }
                    }
                }
            ]
        }
    }
}