{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-62",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605626A"
        },
        "ProgramElementTitle": {
            "val": "Aerial Common Sensor"
        },
        "R1LineNumber": {
            "val": "142"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.002"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "0.002"
            }
        },
        "ProgramElementNote": {
            "val": "The Enhanced Medium Altitude Reconnaissance and Surveillance System (EMARSS) Research, Development, Test, and Evaluation (RDTE) funding line contains funding for Airborne Reconnaissance Low - Enhanced (ARL-E) in Fiscal Year (FY) 2015 ($10.174 million). The remaining funds will go towards Interim Contractor Logistics Support (ICLS) and test support for the EMARSS Variants: EMARSS-G (Constant Hawk & Tactical Operations (TACOP) Light Imaging Detection and Ranging (LiDAR)); EMARSS-V (Vehicle and Dismounted Exploitation Radar (VaDER)); EMARSS-M (Liberty Project Aircraft (LPA)); and EMARSS-S Engineering and Manufacturing Development (EMD) systems.\n\nFor FY16 and beyond, the EMARSS RDTE funding line continues on 375206EH3.\nFor FY16 and beyond, the ARL-E RDTE funding line continues on 375206EH5."
        },
        "ProgramElementMissionDescription": {
            "val": "The EMARSS is the Army's next generation C-12 based, direct support, manned airborne intelligence collection, processing, and targeting support system.  EMARSS provides a persistent capability to detect, locate, classify\/identify, and track surface targets with a high degree of timeliness and accuracy.  EMARSS aircraft will be assigned to the U.S. Army Intelligence and Security Command's (INSCOM) Aerial Exploitation Battalions (AEB). EMARSS is an improvement over the existing Medium Altitude Reconnaissance and Surveillance System Quick Reaction Capability (MARSS QRC) in that it hosts an on board Distributed Common Ground System - Army (DCGS-A) capability, improved satellite communications, improved aircraft performance, and life cycle logistics sustainment capability. \n\nEMARSS will consist of a commercial derivative aircraft equipped with an Electro-optical\/Infrared (EO\/IR) sensor with Full Motion Video (FMV), a Communications Intelligence (COMINT) collection system, an Aerial Precision Geolocation (APG) system, tactical line-of-site (LOS) and beyond line-of-site (BLOS) communications suite, two DCGS-A enabled operator workstations and a self-protection suite.  EMARSS is built to allow future capabilities to be integrated on platform with the addition of a third carry-on workstation.  \n\nEMARSS will operate in direct support of tactical missions.  EMARSS, integrating elements of the DCGS-A, will provide efficient response to Combat Forces with Intelligence, Surveillance and Reconnaissance (ISR) tasking.   \n\nThe EMARSS funding line contains funding for the ARL-E program.  ARL-E supports the Aerial ISR 2020 Strategy which recommended replacement of the current Airborne Reconnaissance Low Multifunction (ARL-M) and migrates the current ARL sensors plus new niche sensors to meet the ARL-E Capabilities Production Document (CPD) requirements.  ARL-E procures the hardware, software, and infrastructure to rapidly install sensors which support a rapid plug and play, quick connect\/disconnect, mounting system to allow the installation of various combinations of sensor-types in support of a wide-range of theater operations. The sensor suite will consist of a COMINT subsystem capable of supporting theater net centric geo-location efforts, High Definition Full Motion Video (FMV); Improved Synthetic Aperture Radar \/ Moving Target Indicator (SAR\/MTI) radar capability and updated mission workstations, as well as radio and data\/communications architecture. ARL-E will leverage existing sensors as well as integrating and installing niche sensors to augment current capabilities. Niche capabilities include Wide Area Aerial Surveillance (WAAS), LIDAR, and Hyper Spectral Imaging (HSI) sensors."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.002"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.002"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AC5"
                    },
                    "ProjectTitle": {
                        "val": "Enhanced Medium Alt Recon Surv Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.002"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.002"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Enhanced Medium Altitude Reconnaissance and Surveillance System (EMARSS) Research, Development, Test, and Evaluation (RDTE) funding line contains funding for Airborne Reconnaissance Low - Enhanced (ARL-E) in Fiscal Year (FY) 2015 ($10.174 million). The remaining funds will go towards Interim Contractor Logistics Support (ICLS) and test support for the EMARSS Variants: EMARSS-G (Constant Hawk & Tactical Operations (TACOP) Light Imaging Detection and Ranging (LiDAR)); EMARSS-V (Vehicle and Dismounted Exploitation Radar (VaDER)); EMARSS-M (Liberty Project Aircraft (LPA)); and EMARSS-S Engineering and Manufacturing Development (EMD) systems.\n\nFor FY16 and beyond, the EMARSS RDTE funding line continues on 375206EH3.\nFor FY16 and beyond, the ARL-E RDTE funding line continues on 375206EH5."
                        },
                        "ProjectMissionDescription": {
                            "val": "The EMARSS is the Army's next generation C-12 based, direct support, manned airborne intelligence collection, processing, and targeting support system.  EMARSS provides a persistent capability to detect, locate, classify\/identify, and track surface targets with a high degree of timeliness and accuracy.  EMARSS aircraft will be assigned to the U.S. Army Intelligence and Security Command's (INSCOM) Aerial Exploitation Battalions (AEB). EMARSS is an improvement over the existing Medium Altitude Reconnaissance and Surveillance System Quick Reaction Capability (MARSS QRC) in that it hosts an on board Distributed Common Ground System - Army (DCGS-A) capability, improved satellite communications, improved aircraft performance, and life cycle logistics sustainment capability.   \n\nEMARSS Payloads will consist of Mission Equipment Packages (MEP) and Processing Exploitation & Dissemination commercial derivative equipment such as, an Electro-optical\/Infrared (EO\/IR) sensor with Full Motion Video (FMV), a Communications Intelligence (COMINT) collection system, an Aerial Precision Geolocation (APG) system, tactical line-of-site (LOS) and beyond line-of-site (BLOS) communications suite, two DCGS-A enabled operator workstations and a self-protection suite.  Payloads integrated on platforms will include: niche capabilities such as Wide Area Aerial Surveillance (WAAS), LiDAR and improved Synthetic Aperture Radar \/ Moving Target Indicator (SAR\/MTI) radar capability.   \n\nEMARSS will operate in direct support of tactical missions.  EMARSS, integrating elements of the DCGS-A, will provide provide a near real-time response to Combat Forces with Intelligence, Surveillance and Reconnaissance (ISR) tasking.  \n\nThe FY 2015 EMARSS funding line contains $10.174 million for the ARL-E program.  ARL-E supports the Aerial ISR 2020 Strategy which recommended replacement of the current Airborne Reconnaissance Low Multifunction (ARL-M) and migrates the current ARL sensors plus new niche sensors to meet the ARL-E Capabilities Production Document (CPD) requirements.  ARL-E procures the hardware, software, and infrastructure to rapidly install sensors which support a rapid plug and play, quick connect\/disconnect, mounting system to allow the installation of various combinations of sensor-types in support of a wide-range of theater operations. The sensor suite will consist of a COMINT subsystem capable of supporting theater net centric geo-location efforts, High Definition FMV; Improved Synthetic Aperture Radar \/ Moving Target Indicator (SAR\/MTI) radar capability and updated mission workstations, as well as radio and data\/communications architecture. ARL-E will leverage existing sensors as well as integrating and installing niche sensors to augment current capabilities. Niche capabilities include WAAS, LiDAR, and Hyper Spectral Imaging (HSI) sensors.\n \nFY 2016 RDTE funding in the amount of $0.002 million provides Interim Contractor Logistical Support (ICLS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EMARSS - Product Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.002"
                                            },
                                            "Text": {
                                                "val": "Partially funds an ICLS capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Aerial Common Sensor (ACS)"
                                    },
                                    "Title": {
                                        "val": "EMARSS - Aircraft Procurement (A02005)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "99.500"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "99.500"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "EMARSS MEP\/PED"
                                    },
                                    "Title": {
                                        "val": "EMARSS Payloads (AZ2054)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.570"
                                        },
                                        "CurrentYear": {
                                            "val": "13.316"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.305"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.305"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.294"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.452"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "62.937"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "ARL Mod"
                                    },
                                    "Title": {
                                        "val": "ARL Mods (AZ2050)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "68.540"
                                        },
                                        "CurrentYear": {
                                            "val": "52.400"
                                        },
                                        "BudgetYearOne": {
                                            "val": "53.778"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "53.778"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.668"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.679"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "185.065"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Aerial Common Sensor (ACS) - A02005 - FY 2015 Base procurement dollars in the amount of $165.890 million supports the modification and conversion of the balance of QRC systems redeploying out of Afghanistan to meet the EMARSS CPD.\n\nFY 2014 A02005 Oversea Contingency Operations (OCO) in the amount of $28 million procured one EMARSS-V.\n\nFor FY 2016 and beyond, the EMARSS Aviation Procurement - Army (APA) funding line continues from A02005 and splits between Project Manager Sensors - Aerial Intelligence (PM SAI) AZ2054 EMARSS Payloads and Project Manager Fixed Wing (PM FW) A02112 EMARSS Special Electronic Mission Aircraft (SEMA).  Also in FY 2016 the EMARSS Payloads AZ2054 line is established\/separated from ARL Mod AZ2050. Separate funding lines support the Army Acquisition Executive's directive, codified in the October 28, 2011 memorandum, to assign overall acquisition lead for manned airborne intelligence systems to Program Executive Officer for Aviation PEO-AVN); and overall sensor,processing, exploitation, and dissemination responsibilities to Program Executive Officer or Intelligence, Electronic Warfare, and Sensors (PEO-IEWS)."
                        },
                        "AcquisitionStrategy": {
                            "val": "EMARSS is a Program of Record based on an Army G-3\/5\/7 Directed Requirement (DR) signed 11 December 2009.  The program entered the acquisition process in the EMD phase with a 1QFY11 contract award that was competitively awarded to a single contractor.  Program completed System Design Review in 1QFY12 and began modification and integration of the aircraft in 2QFY12.  Program currently has an Army validated CPD and a successful Milestone C.\n\nARL-E portion, in the amount of $10.174 million, funds the engineering, manufacturing and development of a Long Range radar prototype to replace the current ARL Phoenix Eye to meet requirement for increased performance for ARL-E."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}