{
    "id": "2018-Army-PB-2040-JBOOK-4d642436f65ddc83c084fdb1d917f4809eff5a3f2d9cca01c78cf59a8dd3a26e-19",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602783A"
        },
        "ProgramElementTitle": {
            "val": "Computer and Software Technology"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "12.266"
            },
            "CurrentYear": {
                "val": "13.811"
            },
            "BudgetYearOne": {
                "val": "14.041"
            },
            "BudgetYearOneBase": {
                "val": "14.041"
            },
            "BudgetYearTwo": {
                "val": "10.074"
            },
            "BudgetYearThree": {
                "val": "10.276"
            },
            "BudgetYearFour": {
                "val": "10.482"
            },
            "BudgetYearFive": {
                "val": "10.692"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) develops and characterizes information and communications processing software that automates the delivery of information used in planning, rehearsal, and execution by ground commanders. Efforts develop communication\/network architectures, software, and the information fusion software necessary to simplify the understanding and interactions from humans to humans, humans to computers, and computers to humans.  Research enables enhanced understanding of many information sources and accelerates the decision cycle time for commanders and leaders operating in the mobile, dispersed, highly networked environment envisioned for the future force.\n\nWork in this PE is fully coordinated with PE 0603008A (Command, Control, Communications Advanced Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), PE 0603008A (Command, Control, Communications Advanced Technology), and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThis PE supports Army Science and Technology efforts in the Command, Control, Communications, and Intelligence portfolio.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.656"
                },
                "CurrentYear": {
                    "val": "13.811"
                },
                "BudgetYearOne": {
                    "val": "14.007"
                },
                "BudgetYearOneBase": {
                    "val": "14.007"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.266"
                },
                "CurrentYear": {
                    "val": "13.811"
                },
                "BudgetYearOne": {
                    "val": "14.041"
                },
                "BudgetYearOneBase": {
                    "val": "14.041"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.390"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.034"
                },
                "BudgetYearOneBase": {
                    "val": "0.034"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.390"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.002"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.036"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.036"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Y10"
                    },
                    "ProjectTitle": {
                        "val": "Computer\/Info Sci Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.266"
                        },
                        "CurrentYear": {
                            "val": "13.811"
                        },
                        "BudgetYearOne": {
                            "val": "14.041"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.041"
                        },
                        "BudgetYearTwo": {
                            "val": "10.074"
                        },
                        "BudgetYearThree": {
                            "val": "10.276"
                        },
                        "BudgetYearFour": {
                            "val": "10.482"
                        },
                        "BudgetYearFive": {
                            "val": "10.692"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project develops and characterizes information and communications processing software to automate the delivery of information for planning, rehearsal, and execution by ground commanders. Efforts develop communication\/network architectures, software, and the information fusion software necessary to simplify the understanding and interactions from humans to humans, humans to computers, and computers to humans.  Research enables enhanced understanding of many information sources and accelerates the decision cycle time for commanders and leaders operating in the mobile, dispersed, highly networked environment envisioned for the future force.\n\nWork in this Project is fully coordinated with Program Element (PE) 0603008A (Command, Control, Communications Advanced Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), PE 0603008A (Command, Control, Communications Advanced Technology), and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThis Project supports Army Science and Technology efforts in the Command, Control, Communications, and Intelligence portfolio.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Media Information Processing and Exploration"
                                    },
                                    "Description": {
                                        "val": "This effort develops and characterizes fusion software to improve the completeness and timeliness of decision-making for Mission Command.  The goal of this effort is to develop software applicable to the Distributed Common Ground Station – Army (DCGS-A) architecture (an integrated architecture of all ground\/surface systems) and for future force assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.644"
                                            },
                                            "Text": {
                                                "val": "Examine text analytics techniques for rapid extraction of social and cultural relationship information to increase the accuracy and timeliness of predicting attitudes for use in social network analyses; and characterize the use of crowd sourcing and teaming concepts for analysis in a DCGS-A-like environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.833"
                                            },
                                            "Text": {
                                                "val": "Will investigate extension of social media analysis techniques to predict adversarial behaviors; and address the issues of incorporating prediction tools into a tactical local cloud computing cluster and the potential to execute these prediction tools within a tactical environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.888"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.888"
                                            },
                                            "Text": {
                                                "val": "Will design and develop methods to extract information from multi-source data, predict adversarial intent, and provide indications and warnings of adversarial action for use in intelligence analysis and tactical operations; investigate collective-intelligence techniques to enhance Soldier understanding of political, military, economic and social conditions in tactical environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Assurance"
                                    },
                                    "Description": {
                                        "val": "This effort develops and characterizes fusion software to improve the completeness and timeliness of decision-making for Mission Command.  The focus is on software applicable to the Distributed Common Ground Station – Army (DCGS-A) architecture (an integrated architecture for intelligence systems and ground\/surface command and control systems) and for future force requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.452"
                                            },
                                            "Text": {
                                                "val": "Examined text analytics techniques for rapid extraction of social and cultural relationship information to increase the accuracy and timeliness of predicting attitudes for use in social network analyses; and characterized the use of crowd sourcing and teaming concepts for analysis in a DCGS-A-like environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.944"
                                            },
                                            "Text": {
                                                "val": "Will design and characterize techniques of active cyber defense effects to disrupt adversarial command and control of heterogeneous networks while maintaining communication with key cyber terrain assets (i.e., elements of the domain that enable mission essential warfighting functions); explore and validate novel big data analytical approaches to identify and manage risks posed by emerging vulnerabilities; and develop proof-of-concept detection capabilities to identify malicious or anomalous events in a complex, interconnected information environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.050"
                                            },
                                            "Text": {
                                                "val": "Will design and develop methods to extract information from multi-source data, predict adversarial intent, and provide indications and warnings of adversarial action for use in intelligence analysis and tactical operations; investigate collective-intelligence techniques to enhance Soldier understanding of political, military, economic and social conditions in tactical environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Context-Based Information Exchange"
                                    },
                                    "Description": {
                                        "val": "This effort investigates techniques that integrate local and external information sources, and it applies text and video analytic approaches to support automated intelligence analysis and decision making. The goal is to enable tactical users to cooperatively share relevant and timely tactical information within a distributed wireless environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.231"
                                            },
                                            "Text": {
                                                "val": "Explore text-based techniques, like transfer learning and semantic representation of visual concepts, as a means of overcoming challenges in extracting objects, actions, and context from video; and develop tools to assist with information extraction from various communication modes to include text embedded in video transmissions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.287"
                                            },
                                            "Text": {
                                                "val": "Will develop quantitative models of trust and quality; explore approaches to applying user context (e.g. mission, cognitive state, trust, and quality) in networked military and social information delivery; and develop text and video analytics from research in PE 0601104A Project H50 (Network Sciences Collaborative Technology Alliance) and Project J15 (Network and Information Sciences International Technology Alliance) along with new internal ARL research and explore its effect on intelligence products."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.334"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.334"
                                            },
                                            "Text": {
                                                "val": "Will extend user context models to incorporate continuous learning to improve performance and fit of models of individual solders over time; based on context models, investigate algorithms to foresee mission-related information requirements prior to manual requests in anticipation of soldier situational awareness gaps; develop algorithms to generate computable descriptions of location imagery captured by battlefield visual sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Lingual Computing"
                                    },
                                    "Description": {
                                        "val": "This effort develops and assesses computational multilingual algorithms and software frameworks to enable commanders and troops to bridge language barriers in order to counter adversaries and collaborate with allies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.990"
                                            },
                                            "Text": {
                                                "val": "Implemented and validated advanced algorithms that improve machine translation technologies by incorporating data selection techniques into algorithms to generalize existing machine translation modules; and increased ability to translate low density languages of military interest to include key languages native to Africa."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.647"
                                            },
                                            "Text": {
                                                "val": "Will explore the use of linguistic analysis to refine the automated interpretation of cultural concepts within multi-lingual information sources; and develop and assess techniques for rapid linguistic analysis and translation of documents written in low-density languages that lack a large body of relevant previously translated texts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.597"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.597"
                                            },
                                            "Text": {
                                                "val": "Will develop semi-supervised analysis and deep learning methods for automated information extraction from multilingual sources; develop generalized methods for the automatic processing of document images containing multilingual handwritten and printed text; assess human-in-the-loop methods for leveraging semantic representations of domain data to achieve high quality translations to and from low-resource languages"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Theories and Models"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs theory based software models to characterize and validate emerging network protocols and structures.  The goal of this effort is to develop software algorithms that maintain effective communications in networks in spite of disruptive effects such as task reorganization, mobility of friendly forces, and adversarial attacks on friendly networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.357"
                                            },
                                            "Text": {
                                                "val": "Implement ultraviolet (UV) communications components that attach to the radio frequency (RF) common sensor radio; validate simulation models to investigate how mobility and autonomy may be exploited to maintain connectivity; validate that optical and UV can provide robust non-line-of- sight communications to augment RF communications; and implement mapping connectivity regions to blend with mobility planning and sensing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.415"
                                            },
                                            "Text": {
                                                "val": "Will implement techniques for adapting communications components at the physical, media access control (MAC), and networking layers to enable robust wireless communications; develop tools for content and software based networking that enable discovery of, access to, and processing of information sources in highly dynamic and contested environments; and explore and create methodologies and approaches to increase the validity of network science experimentation results across contexts, at the appropriate network scale, and with the appropriate fidelity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.453"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.453"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques for the distributed management & control of cognitive radio networks; will implement the adaptive algorithms for robust and efficient tactical communications using cognitive and dynamic spectrum access techniques investigated and created in PE 0601102A Project H48 \/ Battlespace Info & Comm Rsc; explore and implement models for influencing the evolution of communication networks in spite of mobility and adversarial attacks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Heterogeneous Computing and Computational Sciences"
                                    },
                                    "Description": {
                                        "val": "This effort researches and develops software algorithms to allow information processing across different computing hardware platforms. The goal of this research is to provide high performance computing \/ processing capabilities to the Soldier on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.621"
                                            },
                                            "Text": {
                                                "val": "Designed an auto-tuning approach to balance performance models for hybrid cores where low-level instruction scheduling is a problem; implemented new mathematical algorithm to address placement of mobile high-performance computing (HPC) in dynamic battlefield networks; and designed the problem for heterogeneous networks and quantify minimum communications path lengths (using quantum annealing algorithms) to converge on a solution for optimum distribution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.685"
                                            },
                                            "Text": {
                                                "val": "Will implement auto-tuning approach to balance performance models on next generation hybrid cores where low-level instruction scheduling is a problem; validate mathematical algorithm to address placement of mobile HPC in dynamic battlefield along with other HPC systems; investigate methods for mitigating bandwidth allocation issues by utilizing emerging memory hierarchies and storage; and create algorithms to quantify resiliency for tactical HPC systems and associated programming models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.719"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.719"
                                            },
                                            "Text": {
                                                "val": "Will design algorithm development and programming methodologies to fully utilize domain-specific processor\/processing architectures (custom-engineered for size, weight and power based on task); implement middleware that enables reuse of existing code to take advantage of next generation processing capabilities; demonstrate scalability toward exascale (billion, billion calculations per second) capability of low-power next generation processing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Material Modeling for Force Protection"
                                    },
                                    "Description": {
                                        "val": "This effort designs and characterizes software to improve parallel processing for computationally intensive physics problems.  The intent is to create a computational science environment to assist researchers from different disciplines to work collaboratively and to exchange models and results."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.971"
                                            },
                                            "Text": {
                                                "val": "Developed hierarchical multi-scale models for material behavior and design; used multiple parallel model couplings to tie models of different length or time scales together; investigated emerging programming languages for scalability and portability on different HPC computing platforms; and investigated applicability of emerging programming languages for the specific class of multi-physics applications related to underbody blast applications which includes modeling of the Soldier."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}