{
    "id": "2018-Army-PB-2040-JBOOK-4b1431d557244e9ea54e049cfbecfc8cdb410cfc025b821caca6b08b36a8ebb9-19",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605805A"
        },
        "ProgramElementTitle": {
            "val": "Munitions Standardization, Effectiveness and Safety"
        },
        "R1LineNumber": {
            "val": "171"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "48.335"
            },
            "CurrentYear": {
                "val": "40.545"
            },
            "BudgetYearOne": {
                "val": "43.444"
            },
            "BudgetYearOneBase": {
                "val": "43.444"
            },
            "BudgetYearTwo": {
                "val": "41.589"
            },
            "BudgetYearThree": {
                "val": "44.739"
            },
            "BudgetYearFour": {
                "val": "41.671"
            },
            "BudgetYearFive": {
                "val": "47.614"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports continuing technology investigations.  It provides a coordinated tri-service mechanism for the collection and free exchange of technical data on the performance and effectiveness of all non-nuclear conventional munitions and weapons systems in a realistic operational environment.  \n\nProject 297 - Munitions Survivability & Logistics: This Project supports the future force by making Army units more survivable through the investigation, testing and demonstration of munitions logistics system improvements that prevent or minimize catastrophic explosive events and accelerate ammunition resupply.  Key thrusts are munitions storage area survivability, Insensitive Munitions (IM) technology integration and compliance, ammunition management and asset visibility, weapon system rearm, munitions configured load enablers and advanced packaging and distribution system enhancements.  Within each thrust, a broad array of solutions will be identified, tested, and evaluated against developed system measures of effectiveness.  Optimum, cost effective and efficient solutions that enable the rapid projection of lethal and survivable forces will be demonstrated.  The early stages of force deployment are especially critical.  Theater ammunition storage areas are vulnerable and present the enemy with lucrative targets.  These areas and distribution nodes contain the only available munitions stocks in theater.  Loss of these munition stocks could cripple the force, jeopardize the mission, and result in high loss of life.  This Project mitigates vulnerabilities and ensures a survivable fighting force.\n\nProject 857 - DoD Explosives Safety Standards : This Project supports the Research, Development, Test, and Evaluation efforts of the Department of Defense (DoD) Explosive Safety Standards Board.  It supports explosive safety effects research and testing to quantify hazards and to develop techniques to mitigate those hazards in all DoD manufacturing, testing, transportation, maintenance, storage, disposal of ammunition and explosives operations, and also to develop risk based explosives safety standards.  Results are essential to the development and improvement of quantity-distance standards, hazard classification procedures, cost effective explosion-resistant facility design procedures, and personnel hazard\/protection criteria.\n\nProject 858 - Army Explosives Safety Management Program: This Project establishes, validates or modifies explosives technical safety requirements per Department of Defense Manual 6055.09 and Department of the Army Pamphlet 385-64, Ammunition and Explosives Safety Standards. Project activities promote Research, Development, Test, and Evaluation (RDTE) of new and innovative explosives safety technologies that improve the survivability of Army personnel, facilities, and equipment as well as improve the health, safety and welfare of the general public (with highest priority directed to combat theater of operations).\n\nProject 859 - Life Cycle Pilot Process: This Project supports the implementation of the Single Manager for Conventional Ammunition (SMCA) Industrial Base Strategic Plan through technology investigations, model based process controls, pilot prototyping, and industrial assessments.  It will assess life cycle production capabilities required for all ammunition families, address design for manufacturability to facilitate economical production, identify industrial and technology requirements, and address the ability of the production base to rapidly and cost effectively produce quality products.  Cost reduction is an important part of the Life Cycle Pilot Process (LCPP).  LCPP provides the resources to prototype critical technologies and develop the knowledge base to establish cost effective, environmentally safe and modern production processes in support of the munitions Industrial Base transformation.  In addition, the LCPP program addresses Single Point Failures (SPFs)\/No Source of supply within the National Technology Industrial Base (NTIB).  LCPP provides support to reduce supply chain risk by investigating, developing and evaluating additional sources of supply for a known SPF.\n\nProject F21:  The North Atlantic Treaty Organization (NATO) Ammunition Evaluation program funding assures interchangeability of direct fire ammunition and weapons among all the NATO countries with all of the associated logistic, strategic and tactical advantages of the alliance.  The Project involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC).  In addition, this Project supports small caliber ammunition, 40mm grenade munitions, medium caliber cannon ammunition and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy and general product improvements.  This Project also supports the standardization and interchangeability of legacy and new production United States (U.S.) weapons and ammunition with Allied Nations to maximize battlefield interchangeability\/compatibility under the auspices of the international Joint Ballistics Memorandum Of Understanding (JBMOU).  Maximizing standardization, interchangeability, and exportability will also potentially increase Foreign Military Sales (FMS) of U.S. indirect fire Weapon and Munition products to maintain critical mass domestic production and affordable taxpayer costs through increased economies of scale.  Fiscal Year (FY) 2018 funding supports NATO small arms ammunition interchangeability group meetings, documentation, and test operations.  FY 2018 funding also supports JBMOU ballistic testing including firing tables, safety, reliability, and performance.\n\nF24 - Conventional Munitions Demilitarization (Demil): The Conventional Munitions Demilitarization technology Project supports the Single Manager for Conventional Ammunition (SMCA) responsibility per Department of Defense Instruction (DoDI) 5160.68 to plan, program, budget and fund a Joint Service Research and Development (R&D) program that develops capability and capacity as well as technology and facilities to support the SMCA mission to demil and dispose of conventional ammunition stored in the SMCA Resource, Recovery and Disposition Account (B5A).  The program goals include SMCA efforts to increase efficiencies and effectiveness to reduce the demil stockpile; reduce processing costs including packaging, handling and crating; and increase capacity through improved demil capabilities and processes.  Project F24 includes activities: (1) to establish requirements and develop processes to focus investments, assess capabilities, analyze alternatives, and recommend and implement R&D projects; (2) to improve products and processes that support existing capabilities; (3) to develop or improve demil methods and processes related to advance the primary demilitarization core thrust areas of destruction, disassembly, removal, resource recovery and recycling, and waste stream treatment; (4) to ensure safe and environmentally acceptable demil operations; (5) to transition R&D products to United States Army depots or plants as well as commercial facilities performing demil; and (6) to mitigate risk and close-out project activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "64.604"
                },
                "CurrentYear": {
                    "val": "40.545"
                },
                "BudgetYearOne": {
                    "val": "40.204"
                },
                "BudgetYearOneBase": {
                    "val": "40.204"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "48.335"
                },
                "CurrentYear": {
                    "val": "40.545"
                },
                "BudgetYearOne": {
                    "val": "43.444"
                },
                "BudgetYearOneBase": {
                    "val": "43.444"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-16.269"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.240"
                },
                "BudgetYearOneBase": {
                    "val": "3.240"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-15.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.292"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.023"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "3.240"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.240"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year 2016 Congressional Add of $15,000,000 for Hybrid Projectile Technology into Project 862 (Indirect Fire and Fuze Technology) reprogrammed into Program Element 0603004A (Weapons and Munitions Advanced Technology) \/ Project 43A (Adv Weaponry Tech Demo)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "297"
                    },
                    "ProjectTitle": {
                        "val": "Mun Survivability & Log"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.451"
                        },
                        "CurrentYear": {
                            "val": "15.149"
                        },
                        "BudgetYearOne": {
                            "val": "16.650"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.650"
                        },
                        "BudgetYearTwo": {
                            "val": "16.472"
                        },
                        "BudgetYearThree": {
                            "val": "16.496"
                        },
                        "BudgetYearFour": {
                            "val": "16.598"
                        },
                        "BudgetYearFive": {
                            "val": "16.114"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the future force by making Army units more survivable through the investigation, testing and demonstration of munitions logistics system improvements that prevent or minimize catastrophic explosive events and accelerate ammunition resupply.  Key thrusts are munitions storage area survivability, Insensitive Munitions (IM) technology integration and compliance, ammunition management and asset visibility, weapon system rearm, munitions configured load enablers and advanced packaging and distribution system enhancements.  Within each thrust, a broad array of solutions will be identified, tested, and evaluated against developed system measures of effectiveness.  Optimum, cost effective and efficient solutions that enable the rapid projection of lethal and survivable forces will be demonstrated.  The early stages of force deployment are especially critical.  Theater ammunition storage areas are vulnerable and present the enemy with lucrative targets.  These areas and distribution nodes contain the only available munitions stocks in theater.  Loss of these munition stocks could cripple the force, jeopardize the mission, and result in high loss of life.  This Project mitigates vulnerabilities and ensures a survivable fighting force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Munitions Predictive Life"
                                    },
                                    "Description": {
                                        "val": "This activity will demonstrate technologies and algorithms that can help assess munitions serviceability based upon aggregate environmental exposures, system cycling and munition degradation models.  The activity will provide life cycle management tools for risk mitigation strategies, while reducing testing, inspection & surveillance required as well as improving weapon system reliability and warfighter effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.099"
                                            },
                                            "Text": {
                                                "val": "Completed validation of temperature exposure algorithmic models of munitions for evaluation in a surrogate Munitions History Program software tool. Developed reliability and risk evaluation algorithms and conducted validation testing for 5.56mm and 7.62mm caliber ammunition families.  Integrated chemical based propellant reliability sensor into ammunition packaging and conducted demonstration.  Conducted engineering and long term propellant validation testing for a resistance based reliability sensor.  Completed prototype design of next generation ammunition container based temperature\/humidity exposure reliability sensor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.916"
                                            },
                                            "Text": {
                                                "val": "Complete integration of temperature exposure algorithmic models of munitions into the surrogate Munitions History Program. Develop ammunition database analysis based reliability and risk evaluation algorithms and conduct validation testing for grenade ammunition families.  Conduct a trade-off analysis between brilliant green and resistance based propellant sensors to identify specific use cases for each.  Conduct long term operational evaluation of next generation ammunition container based temperature\/humidity exposure reliability sensor.  Conduct market survey of passive Radio Frequency Identification and low cost active environmental sensors for munitions, select viable candidates, and test.  Conduct correlation testing on the passive time\/temperature exposure sensor with legacy ammunition items and integrate."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.718"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.718"
                                            },
                                            "Text": {
                                                "val": "Conduct qualification safety testing of a next generation ammunition container based temperature\/humidity exposure reliability sensor and complete data integration into Munitions History Program (MHP) and Stockpile reliability program Quality Assurance Specialist Ammunition Surveillance User Inspection Device (SQUID).  Conduct prototype engineering testing of a Multi Frequency Sensor Suite (MFSS) that will monitor munitions exposure to ambient radiation over their lifecycle for improved reliability knowledge. Conduct correlation testing on the passive time\/temperature exposure sensor with legacy ammunition items and integrate. Conduct market survey of passive Radio Frequency Identification and low cost active environmental sensors for legacy munitions, select viable candidates, and test.  Integrate passive propellant temperature sensor with fire control systems and processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Insensitive Munitions (IM) Integration Program"
                                    },
                                    "Description": {
                                        "val": "Demonstrate multiple IM technologies and integrate into end item(s) to improve munitions survivability and warfighter safety.  IM Technologies, using State-of-the-Art materials, will be developed in the areas of warhead, propulsion and propellants, explosives, packaging, and barriers.  In addition, modeling and simulation will be used to reduce development and testing costs.  Efforts will increase the number of IM compliant ammunition items fielded to mitigate munitions reaction to unplanned stimuli such as fire, fragments, enclosed heat build-up (cook-off), bullets, adjacent munitions reaction (sympathetic detonation), and shape charge jet attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.101"
                                            },
                                            "Text": {
                                                "val": "Finalized pallet barrier design and performed rough handling for the IM enhanced 105mm M1. Transitioned all 105mm IM Technologies to the Project Manager Combat Ammunition Systems (PM-CAS) to include pallet barriers, vented cylindrical containers and cartridge case spacer to produce an IM compliant 105mm M1 round. Finalized propellant lab scale methodologies and testing hardware. Transitioned processing methodologies and IM propellants to medium and large caliber ammo programs. Matured methodologies to produce affordable eutectic components for munition or container venting in fires. Matured a reduced shock sensitivity high explosive material, MDNT (Methyl Dinitro Triazole), for small critical diameter munitions such as the M-67 grenade.  Scaled-up in-house operations to produce 20lbs of non-energetic DAMT (Diamino Methyl Triazole), a precursor material for making MDNT. Demonstrated the performance of MDNT in small diameter munitions. Demonstrated the reduced shock response of propellants manufactured with high shear mixing. Transitioned a reduced-sensitivity flexible explosive to Project Manager Close Combat Systems (PM-CCS) for demolition munitions. Developed sub-scale Slow Cook Off (SCO) test for the evaluation of propellants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.666"
                                            },
                                            "Text": {
                                                "val": "Conduct integration testing of all 30mm M788\/M789 IM technologies and transition to the PM.  Select candidate materials for thermal mitigation and conduct 40mm M430A1 integration testing and transition to Project Manager Maneuver Ammunition Systems (PM-MAS).  Continue development of IM propellants for medium and large caliber munitions.  Finalize in-house evaluation tools for sub-scale Slow Cook Off (SCO) and Fast Cook Off (FCO) for propellants. Develop venting technologies and propellants for base bleed projectiles.  Continue development of high energy aluminized energetics for use in multipurpose warheads.  Leverage technologies from the M430A1 grenade to develop liner release and warhead venting solutions to mitigate cook off."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.288"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.288"
                                            },
                                            "Text": {
                                                "val": "Conduct final integration testing of all 30mm M788\/M789 IM technologies and transition to Project Manager Maneuver Ammunition Systems (PM-MAS).  Validate reduced-sensitivity and high performance explosives in small and medium caliber munitions systems.  Optimize the use of nano-energetic materials as reduced-sensitivity but high-output main fill explosives or boosters in small and medium caliber munition systems.  Validate the use of high-energy output and reduced-sensitivity 3,4-dinitropyrazole (DNP) explosive in hand grenades and optimize booster configuration to accommodate enhanced fuze.  Optimize the use of new packaging and dunnage materials that actively attract or pull heat away from vulnerable munition components in case of fire."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Munitions Packaging"
                                    },
                                    "Description": {
                                        "val": "This activity will demonstrate upgrades to existing  packaging components and materials to improve legacy ammunition survivability.  These upgrades will enhance ammunition survivability and reliability, improve field ammunition operations, and improve packaging producibility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.711"
                                            },
                                            "Text": {
                                                "val": "Conducted sequential rough handling testing of redesigned advanced lightweight cylindrical ammunition container packaging.  Completed prototype design of a plastic polymer container for 5.56mm ammunition containers to reduce packaging weight and production costs.  Designed and performed engineering and environmental testing of plastic sealed ammunition pouch for 5.56mm clipped ammunition.  Coordinated the review and approval of updates to military and commercial standards and specifications for alternative Environmental Protection Agency registered preservatives for wood ammunition packaging materials.  Implemented ammunition packaging test requirement changes that eliminate redundancies while continuing to research the feasibility of changing more technically complex physical characteristic requirements.  Performed a phase II study of Eco-Friendly packaging solutions that included a characterization study as well as performance testing on candidate products that may be incorporated into ammunition end item container component designs.  Completed prototype design and conducted engineering testing on an enhanced fiber tube innerpack that improves protection and handling for 120mm mortar munitions.  Performed unit load and transportation testing of enhanced ammunition pallet retention system that is lighter and provides easier access, completed design drawings and transitioned."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.947"
                                            },
                                            "Text": {
                                                "val": "Complete prototype verification testing (Unit Load, Insensitive Munitions, Electromagnetic Environmental Effects) for HDPE cylindrical containers.  Optimize design and perform verification testing of plastic polymer rectangular container for legacy 5.56mm ammunition.  Optimize design for plastic sealed ammunition pouches and perform validation testing with 5.56mm ammunition items.  Fabricate packaging components using selected eco-friendly materials and conduct performance testing. Complete design modifications for an enhanced fiber tube innerpack for 120mm mortar munitions and conduct verification testing.  Complete modeling and simulation of a small caliber ammunition bulk packaging container for improved distribution and retrograde efficiency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.575"
                                            },
                                            "Text": {
                                                "val": "Develop prototypes and conduct sequential rough handling and environmental testing for the injection molded cylindrical container that integrates it for use with the M829A4 120mm tank and 120mm mortar munitions. Develop prototypes and conduct sequential rough handling and environmental testing for the plastic rectangular container to integrate it for use with legacy 5.56 small caliber ammunition.  Develop several concepts geared to “lighten the load” and down select concepts thru modeling and simulation and analysis.  Complete qualification testing of plastic sealed ammunition pouches for use with 5.56mm ammunition.  Perform final hazard classification testing on M6 and M7 blasting cap container design with Mycofoam.  Fully implement Mycofoam as replacement dunnage design option for M6 and M7 blasting cap packaging design as part of the eco-friendly program.  Conduct engineering and prototype testing of a small caliber ammunition bulk packaging container for improved distribution efficiency."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ammo Provider"
                                    },
                                    "Description": {
                                        "val": "This activity demonstrates technologies that will assure a survivable munitions logistics system by increasing distribution velocity and protecting ammo storage areas.  Technology areas to be investigated include ammunition asset visibility (including environmental sensors, marking technologies, and supply chain modeling), ammunition management (including improvements in stockpile surveillance and condition based management), sustainment (including pre-configured loads (soldier to unit size), field ammo reconfiguration capability, robotic handling, and improved load building capability), and force protection (including site planning software and field storage protection)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.540"
                                            },
                                            "Text": {
                                                "val": "Completed rope cutter design, integrated into centrifugal clutch mechanism, and conducted engineering testing of the helicopter delivered emergency resupply speedbag that will expand its use for heavier payloads, higher drop heights, and variable impact velocities. Conducted fragment impact testing on containerized small caliber ammunition to determine the feasibility of using these containers as an outer barrier to make tactical ammunition delivery loads more survivable. Developed design and conducted modeling and simulation of a unitization solution for tactical partial pallet ammunition loads to improve handling and transportation efficiency. Completed market survey and preliminary evaluation of technologies for manufacturing ammunition inner packing material at the field level.  Completed user needs evaluation for an Ammunition Quality Decision Tool (AQDT) that will improve stockpile management and reliability. Assessed interface concepts and off the shelf solutions that provide similar capabilities to the Joint Modular Intermodal Container (JMIC) at lower cost. Conducted system analysis of the existing Configured Load Building Tool (CLBT) prototype that permits the rapid design of optimum load configurations for any transportation conveyance in accordance with applicable transportation regulations and doctrine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.620"
                                            },
                                            "Text": {
                                                "val": "Complete design of a partial\/mixed pallet tactical ammunition load unitization solution and fabricate prototypes.  Complete evaluation of technologies for manufacturing ammunition inner packing material at the field level and develop recommendations. Continue integration of automated Material Handling Equipment (MHE) into Automated Supply Point-Scalable (ASP-S) and conduct Phase 1 demonstration.  Build a graphical user interface for ammunition risk & reliability and thermal pallet algorithms, incorporate into the Ammunition Quality Decision Tool and evaluate tool effectiveness.  Complete Joint Modular Intermodal Container (JMIC) Cost Benefit Analysis and alternative prototype design.  Complete design of an applique interface kit for manually operated MHE that links the MHE to the ASP-S planning and control system for seamless operations during the transition period from fully manual operations to fully autonomous operations.  Evaluate requirements and modify design as needed of munitions health monitoring systems to provide stockpile management capability for and ensure interoperability with ASP-S hardware and software.  Develop the design concept for an automated pallet scanning and weighing capability to enable rapid accountability and autonomous load building in the ASP-S.  Complete design of a web based version of the Munitions Survivability Software (MSS) prototype that will permit the quick design and layout of safe ammunition storage areas and integrate into the Virtual Forward Operating Base (VFOB) site planning tool.  Complete design of an Unmanned Aerial System (UAS)--Resupply Pod and unpowered descent system that will improve supply delivery accuracy and survivability and UAS maneuverability.  Develop requirements and design architecture for an intelligent, anticipatory, real-time ammunition management software tool."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.069"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.069"
                                            },
                                            "Text": {
                                                "val": "Conduct phase 1 demonstration of the enhanced speedbag with the Tactical Resupply Unmanned Aerial System – Competitive (TRUC).  Complete the design of a graphical user interface for the Ammunition Quality Decision Tool and conduct user evaluation of tool effectiveness. Complete Joint Modular Intermodal Container (JMIC)\/container Analysis of Alternatives and transition alternative prototype. Implement software requirements for operating Expeditionary Munitions Survivability Software (EMSS) in a disconnected state.  Add basic site surveying capability with a mobile hardware device.  Expand Configured Load Building Tool (CLBT) prototype capabilities to determine and visualize loads at the sub-pallet level on set of defined standard transportation conveyances.  Mature 5K forklift and Rough Terrain Container Handler (RTCH) automation kit prototypes to include integration of maintenance and troubleshooting aids and conduct validation testing. Integrate applique interface kit for manually operated Material Handling Equipment (MHE) into the 5K forklift and RTCH, implement software control subsystems, and perform subsystem testing. Conduct engineering and user testing of the automated pallet scanning and weighing system. Develop software links to Automated Supply Point-Scalable (ASP-S) for data transmission. Complete design for an integrated round counting sensor device that enables automatic capturing of fired ammunition data from weapon systems to facilitate anticipatory resupply.  Complete requirements analysis and update design architecture of the Class V Adaptive Demand Estimation System (CADES) that will permit intelligent, anticipatory ammunition management on the battlefield with the ability to monitor consumption and supply node stock levels for forward warfighting units. Modify as necessary and conduct demonstration of the CADES prototype to provide theater level stockage objective to meet anticipated demand.  Support continued use of the Distribution & Retrograde APEX Management (DRAM) prototype in operational demonstrations. Complete the design of a multi-modal supply pallet that minimizes the requirement for handling and reconfiguration of cargo in transit."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "857"
                    },
                    "ProjectTitle": {
                        "val": "DoD Explosives Safety Standards"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.754"
                        },
                        "CurrentYear": {
                            "val": "1.607"
                        },
                        "BudgetYearOne": {
                            "val": "1.968"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.968"
                        },
                        "BudgetYearTwo": {
                            "val": "1.862"
                        },
                        "BudgetYearThree": {
                            "val": "1.880"
                        },
                        "BudgetYearFour": {
                            "val": "1.914"
                        },
                        "BudgetYearFive": {
                            "val": "1.953"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Research, Development, Test, and Evaluation efforts of the Department of Defense (DoD) Explosive Safety Standards Board.  It supports explosive safety effects research and testing to quantify hazards and to develop techniques to mitigate those hazards in all DoD manufacturing, testing, transportation, maintenance, storage, disposal of ammunition and explosives operations, and also to develop risk based explosives safety standards.  Results are essential to the development and improvement of quantity-distance standards, hazard classification procedures, cost effective explosion-resistant facility design procedures, and personnel hazard\/protection criteria."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Explosive and Munitions Tests"
                                    },
                                    "Description": {
                                        "val": "Testing aimed at solving practical problems and increasing predictability of the effects of explosions and impacts on people, materials and structures.  Additionally, testing provides data on the interaction of explosives in various configurations.  Testing results are used to improve predictability of effects from explosive incidents and improve criteria to protect people, structures and the environment from the damaging effects of DoD munitions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Explsoion effects testing to provide data for increasingly accurate predictions of real world effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.574"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.574"
                                            },
                                            "Text": {
                                                "val": "Continue testing of laboratory quantities, potential partnering effort for testing of underwater shock effects, further maturation of HD 1.3 testing and scaled testing of earth-covered magazines to determine blast pressures at intermagazine distance. \n\nLaboratory quantity testing:  Explosives safety criteria are generally geared towards larger quantities of explosives where the specifics of the donor structure have less of an effect on the hazards generated.  This is particularly problematic for lab quantities of explosives (e.g., 500 grams and lower), where the specifics of the construction type, room geometry, standoff, etc., can have a profound effect on the associated hazards.  Current criteria is admittedly conservative in this regime, but testing and analysis are needed to justify reduced safety standoff distances.  This work will leverage previous ATF lab quantities testing by increasing the explosive weight until breach of a sheetrock wall; determine the secondary breach debris hazards from a nominal laboratory room design; and assess overpressurization failure hazards of a nominal laboratory room design.   This will result in reduced safety standoff distances for the conditions tested.  \n\nHazard Division 1.3 testing:  As a result of a study of historical accidents approximately 75% of accidents are initiated by fire versus by detonation via an initiation chain.  Also, the Insensitive Munitions Program has as a primary goal to develop more “insensitive” munitions and their end state is systems that react by burn only.  These two conditions combine to make the potential for a non-detonation reaction more likely in the event of an explosives accident.  This testing effort is designed to address the gaps in knowledge of HD 1.3\/thermal hazards from a non-detonation reaction by performing testing to characterize the debris hazards from breakup of a confining structure, characterize the directional jetting effects from such structures, and assess the thermal hazard of burning in the open."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Safety Guidelines"
                                    },
                                    "Description": {
                                        "val": "The DDESB is charged with developing DoD explosives safety standards.  These standards are captured in several DoD issuances, but the primary one is DoDM 6055.09, DoD Ammunition and Explosives Safety Standards.  Changes to DoDM 6055.09 must be approved by the DoD Explosives Safety Board.  The Board Members have identified their priorities for update of DoDM 6055.09, and these priorities are reflected in the formation of DDESB working groups and test programs to develop new and revised explosives safety standards.  This effort continually improves safety policy and guidance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.754"
                                            },
                                            "Text": {
                                                "val": "Developed revised criteria for intentional burns and detonations required for essential personnel safety during military training operations.  Additionally, initial phases of work completed to develop more accurate hazard classification guidelines and policy.  Continued work leading to eventual development of underwater blast criteria, essential for unexploded ordnance remediation efforts.  Developed revised criteria for design of blast-resistant windows and glazing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "Develop improved DoD and NATO explosives safety guidelines for munitions storage, explosives and field operation facilities.  Prepare revised Dod 6055.9-STD and 4145.26M."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.545"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.545"
                                            },
                                            "Text": {
                                                "val": "Continuation of work on hazard classification criteria.  Initial development of major rewrite of DoD explosives safety standards, to include addressing revised Hazard Division 1.2 criteria in both NATO and DoD policy.  Development of example design procedures for design of blast-resistant windows and glazing.\n\nNear complete rewrite of DoD explosives safety standards.  Continue effort on harmonization with NATO and UN policy resulting in seamless NATO and multi-national operations.  Initial phase of work to develop more refined secondary debris hazards from explosives storage buildings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis Tools"
                                    },
                                    "Description": {
                                        "val": "Develop tools & models required to calculate, estimate and predict explosives safety hazards, associated standoff distances, fragmentation distribution, personnel risks and other parameters.  Additionally tools are required to develop and maintain explosives safety site plans."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.657"
                                            },
                                            "Text": {
                                                "val": "Develop more accurate models  based on results of small scale testing and tools to implement revised standards.  Improve usability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.849"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.849"
                                            },
                                            "Text": {
                                                "val": "Leverage master planning partnerships to develop initial web-based site planning capability. Develop a tool to predict fragment distances from piping partially contaminated with explosives residue.  model which will utilize the pipe size (diameter and thickness), the length of pipe, and the maximum credible event to account for only a percentage of the total available volume in the pipe being filled to better predict fragmentation hazards in building remediation. Develop a model to predict coupled effects of over-pressurization of a structure from a thermal event and the mass distribution of the resulting debris. Development of modeling to predict burn characterization of propellants"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "858"
                    },
                    "ProjectTitle": {
                        "val": "Army Explosives Safety Management Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.150"
                        },
                        "CurrentYear": {
                            "val": "0.633"
                        },
                        "BudgetYearOne": {
                            "val": "1.085"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.085"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project establishes, validates or modifies explosives technical safety requirements per Department of Defense Manual 6055.09 and Department of the Army Pamphlet 385-64, Ammunition and Explosives Safety Standards. Project activities promote Research, Development, Test, and Evaluation (RDTE) of new and innovative explosives safety technologies that improve the survivability of Army personnel, facilities, and equipment as well as improve the health, safety and welfare of the general public (with highest priority directed to combat theater of operations)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Risk based explosives safety criteria"
                                    },
                                    "Description": {
                                        "val": "Development of risk based explosives safety criteria that will aid commanders and safety personnel in the transition from regulation to risk management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Text": {
                                                "val": "Continued explosives testing and support of hazard research and exposure consequences."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.150"
                                            },
                                            "Text": {
                                                "val": "Continue explosives testing and support of hazard research and exposure consequences."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.150"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support of hazard research and exposure consequences."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of enhanced protective structure designs"
                                    },
                                    "Description": {
                                        "val": "Develop enhanced protective structure designs that improve the survivability of Army personnel, facilities and equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Text": {
                                                "val": "Continued explosives testing and support for improving protective construction designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.260"
                                            },
                                            "Text": {
                                                "val": "Continue explosives testing and support for improving protective construction designs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.425"
                                            },
                                            "Text": {
                                                "val": "Will continue explosives testing and support for improving protective construction designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development of explosive safety tools"
                                    },
                                    "Description": {
                                        "val": "Develop explosive safety tools for use by Army personnel. Explosive safety tools allow commanders and safety personnel to make explosive safety decisions using risk management methodologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.223"
                                            },
                                            "Text": {
                                                "val": "Continue development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.510"
                                            },
                                            "Text": {
                                                "val": "Will continue development of new methods and tools for risk assessment to improve explosive safety risk management decisions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "859"
                    },
                    "ProjectTitle": {
                        "val": "Life Cycle Pilot Process"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.899"
                        },
                        "CurrentYear": {
                            "val": "4.863"
                        },
                        "BudgetYearOne": {
                            "val": "5.568"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.568"
                        },
                        "BudgetYearTwo": {
                            "val": "5.647"
                        },
                        "BudgetYearThree": {
                            "val": "5.724"
                        },
                        "BudgetYearFour": {
                            "val": "5.855"
                        },
                        "BudgetYearFive": {
                            "val": "5.840"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the implementation of the Single Manager for Conventional Ammunition (SMCA) Industrial Base Strategic Plan through technology investigations, model based process controls, pilot prototyping, and industrial assessments.  It will assess life cycle production capabilities required for all ammunition families, address design for manufacturability to facilitate economical production, identify industrial and technology requirements, and address the ability of the production base to rapidly and cost effectively produce quality products.  Cost reduction is an important part of the Life Cycle Pilot Process (LCPP).  LCPP provides the resources to prototype critical technologies and develop the knowledge base to establish cost effective, environmentally safe and modern production processes in support of the munitions Industrial Base transformation.  In addition, the LCPP program addresses Single Point Failures (SPFs)\/No Source of supply within the National Technology Industrial Base (NTIB).  LCPP provides support to reduce supply chain risk by investigating, developing and evaluating additional sources of supply for a known SPF."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Fiscal Year (FY) 2016 Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "17.000"
                                        },
                                        "Text": {
                                            "val": "FY 2016 Congressional titled program increase of $17M."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Cost Thrust Area"
                                    },
                                    "Description": {
                                        "val": "This thrust area seeks out new opportunities to reduce overall manufacturing costs of ammunition and ammunition components.  Efforts will review and analyze legacy manufacturing processing for opportunities to integrate new technology and lean manufacturing processes to reduce cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.644"
                                            },
                                            "Text": {
                                                "val": "Completed shape charge jet disrupter.  Evaluated new technologies for legacy processes to reduce overall production costs for the Army."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.424"
                                            },
                                            "Text": {
                                                "val": "Will evaluate, assess and transition new technology for legacy processes to reduce overall production costs for the Army.  Technology transitions to affected Industrial Base via the Production Base Support Modernization program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.086"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.086"
                                            },
                                            "Text": {
                                                "val": "Complete evaluation of the mortar fin inspection process.  Continue to evaluate, assess and transition new technology for legacy processes to reduce overall production costs for the Army."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Single Point Failures"
                                    },
                                    "Description": {
                                        "val": "Project thrust area efforts will employ manufacturing technologies to address SPFs.  These activities are part of the overall strategy to reduce the number of SPFs in the NTIB.  Additionally, thrust area efforts address ammunition manufacturing capability shortfalls.  This area leverages RDTE accomplishments and product knowledge to satisfy manufacturing requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.323"
                                            },
                                            "Text": {
                                                "val": "Completed list of alternative sources for antimony sulfide.  Clamp prototypes for smoke pot lid delivered for testing.  Continued development of manufacturing technology and processes for SPFs.  Efforts addressed source of supply problems within the NTIB."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.076"
                                            },
                                            "Text": {
                                                "val": "Continue development of manufacturing technology and processes for SPFs.  Efforts will address source of supply problems within the NTIB.  Technology transitions and risk mitigation strategies are transferred to Product Managers (PMs)\/Product Directors (PDs) for their use in assessing procurement strategies for affected SPF end items."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.903"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.903"
                                            },
                                            "Text": {
                                                "val": "Will continue to evaluate fuze battery material alternatives and complete evaluation of tank ammunition primer sealant alternatives.  Efforts will address source of supply problems within the NTIB.   Efforts will address source of supply problems within the NTIB.  Technology transitions and risk mitigation strategies are transferred to PMs\/PDs for their use in assessing procurement strategies for affected SPF end items."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturing Technology for Industrial Base Transformation"
                                    },
                                    "Description": {
                                        "val": "Project thrust area identifies and develops technologies that can be utilized at multiple Government and private ammunition manufacturing locations to transform the NTIB."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.932"
                                            },
                                            "Text": {
                                                "val": "Concluded live energetics testing on the multi-axis platform.  Completed testing to determine solvent content in propellant for ultrasound inspection.  Continued Metastable Intermolecular Composites (MIC)\/green primer pilot scale manufacturing.  Investigated, developed and documented manufacturing technology for transition to the NTIB."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.363"
                                            },
                                            "Text": {
                                                "val": "Continue MIC\/green primer pilot scale manufacturing.  Continue investigations, develop and document manufacturing technology for transition to the NTIB.  Technology transitions to affected Industrial Base via the Production Base Support Modernization program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.579"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.579"
                                            },
                                            "Text": {
                                                "val": "Complete MIC\/green primer pilot scale manufacturing and prototype manufacturing of pre-cursor materials for foamed celluloid sheets.  Continue investigations, develop and document manufacturing technology for transition to the NTIB.  Technology transitions to affected Industrial Base via the Industrial Facilities modernization program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F21"
                    },
                    "ProjectTitle": {
                        "val": "NATO Ammo Evaluation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.650"
                        },
                        "BudgetYearOne": {
                            "val": "0.589"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.589"
                        },
                        "BudgetYearTwo": {
                            "val": "0.772"
                        },
                        "BudgetYearThree": {
                            "val": "0.767"
                        },
                        "BudgetYearFour": {
                            "val": "0.782"
                        },
                        "BudgetYearFive": {
                            "val": "6.607"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The North Atlantic Treaty Organization (NATO) Ammunition Evaluation program funding ensures interchangeability of direct fire ammunition and weapons among all the NATO countries with all of the associated logistic, strategic and tactical advantages of the alliance.  The Project involves development and testing compliance of NATO standardization agreements (STANAGS) and staffing of the North American Regional Test Center (NARTC).  In addition, this Project supports small caliber ammunition, 40mm grenade munitions, medium caliber cannon ammunition, and large caliber ammunition enhancements to lethality, effectiveness, survivability, accuracy, and general product improvements.  This Project also supports the standardization and interchangeability of legacy and new production United States (U.S.) weapons and ammunition with Allied Nations to maximize battlefield interchangeability\/compatibility under the auspices of the international Joint Ballistics Memorandum Of Understanding (JBMOU).  Maximizing standardization, interchangeability, and exportability will also potentially increase Foreign Military Sales (FMS) of U.S. indirect fire Weapon and Munition products to maintain critical mass domestic production and affordable taxpayer costs through increased economies of scale.  Fiscal Year (FY) 2018 funding supports NATO small arms ammunition interchangeability group meetings, documentation and test operations.  FY 2018 funding also supports JBMOU ballistic testing including firing tables, safety, reliability, and performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Ammo Design Qualification & NATO Mission Support"
                                    },
                                    "Description": {
                                        "val": "This activity ensures complete interchangeability of small caliber, automated cannon-caliber, 40mm grenade ammunition and weapons among NATO countries to achieve the associated logistic, strategic and tactical advantages."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.455"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work supports NATO small arms ammunition interchangeability group meetings, documentation and test operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.109"
                                            },
                                            "Text": {
                                                "val": "FY 2018 continues work to support NATO small arms ammunition interchangeability group meetings, documentation and test operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support improvements in Direct Fire Propulsion Systems"
                                    },
                                    "Description": {
                                        "val": "Improve Direct Fire Propulsion Systems to increase user survivability."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.195"
                                            },
                                            "Text": {
                                                "val": "FY 2017 work will explore additional sources of supply in the National Technology and Industrial Base (NTIB) to reduce the dependence on foreign suppliers and pursue improvements to address temperature sensitivities of energetics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.030"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.030"
                                            },
                                            "Text": {
                                                "val": "FY 2018 continues work to explore additional sources of supply in NTIB to reduce the dependence on foreign suppliers and pursue improvements to address temperature sensitivities of energetics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Ballistics Memorandum Of Understanding (JBMOU)"
                                    },
                                    "Description": {
                                        "val": "The activity supports the maturation, validation, and risk reduction of battlefield interchangeability\/compatibility and associated enabling technologies between domestic U.S. and NATO\/Allied Nations Indirect Fires Weapons and Munitions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "FY 2018 activities include ballistic testing including firing tables, safety, reliability, and performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F24"
                    },
                    "ProjectTitle": {
                        "val": "Conventional Munitions Demil"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.081"
                        },
                        "CurrentYear": {
                            "val": "17.643"
                        },
                        "BudgetYearOne": {
                            "val": "17.584"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.584"
                        },
                        "BudgetYearTwo": {
                            "val": "16.836"
                        },
                        "BudgetYearThree": {
                            "val": "19.872"
                        },
                        "BudgetYearFour": {
                            "val": "16.522"
                        },
                        "BudgetYearFive": {
                            "val": "17.100"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Conventional Munitions Demilitarization technology Project supports the Single Manager for Conventional Ammunition (SMCA) responsibility per Department of Defense Instruction (DoDI) 5160.68 to plan, program, budget and fund a Joint Service Research and Development (R&D) program that develops capability and capacity as well as technology and facilities to support the SMCA mission to demil and dispose of conventional ammunition stored in the SMCA Resource, Recovery and Disposition Account (B5A).  The program goals include SMCA efforts to increase efficiencies and effectiveness to reduce the demil stockpile; reduce processing costs including packaging, handling and crating; and increase capacity through improved demil capabilities and processes.  Project F24 includes activities: (1) to establish requirements and develop processes to focus investments, assess capabilities, analyze alternatives, and recommend and implement R&D projects; (2) to improve products and processes that support existing capabilities; (3) to develop or improve demil methods and processes related to advance the primary demilitarization core thrust areas of destruction, disassembly, removal, resource recovery and recycling, and waste stream treatment; (4) to ensure safe and environmentally acceptable demil operations; (5) to transition R&D products to United States Army depots or plants as well as commercial facilities performing demil; and (6) to mitigate risk and close-out project activities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Destruction"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing capabilities and capacities for the destruction of munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.460"
                                            },
                                            "Text": {
                                                "val": "Continued fabrication of the Thermal Treatment Chamber for the Letterkenny Munitions Center (LEMC) Ammonium Perchlorate Rocket Motor Destruction (ARMD) project; conducted inert motor tests on Rocket Motor Segmenting (RMS) at Redstone Arsenal. Planned and executed the production transition of the Area Denial Artillery Munition (ADAM) projectile download line at McAlester Army Ammunition Plant (MCAAP). Continued testing in support of the capability assessment for the Static Detonation Chamber (SDC) project at Anniston Munitions Center (ANMC). Awarded a contract for the Castalia Demil Demonstration and initiated project work in Greece; began testing the Castalia Demil system. Initiated the cluster bomb unit (CBU) 100 (also called MK 20 Rockeye) download capability project at Crane Army Ammunition Activity (CAAA). Initiated the engine starter cartridge project at MCAAP. Completed the Limited Rate Initial Production LRIP II test on the Munitions Cryofracture Destruction Facility (MCDF) located at MCAAP."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.967"
                                            },
                                            "Text": {
                                                "val": "Conduct the ARMD TTC LRIP and transition operations to LEMC.  Execute transition of MCDF capability to MCAAP.  Analyze the results of the SDC capability assessment and conduct an analysis of alternatives; plan and initiate Phase II SDC project.  Analyze the results of the Castalia Demil assessment and conduct an analysis of alternatives; plan and initiate Phase II Castalia Demil project.  Begin fabrication of Rockeye download equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.209"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.209"
                                            },
                                            "Text": {
                                                "val": "Will conduct the final transition of LEMC ARMD resulting in Initial Operational Capability (IOC).  Will complete the Final Design for the Multiple Rocket Motor (MRM) Upgrade to the LEMC ARMD.  Initiate Equipment Installation on the Multiple Rocket Motor (MRM) to the LEMC ARMD.  Will conduct the Operational Demonstration for the MCDF.  Will complete the MCDF transition to IOC. Complete fabrication and begin install of Rockeye download equipment at CAAA. Conduct an operational demonstration of the Rockeye Download Equipment. Will complete Phase I operational testing of the Engine Starter Cartridge at MCAAP and initiate design of Phase II Engine Starter Cartridge equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resource Recovery and Recycling (R3)"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on enhancing existing methods of munitions R3."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Awarded a contract and began the design of segmenting and washout equipment for 16-inch Navy gun projectiles at CAAA to make the projectile shells available for recycle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.940"
                                            },
                                            "Text": {
                                                "val": "Design, fabricate and install equipment for the 16-inch Navy Gun projectile washout line at CAAA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.620"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.620"
                                            },
                                            "Text": {
                                                "val": "Will conduct the factory acceptance testing for washout equipment for 16-inch Navy Gun projectiles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Removal"
                                    },
                                    "Description": {
                                        "val": "This effort develops technology to remove propellant and energetics from munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.741"
                                            },
                                            "Text": {
                                                "val": "Initiated the operational demonstration of the Red Phosphorus (RP) demil line at CAAA.  Planned and initiated a closed disposal project for 155mm Copperhead Munitions at MCAAP."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.875"
                                            },
                                            "Text": {
                                                "val": "Will prove out a closed disposal capability for 155mm Copperhead Munitions at MCAAP."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.175"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.175"
                                            },
                                            "Text": {
                                                "val": "Will initiate design modifications and build fixturing for the RP Demil line at CAAA.   Will develop a Design for a capability to demil infrared (IR) munitions at CAAA. Transition the Copperhead Munitions Closed Disposal process at MCAAP."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Waste Stream Treatment"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on handling waste streams from munitions items."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.206"
                                            },
                                            "Text": {
                                                "val": "Initiated an analysis of alternatives (AoA) for organic incineration of CS gas (or tear gas).  Initiated a project to develop an upgraded feed system on a rotary kiln."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.850"
                                            },
                                            "Text": {
                                                "val": "Install the upgraded feed system on a rotary kiln incinerator at an organic location to be determined as per RKPI planning.  Plan and initiate a closed disposal project for CS gas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.976"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.976"
                                            },
                                            "Text": {
                                                "val": "Will assemble major components and conduct operational demonstration of the upgraded feed system on a rotary kiln incinerator at an organic location.  Will conduct testing on CS Gas munitions to verify analytical estimates to thermally treat CS gas and provide a final report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Munitions Disassembly"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing innovative and efficient processes to disassemble munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.424"
                                            },
                                            "Text": {
                                                "val": "Continued planning for Rockeye Munitions demil capability project; developed an AoA to integrate the preprocessing Cryofracture capability of Rockeye Munitions with thermal processing in the rotary kiln at CAAA.  Finalized installation of CBU-87 download hardware, conducted demonstration\/ validation (dem\/val) and completed the IOC of CBU-87 demil capability to include open detonation of submunitions at Hawthorne Army Depot (HWAD).  Planned transition of production demil process for Liquid Rocket-62 (LR-62) Bullpup motors at ANMC.  Conducted dem\/val of the Demilitarization by Induction Heating Meltout (DIHMES) capability on 60mm mortar bodies loaded with Composition B at HWAD.  Planned and initiated a size reduction project for reactive armor tiles to facilitate thermal treatment feeds."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.011"
                                            },
                                            "Text": {
                                                "val": "Finalize design for FASCAM capability, and begin fabrication and installation at CAAA.  Design, fabricate and install size reduction hardware and conduct dem\/val of size reduction hardware for Reactive Armor Tiles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.604"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.604"
                                            },
                                            "Text": {
                                                "val": "Will complete the Design for a capability to Cryofracture Rockeye Munitions with thermal processing in the rotary kiln at CAAA. Will initiate equipment installation for a Rockeye Demil Capability at CAAA.  Planned transition of production demil process for Liquid Rocket-62 (LR-62) Bullpup motors at ANMC. Will install equipment to conduct Reactive Armor Tile Thermal Treatment and disposal. Will conduct an Operational Demonstration of size reduction of reactive armor tiles to facilitate thermal treatment\/disposal. Will transition an Initial Capability for Size Reduction of Reactive Armor Tiles.  Develop a Design for D561\/D562 155mm ICM Project Demil. Fabricate and Install equipment for D561\/D562 ICM Demil at a Depot location.  Will develop a Design for disassembly of MK46 Torpedoes at HWAD."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}