{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-53",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605051A"
        },
        "ProgramElementTitle": {
            "val": "Aircraft Survivability Development"
        },
        "R1LineNumber": {
            "val": "133"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "77.395"
            },
            "CurrentYear": {
                "val": "124.243"
            },
            "BudgetYearOne": {
                "val": "60.979"
            },
            "BudgetYearOneBase": {
                "val": "30.879"
            },
            "BudgetYearOneOCO": {
                "val": "30.100"
            },
            "BudgetYearTwo": {
                "val": "10.362"
            },
            "BudgetYearThree": {
                "val": "8.870"
            },
            "BudgetYearFour": {
                "val": "9.306"
            },
            "BudgetYearFive": {
                "val": "15.808"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Funds from projects EE3 (A\/C Surv Equip Dev) and EE4 (Common Missile Warning System (CMWS)), Program Element (PE) 0605035A (Common Infrared Countermeasures (CIRCM)) are restructured to projects ER7 (Aircraft Survivability Equipment Development) and ER8 (Common Missile Warning System (CMWS)) respectively, PE 0605051A (Aircraft Survivability Development) for Fiscal Year (FY) 2016 and beyond for more efficient and effective program management."
        },
        "ProgramElementMissionDescription": {
            "val": "The Aircraft Survivability Development budget line includes Aircraft Survivability Equipment Development (ER7) and Common Missile Warning System (ER8). This budget line also includes funding for Joint Urgent Operational Needs Statement (JUONS) SO-0010 Phase 2a, Headquarters Department of the Army (HQDA) Directed Requirement for the Advanced Threat Warner and Common Infrared Countermeasures Quick Reaction Capability (ATW & CIRCM QRC), and the next generation missile warning system.\n\nER7: Aircraft Survivability Development.\nThe objective of the Aircraft Survivability Equipment (ASE) Development project is to improve Radio Frequency (RF) ASE for Army aviation. The APR-39 Radar Warning Receiver (RWR) detects, categorizes, and prioritizes RF emitters and provides a visual \/ aural alert to aircrew members warning them of targeting by RF-guided weapons. The Milestone Decision Authority (MDA) approved Phases 1 and 2 of a 3-phased path forward. \n\nPhase 1 serves as an obsolescence \/ sustainment upgrade to the Processor Line Replaceable Unit (LRU) of the AN\/APR-39A(V) RWR implemented to ensure that the currently fielded system remains viable until an affordable improved RF ASE capability can be pursued in Phases 2 and 3. \n\nPhase 2, RWR Modernization, adopts the ongoing United States Navy Class I RWR Engineering Change Proposal (ECP), commonly referred to as the APR-39D(V)2 system. APR-39D(V)2 will significantly improve the RF threat coverage, automatic detection and identification of threat types, bearing, and lethality. Under Phase 2, the Army will develop enhancements to the APR-39D(V)2 as hardware upgrades needed to keep the APR-39D(V)2 technically relevant and address emerging Low Probability Intercept (LPI) and frequency agile threats. \n\nPhase 3 adds active Electronic Countermeasures (ECM) jamming capability for selected aircraft; Materiel Development Decision (MDD) for this ECM jamming capability phase is not expected until later in the Future Years Defense Program (FYDP).\n\nJustification: Fiscal Year (FY) 2018 Base RDT&E funding of $26.165 million supports RWR software improvements and ECP development.\n\nER8: Common Missile Warning System (CMWS).\nThe US Army operational requirements concept for Aviation Infrared (IR) countermeasure systems is known as the Suite of Integrated Infrared Countermeasures (SIIRCM). SIIRCM is an integrated warning and countermeasure system to enhance aircraft survivability against IR-guided threat missile systems. The CMWS is a core element of the SIIRCM concept. CMWS is an integrated ultraviolet (UV) missile warning system, with an Improved Countermeasure Dispenser (ICMD) serving as a subsystem to a host aircraft. \n\nThe CMWS program is a UV missile warning system that cues both flare and laser-based countermeasures to defeat incoming IR-seeking missiles and will alert aircrews to the presence of certain incoming unguided munitions. The B-Kit consists of the components which perform the missile detection and aircrew notification, unguided munitions detection and aircrew notification, false alarm rejection, and countermeasure employment\/cueing functions of the system. The CMWS Electronic Control Unit (ECU) receives UV missile detection data from Electro-Optic Missile Sensors (EOMS) and sends a missile alert signal to warn aircrews via on-board avionics. Tier 1 threat missiles detected and tracked by the CMWS are subsequently defeated by a combination of missile seeker countermeasures, including decoy flares and IR Laser Jamming (currently Advanced Threat Infrared Countermeasures (ATIRCM)-equipped CH-47 platform only). In addition, the CMWS ECU receives from the EOMS unguided munitions detection data which it also passes to the aircrew through aural and visual alerts. The aircrew then applies the appropriate Tactics, Techniques and Procedures (TTPs) to break contact or engage the enemy with own-ship ordnance. The CMWS Generation 3 (Gen 3) ECU in conjunction with ongoing software development efforts will address outstanding materiel release conditions to achieve a Full Materiel Release (FMR) for CMWS and ensure protection against emerging IR-guided missile threats. \n\nThe A-Kit for CMWS includes mounting hardware, wiring harnesses, cables, and other components necessary to install and interface the mission kit on host aircraft. The A-Kit ensures the mission kit is functionally and physically operational with a specific host aircraft type.\n\nJUONS SO-0010 will integrate the Department of the Navy Large Aircraft Infrared Countermeasure (DoN LAIRCM) system on a select number of Army and SOCOM aircraft in the threat area of responsibility. The purpose of this JUONS is to detect and defeat proliferate Surface-to-Air Missiles (SAM) threats. HQDA has provided a follow up Directed Requirement to this JUONS to reduce Space, Weight and Power (SWaP) and accelerate delivery of Common Infrared Countermeasures (CIRCMs).\n\nJustification:\nCMWS: FY 2018 Base Research, Development, Test, and Evaluation (RDTE) dollars in the amount of $4.714 million fund development engineering of the Threat Analysis Database (TAD) and future sensor and algorithm analysis. \n\nATW & CIRCM QRC: FY 2018 OCO RDTE dollars in the amount of $30.100 million fund integration efforts to support the Advanced Threat Warner and Common Infrared Countermeasure Quick Reaction Capability (ATW & CIRCM QRC) in support of JUONS SO-0010 for the OIR theater of operations. \n\nJoint Staff, J-8 Deputy Director for Requirements (DDR) memorandum, April 24, 2015\nSOCOM JUONs SO-0010, Joint Rapid Acquisition Cell (JRAC) memorandum, May 29, 2015\nDirected Requirement for the Advanced Threat Warner and Common Infrared Countermeasure Quick Reaction Capability (ATW & CIRCM QRC) to Support Joint Urgent Operational Need (JUON) SO-0010, CIRCM Critical Intelligence Parameters Breach, 18 December 2015"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "78.112"
                },
                "CurrentYear": {
                    "val": "114.243"
                },
                "BudgetYearOne": {
                    "val": "98.447"
                },
                "BudgetYearOneBase": {
                    "val": "98.447"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "77.395"
                },
                "CurrentYear": {
                    "val": "124.243"
                },
                "BudgetYearOne": {
                    "val": "60.979"
                },
                "BudgetYearOneBase": {
                    "val": "30.879"
                },
                "BudgetYearOneOCO": {
                    "val": "30.100"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.717"
                },
                "CurrentYear": {
                    "val": "10.000"
                },
                "BudgetYearOne": {
                    "val": "-37.468"
                },
                "BudgetYearOneBase": {
                    "val": "-67.568"
                },
                "BudgetYearOneOCO": {
                    "val": "30.100"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.717"
                                },
                                "CurrentYear": {
                                    "val": "10.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-37.468"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-67.568"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "30.100"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funds were added due to emerging Man Portable Air Defense System (MANPADS) threat and Senior Leader and congressional interest in closing the gap between JUONS efforts and next Program of Record (PoR).\n\n$55.810 million was transferred from PE 0605051A ASD project ER8 CMWS to PE 0605049A MWSM project XT4 ATDS in FY18 for more efficient and effective program management.."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "ER7"
                    },
                    "ProjectTitle": {
                        "val": "Aircraft Survivability Equipment Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.516"
                        },
                        "CurrentYear": {
                            "val": "26.815"
                        },
                        "BudgetYearOne": {
                            "val": "26.165"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.165"
                        },
                        "BudgetYearTwo": {
                            "val": "5.797"
                        },
                        "BudgetYearThree": {
                            "val": "4.310"
                        },
                        "BudgetYearFour": {
                            "val": "3.940"
                        },
                        "BudgetYearFive": {
                            "val": "8.750"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funds from project EE3 (A\/C Surv Equip Dev), Program Element (PE) 0605035A (Common Infrared Countermeasures (CIRCM)) are restructured to project ER7 (Aircraft Survivability Equipment Development), PE 0605051A (Aircraft Survivability Development) for Fiscal Year (FY) 2016 and beyond for more efficient and effective program management."
                        },
                        "ProjectMissionDescription": {
                            "val": "The objective of the Aircraft Survivability Equipment (ASE) Development project is to improve Radio Frequency (RF) ASE for Army aviation. The APR-39 Radar Warning Receiver (RWR) detects, categorizes, and prioritizes RF emitters and provides a visual \/ aural alert to aircrew members warning them of targeting by RF-guided weapons. The Milestone Decision Authority (MDA) approved Phases 1 and 2 of a 3-phased path forward. \n\nPhase 1 serves as an obsolescence \/ sustainment upgrade to the Processor Line Replaceable Unit (LRU) of the AN\/APR-39A(V) RWR implemented to ensure that the currently fielded system remains viable until affordable improved RF ASE capability can be pursued in Phases 2 and 3. \n\nPhase 2, RWR Modernization, adopts the ongoing United States Navy Class I RWR Engineering Change Proposal (ECP), commonly referred to as the APR-39D(V)2 system. APR-39D(V)2 will significantly improve the RF threat coverage, automatic detection and identification of threat types, bearing, and lethality. Under Phase 2, the Army will develop enhancements to the APR-39D(V)2 as hardware upgrades needed to keep the APR-39D(V)2 technically relevant and address emerging Low Probability Intercept (LPI) and frequency agile threats. \n\nPhase 3 adds active Electronic Countermeasures (ECM) jamming capability for selected aircraft; Materiel Development Decision (MDD) for this ECM jamming capability phase is not expected until later in the Future Years Defense Program (FYDP).\n\nJustification: Fiscal Year (FY) 2018 Base RDT&E funding of $26.165 million supports RWR software improvements and ECP development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Phase 2 Radio Frequency Countermeasure (CM)"
                                    },
                                    "Description": {
                                        "val": "Phase 2 Product Development (Digital RWR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.516"
                                            },
                                            "Text": {
                                                "val": "Will fund RWR software development and emerging threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.815"
                                            },
                                            "Text": {
                                                "val": "Will fund Product Development - RWR software development and SIL updates, Support Costs - Contractor Support and Matrix Support; Test and Evaluation - Multi-Service Developmental Testing\/Operational Testing (DT\/OT) and Government System Test and Evaluation; and Management Services - Threat Management and Project Management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.165"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.165"
                                            },
                                            "Text": {
                                                "val": "Will fund software improvement and ECP development, platform integration, Government Test and Evaluation and Support\/Management services."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "AZ3511"
                                    },
                                    "Title": {
                                        "val": "Radio Frequency CM (AZ3511)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.730"
                                        },
                                        "CurrentYear": {
                                            "val": "50.425"
                                        },
                                        "BudgetYearOne": {
                                            "val": "57.743"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "57.743"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.997"
                                        },
                                        "BudgetYearThree": {
                                            "val": "94.897"
                                        },
                                        "BudgetYearFour": {
                                            "val": "72.238"
                                        },
                                        "BudgetYearFive": {
                                            "val": "95.531"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Army RF ASE is managed by Project Manager ASE (PM ASE) for development, testing, procurement, integration and installation on Army rotary wing and small fixed wing aviation platforms. PM ASE proposed a three-phased path forward commensurate with user priorities and affordability considerations. The Milestone Decision Authority (MDA) approved Phases 1 and 2 of a 3-phased path forward.\n\nPhase 1 addresses obsolescence\/Diminishing Manufacturing Sources (DMS) issues associated with the currently fielded AN\/APR-39A(V) RWR via sole source ECP awarded to the APR-39A manufacturer. \n\nPhase 2 adopts the on-going United States Navy (USN) RWR Class I Correction of Deficiencies ECP commonly referred to as the APR-39D(V)2 system, limiting service-unique design, test, and integration expenses. Full Army participation throughout the remaining development, testing, procurement, fielding, and sustainment of the APR-39D(V)2 Digital RWR will address the significant Army RF capability gap while avoiding additional costs associated with a single-Service solution. This multi-Service approach also fields an effective and suitable material solution sooner to support the re-balance of the National Defense Strategy to the RF threat-heavy Asia-Pacific Region and European Region. \n\nPhase 3 will develop and integrate active Electronic Countermeasures jamming capability for select aircraft."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Threat Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.833"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.006"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.282"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.284"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.284"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.429"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.253"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.258"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.258"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Digital Radar Warning Receiver (RWR)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lab Demo \/ Study"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.634"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "S\/W Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OGA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Grounds, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.498"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.539"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15.705"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "23.955"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "23.955"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SIL Updates"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "I2WD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Grounds, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.726"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.814"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Depot Standup"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tobyhanna"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tobyhanna, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.052"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.052"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Platform Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.844"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.672"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.036"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.036"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contractor Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.803"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.329"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.206"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.503"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.503"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.430"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.370"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.117"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Multi-Service DT\/OT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.582"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.405"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.255"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.379"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.379"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government System Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.916"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.195"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.183"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.750"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.750"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-93.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 DT\/OT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 Platform Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 Initial Procurement Cut-In"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 Procurement\/Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 FUE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Emerging Threats\/SIL Updates"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 Procurement Transition"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ER8"
                    },
                    "ProjectTitle": {
                        "val": "Common Missile Warning System (CMWS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "62.879"
                        },
                        "CurrentYear": {
                            "val": "97.428"
                        },
                        "BudgetYearOne": {
                            "val": "34.814"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.714"
                        },
                        "BudgetYearOneOCO": {
                            "val": "30.100"
                        },
                        "BudgetYearTwo": {
                            "val": "4.565"
                        },
                        "BudgetYearThree": {
                            "val": "4.560"
                        },
                        "BudgetYearFour": {
                            "val": "5.366"
                        },
                        "BudgetYearFive": {
                            "val": "7.058"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "216.670"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funds from project EE4 (Common Missile Warning System (CMWS)), Program Element (PE) 0605035A (Common Infrared Countermeasures (CIRCM)) are restructured to project ER8 (Common Missile Warning System (CMWS)), PE 0605051A (Aircraft Survivability Development) for Fiscal Year (FY) 2016 and beyond for more efficient and effective program management."
                        },
                        "ProjectMissionDescription": {
                            "val": "The US Army operational requirements concept for Aviation Infrared (IR) countermeasure systems is known as the Suite of Integrated Infrared Countermeasures (SIIRCM). SIIRCM is an integrated warning and countermeasure system to enhance aircraft survivability against IR-guided threat missile systems. The CMWS is a core element of the SIIRCM concept. CMWS is an integrated ultraviolet (UV) missile warning system, with an Improved Countermeasure Dispenser (ICMD) serving as a subsystem to a host aircraft. \n\nThe CMWS program is a UV missile warning system that cues both flare and laser-based countermeasures to defeat incoming IR-seeking missiles and will alert aircrews to the presence of certain incoming unguided munitions. The B-Kit consists of the components which perform the missile detection and aircrew notification, unguided munitions detection and aircrew notification, false alarm rejection, and countermeasure employment\/cueing functions of the system. The CMWS Electronic Control Unit (ECU) receives UV missile detection data from Electro-Optic Missile Sensors (EOMS) and sends a missile alert signal to warn aircrews via on-board avionics. Tier 1 threat missiles detected and tracked by the CMWS are subsequently defeated by a combination of missile seeker countermeasures, including decoy flares and IR Laser Jamming (currently Advanced Threat Infrared Countermeasures (ATIRCM)-equipped CH-47 platform only). In addition, the CMWS ECU receives from the EOMS unguided munitions detection data which it also passes to the aircrew through aural and visual alerts. The aircrew then applies the appropriate Tactics, Techniques and Procedures (TTPs) to break contact or engage the enemy with own-ship ordnance. The CMWS Generation 3 (Gen 3) ECU in conjunction with ongoing software development efforts will address outstanding materiel release conditions to achieve a Full Materiel Release (FMR) for CMWS and ensure protection against emerging IR-guided missile threats. \n\nThe A-Kit for CMWS includes mounting hardware, wiring harnesses, cables, and other components necessary to install and interface the mission kit on host aircraft. The A-Kit ensures the mission kit is functionally and physically operational with a specific host aircraft type.\n\nJoint Urgent Operational Needs Statement (JUONS) SO-0010 will integrate the Department of the Navy Large Aircraft Infrared Countermeasure (DoN LAIRCM) system on a select number of Army and Special Operations Command (SOCOM) aircraft in the threat area of responsibility. The purpose of this JUONS is to detect and defeat proliferate Surface-to-Air Missiles (SAM) threats. Headquarters Department of the Army (HQDA) has provided a follow up Directed Requirement to this JUONS to reduce Space, Weight and Power (SWaP) and accelerate delivery of Common Infrared Countermeasures (CIRCMs).\n\nJustification: \nCMWS: FY 2018 Base Research, Development, Test, and Evaluation (RDTE) dollars in the amount of $4.714 million fund development engineering of the Threat Analysis Database (TAD) and future sensor and algorithm analysis. \n\nATW & CIRCM QRC: FY 2018 Overseas Contingency Operations (OCO) RDTE dollars in the amount of $30.100 million fund integration efforts to support the Advanced Threat Warner and Common Infrared Countermeasure Quick Reaction Capability (ATW & CIRCM QRC) in support of JUONS SO-0010 for the OIR theater of operations. \n\nJoint Staff, J-8 Deputy Director for Requirements (DDR) memorandum, April 24, 2015\nSOCOM JUONS SO-0010, Joint Rapid Acquisition Cell (JRAC) memorandum, May 29, 2015\nDirected Requirement for the Advanced Threat Warner and Common Infrared Countermeasure Quick Reaction Capability (ATW & CIRCM QRC) to Support Joint Urgent Operational Need (JUON) SO-0010, CIRCM Critical Intelligence Parameters Breach, 18 December 2015"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "JUONS SO-0010 Phase 2a Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "43.300"
                                        },
                                        "Text": {
                                            "val": "FY 2016 Base RDTE dollars in the amount of $43.300 million will fund Product Development – JUONS SO-0010 Phase 2a Prime Contractor – Integration Engineering and JUONS SO-0010 Phase 2a Aircraft Integration; and Management Services – JUONS SO-0010 Phase 2a Systems Engineering Program Management."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ATW & CIRCM QRC Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "16.700"
                                        },
                                        "Text": {
                                            "val": "Begin ATW & CIRCM QRC development and qualification of the new Army ATW processor and the ATW transfer alignment function.  Funding will also begin software integration with the current ATW processor.  Efforts will also begin on A-Kit development\/Integration.  Efforts will also include Army systems engineering and program management efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CMWS Product Development and Management Services"
                                    },
                                    "Description": {
                                        "val": "RDTE funding supports continuing development engineering of the TAD, salaries, and integration with other ASE Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.879"
                                            },
                                            "Text": {
                                                "val": "FY 2016 Base RDTE dollars in the amount of $2.997 million will fund Product Development – TAD; and Management Services – CMWS Systems Engineering Program Management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.318"
                                            },
                                            "Text": {
                                                "val": "FY 2017 Base RDTE dollars in the amount of $4.318 million will fund Product Development - TAD and Future Sensor and Algorithm Analysis; and Management Services - CMWS Systems Engineering Program Management. FY 2017 Base RDTE dollars in the amount of $20.000 million will fund Product Development - Advanced Missile Warning System Development Engineering; and Management Services – CMWS Systems Engineering Program Management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.714"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.714"
                                            },
                                            "Text": {
                                                "val": "FY 2018 Base RDTE dollars in the amount of $4.714 million will fund Product Development - TAD and Future Sensor and Algorithm Analysis; and Management Services - CMWS Systems Engineering Program Management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JUONS SO-0010 Phase 2a OCO"
                                    },
                                    "Description": {
                                        "val": "JUONS Phase 2a will integrate the Department of the Navy Large Aircraft Infrared Countermeasure (DoN LAIRCM) system on a select number of aircraft in the threat area of responsibility."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.510"
                                            },
                                            "Text": {
                                                "val": "blank"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ATW & CIRCM QRC OCO"
                                    },
                                    "Description": {
                                        "val": "ATW\/CIRCM QRC will displace JUONS Phase 2a to achieve reduction in SWaP."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "61.600"
                                            },
                                            "Text": {
                                                "val": "blank"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "There is no FY18 Base funding for this effort."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "30.100"
                                            },
                                            "Text": {
                                                "val": "Continue development and qualification of the new Army ATW processor and the ATW transfer alignment function. Complete software integration with the current ATW processor and begin the software integration with the new Army ATW processor. Continue QRC A-Kit development\/Integration efforts for UH-60M, UH-60L, HH-60M, CH-47F, AH-64E, MH-47G and MH-60M. Funding will also support the modification of the JUONS SO-0010 Phase 2a A-Kit to accommodate the new Army ATW processor and CIRCM on all aircraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APA Funding:"
                                    },
                                    "Title": {
                                        "val": "SSN AZ3517; BA4; CMWS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "104.348"
                                        },
                                        "CurrentYear": {
                                            "val": "97.741"
                                        },
                                        "BudgetYearOne": {
                                            "val": "126.745"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.225"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "89.520"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "32.719"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.775"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.917"
                                        },
                                        "BudgetYearFive": {
                                            "val": "61.000"
                                        },
                                        "CostToComplete": {
                                            "val": "69.608"
                                        },
                                        "TotalCost": {
                                            "val": "521.853"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "CMWS: The acquisition strategy includes buying CMWS B-Kits to support fielding requirements and installation of A-Kits on all modernized aircraft. The previous CMWS production contract was a firm fixed-priced (FFP), Indefinite Delivery, Indefinite Quantity (IDIQ) contract. A FFP bridge contract was awarded March 2013 for CMWS hardware. The follow-on CMWS production FFP\/Cost Plus Fixed Fee (CPFF) IDIQ contract is a 3 year firm fixed price contract to procure the remaining Generation 3 Electronic Control Unit (ECU) and A-Kits and was awarded SEP 2013. The Gen 3 ECU, which provides increased processing capacity and enables unguided munitions detection, became a part of the system in FY 2010; First Unit Equipped (FUE) for the Gen 3 ECU was achieved in Operation Enduring Freedom (OEF) on 18 September 2013. All aircraft deployed to OEF have received the new processor with hostile fire detection capability. Gen 3 ECUs will gradually replace all Gen 2 ECUs across the Aviation fleet between now and 2017.\n\nJUONS Phase 2a and ATW & CIRCM QRC: JUONS SO-0010 acquisition strategy includes aircraft prime contractor engineering support contracted to a Government test organization. Aircraft integration for JUONS will be handled through government operated organizations and industry partners."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CMWS Systems Engineering Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "PM ASE, HSV, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.800"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.339"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.387"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.370"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.370"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Advanced Missile Warning System Systems Engineering Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JUONS SO-0010 Phase 2a Systems Engineering Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "PM ASE, HSV, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.317"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.310"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.627"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ATW & CIRCM QRC Systems Engineering Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "PM ASE, HSV, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.544"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CMWS tier 2\/3 Upgrades"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Threat Analysis Database Design"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.455"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Threat Analysis Database (TAD)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.874"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.543"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.131"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.188"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.188"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Enhanced Sensor Study & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.466"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.466"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Data Modeling"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.688"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Future Sensor and Algorithm Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.800"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.156"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.156"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Prime Contractor--Integration Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD,TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.787"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Aircraft Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "19.974"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Software"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Advanced Missile Warning System Development Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "18.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "18.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JUONS SO-0010 Phase 2a Prime Contractor -- Integration Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.742"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.200"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.942"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JUONS SO-0010 Phase 2a Software"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.534"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.534"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JUONS SO-0010 Phase 2a Training"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.200"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ATW & CIRCM QRC Development Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "5.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.100"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ATW & CIRCM QRC ATW System Development and Qualification"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "29.453"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "26.788"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ATW & CIRCM QRC Aircraft Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.442"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "25.548"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CMWS Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.156"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JUONS SO-0010 Phase 2a Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "21.709"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "26.709"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ATW & CIRCM QRC Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.720"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "24.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "24.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160785-94.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "CMWS System Dev\/Tier 2 and 3 Upgrades (TAD Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CMWS Gen 3 Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CMWS Future Sensor and Algorithm Analysis"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JUONS SO-0010 Phase 2a Contractor Logistics Support (Field Support)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JUONS SO-0010 Phase 2a Engineering, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ATW & CIRCM QRC Engineering, Integration, and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}