{
    "id": "2018-Navy-PB-1319-MJBOOK-4-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-15",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0204574N"
        },
        "ProgramElementTitle": {
            "val": "Cryptologic Direct Support"
        },
        "R1LineNumber": {
            "val": "211"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "19.754"
            },
            "PriorYear": {
                "val": "1.915"
            },
            "CurrentYear": {
                "val": "1.122"
            },
            "BudgetYearOne": {
                "val": "2.355"
            },
            "BudgetYearOneBase": {
                "val": "1.155"
            },
            "BudgetYearOneOCO": {
                "val": "1.200"
            },
            "BudgetYearTwo": {
                "val": "2.328"
            },
            "BudgetYearThree": {
                "val": "2.362"
            },
            "BudgetYearFour": {
                "val": "2.378"
            },
            "BudgetYearFive": {
                "val": "2.427"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Cryptologic Systems Engineering - The Cryptologic Carry-on Program develops state-of-the-art signal acquisition systems and software in response to Combatant Command requirements for a quick-reaction surface cryptologic carry-on capability. There are 124 cryptologic capable surface ships and shore sites in the current Navy inventory; each of these is a potential user of this carry-on equipment, depending on deployment schedules and the tempo of operations. In addition, numerous other Navy and Coast Guard platforms are potential users."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.915"
                },
                "CurrentYear": {
                    "val": "1.122"
                },
                "BudgetYearOne": {
                    "val": "1.236"
                },
                "BudgetYearOneBase": {
                    "val": "1.236"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.915"
                },
                "CurrentYear": {
                    "val": "1.122"
                },
                "BudgetYearOne": {
                    "val": "2.355"
                },
                "BudgetYearOneBase": {
                    "val": "1.155"
                },
                "BudgetYearOneOCO": {
                    "val": "1.200"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.119"
                },
                "BudgetYearOneBase": {
                    "val": "-0.081"
                },
                "BudgetYearOneOCO": {
                    "val": "1.200"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.115"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.085"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "1.200"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.004"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3091"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Cryptological Sys Eng (CCOP)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.754"
                        },
                        "PriorYear": {
                            "val": "1.915"
                        },
                        "CurrentYear": {
                            "val": "1.122"
                        },
                        "BudgetYearOne": {
                            "val": "2.355"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.155"
                        },
                        "BudgetYearOneOCO": {
                            "val": "1.200"
                        },
                        "BudgetYearTwo": {
                            "val": "2.328"
                        },
                        "BudgetYearThree": {
                            "val": "2.362"
                        },
                        "BudgetYearFour": {
                            "val": "2.378"
                        },
                        "BudgetYearFive": {
                            "val": "2.427"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Advanced Cryptologic Systems Engineering - Cryptologic Carry On Program (CCOP) develops state-of-the-art signal acquisition systems and software in response to Combatant Command requirements for a quick-reaction surface, subsurface and airborne cryptologic carry-on capability. There are approximately 124 cryptologic capable surface ships and shore sites in the current Navy inventory; each is a potential user of this carry-on equipment, depending on deployment schedules and the tempo of operations. In addition, there are numerous subsurface and air platforms that are also potential users. This funding line will provide the resources to enable rapid transition of available Commercial Off-The-Shelf (COTS) and Government Off -The-Shelf (GOTS) technologies that apply to Fleet requirements for carry-on system functionalities. These technologies typically require various levels of integration to leverage on-board systems that provide system and mission management, product reporting, and data analysis. COTS\/GOTS system documentation and training materials usually require adaptation or modification to meet fleet operator requirements, or entirely new training materials may need to be developed. Before deployment for operational use, systems must be systematically tested to ensure suitable and reliable operation, tested for network vulnerabilities if connected to shipboard Local Area Networks, and tested relative to interoperability requirements. Certification testing is conducted to meet Office of Naval Intelligence security requirements, and network testing is conducted in accordance with Information Technology (IT) requirements to allow connection to Navy networks. Funding will also provide resources to address rapid deployment of enhancements or improvements to the common hardware and\/or software baseline of all other carry-on subsystems to meet emergent requirements. \n\nFunding will support development and integration efforts to fuse data produced and distributed by Shipboard IW\/Information Operations (IO) systems with other intelligence data at multiple classification levels and provided to shipboard combat systems to support kinetic and non-kinetic fires and can also be used to enable a more complete understanding and more agile and effective exploitation of the electromagnetic spectrum.\n\nFY18 funds will continue to integrate, test, and document identified COTS and GOTS technologies and subsystems that meet emergent and on-going Fleet requirements as specified in the Signals of Interest (SOI) and target threat list. Funds will continue to develop upgrades to existing systems and subsystems according to Fleet requirements. Funds will aid the development of new signal processing algorithms and software based solutions to enable rapid transition to permanently installed Ship's Signal Exploitation Space (SSES) systems, the research of self contained small form factor systems for Patrol craft and other small units, and the research of Adaptive Mission Modules for rapid insertion to counter specific threats or provide intelligence in specific areas of operation.\n\n\nFY18 OCO funds will develop target signal files in order to counter the latest threats. New threat signal files must be developed and fielded to forward deployed platforms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Cryptological Sys Eng - CCOP"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.915"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to integrate, test and document identified COTS and GOTS technologies and subsystems that met emergent and on-going Fleet requirements as specified in the SOI and targeted threat list. Continued to develop upgrades to existing systems and subsystems according to Fleet requirements. Continued the development of new signal processing algorithms and software based solutions to enable rapid transition to permanently installed SSES systems and the research of self contained small form factor systems for Patrol craft and other small units. Continued to develop enhanced Red Falcon systems to combat future SOI."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.122"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to integrate, test and document identified Commercial Off-The-Shelf (COTS) and Government Off -The-Shelf (GOTS) technologies and subsystems that meet emergent and on-going Fleet requirements as specified in the Signals of Interest (SOI) and target threat list. Continue to develop upgrades to existing systems and subsystems according to Fleet requirements. Continue the development of new signal processing algorithms and software based solutions to enable rapid transition to permanently installed Ship's Signal Exploitation Space (SSES) systems and the research of self contained small form factor systems for Patrol craft and other small units. Continue to develop enhanced Red Falcon systems to combat future SOIs. Research Adaptive Mission Modules for specific threats\/areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.355"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.155"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to integrate, test and document identified COTS and GOTS technologies and subsystems that meet emergent and on-going Fleet requirements as specified in the SOI and target threat list. Continue to develop upgrades to existing systems and subsystems according to Fleet requirements. Continue the development of new signal processing algorithms and software based solutions to enable rapid transition to permanently installed Ship's Signal Exploitation Space (SSES) systems and the research of self-contained small form factor systems for Patrol craft and other small units. Continue to develop enhanced Red Falcon systems to combat future SOI. Continue to research Adaptive Mission Modules for specific threats\/areas."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 OCO funds will develop target signal files in order to counter the latest threats. New threat signal files must be developed and fielded to forward deployed platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN \/ 3501"
                                    },
                                    "Title": {
                                        "val": "Cryptologic Communications Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.433"
                                        },
                                        "CurrentYear": {
                                            "val": "21.098"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.767"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.487"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "2.280"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.748"
                                        },
                                        "BudgetYearThree": {
                                            "val": "25.808"
                                        },
                                        "BudgetYearFour": {
                                            "val": "29.236"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.158"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "229.802"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Acquisition, management, and contracting strategies are to support engineering and manufacturing development by providing funds to Space and Naval Warfare (SPAWAR) Systems Centers Atlantic and Pacific, and miscellaneous contractors with management oversight by SPAWAR."
                        },
                        "PerformanceMetrics": {
                            "val": "Cryptologic Carry On Program (CCOP) will deliver state-of-the-art signal acquisition software for CCOP systems in response to Combatant Command requirements for a quick-reaction surface, subsurface and airborne cryptologic carry-on capability."
                        }
                    }
                }
            ]
        }
    }
}