{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-10",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604633A"
        },
        "ProgramElementTitle": {
            "val": "Air Traffic Control"
        },
        "R1LineNumber": {
            "val": "90"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.714"
            },
            "CurrentYear": {
                "val": "3.421"
            },
            "BudgetYearOne": {
                "val": "3.536"
            },
            "BudgetYearOneBase": {
                "val": "3.536"
            },
            "BudgetYearTwo": {
                "val": "12.199"
            },
            "BudgetYearThree": {
                "val": "7.752"
            },
            "BudgetYearFour": {
                "val": "8.334"
            },
            "BudgetYearFive": {
                "val": "7.629"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds continuous efforts in the development of modernized tactical Air Traffic Control (ATC) systems that will enable safety of aircraft operations.  ATC systems are required to achieve or maintain compliance with civil, military, domestic and international ATC mandates and combat identification requirements.  Funding will be utilized to develop, evaluate and integrate technologies required to support ATC requirements.  Efforts funded include the Tactical Airspace Integration System (TAIS) web based architecture and Common Operating Environment (COE) initiatives, Air Traffic Navigation Integration and Coordination System (ATNAVICS) Modernization, Advanced Surveillance, the development of an ATC Tactical Network, the Mobile Tower System (MOTS) Preplanned Product Improvement (P3I) upgrades, and Tactical Terminal Control System (TTCS) modernization. \n\nTAIS, the Army's system of record for Airspace Control (AC) and enroute Air Traffic Services (ATS) within the Army Mission Command Information System (MCIS), requires the development and testing of web-based services for AC, and integration of these new web-based services into the TAIS common MCIS hardware, while meeting the COE standards.  Additional capabilities will be provided through advanced surveillance and mission planning interfaces.  TAIS efforts also include developing and testing improvements to the air picture including the addition of Blue Force Tracker correlation and radar fusion capability.  TAIS develops software and required hardware for AC web services to operate effectively in a dynamic net-centric interconnected environment.  TAIS also integrates advanced surveillance capabilities to further enhance airspace integration and dynamic management capabilities.  ATNAVICS is an Airport Surveillance Radar (ASR) and Precision Approach Radar (PAR) system that provides ATS at Army terminal airfields and landing sites at Division, Corps, and Echelons Above Corps to include services for Joint and Allied aircraft.  ATNAVICS will integrate Mode S capabilities required to control aircraft both Outside of the Continental United States (OCONUS) and Continental United States (CONUS).  ATNAVICS will network its radar picture and interrogator data (Mode S) to aviation and joint network nodes through TAIS.  ATNAVICS will undergo an effort to increase the range of the primary radar to 60 nautical miles.  As the Department of Defense transitions military aircraft to positional self-reporting technologies, the flight information will be captured by the Advanced Surveillance program.  Advanced Surveillance allows ATC reception of aircraft self-reporting data which includes the Automatic Dependent Surveillance Broadcast.  Advanced Surveillance integrates local radar feeds and self-reporting aircraft positional data into a correlated situational awareness air picture.  ATC Tactical Networking supports the non-recurring engineering, test and evaluation tasks necessary for the integration of the radios, control stations and transmitter\/receivers and software that will provide all ATC tactical systems an airfield network node capability.  This will enable each ATC system to send voice and data between ATC platforms including connectivity to an external network for long range flight-following and data exchange further reducing aviation operational risk by providing all ATC operators a common air picture.  ATC Networking is required to meet the Net Ready Key Performance Parameter for ATC tactical systems.  MOTS provides the Joint Force Commander or Combatant Commander a highly mobile, self-contained, integrated and reliable information system platform for visual and procedural aircraft deconfliction and aircrew force protection in unified action terminal airspace environments.  The Airfield Lighting System (ALS) is a component of the MOTS and can be operated by solar power or by generator power.  The ALS improvements include a Precision Approach Path Indicator and an ALS trailer charging system.  The TTCS is a mobile ATC communications system that provides initial ATS at remote landing sites and drop zones. It enables secure ground-to-air and ground-to-ground communications between Army aircraft, other services, Allied aircraft and ground stations. TTCS also provides aircraft separation and ground control capabilities, a meteorological measuring system for basic weather information, Blue Force Tracker which provides near real time situational awareness and precision location capability.  Future improvements include incorporating advance surveillance as risk mitigation by improving airspace situational awareness and providing an improved soldier interface that is common with other ATC systems.\n\nThe FY 2018 funding request was reduced by $3.374 million to account for the availability of prior year execution balances."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.076"
                },
                "CurrentYear": {
                    "val": "3.421"
                },
                "BudgetYearOne": {
                    "val": "6.749"
                },
                "BudgetYearOneBase": {
                    "val": "6.749"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.714"
                },
                "CurrentYear": {
                    "val": "3.421"
                },
                "BudgetYearOne": {
                    "val": "3.536"
                },
                "BudgetYearOneBase": {
                    "val": "3.536"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.362"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.213"
                },
                "BudgetYearOneBase": {
                    "val": "-3.213"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.362"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.213"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.213"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2018 reflects funding adjustments for under-execution (-$3.374 million), inflation (+$0.156 million), and miscellaneous decrement (-$0.001 million)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "586"
                    },
                    "ProjectTitle": {
                        "val": "Air Traffic Control"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.714"
                        },
                        "CurrentYear": {
                            "val": "3.421"
                        },
                        "BudgetYearOne": {
                            "val": "3.536"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.536"
                        },
                        "BudgetYearTwo": {
                            "val": "12.199"
                        },
                        "BudgetYearThree": {
                            "val": "7.752"
                        },
                        "BudgetYearFour": {
                            "val": "8.334"
                        },
                        "BudgetYearFive": {
                            "val": "7.629"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds continuous efforts in the development of modernized tactical Air Traffic Control (ATC) systems that will enable safety of aircraft operations.  ATC systems are required to achieve or maintain compliance with civil, military, domestic and international ATC mandates and combat identification requirements.  Funding will be utilized to develop, evaluate and integrate technologies required to support ATC requirements.  Efforts funded include the Tactical Airspace Integration System (TAIS) web based architecture and Common Operating Environment (COE) initiatives, Air Traffic Navigation Integration and Coordination System (ATNAVICS) Modernization, the development of an ATC Tactical Network, the Mobile Tower System (MOTS) Preplanned Product Improvement (P3I) upgrades, and Tactical Terminal Control System (TTCS) modernization. \n\nTAIS, the Army's system of record for Airspace Control (AC) and enroute Air Traffic Services (ATS) within the Army Mission Command Information System (MCIS), requires the development and testing of web-based services for AC, and integration of these new web-based services into the TAIS common MCIS hardware, while meeting the COE standards.  Additional capabilities will be provided through advanced surveillance and mission planning interfaces.  TAIS efforts also include developing and testing improvements to the air picture including the addition of Blue Force Tracker correlation and radar fusion capability.  TAIS develops software and required hardware for AC web services to operate effectively in a dynamic net-centric interconnected environment.  TAIS also integrates advanced surveillance capabilities to further enhance airspace integration and dynamic management capabilities.  ATNAVICS is an Airport Surveillance Radar (ASR) and Precision Approach Radar (PAR) system that provides ATS at Army terminal airfields and landing sites at Division, Corps, and Echelons Above Corps to include services for Joint and Allied aircraft.  ATNAVICS will integrate Mode S capabilities required to control aircraft both Outside of the Continental United States (OCONUS) and Continental United States (CONUS).  ATNAVICS will network its radar picture and interrogator data (Mode S) to aviation and joint network nodes through TAIS.  ATNAVICS will undergo an effort to increase the range of the primary radar to 60 nautical miles.  As the Department of Defense transitions military aircraft to positional self-reporting technologies, the flight information will be captured by the Advanced Surveillance program.  Advanced Surveillance allows ATC reception of aircraft self-reporting data which includes the Automatic Dependent Surveillance Broadcast.  Advanced Surveillance integrates local radar feeds and self-reporting aircraft positional data into a correlated situational awareness air picture.  ATC Tactical Networking supports the non-recurring engineering, test and evaluation tasks necessary for the integration of the radios, control stations and transmitter\/receivers and software that will provide all ATC tactical systems an airfield network node capability.  This will enable each ATC system to send voice and data between ATC platforms including connectivity to an external network for long range flight-following and data exchange further reducing aviation operational risk by providing all ATC operators a common air picture.  ATC Networking is required to meet the Net Ready Key Performance Parameter for ATC tactical systems.  MOTS provides the Joint Force Commander or Combatant Commander a highly mobile, self-contained, integrated and reliable information system platform for visual and procedural aircraft deconfliction and aircrew force protection in unified action terminal airspace environments.  The Airfield Lighting System (ALS) is a component of the MOTS and can be operated by solar power or by generator power.  The ALS improvements include a Precision Approach Path Indicator and an ALS trailer charging system.  The TTCS is a mobile ATC communications system that provides initial ATS at remote landing sites and drop zones. It enables secure ground-to-air and ground-to-ground communications between Army aircraft, other services, Allied aircraft and ground stations. TTCS also provides aircraft separation and ground control capabilities, a meteorological measuring system for basic weather information, Blue Force Tracker which provides near real time situational awareness and precision location capability.  Future improvements include incorporating advance surveillance as risk mitigation by improving airspace situational awareness and providing an improved soldier interface that is common with other ATC systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Airspace Integration System (TAIS)"
                                    },
                                    "Description": {
                                        "val": "TAIS Airspace Information Center (AIC), Common Operating Environment (COE) and Airspace Integration Improvements Initiative enhancements will be addressed through upgrades to the communications suite through new components such as 117G radios, BFT2\/KGV-72, and ADS-B.   TAIS develops software and required hardware for airspace management web services to operate effectively in a dynamic net-centric interconnected COE environment.   TAIS will also integrate advanced surveillance interfaces and passive receiver to further enhance a dynamic airspace management capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.733"
                                            },
                                            "Text": {
                                                "val": "Continued development of sensor and data interfaces to Civil Aviation agencies in support of military and homeland defense Air Traffic Services and Airspace Management Command and Control.  In order to meet COE requirements, continued development of web services and service oriented architecture with Joint systems to facilitate Air Traffic services and Airspace Command and Control across DoD agencies, Federal agencies, COE and Allied Nations.   Continued to address Airspace Integration Improvements Initiative enhancements through upgrades to the communications suite through new components such as 117G radios, BFT2\/KGV-72 and ADS-B.  Continued to develop and refine interfaces to cooperative and non-cooperative sensor and self-reporting aircraft in support of Situational Awareness and airspace management and de-confliction.  Developed deployable web based capabilities to enable disconnected off grid operations via non-line-of-sight communications and disjoined edge user nodes in support of ATC and ATS.   Developed an embedded computer-based, Adaptive Learning Environment (ALE) to advance operator proficiency and adaptive decision-making capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.184"
                                            },
                                            "Text": {
                                                "val": "Continue to develop sensor and data interfaces to Civil Aviation agencies in support of military and homeland defense Air Traffic Services and Airspace Management Command and Control.   Continue to develop web services and service oriented architecture with Joint systems to facilitate Air Traffic services and Airspace Command and Control across DoD agencies, Federal agencies, COE and with Allied Nations.   Continue to develop dynamic mission updates and interfaces with Unmanned Aerial Systems and DoD\/Joint Air platforms for situational awareness.   Continue to develop and refine interfaces to cooperative and non-cooperative sensor and self-reporting aircraft in support of Situational Awareness and airspace management and de-confliction.  Develop rapidly deployable web based capabilities to enable disconnected off grid operations via non-line-of-sight communications and disjoined edge user nodes in support of ATC and ATS.   Continue to develop a computer-based, adaptive learning environment (ALE) to advance operator proficiency and adaptive decision-making capabilities.   Continue incorporation of automated forms such as electronic flight strips, duty and facility logs within the ATC network environment strips, duty and facility logs and ATC records within the ATC network environment.  Continue to reduce TAIS operator workload by simplifying software operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.679"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing COE, Joint Interoperability Testing and Network Integration Event test and certification in support of the interoperability within the Army's Mission Command Information System (MCIS).  Incorporate emerging Federal Aviation Administration (FAA) requirements.  Develop software solutions to provide FAA Notice to Airman, Pilot Reports and Temporary Flight Restrictions.  Develop system and user defined quality of service and performance tools to monitor and adjust critical performance and loading of software.  Develop real time retrieval of AMPS mission data using a web-service and end points.  Continue System Modification 2 testing including transportability, mobility and Electro Magnetic Environmental Effects (E3) tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Traffic Navigation Integration and Coordination System (ATNAVICS) Modernization"
                                    },
                                    "Description": {
                                        "val": "ATNAVICS is a highly mobile tactical area surveillance and precision approach air traffic control radar system.  It provides the Joint Force Commander or Combatant Commander, with a mobile, self-contained and reliable Airport Surveillance Radar, Precision Approach Radar and a Secondary Surveillance Radar capability.  System modernization includes radar interrogation enhancements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.083"
                                            },
                                            "Text": {
                                                "val": "Completed box level development, testing, and certification of Mode S.  Began system level development, testing, certification and integration of Mode S and ADS-B secondary surveillance radar capability into the ATNAVICS Platform.  This will enable ATNAVICS to be compliant with International Civil Aviation Organization (ICAO) and FAA mandates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.462"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.462"
                                            },
                                            "Text": {
                                                "val": "Provide Risk Management Framework to ATNAVICS to comply with Cyber Security requirements and Army Test Evaluation Command testing required for Full Material Release."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Tower System (MOTS) P3I"
                                    },
                                    "Description": {
                                        "val": "MOTS is a rapidly deployable Air Traffic Control System supporting operations at military\/civilian airfields and tactical landing zones.  It provides the ATC tower with secure, anti-jam communications, basic weather information, and precision location.  The system includes an Airfield Lighting System that provides a visual indication of landing zone and runway locations in degraded conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Text": {
                                                "val": "Conducted nonrecurring engineering, test, and evaluation tasks necessary for the development and integration of amplifiers for 117G radios, ARC-220 replacement and universal power supply (UPS). The 117G amplifier increased the range of the 117G radios to allow the system to meet the 30 nautical mile range threshold requirement.  The placement of UPS in the MOTS was re-engineered to address human factors issues on the current design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.237"
                                            },
                                            "Text": {
                                                "val": "Conduct nonrecurring engineering, test and evaluation tasks necessary for the development and integration of remote operation (300 ft) and advanced batteries. The remote operation (300 ft) will improve safety and functionality by providing the MOTS the capability to be remotely operated up to 300 ft away from the shelter. The advanced batteries replacement will allow the MOTS to meet its threshold requirement for extreme cold weather operation and storage."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Terminal Control System (TTCS)"
                                    },
                                    "Description": {
                                        "val": "The TTCS is a mobile ATC communications system that provides initial ATS at remote landing sites and drop zones. It enables secure ground-to-air and ground-to-ground communications between Army aircraft, other services, Allied aircraft and ground stations. TTCS also provides aircraft separation and ground control capabilities, a meteorological measuring system for basic weather information, and Blue Force Tracker which provides near real time situational awareness and precision location capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.320"
                                            },
                                            "Text": {
                                                "val": "Continued development of the Tactical Operations Center Network Inter-Communication System (TOCNET) Commonality Modification Work Order. The effort integrates the Soft Crew Access Unit and the Passive Detecting Receiving System."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.883"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.883"
                                            },
                                            "Text": {
                                                "val": "Conduct nonrecurring engineering test and evaluation tasks necessary for the development and integration of the ATC Tactical Network.  The ATC Tactical Network effort will enable the TTCS to share air traffic control data with the other tactical PM ATC platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management (PM) Support"
                                    },
                                    "Description": {
                                        "val": "PM support of PM ATC"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.378"
                                            },
                                            "Text": {
                                                "val": "Continued program management support of PM ATC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.512"
                                            },
                                            "Text": {
                                                "val": "Continue program management support of PM ATC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Air Traffic Control (AA0050)"
                                    },
                                    "Title": {
                                        "val": "Air Traffic Control"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "94.544"
                                        },
                                        "CurrentYear": {
                                            "val": "53.405"
                                        },
                                        "BudgetYearOne": {
                                            "val": "83.790"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "83.790"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "69.589"
                                        },
                                        "BudgetYearThree": {
                                            "val": "47.469"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.922"
                                        },
                                        "BudgetYearFive": {
                                            "val": "51.632"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This project is comprised of multiple systems supporting ATC development and test efforts.  While the detailed acquisition strategy varies by program, the general strategy for each program is to complete development and testing efforts through contract modifications, engineering service tasks, and new\/follow-on contracts.  ATC systems are required to achieve or maintain compliance with civil, military, domestic and international air traffic control and upcoming Next Gen requirements and mandates as well as current aircraft self-reporting transponders."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}