{
    "id": "2018-Navy-PB-1319-JBOOK-a7cc640ffed4392d95d7f988b4b952d94a6133d0328e6a89c81644204d772893-9",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602435N"
        },
        "ProgramElementTitle": {
            "val": "Ocean Wrfghtg Env Applied Res"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "69.703"
            },
            "CurrentYear": {
                "val": "42.618"
            },
            "BudgetYearOne": {
                "val": "42.411"
            },
            "BudgetYearOneBase": {
                "val": "42.411"
            },
            "BudgetYearTwo": {
                "val": "45.132"
            },
            "BudgetYearThree": {
                "val": "44.838"
            },
            "BudgetYearFour": {
                "val": "45.000"
            },
            "BudgetYearFive": {
                "val": "45.900"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (20 Jan 2015).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE provides the unique, fundamental programmatic instrument by which basic research on the natural environment is transformed into technological developments that provide new or enhanced warfare capabilities for the Battlespace Environment (BSE).  The objectives of this program are met through measuring, analyzing, modeling and simulating, and applying environmental factors affecting naval material and operations in the BSE.  This program provides for BSE technological developments that contribute to meeting top joint warfare capabilities established by the Joint Chiefs of Staff, with primary emphasis on Joint Littoral Warfare and Joint Strike Warfare. \n\nThis PE fully supports the Director of Defense Research and Engineering's Science and Technology Strategy and is coordinated with other DoD Components through the Defense Science and Technology Reliance process.  Work in this program is related to and fully coordinated with efforts in accordance with the on-going Reliance joint planning process.  There is close coordination with the US Air Force and US Army under the Reliance program in the BSE categories of Lower Atmosphere, Ocean Environments, Space & Upper Atmosphere, and Terrestrial Environments.  Within the Naval Transformation Roadmap, the investment will contribute toward achieving each of the \"key transformational capabilities\" required by Sea Strike, Sea Shield, and Sea Basing.  Moreover, environmental information, environmental models, and environmental tactical decision aids that emerge from this investment will form one of the essential components of FORCEnet (which is the architecture for a highly adaptive, human-centric, comprehensive maritime system that operates from seabed to space).  The Navy program includes efforts that focus on, or have attributes that enhance, the affordability of warfighting systems.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "72.252"
                },
                "CurrentYear": {
                    "val": "42.618"
                },
                "BudgetYearOne": {
                    "val": "43.368"
                },
                "BudgetYearOneBase": {
                    "val": "43.368"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "69.703"
                },
                "CurrentYear": {
                    "val": "42.618"
                },
                "BudgetYearOne": {
                    "val": "42.411"
                },
                "BudgetYearOneBase": {
                    "val": "42.411"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.549"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.957"
                },
                "BudgetYearOneBase": {
                    "val": "-0.957"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.964"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.585"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.957"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.957"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Ocean Wrfghtg Env Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "40.738"
                        },
                        "CurrentYear": {
                            "val": "42.618"
                        },
                        "BudgetYearOne": {
                            "val": "42.411"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.411"
                        },
                        "BudgetYearTwo": {
                            "val": "45.132"
                        },
                        "BudgetYearThree": {
                            "val": "44.838"
                        },
                        "BudgetYearFour": {
                            "val": "45.000"
                        },
                        "BudgetYearFive": {
                            "val": "45.900"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides technologies that form the natural environment technical base on which all systems development and advanced technology depend.  Furthermore, this technical base provides developments that may be utilized in the Future Naval Capabilities programs: Organic Mine Countermeasures (MCM) and Autonomous Operations. This project contains the National Oceanographic Partnership Program (NOPP) (Title II, subtitle E, of Public Law 104-201) and efforts aimed\nat understanding and predicting the impacts of underwater sound on marine mammals.\n\nMajor efforts of this project are devoted to: gaining real-time knowledge of the Battlespace Environment (BSE), determining the natural environment needs of regional warfare, providing the on-scene commander with the capability to exploit the environment to tactical advantage and, developing atmospheric research related to detection of sea-skimming missiles and strike warfare. This project provides natural environment applied research for all fleet operations and for current or emerging systems, and continuing support to research vessels of the U.S. Academic Research Fleet for operations, maintenance, repair and upgrades that enable applied research at sea and provides modeling and analysis for environmental compliance for ONR\/NRL field work and active acoustic experiments. Major developments are routinely transitioned to the Fleet Numerical Meteorology and Oceanography Center and to the Naval Oceanographic Office where they are used to provide timely information about the natural environment for all fleet operations.\n\nJoint Littoral Warfare efforts address issues in undersea, surface, and air battlespace. Efforts include ocean and atmospheric analysis and prediction for real-time description of the operational environment, shallow water acoustics, multiple-influence sensors for undersea surveillance and weapon systems, and influences of the natural environment on MCM and Anti-Submarine Warfare (ASW) systems. Joint Strike Warfare efforts address issues in air battlespace dominance. Efforts include influences of the natural environment on air operations, electromagnetic (EM)\/electro-optic (EO) systems used in intelligence, surveillance, reconnaissance, targeting, bomb damage assessment, and detection of missile weapon systems. They also include improvements in tactical information management about the BSE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Coastal Geosciences\/Optics"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to determine the sources, distribution, and natural variability (concentration and properties) of optically important matters in the coastal ocean in support of Naval Mine, Undersea, and Special Warfare.\n\nThe funding increase from FY 2017 to FY 2018 supports expansion of the development of new Coastal Geosciences\/Optics sensors on operational platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.071"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed development of the BMFC (Benthic Microbial Fuel Cell) into a functionally capable technology practical for powering Navy devices. \n- Completed the effort to combine optical (Vis\/SWIR\/TIR) and passive microwave (PM) data to (1) improve the performance of the existing NRL microwave soil moisture (SM) and vegetation water content (VWC) algorithm near inland waterways and heavily vegetated regions at 40-km resolution; and (2) develop a down-scaling algorithm to generate SM and VWC data globally at 1 km spatial resolution, which is critical but unfilled DoD requirement for determining soil strength at spatial scales required for Marine Crops\/Army mobility predictions.\n- Continue the effort to develop new methods using sparse representation theory for global inversion of marine gravity to deep-water seafloor topography.\n- Initiated studies to reduce uncertainties in data-assimilative littoral models in data-sparse environments\n- Initiated analysis of historic remote sensing modalities to determine whether robust climatologies can be developed which provide utility for initialization of littoral geosciences forecast models in data-poor regions.\n- Initiated a baseline study of littoral geosciences environmental variables and their value, singly or in combination, to reducing uncertainty of inverse and forward models, in data-poor regions"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.604"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above.\n- Complete the effort to develop new methods using sparse representation theory for global inversion of marine gravity to deep-water seafloor topography.  \n- Initiate development of new technologies and methodologies to delineate suspended sediment orientations in the water column and the turbulent motions which give rise to their spatial distributions, in response to the highly varied forcing of the littoral region."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.904"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.904"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research investments in this activity support the development and testing of expendable and autonomous bioluminescence sensors, the continued development of extended range underwater imaging technologies, and algorithm development and testing for application to ocean color remote sensing from aircraft and space in order to characterize key features of the coastal battle space such as bathymetry, shallow-water bottom types, and the distribution of ocean water optical properties.  Complete the effort to demonstrate an extremely compact hyperspectral imager (HSI) employed to retrieve coastal environmental products, ultimately from very small UAVs, by modifying a prototype sensor, incorporating smartphone technology for control and processing and evaluate the performance for quantitative retrieval of environmental products.  Complete the effort to couple sediment models that use accurate numerical representations of coastal sediment dynamics with coastal optical modeling systems in order to accurately forecast the appearance and persistence of near-bottom turbidity layers and sediment re-suspension events.\n\nUndersea Warfare \nApplied research focused on minimizing the logistics burden of persistently maintaining multiple sensors in remote or challenged locations.  The research emphasizes technologies leading to non-platform-based systems through novel power sources and power-harvesting.  For example, benthic microbial fuel cells (BMFCs) are prototype power supplies that generate power from the oxidation of sedimentary organic matter and are intended for marine deployed sensor systems presently powered by batteries.  BMFCs can provide power for long-term, uninterrupted operation of Anti-Submarine Warfare; Intelligence, Surveillance and Reconnaissance; and scientific systems otherwise limited in operational lifetime by battery depletion.\n\nBattlespace Environments \nConceptualize and perform laboratory, field, and numerical modeling studies to understand and exploit various geoscience and optical environmental phenomena in areas that are scientifically challenging, require innovation, and are of interest to the Navy\/Marine Corps. Encompasses the design, performance, analysis and underlying theory of field and laboratory experiments designed to understand geological\/geophysical, biological, and optical phenomena in the oceans and littoral zones, and to validate that understanding. Includes efforts to develop new or enhance existing shipboard, in-situ, airborne, and spaceborne sensors and appropriate inversion and though-the-sensor techniques to obtain, store, utilize, merge and\/or exploit data and create operationally and tactically useful environmental information of the littorals and bottom. This includes specification and development of sensors, signal processing, inversion, and other analysis tools when needed."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Mammals and Biology"
                                    },
                                    "Description": {
                                        "val": "The Marine Mammals and Biology program focus is to better understand and characterize the effects of underwater sounds produced by Navy sources (especially sonar) on marine mammals.  Efforts include research on integrated ecosystems, effects of sound exposure on marine mammals, and improving the monitoring and detection of marine mammals. The research in this program supports Navy environmental compliance information needs and facilitates acquiring LOAs from NOAA that enable all Navy training and testing operations, and the development of appropriate state-of-the-art mitigation measure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.448"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued at-sea demonstration of radar and acoustics systems to monitor marine mammals in fleet activities. \n- Continued multi-investigator, coordinated field research to test responses of marine mammals (especially beaked whales) to controlled sound exposures. \n- Continued development of new technologies for detection and localization of marine mammals, including (but not restricted to) gliders equipped with passive acoustic sensors, radar and thermal imagery. \n- Continued research examining hearing sensitivity of marine mammals (including temporary and permanent threshold shifts). \n- Continued research efforts examining distributions and abundances of marine mammals relative to prey fields and basic oceanographic parameters. \n- Continued development of and evaluated models that predict time- and space-dependent sound fields produced by anthropogenic noise sources and mammal responses to the noise. \n- Continued development and testing of multi-frequency acoustic technologies for detection, identification and enumeration of fish. \n- Continued research on the physiology and stress of marine mammals in the wild."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.446"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.407"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.407"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated Ecosystem Research:  Conduct research to understand the patterns and causes of variability in the distribution and abundance of marine mammals over space and time. Initiate a multidisciplinary approach using tagging, visual surveys, and passive acoustics to collect baseline measures of marine mammal behaviors and distributions relative to environmental features and marine mammal prey fields. \n\nEffects of Sound:  Conduct research on behavioral, physiological (hearing and stress response), and potentially population-level consequences of sound exposure on marine life. Initiate research to characterize the causal chain of events leading from sound exposure to \"biologically significant\" behavioral reactions that might increase risks of population-level effects and\/or the potential for stranding. Conduct research to develop an understanding of the natural variation of stress markers, better understand and characterize the relationships among hormones or other biomarkers in different matrices and characterize the relationship between the physiological stress response in marine mammals and acoustic exposure.  \n\nMonitoring and Detection:  Conduct research to develop and test new and existing technology to detect and classify marine mammals in the marine environment and during periods of low light.  Continue the development and testing of new autonomous hardware platforms using passive acoustics and\/or IR to detect and classify marine mammals."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Marine Meteorology"
                                    },
                                    "Description": {
                                        "val": "The marine atmosphere affects most aspects of naval operations. This activity develops observing technologies, models, Numerical Weather Prediction (NWP) systems and Tactical Decision Aids (TDA) that describe the atmospheric environment and its impacts on naval sensors and operations. This activity focuses on uniquely marine aspects of atmospheric science such as air-sea interaction, coupled ocean-atmosphere modeling, EM and EO propagation, coastal meteorology, Tropical Cyclone (TC) prediction, and the use of remote sensing to obtain quantitative observations of atmospheric properties. Aspects of the atmospheric environment of particular interest include near-surface phenomena that affect refractivity, marine boundary layer dynamics that affect clouds, rain, visibility and fog, and processes that control TC structure, track, and intensity. Objectives of this activity are improved NWP systems and TDAs that provide NOWCAST and forecast skill at global, regional, and tactical scales for operational support, sensor and system development, and performance prediction.\n\nThe funding decrease from FY 2017 to FY 2018 reflects the completion of efforts to produce the first numerical weather prediction model of operational accuracy covering the entire middle atmosphere."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.681"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the effort to produce the world's first numerical weather prediction model of operational accuracy covering the entire middle atmosphere. \n- Complete the design, assembly, testing and delivery of a threat detection technology for Tier 1 environmental analysis of aerosols. \n- Complete the development of the ability to accurately detect, monitor and forecast the 3-D areal extent of global airborne dust, volcanic ash, and smoke and improve aerosol optical depth analyses and forecasts through the use of a suite of satellite sensors and the Navy Atmospheric Aerosol Prediction System (NAAPS).\n- Complete the development of a Hybrid Ensemble 4D-VAR Data Assimilation (DA) scheme for regional models based on the global data assimilation techniques, in order to simultaneously estimate regional and global model initial conditions. \n- Completed development of a quantitative prediction capability of EM propagation (EMProp) and sensor performance through improved mesoscale modeling, and characterize the uncertainty in these predictions due to the environment and propagation models. \n- Completed the effort to develop and evaluate a global coupled atmosphere-ocean system that can accurately simulate and predict the Madden Julian Oscillation (MJO), which is a phenomenon that serves as a bridge between current weekly forecasts and extended-range forecasts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.807"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above. \n-Complete the effort to produce the world's first numerical weather prediction model of operational accuracy covering the entire middle atmosphere.  \n- Initiate development of a high-altitude version of the tropical cyclone intensity prediction model (COAMPS-TC) to incorporate new upper-level physics that affect storm dynamics.\n- Initiate development of a probabilistic tropical cyclone forecasting system, based on the COAMPS-TC ensemble, that generates probabilistic guidance and quantifies the forecast uncertainty.\n- Initiate development of a high resolution global weather prediction system (based on NAVGEM) with an improved dynamical core, increased resolution (approx. 10km and 100 layers), physics upgrades, new physics-dynamics coupling, and advances in the NAVDAS-AR data assimilation system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY 2017 less those noted as completed above.\n\nPerform field measurements; theoretical analyses; development of data fusion, data assimilation and modeling technologies; increasing knowledge content of data from remote sensing and through-the-sensor systems; exploring dynamical and physical processes, coupled atmosphere\/ocean\/wave\/ice\/land processes, atmospheric predictability, and methodologies for probabilistic forecasting and characterization of uncertainty. Encompasses the design, performance, analysis and underlying theory of field and laboratory experiments and telescoping, global-to-tactical scale numerical simulations specifically designed to understand atmospheric environmental processes and phenomena. Includes efforts to develop appropriate inversion and other techniques to obtain atmospheric environmental data from airborne and spaceborne sensors.  Includes empirical and numerical model development techniques and associated efforts designed to improve atmospheric prediction, diagnose problems and increase the efficiency and accuracy of those models and model systems in a variety of computational environments. Includes efforts to fuse, merge and exploit atmospheric data and create operationally useful information. The research is coordinated with operational customers to enable rapid transition of research into operations.\n\nInitiate the development of a version of the Navy's regional NWP prediction system (COAMPS) that incorporates new physics and is optimized to provide much more accurate forecasts in the Arctic, particularly for poorly predicted phenomena like polar lows, and couples with ocean and ice forecast models.  Complete the effort to utilize satellite microwave radiometers to introduce a reliable sea spray source term and demonstrate the new source term within the Navy Aerosol Analysis and Prediction System (NAAPS) for the purposes of global aerosol modeling to produce reliable forecasts of EO propagation, weather, and climate, as a result of the ability to accurately model maritime aerosols.  Complete the effort to develop a unique, flexible, situation-dependent, operational METOC nowcast support capability to improve nowcast skill based on dynamic ship-following, high-resolution, rapidly updated data assimilation and mesoscale modeling called CSI (COAMPS-OS Ship-following Infosphere)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National Oceanographic Partnership Program (NOPP)"
                                    },
                                    "Description": {
                                        "val": "This activity focuses on US Navy investments in the National Oceanographic Partnership Program (NOPP). NOPP, established by the US Congress (Public Law 104-201) in Fiscal Year 1997, is a unique collaboration among 15 federal agencies involved in conducting, funding, or utilizing results of ocean research. NOPP's value to the Navy derives from the capacity of the partnership to enable and ensure multi-agency efforts where such collaboration enhances efficiency or effectiveness, and\/or reduces costs. Generally, NOPP investments are made on topics that cross-agency missions, fall in gaps between agencies and\/or are too large for any one agency to fund itself."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.964"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiated marine mammal tagging as a component of the marine arctic ecosystem dynamics study.\n- Initiated development of coupled Arctic System Models to support improved forecasting and prediction of sea ice and other operational parameters\n- Initiated efforts to seamlessly nest high-resolution regional ocean models into tide-resolving global HYCOM ocean forecasts\n- Initiated project to understand the role of the ocean in providing skill in extended-range predictions of the environment through systematic model intercomparisons"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.626"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.611"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.611"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Development of an integrated coastal ocean observation system and development of sensors, communications and data acquisition, storage and processing tools required to affect it, modernization of ocean research and observation infrastructure, and marine mammal-related research.  Specific research activities include conducting studies to develop an integrated coastal ocean observation system and associated sensors, communications, data acquisition, storage and processing tools. Efforts will also be initiated to develop small space-based sensors for littoral oceanographic and atmospheric dynamics research; tools for improved production and application of high resolution sea surface temperature data; and miniaturized, next generation sensors for ocean measurements."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ocean Acoustics"
                                    },
                                    "Description": {
                                        "val": "This activity is dedicated to the determination of the impact of the natural ocean environment on acoustic wave phenomena in support of naval undersea warfare and underwater force protection operations. This activity studies underwater acoustic propagation, scattering from ocean boundaries, and ambient noise issues that impact the development and employment of acoustic systems. The Littoral Zone (LZ) has been the ocean environment of greatest interest. Aspects of this environment, that greatly impact underwater acoustic systems, are the shallow water included in the Littoral Zone, the consequent closeness and physical significance of the ocean bottom, and the complexities inherent to rapid changes of the ocean structure. The objectives of this program are met through measuring, analyzing, modeling and simulating, and exploiting ocean acoustic factors to gain advantage over potential adversaries using undersea acoustic systems. Results of this activity support acoustic sensor and system development, performance prediction, and tactical decision aids."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.493"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue effort to reduce acoustic propagation forecast error through a coupled ocean-acoustic assimilative model.  \n- Continued development of an integrated hydrodynamic\/acoustic propagation modeling capability for littoral regions to predict acoustic ASW system performance in dynamic environments. \n- Continued development of a Tactical Decision Aid (TDA) that can predict the dynamic oceanographic characteristics of shallow-water internal waves and their effects on underwater acoustic signals. \n- Continued development of a validated, physics-based processing algorithm that diagnoses acoustic performance directly from oceanographic data. \n- Continued development of a set of physics-based environmental acoustic metrics to evaluate the predictions of TDAs that are used in planning asset allocation and placement of distributed Autonomous Undersea Vehicles (AUVs) in a time evolving scenario. \n- Continued development of improved performance predictions for sonar surveillance systems that utilize horizontal line arrays operating in shelf-break environments and relate horizontal-array signal gain and coherence length to the statistics and scale lengths of transverse environmental inhomogeneities. \n- Continued development of an ocean magnetic prediction system for magnetic fields generated by high amplitude internal waves, internal bores, and internal solitary waves. \n- Complete enhancements to the accuracy of acoustic performance predictions through stochastic algorithms dealing with environmental uncertainty.\n- Completed development of a coupled algorithm to assimilate in-situ acoustic data into an acoustic model used for autonomous system decision support.  \n- Completed effort to develop a new through-the-sensor environmental characterization capability for multistatic sonobuoy systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.288"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above. \n- Complete effort to reduce acoustic propagation forecast error through a coupled ocean-acoustic assimilative model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Warfare applied research to provide the Warfighter with improved Anti-Submarine Warfare (ASW) performance assessment models and tactical decision aids to plan ASW operations, evaluate effectiveness of ASW systems, and enable environmental adaptive system control.  The capability to provide ASW sensor and system performance models, realistic simulations, and measures of effectiveness that incorporate and exploit critical environmental knowledge requires coupling ocean dynamics and acoustics, ambient noise characterization in the littorals, acoustic and optical scattering and propagation characterization, through-the-sensor measurement techniques for in situ environmental parameters, measurement and prediction of uncertainty, and development of tactical decision tools.\n\nEfforts include continuation of applied research to enhance passive sonar performance capability in the Arctic environment by developing a better passive sonar performance prediction model and new acoustic ice-characterization methods."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Oceanography"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop naval tactical uses of knowledge of the physics of the ocean within the BSE. This is achieved through the development of predictive models of the water mass structure, waves, currents, and air-sea interactions and developing measurement\/observation technology. Other applications utilize knowledge of the interaction of the water column hydrodynamics and the acoustics to predict the undersea transmission characteristics and sources of uncertainty in these statistics. Utilizing knowledge of the ocean surface physics, the physical oceanography program seeks to exploit the combination of remotely sensed data, in-situ data, and adaptively sampled data to optimize predictions of ocean currents and water column structure. These predictions, custom databases, adaptive sampling schemes and data programs serve Anti-Submarine Warfare (ASW), Naval Special Warfare (NSW), Sea-Basing, and mine warfare needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.081"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed the development of the calibration of ocean forcing and its uncertainty using satellite flux estimates and ocean observations propagated through the ocean physics to the surface.\n- Initiated multi-scalable visuzalization tools using GPU's, tablets and remote sensing data.\n- Initiated testing of Air-Deployed Ocean Profiler in research and fleet test.\n- Initiated development of a coupled atmosphere-ocean-cryosphere-wave prediction system capable of forecasts from the submesoscale to decadal.\n- Initiated development of a high resolution Arctic ice\/ocean\/weather\/wave prediction system that can assimilate SAR data.\n- Initiated Synthetic Aperture Radar Data Assimilation for Tropical Storm Forecasts\n- Initiated Expendable Expeditionary Data Fusion Development"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.847"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016 less those noted as completed above. \n- Complete the effort to develop the Navy's coupled ocean-atmosphere variational data assimilation (DA) system.  \n- Initiate the development and testing of the Remote Ocean Sampling System for air-sea surface flux sampling\n- Initiate the development of advanced autonomy for operations of gliders and uuv's in extreme environments\n- Initiate the development of ocean drifters with stable salinity sensors and high resolution turbulence sensors"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.010"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.010"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct applied research including field research on ocean processes and dynamics, ocean model development, and data assimilation from the open ocean to the nearshore and riverine environments is directed towards model system development and analysis. Model and data assimilation development is extending to the field of coupled models including air-ice-wave-ocean-land models. This encompasses the design, analysis and underlying theory of field and laboratory experiments designed to understand ocean environmental processes and phenomena. It includes model development to improve ocean environmental predictive capabilities, through improved physical characterization, diagnosis, efficiency and accuracy of these models in a variety of computational environments. Also includes efforts to develop new or enhance existing shipboard, in-situ, airborne, and spaceborne sensors and appropriate inversion and \"through the sensor\" techniques to obtain physical oceanographic environmental data. Includes effort to fuse and exploit oceanographic data to create operationally useful information.\n\nConduct applied research that develops and tests the Remote Ocean Sampling System for the air-sea surface flux sampling, while also developing an advanced autonomy for operations of gliders plus UUV's in extreme environments and develop ocean drifters with stable salinity sensors and high resolution turbulence sensors.  Completion of the effort to develop a capability to estimate global ocean forecast uncertainty from ensembles which will enable risk assessment with skill out to 30 days, providing the real-time assessment of environmental uncertainty anywhere on demand and risk analysis products that can be used as inputs to existing decision support tools such as risk quantification and mission planning.  Completion of the effort to develop a new capability for accurate and rapid characterization of the local ocean battlespace utilizing the ability of gliders to work in coordinated teams and 4-dimensional variational assimilation (4D-Var) to maximize impact of the glider data in a high resolution local forecast model for more accurate ocean predictions around Sea Base and Sea Strike areas.\n\nThe research is coordinated with operational customers to enable its rapid transition into operational systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "All Science and Technology model improvements undergo a rigorous validation verification and evaluation against quantifiable metrics before being accepted for transition into operations.  In Marine Meteorology, for example, typical improvements over the past decade have amounted to a gain in skill of one forecast-day (i.e., the 4-day forecast is now as skillful as the 3-day forecast of a decade ago), and tropical cyclone forecast track error has been reduced by 50%.  It is expected that future increases in skill will continue at or above this pace."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "28.965"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.965"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The AGOR Mid-Life Refit FY15 funding will support the overhaul, re-fit and upgrade of Navy research vessel THOMAS G THOMPSON (AGOR 23).  In FY15 funds will be awarded to the University of Washington, the operator of THOMPSON, to support the competitive selection of a US shipyard which will implement the design plans. The THOMPSON entered the Vigor, Seattle shipyard in June 2016 to begin the 11-month refit."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "AGOR Mid-life Refit"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "28.965"
                                        },
                                        "Text": {
                                            "val": "The AGOR Mid-Life Refit FY16 funding represents an increase of $10M more than FY15, and provides full funding in this FY for the second vessel, AGOR 24 Roger Revelle.  A contract with the University of California-San Diego's Scripps Institution of Oceanography will be developed to manage the project during FY16, with a major shipyard overhaul preliminarily planned for FY18. Deliverables will support environmental compliance requirements regarding ballast water treatment, marine sanitation, engine exhaust, incinerator exhaust, air conditioning refrigerants, and oily-water separation.  Additional deliverables will overcome obsolescence of diesel engine and electrical system components, and enhanced the ship safety with piping replacements in the ship's firemain and ballast water systems."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Deliverables will support new environmental compliance requirements regarding ballast water treatment, marine sanitation, engine exhaust, incinerator exhaust, air conditioning refrigerants, and oily-water separation.  Additional deliverables will overcome obsolescence of diesel engine and electrical system components, and enhance the ship safety with piping replacements in the ship's firemain and ballast water systems."
                        }
                    }
                }
            ]
        }
    }
}