{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601110D8Z"
        },
        "ProgramElementTitle": {
            "val": "Basic Research Initiatives"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "70.311"
            },
            "CurrentYear": {
                "val": "36.654"
            },
            "BudgetYearOne": {
                "val": "40.612"
            },
            "BudgetYearOneBase": {
                "val": "40.612"
            },
            "BudgetYearTwo": {
                "val": "43.006"
            },
            "BudgetYearThree": {
                "val": "45.513"
            },
            "BudgetYearFour": {
                "val": "46.400"
            },
            "BudgetYearFive": {
                "val": "47.353"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Supporting basic research provides the Department of Defense (DoD) with a deep and broad awareness of current directions in areas of research important to U.S. military capabilities – including physics and the physical sciences, materials science, chemistry and chemical engineering, electrical engineering, mathematics, computer science, mechanical and aerodynamic engineering, ocean sciences, biological sciences, and the social sciences, among others.  Basic research sustains scientific and engineering communities as it generates the critical technical underpinnings of DoD capabilities.  Basic research allows exploration and discovery, yielding disruptive non-incremental advances that can improve or radically change military capabilities, strategy, and operations.  \n\nThe Basic Research Initiatives program element (PE) supports the defense basic research enterprise in three critical areas:  Strategic Support for Basic Research (SSBR), the Minerva Research Initiative, and the Vannevar Bush Faculty Fellowship Program (Vannevar Bush), formerly known as the National Security Science and Engineering Faculty Fellowship (NSSEFF) program."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "71.940"
                },
                "CurrentYear": {
                    "val": "36.654"
                },
                "BudgetYearOne": {
                    "val": "40.649"
                },
                "BudgetYearOneBase": {
                    "val": "40.649"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "70.311"
                },
                "CurrentYear": {
                    "val": "36.654"
                },
                "BudgetYearOne": {
                    "val": "40.612"
                },
                "BudgetYearOneBase": {
                    "val": "40.612"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.629"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.037"
                },
                "BudgetYearOneBase": {
                    "val": "-0.037"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.295"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.334"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.037"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.037"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P010"
                    },
                    "ProjectTitle": {
                        "val": "Basic Research Initiatives"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.530"
                        },
                        "CurrentYear": {
                            "val": "13.548"
                        },
                        "BudgetYearOne": {
                            "val": "12.444"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.444"
                        },
                        "BudgetYearTwo": {
                            "val": "12.525"
                        },
                        "BudgetYearThree": {
                            "val": "12.711"
                        },
                        "BudgetYearFour": {
                            "val": "12.922"
                        },
                        "BudgetYearFive": {
                            "val": "13.193"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Research Initiatives project code, P010, includes Strategic Support for Basic Research (SSBR) and the Minerva Research Initiative.\n\nSSBR supports oversight, policies, and initiatives to implement the Assistant Secretary of Defense for Research and Engineering's (ASD(R&E)) strategic plan for defense basic research.  This plan defines actions to help create conditions for defense basic research investments capable of producing high-payoff, transformative scientific breakthroughs for the Department. SSBR initiatives support the five Basic Research Office strategic goals:  (1) drive the direction of DoD basic research investments; (2) coordinate and conduct oversight of DoD basic research programs; (3) improve science and engineering (S&E) workforce and public outreach; (4) enhance university-industry collaboration; and (5) engage with academic research community and international partners. \n\nThe Minerva Research Initiative, a department-wide basic research program in the social sciences directed by the Office of the Secretary of Defense (OSD) and executed by the Services, seeks to build a fundamental understanding of the sources of present and future conflict.  It is one of the Nation’s only social science basic research programs in support of national security (especially funding field research).  Minerva promotes a deeper understanding of the social and cultural environments, where threats such as radicalization and regional instabilities develop, and supports more effective strategic and operational policy decisions.  Minerva program priorities are consistent with the goals set forth in the 2014 Quadrennial Defense Review (QDR), informing DoD efforts to effectively build security globally, and are updated annually according to inputs from across the defense enterprise."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Support for Basic Research (SSBR)"
                                    },
                                    "Description": {
                                        "val": "The SSBR program actively creates conditions for defense basic research investments capable of producing high-payoff, transformative scientific breakthroughs for the Department.  SSBR initiatives support the five Basic Research Office strategic goals:  (1) drive the direction of DoD basic research investments; (2) coordinate and conduct oversight of DoD basic research programs; (3) improve science and engineering (S&E) workforce and public outreach; (4) enhance university-industry collaboration; and (5) engage with academic research community and international partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.002"
                                            },
                                            "Text": {
                                                "val": "Executed a series of new workshops for scientific situational awareness including machine learning, power and energy, and quantum information science, among others.  Through these workshops, National research leaders convened to provide expert perspectives on potential breakthroughs and barriers of advancement in rapidly evolving fields of basic research, and have informed MURI topic priorities and Vannevar Bush research solicitation areas.\n\nWith the goals of reinvigorating DoD laboratories as facilities of basic research and enhancing connectivity between the academic and defense laboratory communities, the Department launched the “Laboratory University Collaboration Initiative” (LUCI) pilot, augmenting the Vannevar Bush Program, an ASD(R&E) Program.  There were 16 collaborative research projects conducted between DoD researchers and Vannevar Bush Fellows in areas of scientific or technological importance to DoD, while also expanding the research capabilities of DoD laboratories.  Additionally, the I-Corps Pilot Program aimed at accelerating commercialization of basic research innovations was successfully launched, with one team selected for support, and five additional teams in the queue.  Modeled after the National Science Foundation's I-Corps program, the DoD program facilitates collaboration between academia and industry to spur the transition of defense innovations of interest into emerging products and services.  Those emerging products and services have the potential for commercialization into industry or transition into DoD programs of record."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Execute new \"Future Directions\" workshops for scientific situational awareness on topics recommended by DoD S&T community and academia.  Convene National research leaders to provide expert perspectives on potential breakthroughs and barriers of advancement in rapidly evolving fields of basic research.  Continue studies of how past DoD investments and high priority basic research has led to advances in new technologies and new capabilities for the Nation.  As part of the ASD(R&E) mission, continue to analyze university-related business practices for improvement and efficiency.  Continue support for scientific expertise to oversee science and engineering initiatives.  Organize DoD I-Corps competition to select projects that could lead to commercialization into industry or transition into DoD programs of record, with a goal of selecting two teams to enter the training program (Pub. L. 113–66, div. A, title XVI, §1603), and partner with organizations such as OSBP to create opportunities for further technology maturation and potential entrance to programs of record.  Launch the Defense Enterprise Scientific Initiative (DESI) pilot, which aims to build collaboration of universities, industry, and laboratories on defense-critical capabilities.  Explore other opportunities to foster partnerships between academia and industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.235"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.235"
                                            },
                                            "Text": {
                                                "val": "Continue the series of workshops for scientific situational awareness that were planned in previous fiscal years.  Convene national research leaders to provide expert perspectives on potential breakthroughs and barriers of advancement in rapidly evolving fields of basic research.  Continue studies of how past DoD investments and high priority basic research has led to advances in new technologies and new capabilities for the Nation.  As part of the ASD(R&E) mission, continue to analyze university-related business practices for improvement and efficiency.  Continue support for scientific expertise to oversee science and engineering initiatives.  Evaluate effectiveness of DESI and I-Corps pilot programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minerva Research Initiative"
                                    },
                                    "Description": {
                                        "val": "The Minerva Research Initiative includes three primary components:  (1) a university-based social science basic research grant program; (2) the Research for Defense Education Faculty (R-DEF) program for the professional military education (PME) institutions; and (3) a collaboration with the congressionally established United States Institute of Peace to award research support to advanced graduate students and early career scholars working on security and peace.  All components contribute to Minerva goals of revitalizing connections between DoD and academic social science communities and building cultural and foreign area knowledge on topics ranging from the mechanisms of radicalization to geopolitical power projection strategies in a multipolar world.  This deeper scientific understanding will provide a more informed basis to shape doctrine, analysis, and other strategic and operational decisions made by war planners and warfighters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.528"
                                            },
                                            "Text": {
                                                "val": "Heightened challenges related to global terrorism and the Islamic State of Iraq and Syria (ISIL) indicate the need for serious intellectual investment into the sources of social conflict and cooperation.  One of the only funders of fieldwork-based security research, Minerva received a one-time plus-up of funds to support research addressing emerging national security needs.  Ongoing technical and logistical program support enables safe and ethical research in regions involving complex security challenges.\n\nIn addition to new investments, the Minerva program continued its support of ongoing university-led research initiatives; maintained support of R-DEF program at defense education institutions; provided subject matter expertise to quick-turn studies requested by the operational community; established a joint pilot program with United States Institute of Peace (USIP) to support advanced graduate students and early career scholars working on security and peace; and facilitated building policy and operational community connections with ongoing Minerva efforts, in order to effectively connect new social science insights and methods to current and future defense leadership and inform tomorrow's key security decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.548"
                                            },
                                            "Text": {
                                                "val": "Continue supporting university-led research initiatives on themes including: the social impact of autonomy; societal resilience; power and deterrence; cyber defense; interconnectivity between security and sociality; and great powers conflict. Maintain support of R-DEF program at defense education institutions. Enhance accessibility of research insights through a more robust website and outreach efforts. And continue connecting subject matter expertise to the operational community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.209"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.209"
                                            },
                                            "Text": {
                                                "val": "Continue ongoing and start new university-led research initiatives with priorities shaped by defense needs; maintain support of R-DEF program at defense education institutions; continue active engagement providing subject matter expertise to the operational community; and continue building policy and operational community connections to ongoing Minerva efforts, in order to effectively connect new social science insights and methods to current and future defense leadership and inform tomorrow's key security decisions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P060"
                    },
                    "ProjectTitle": {
                        "val": "Vannevar Bush Faculty Fellowship"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.781"
                        },
                        "CurrentYear": {
                            "val": "23.106"
                        },
                        "BudgetYearOne": {
                            "val": "28.168"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.168"
                        },
                        "BudgetYearTwo": {
                            "val": "30.481"
                        },
                        "BudgetYearThree": {
                            "val": "32.802"
                        },
                        "BudgetYearFour": {
                            "val": "33.478"
                        },
                        "BudgetYearFive": {
                            "val": "34.160"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Vannevar Bush Faculty Fellowship (Vannevar Bush), formerly National Security Science and Engineering Faculty Fellowship (NSSEFF), program supports world-class researchers in scientific areas of critical importance to DoD and ensures the cultivation of exceptional talent.  Fellows’ research spans a broad set of emerging scientific areas with transformative potential including Quantum Information Science, Novel Engineered Materials, Cognitive Neuroscience, Engineering Biology, Robotics and Data Analytics, etc.  The Vannevar Bush program is a key resource to the entire Department that fosters close connections between academia and the DoD science and engineering enterprise, a primary goal of SSBR efforts.  Fellows provide the Department the deep scientific expertise from today’s leading research universities and collaborate with defense scientists and engineers.  This program actively engages and coordinates basic research across the Department."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vannevar Bush Faculty Fellowship (Vannevar Bush) Program"
                                    },
                                    "Description": {
                                        "val": "The Vannevar Bush Program, formerly known as the National Security Science and Engineering Faculty Fellowship (NSSEFF), ensures that DoD has a research portfolio that supports the foremost creative, innovative, and productive university researchers.  The objectives of the program are to:  (1) support scientific research that may lead to extraordinary outcomes; (2) educate and train student and post-doctoral researchers for the defense and national security workforce; (3) foster long-term relationships between university researchers and the DoD; (4) familiarize select university researchers and their students with DoD's current and future challenges; and (5) increase the number of exceptionally talented technical experts that are contributing to DoD's mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.781"
                                            },
                                            "Text": {
                                                "val": "Continued support for 32 current Vannevar Bush Fellows.  Reviewed and updated program topic areas.  Solicited for a new class of Vannevar Bush Fellows.  Organized and conducted a Vannevar Bush Spring meeting at the Army Research Laboratory at Adelphi including DoD laboratory tours.  Utilized this venue to identify and facilitate new connections between new Fellows and DoD scientists and engineers, including the Vannevar Bush Steering Committee.  Organized and conducted a program review and report on Fellows’ progress.  To enhance connectivity between the Fellows and defense laboratory communities, the Basic Research Office launched a laboratory-wide “Laboratory University Collaboration Initiative” (LUCI) pilot, funded from the FY16 appropriated budget line (P010) and augmenting the Vannevar Bush program to support 16 collaborative research projects between DoD researchers and Vannevar Bush Fellows in areas of scientific or technological importance to DoD, while also expanding the research capabilities of the DoD laboratories."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.106"
                                            },
                                            "Text": {
                                                "val": "Continue support for 42 current Vannevar Bush Fellows and DoD collaborative research partners.  Review and update program topic areas.  Solicit for a new class of Vannevar Bush Fellows.  Organize and conduct the Vannevar Bush annual meeting which will be hosted by Air Force Research Laboratory (AFRL) at Wright-Patterson Air Force Base, with goals to familiarize Fellows and their research goals with AFRL mission and research strengths.  Utilize this venue to identify and facilitate new connections between new Fellows and DoD scientists and engineers, including the Vannevar Bush Steering Committee.  Organize and conduct a program review and report on Fellows’ progress.  Continue support for 16 LUCI Fellows in DoD laboratories to conduct collaborative basic research with Vannevar Bush Fellows.  Organize and conduct a new LUCI competition and selection for ten collaborative research projects between DoD researchers and Vannevar Bush Fellows in areas of scientific or technological importance to the Department.  Conduct a review on LUCI projects and report the scientific progress and the impacts of LUCI projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.168"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.168"
                                            },
                                            "Text": {
                                                "val": "Continue support of 50 Vannevar Bush Fellows and DoD collaborative research partners (26 LUCI projects).  Review and update program topic areas.  Solicit for a new class of Vannevar Bush Fellows.  Organize and conduct Vannevar Bush annual meeting including DoD laboratory tours.  Utilize this venue to identify and facilitate new connections between new Fellows and DoD scientists and engineers, including the Vannevar Bush Steering Committee.  Organize and conduct a program review and report on Fellows’ progress.  Conduct review of 26 LUCI Fellows in DoD laboratories and report the scientific progress and the impacts of the LUCI projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}