{
    "id": "2018-Army-PB-2040-JBOOK-4d642436f65ddc83c084fdb1d917f4809eff5a3f2d9cca01c78cf59a8dd3a26e-8",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602601A"
        },
        "ProgramElementTitle": {
            "val": "Combat Vehicle and Automotive Technology"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "95.763"
            },
            "CurrentYear": {
                "val": "67.959"
            },
            "BudgetYearOne": {
                "val": "67.232"
            },
            "BudgetYearOneBase": {
                "val": "67.232"
            },
            "BudgetYearTwo": {
                "val": "68.826"
            },
            "BudgetYearThree": {
                "val": "72.085"
            },
            "BudgetYearFour": {
                "val": "78.336"
            },
            "BudgetYearFive": {
                "val": "85.815"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) researches, designs, and evaluates combat and tactical vehicle automotive technologies that enable the Army to have a lighter, more survivable, more mobile and more deployable force. Project C05 investigates, researches, and evaluates advanced ground vehicle design and occupant protection technologies in such areas as armor concepts, ballistic defeat mechanisms, blast mitigation, survivability modeling and simulation (M&S), hit avoidance, kill avoidance, safety, sensors, counter-measures, instrumentation and survivability packaging concepts to achieve superior survivability\/protection for Soldiers and military ground vehicles. Survivability technologies will be designed for integration into the Modular Active Protection System (MAPS). Project H77 funds the National Automotive Center (NAC), which was chartered by the Secretary of the Army to conduct shared government and industry, or \"dual use\", technology programs to leverage commercial investments in automotive technology research and development for Army ground combat and tactical vehicle applications. Project H91 designs, matures, and evaluates a variety of innovative and enabling technologies in the areas of electrical power, thermal management, propulsion, mobility, power for advanced survivability, vehicle diagnostics, fuels, lubricants, water purification, intelligent systems, autonomy-enabled systems, and other component technologies to enhance the mobility, power and energy and reduce the logistic chain of combat and tactical vehicles. This PE executes the Army's Combat Vehicle Prototyping (CVP) program to mature, integrate and demonstrate ground vehicle leap ahead technologies in support of future combat vehicles.\n\nWork in this PE is related to, and fully coordinated with, PEs 0602105A (Materials Technology), 0602618A (Ballistics Technology, Robotics Technology), 0602705A (Electronics and Electronic Devices), 0602716A (Human Factors Engineering Technology), 0603005A (Combat Vehicle and Automotive Advanced Technology), 0603125A (Combating Terrorism – Technology Development), 0603734 (Military Engineering Advanced Technology), and 0708045A (Manufacturing Technology).  \n\nWork in this PE is coordinated with the United States Marine Corps, the Naval Surface Warfare Center, and other ground vehicle developers within the Defense Advanced Research Projects Agency (DARPA) and the Departments of Energy, Commerce, and Transportation.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this PE is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, MI."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "98.439"
                },
                "CurrentYear": {
                    "val": "67.959"
                },
                "BudgetYearOne": {
                    "val": "65.912"
                },
                "BudgetYearOneBase": {
                    "val": "65.912"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "95.763"
                },
                "CurrentYear": {
                    "val": "67.959"
                },
                "BudgetYearOne": {
                    "val": "67.232"
                },
                "BudgetYearOneBase": {
                    "val": "67.232"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.676"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.320"
                },
                "BudgetYearOneBase": {
                    "val": "1.320"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.004"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.672"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "1.109"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.109"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.211"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.211"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C05"
                    },
                    "ProjectTitle": {
                        "val": "Armor Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.092"
                        },
                        "CurrentYear": {
                            "val": "24.380"
                        },
                        "BudgetYearOne": {
                            "val": "21.428"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.428"
                        },
                        "BudgetYearTwo": {
                            "val": "26.291"
                        },
                        "BudgetYearThree": {
                            "val": "24.442"
                        },
                        "BudgetYearFour": {
                            "val": "23.143"
                        },
                        "BudgetYearFive": {
                            "val": "35.506"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, researches, and evaluates advanced ground vehicle design and occupant protection technologies in such areas as armor concepts, ballistic defeat mechanisms, blast mitigation, survivability modeling and simulation (M&S), improved situational awareness, hit avoidance, kill avoidance, safety, sensors for blast, crash and rollovers, instrumentation and survivability packaging concepts to achieve superior survivability\/protection for Soldiers and ground combat and tactical vehicles. Survivability\/protection technologies are being investigated to meet anticipated ground combat and tactical vehicle survivability objectives. Additionally, this project focuses on analysis, modeling, and characterization of potential survivability solutions that could protect against existing and emerging threats. This analysis is used to aid in the identification of technologies to enter maturation and development in Program Element (PE) 0603005A, Project 221.\n\nThis Project supports Army science and technology efforts in the Ground Maneuver portfolio. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this Project is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC) Warren, MI and is fully coordinated with work at the Army Research Laboratory (ARL), Aberdeen Proving Ground, MD and at Communications-Electronics Research, Development and Engineering Center (CERDEC), Aberdeen Proving Ground, MD and Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Armor Development:"
                                    },
                                    "Description": {
                                        "val": "The objective of this effort is to design, integrate and validate performance of advanced armor systems to defeat single and multiple chemical energy (CE) and kinetic energy (KE) emerging threats for combat and tactical vehicles. These systems include base armor (small arms \/ medium caliber, opaque and transparent B-kits), applique armor (passive \/ reactive \/ active multi-threat C-kits), multifunctional armor, and adaptive and cooperative armors. This effort coordinates with PEs 0602618A and 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.448"
                                            },
                                            "Text": {
                                                "val": "Developed new armor materials and mechanisms to achieve an overall ground vehicle armor subsystem weight reduction of 10-15%. Matured advanced passive and explosive reactive armor component technologies using new and novel material selections and design approaches for defeat of kinetic energy threats, chemical energy threats, and improvised explosive devices. Conducted advanced passive kinetic energy armor and explosive reactive armor integration experiments for component integration, and system seams and attachments. Began validation of advanced passive B-Kits, and advanced reactive armor systems for C-Kits by conducting ballistic experiments. Matured lightweight materials for structural application and structural designs to provide the protection capability required when integrated with B-Kit and C-Kit armor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.893"
                                            },
                                            "Text": {
                                                "val": "Will complete advanced passive B-Kit and C-Kit integration experiments for component integration, and system seams and attachments; will use the integration experiment results to identify and design the desired seam and attachment approach for follow-on integration and demonstration of those technologies; will complete validation of the ballistic performance of the B-kit and C-kit technologies through ballistic coupon experiments; will conduct modeling and simulation of the next generation armor systems that evaluate integration feasibility and resulting performance of those technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.025"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.025"
                                            },
                                            "Text": {
                                                "val": "Will mature attachment designs for subsystem integration of advanced passive and reactive armor technologies; verify performance of subsystem integration design for advanced passive and reactive armor technologies through finite element modeling; will investigate various adaptive armor solutions in relevant environment; will begin design of adaptive armor subsystem for system integration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Mitigation:"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates and evaluates advanced survivability and protection capabilities, tools and technologies to improve protection against vehicle mines, improvised explosive devices (IEDs) and other underbody threats and crash events. This effort also designs and evaluates technologies purposed for protecting the occupant such as seats and restraints. Blast and crash mitigation technologies are further investigated and matured in such areas as active and passive exterior\/hull\/cab\/kits, interior energy absorbing capabilities for seats, floors, restraints, sensors for active blast mitigating technologies and performance evaluation, M&S, experimentation and instrumentation. This effort coordinates with PEs 0602618A and 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.384"
                                            },
                                            "Text": {
                                                "val": "Developed blast mitigation technologies to include seats, restraints, flooring and structures at the component and sub-system level to verify sub-system interactions. Evaluated passive and active technology solutions using Finite Element Modeling and Simulation tools along with sub-system laboratory tools to develop a variety of concepts. Verified component and sub-system design guidelines and evaluation techniques. Matured the Warrior Injury Assessment Manikin (WIAMan) in the laboratory environment through durability, repeatability and sensitivity tests of the WIAMan device components and system. Began development of WIAMan test device certification procedures through calibration testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.335"
                                            },
                                            "Text": {
                                                "val": "Will complete the design of subsystem concepts for the integration of seats, restraints, flooring and structures; will verify subsystem concepts and the associated technology interactions of the seats, restraints, flooring and structures through performance modeling and simulation; will develop certification test procedures to enable verification of the next generation WIAMan technology demonstrator based on laboratory and calibration testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.932"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.932"
                                            },
                                            "Text": {
                                                "val": "Will design subsystem concepts for integration of armor and Modular Active Protection System (MAPS) surrogate hardware; will validate design of subsystem components required for integration of seats, restraints, flooring and structures through structural and blast analysis; will mature WIAMan certification test procedures based on test results."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synergistic Vehicle Protection Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and integrates advanced synergistic survivability technologies and simulation tools to provide enhanced protection for ground vehicles while minimizing overall system burdens. Synergistic survivability technologies such as, armor and active protection, offer the potential of non-linear survivability improvements. The modular approach facilitates trade-offs between protection, payload, performance, cost drivers and performance of vulnerability assessments throughout the life cycle of a system. Provides quantifiable metrics for development of requirements and evaluation of concept feasibility in the development of survivable combat systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.651"
                                            },
                                            "Text": {
                                                "val": "Leveraged the enhanced protected mobility optimization and assessment tools and methodologies developed previously to design future vehicle concepts, optimized protection and mobility technologies to minimize system burdens, and identified future technology metrics and requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.202"
                                            },
                                            "Text": {
                                                "val": "Will utilize survivability and mobility assessment tools and methodologies to continue to develop future vehicle concepts targeting a range of vehicle weight classes; will investigate vehicle concepts that are modular in nature to accommodate multiple mission requirements; will explore vehicle concepts that utilize lightweight non-structural components while maintaining survivability and mobility performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improved Situational Awareness for Ground Platforms"
                                    },
                                    "Description": {
                                        "val": "This effort investigates situational awareness (SA) technologies and architectures to improve occupant and vehicle survivability in all conditions and environments to include degraded visual environments (DVE) for ground vehicles. This effort also investigates and analyzes electronic architectures to enable the efficient integration of DVE systems such as intra-vehicle data and video networks, SA input\/output devices, and associated software architectures and interfaces. This effort coordinates with PEs 0603005A, 0602709A, and 0603710A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.760"
                                            },
                                            "Text": {
                                                "val": "Integrated aviation-based DVE sensors onto an Indirect Vision Driving vehicle through the Integrated Digital Video System (IDVS); developed algorithms that determine how to take World Model information from various sources and overlaid that information in real time on the Indirect Vision Driving screens to aid the vehicle operator in visually occluded environments. Conducted human-in-the-loop experiments of the Indirect Vision Driving system augmented with DVE sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.242"
                                            },
                                            "Text": {
                                                "val": "Will design and develop scalable sensing and immersive intelligence for local SA for DVE for ground vehicle systems; will develop digital architecture and sensor processing with in-vehicle displays for the indirect vision driver. Will investigate hostile fire localization and collision avoidance through the radar and electro-optic sensor, which will improve situational awareness, improve indirect driving maneuverability, and threat detection for improved vehicle and occupant survivability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.608"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.608"
                                            },
                                            "Text": {
                                                "val": "Will validate increased SA in DVE to enable indirect vision driving maneuverability, driving aids to reduce accidents & threat detection to improve survivability. Will improve operational tempo (OPTEMPO) in DVE to maintain OPTEMPO and decrease occupant injury. Will optimize aviation capabilities provided by the Degraded Visual Environment Mitigation (DVE-M) program to provide a complete sensor that is scalable to the mission and vehicle family."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vision Protection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops protection materials, concepts, and devices to protect vehicle occupants' eyes, vehicle cameras and electro-optical fire control systems against emerging laser threats. This effort also evaluates methods to apply the advanced protection materials, concepts, and devices onto vehicle cameras and electro-optical systems to prevent lasers from destroying sighting systems, disabling cameras that provide situational awareness, and damaging or disorienting Warfighter vision. Coordinated work is also being performed in PEs 0602120A, 0602705A, 0602712A and 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.849"
                                            },
                                            "Text": {
                                                "val": "Conducted damage threshold and damage mechanism studies on current day cameras and optical systems from short-pulsed laser threats. Improved capability to conduct experiments and validation of protection concepts against emerging laser threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.708"
                                            },
                                            "Text": {
                                                "val": "Will evaluate high energy laser threats to determine their threat parameters for testing sensors against the threats; will develop concepts to protect current systems against the ultra-short pulse laser threat that leverages initial capability testing completed on power-limiting materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.863"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.863"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to mature protected day cameras for near-term threat protection; design and mature concepts for future systems to protect against current and future laser threats; improve laboratory capability to enable integration and testing of vision protection concepts on ground vehicles."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H77"
                    },
                    "ProjectTitle": {
                        "val": "National Automotive Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.125"
                        },
                        "CurrentYear": {
                            "val": "15.936"
                        },
                        "BudgetYearOne": {
                            "val": "17.977"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.977"
                        },
                        "BudgetYearTwo": {
                            "val": "12.094"
                        },
                        "BudgetYearThree": {
                            "val": "12.423"
                        },
                        "BudgetYearFour": {
                            "val": "14.929"
                        },
                        "BudgetYearFive": {
                            "val": "15.288"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the National Automotive Center (NAC), which was chartered by the Secretary of the Army to conduct shared government and industry (dual use) technology programs to leverage commercial investments in automotive technology research and development for Army ground combat and tactical vehicle applications. Primary thrusts for this activity include advanced power and energy technologies for tactical and non-tactical ground vehicles, electric infrastructure and alternative energy for installations and bases, vehicle networking and connectivity to maximize overlap between commercial and military requirements. Active outreach to industry, academia and other government agencies develops new thrust areas for this Project to maximize shared commercial and government investment.\n\nThis Project supports Army science and technology efforts in the Ground Maneuver portfolio. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this Project is performed by Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, Michigan."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Power, Energy and Mobility:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates dual use power, energy, and mobility technologies leveraging commercial and academic investment to military application. This effort focuses on technologies such as lightweight composite materials, electrification of engine accessories, alternative fuels, hybrid vehicle architectures, and compact electrical power generation in order to maximize common investment to meet Army ground vehicle requirements. This work is done in conjunction with Program Elements (PEs) 0603005A and 0603125A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.072"
                                            },
                                            "Text": {
                                                "val": "Continued joint activities with Department of Energy and Department of Transportation to exploit fuel efficient vehicle operation for military platforms and duty cycles. Continued to support the transition of technology to\/from industry and government. Developed and matured fuel cell systems for initial integration experiments of fuel cells onto vehicles. Investigated fuel reduction and water generation technologies to determine logistical impacts, leveraging commercial and academic investments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.309"
                                            },
                                            "Text": {
                                                "val": "Will continue to support the transition of technology to\/from industry and government. Will continue to investigate fuel reduction and water generation technologies to determine logistical impacts, leveraging commercial and academic investments. Will mature fuel quality monitoring technologies for dual use in commercial, combat, and tactical systems. Will design and develop water treatment and reuse technologies to reduce logistics burdens of resupplying water to the battlefield. Will continue to collaborate with automotive industry and Department of Energy in fuel cell technology maturation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.391"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.391"
                                            },
                                            "Text": {
                                                "val": "Will continue to investigate new computer-aided engineering tools for vehicle batteries that can accurately predict the combined structural, electrical, and thermal responses to military usage conditions. Will continue to investigate new computer-aided engineering tools for vehicle engines that accurately model fuel injection spray, cavitation within fuel injectors, flash boiling, spray\/wall interaction, super critical fuel injection, in-cylinder radiation and heat transfer, engine knock and soot emissions. Will continue to investigate alternate integrated starter generator motors that achieve the required power and torque densities without Rare-Earth materials. Will continue to collaborate with automotive industry and Department of Energy in fuel cell technology maturation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dual Use Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, researches and evaluates ground vehicle technologies with both military and commercial applications such as renewable energy technologies, electrical power management between vehicles and the grid, alternative fuels, new human machine interfaces, and advanced vehicle networking, automation, and secure communication (telematics). This effort maximizes commercial technology investment for military applications in line with the National Automotive Center's Charter. Collaborations with industry, universities and other government agencies on standards writing for joint applications will facilitate this activity. This work is done in conjunction with PE 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.053"
                                            },
                                            "Text": {
                                                "val": "Continued to leverage commercial automotive and trucking research and development centers to transition reliable, affordable technology solutions to our military ground vehicle fleet. Continued to leverage industry's state of the art vehicle electrification and open vehicle architecture standards and facilitate transition into military ground vehicles. Continued to research and develop autonomous vehicle standards with industry and other government organizations. Matured intelligent ground vehicle systems and develop mission payloads for dual use applications to increase efficiencies. Investigated solutions to transition commercial fuel cell technologies to military ground systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.627"
                                            },
                                            "Text": {
                                                "val": "Will continue to leverage commercial automotive and trucking research and development centers to transition reliable, affordable technology solutions to our military ground vehicle fleet. Will continue dual use collaborative investigations of military & commercial open vehicle architecture standards, electrification standards, vehicle security engineering best practices, and communication systems integration challenges through collaborative mechanisms such as High-efficiency Truck Users Forum (HTUF). Will design and develop dual use autonomy-enabled vehicle component technologies and material handling equipment for use in reducing convoy manpower and optimizing logistical operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.586"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.586"
                                            },
                                            "Text": {
                                                "val": "Will continue to leverage commercial automotive and trucking research and development centers to transition reliable, affordable technology solutions to our military ground vehicle fleet. Will continue dual use collaborative investigations of military & commercial ongoing open vehicle architecture standards, electrification standards, autonomous systems technologies and integration, vehicle security engineering best practices, and communication systems integration challenges through collaborative mechanisms such as the Society of Automotive Engineers, Automation Alley, the Center for Automotive Research (CAR), and the HTUF. Will conduct integration of autonomy systems on international vehicles and demonstrate an autonomous convoy with advanced vehicle behaviors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H91"
                    },
                    "ProjectTitle": {
                        "val": "Ground Vehicle Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.946"
                        },
                        "CurrentYear": {
                            "val": "27.643"
                        },
                        "BudgetYearOne": {
                            "val": "27.827"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.827"
                        },
                        "BudgetYearTwo": {
                            "val": "30.441"
                        },
                        "BudgetYearThree": {
                            "val": "35.220"
                        },
                        "BudgetYearFour": {
                            "val": "40.264"
                        },
                        "BudgetYearFive": {
                            "val": "35.021"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs, develops, and evaluates a variety of innovative enabling technologies in the areas of vehicle concepts, virtual prototyping, electrical power, thermal management, propulsion, mobility, survivability, vehicle diagnostics, fuels, lubricants, water purification, intelligent systems, autonomy-enabled systems, and other component technologies for application to combat and tactical vehicles.   \n\nThis Project supports Army science and technology efforts in the Ground Maneuver portfolio. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Combat Vehicle Modernization Strategy.  \n\nWork in this Project is performed by the Tank Automotive Research, Development, and Engineering Center (TARDEC), Warren, Michigan. Efforts in this Project are closely coordinated with the Army Research Laboratory (ARL), the Defense Advanced Research Projects Agency (DARPA), the Army Engineer Research and Development Center, Edgewood Chemical Biological Center (ECBC), and the Army Medical Command (MEDCOM)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pulse Power:"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on growing compact, high frequency\/high energy\/high power density components and devices for several advanced electric-based survivability and lethality weapon systems. Technologies include direct current (DC) to DC chargers, high energy batteries, pulse chargers, high density capacitors, and solid state switches. This effort is coordinated with Program Elements (PEs) 0603005A and 0602705A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.293"
                                            },
                                            "Text": {
                                                "val": "Completed the design and integration of energy storage and high-voltage power electronic components into a system that enables high mass-efficiency electromagnetic threat defeat mechanisms. Began pulse power system laboratory testing to validate the power system performance needed for electromagnetic armor threat defeat. Completed design of an electromagnetic armor module."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.568"
                                            },
                                            "Text": {
                                                "val": "Will complete laboratory testing of pulse power system performance to enable electromagnetic armor threat defeat. Will complete pulse power system environmental and durability laboratory testing to validate the ability of the system to operate in relevant environments. Will mature electromagnetic armor modules in preparation for testing of the integrated pulse power and electromagnetic armor system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Propulsion and Thermal Systems:"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs and evaluates high power density engines and transmission systems needed to offset increasing combat vehicle weights (armor), improved fuel economy (fuel cost & range), and reduced cooling system burden (size, heat rejection). This effort also researches and matures thermal management technologies and systems including heat energy recovery, propulsion and cabin thermal management sub-systems to utilize waste heat energy and meet objective power and mobility requirements on all ground vehicles. Lastly, this effort maximizes efficiencies within propulsion and thermal systems to reduce burden on the vehicle while providing the same or greater performance capability. This effort is coordinated with PE 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.928"
                                            },
                                            "Text": {
                                                "val": "Designed and developed an advanced heat exchanger and efficient fan subsystem to increase cooling capabilities and fuel efficiency. Designed waste heat recovery system for military vehicle applications to provide additional onboard electrical power. Matured engine component concept designs through thermal, structural and reliability modeling and simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.895"
                                            },
                                            "Text": {
                                                "val": "Will investigate advanced heat exchanger and efficient fan components to determine cooling performance and component efficiencies. Will conduct analysis and cooling system design optimization on an advanced combat vehicle propulsion system design that incorporates the advanced cooling components with a waste heat recovery system that maximizes propulsion cooling performance and minimizes parasitic power draw from the vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.466"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.466"
                                            },
                                            "Text": {
                                                "val": "Will mature advanced heat exchanger, efficient fan, and waste heat recovery system into advanced thermal management system. Will mature advanced thermal management system concept design in preparation of integration into advanced combat vehicle propulsion system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Management Technologies:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates power management technologies, software, and implementation approaches. Technologies include Alternating Current (AC) to Direct Current (DC) inverters, DC-DC converters, solid state circuit protection, power distribution, and automated control of complete power systems. Special emphasis has been placed on developing high temperature capable power electronics, leading to the use of Silicon Carbide (SiC) in the above technologies. This effort coordinates with PE 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.484"
                                            },
                                            "Text": {
                                                "val": "Completed development of the next generation power architecture and corresponding system design using SiC power electronics and low cost computers. Integrated high and low voltage power components into a System Integration Lab (SIL) and conduct validation of the power architecture and power electronics in the SIL, demonstrating SiC and automated power management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.625"
                                            },
                                            "Text": {
                                                "val": "Will conduct analysis and system integration laboratory testing power architectures for the next generation military vehicles in order to provide efficient distribution and control of power across the platform. Will begin power architecture control software development in order to establish power quality, prioritization and optimization algorithms that maximize available power on the vehicle. Will begin environmental, electromagnetic interference (EMI) and reliability performance testing of vehicle power architecture system components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.685"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.685"
                                            },
                                            "Text": {
                                                "val": "Will complete testing of Gallium Nitride (GaN) and SiC based leap-ahead electrical power system in the SIL to troubleshoot issues in preparation for future combat vehicle integration. Will continue environmental, EMI, reliability performance, and other testing of vehicle power architecture system components and software to prepare for future combat vehicle testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Electronics, Hybrid Electric and Onboard Vehicle Power (OBVP) Components:"
                                    },
                                    "Description": {
                                        "val": "This effort researches, develops and evaluates technologies to increase onboard vehicle electric power to enable vehicle systems such as advanced survivability systems, situational awareness systems, advanced computing, and the Army network. This effort researches, designs and evaluates high temperature and efficient power generation components to provide increased electrical power and reduced thermal loads using high operating temperature switching devices and advanced electrical generation components such as integrated starter generators and integrated starter alternators. This effort also researches, designs and evaluates advanced control techniques for power generation components to make these systems more efficient, increase electrical power output and reduce thermal loads. This effort is coordinated with PE 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.172"
                                            },
                                            "Text": {
                                                "val": "Designed and developed a high power generator, high temperature inverter and electronic controls strategy to electrify and control parasitic vehicle automotive loads to increase onboard vehicle power availability and fuel efficiency with no negative impact to vehicle mobility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.288"
                                            },
                                            "Text": {
                                                "val": "Will continue development of components for a high power generator, high temperature inverter and electronic controls strategy to electrify and control parasitic vehicle automotive loads to increase onboard vehicle power availability and fuel efficiency with no negative impact to vehicle mobility. Components will be assembled into a brass board configuration to begin system design and control algorithm development for a vehicle power system control strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Will complete testing of integrated starter generator system in brass board configuration. Will begin analysis and system design optimization on an advanced combat vehicle propulsion system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Non-Primary Power Systems:"
                                    },
                                    "Description": {
                                        "val": "This effort researches, investigates, conducts experiments and validates Auxiliary Power Units (APUs) technologies such as modular\/scalable engine based APUs, fuel cell reformer systems to convert JP-8 to hydrogen, sulfur tolerant JP-8 fuel cell APUs and novel engine based APUs for military ground vehicle and unmanned ground systems. This effort also determines inputs for APU interface control documents, as well as investigates solutions for reducing APU acoustic signature for silent operation during mounted surveillance missions. This effort investigates the use of small engines and JP-8 fuel cell systems for use as prime power solutions for unmanned ground systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.838"
                                            },
                                            "Text": {
                                                "val": "Designed and developed high power rotary engine technologies to increase the power density up to two times current power densities of other heavy fueled internal combustion engines. Investigated and designed active noise control, muffler and insulation technologies to reduce the acoustic signature of engine-based APU to decrease detection during mounted surveillance missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.298"
                                            },
                                            "Text": {
                                                "val": "Will complete system analysis of an advanced APU to include cooling, dust mitigation and control approaches for a rotary engine-based engine-generator. Will continue the development of an approach to advanced noise control strategies that include technologies such as active noise cancellation, isolation and muffling to reduce acoustic signature of engine-based APUs to decrease auditory detection during mounted surveillance missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.327"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.327"
                                            },
                                            "Text": {
                                                "val": "Will investigate advanced APU to verify performance, control strategy and advanced noise control. Will continue to optimize active noise cancellation, isolation and muffling to decrease auditory detection during mounted surveillance missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Elastomer Improvement Program:"
                                    },
                                    "Description": {
                                        "val": "This effort researches, formulates and tests new elastomer (rubber) compounds for vehicle track systems to increase track system durability, reduce track system failures and reduce Operations & Sustainment (O&S) costs related to premature track system failures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.637"
                                            },
                                            "Text": {
                                                "val": "Fabricated elastomer samples with optimized compounds for durability evaluation. Validated durability evaluation data with predictive fatigue models. Performed design iterations of track system elastomer components based on field test results and fatigue modeling and simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.662"
                                            },
                                            "Text": {
                                                "val": "Based on results from previous field testing, will update current compounds or designs for elastomeric components in both road wheels and track systems to improve durability performance. Will update modeling and simulation of elastomer durability models with validated results. Will fabricate the updated component designs for road wheels and track systems, and evaluate the latest designs through laboratory testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.662"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.662"
                                            },
                                            "Text": {
                                                "val": "Will formulate final compounds for selection and inclusion on the advanced running gear demonstration platform. Will mold compounds for the track pad, bushing and road wheels. Will perform final laboratory evaluations on selected finished product compounds and then produce quantity for demonstrator evaluations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligent Systems Technology Research:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates improved operations of manned platforms through the application of sensing and autonomy technologies developed for unmanned systems such as maneuver and tactical behavior algorithms, driver assist techniques, autonomy kits, advanced navigation and planning, vehicle self-protection, local situational awareness, advanced perception, vehicle and pedestrian safety, active safety, and robotic command and control. This effort is coordinated with efforts in PEs 0602120A, 0602784A, 0603005A, and 0603734A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.363"
                                            },
                                            "Text": {
                                                "val": "Developed autonomous behaviors for mounted and dismounted ground vehicle systems that are adaptable to different missions and environments. Developed advanced cognitive control through feedback coupling of Soldier-Unmanned Ground Vehicle system capabilities and behavior at neural, neurocognitive, and sociocognitive levels. Matured reliable and consistent autonomous capabilities for mounted and dismounted ground vehicle systems to increase autonomous vehicle control and reduce required level of human interaction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.832"
                                            },
                                            "Text": {
                                                "val": "Will investigate effective control of unmanned systems operating with soldier trust in autonomous systems, and manned\/unmanned teaming. Will design and develop common interfaces, drive-by-wire, and advanced vehicle behavior technologies with immediate installation and base operation requirements that will allow investigation between controlled to uncontrolled hostile environments. Will design and develop the Warfighter-Machine Interface with scalability and driver\/crew aids. Will investigate tactical resupply perception models, location fidelity of supply, and software algorithms to meet dynamic stockage objectives to improve throughput."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.917"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.917"
                                            },
                                            "Text": {
                                                "val": "Will continue to design and develop the Warfighter Machine Interface for scalability and driver\/crew aids. Will mature the increased reliability of robotic technologies to produce trust and confidence of autonomous vehicles. Will improve standardized data collection tools and methodologies to mature Department of Defense (DoD) ground robotic requirements, development, technology investments and procurement decisions. Will conduct experiments to validate that these tools and technologies are increasing our capabilities of protecting the force, reducing burden on soldiers, and mission command & tactical intelligence."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Storage:"
                                    },
                                    "Description": {
                                        "val": "This effort investigates novel advanced ground vehicle energy storage devices such as advanced chemistry batteries and ultra capacitors for starting, lighting, and ignition and silent watch requirements for powering vehicle electronics and communications systems with main engine off. Develop and test energy storage devices to meet harsh military requirements that far exceed commercial requirements such as extreme temperature operation (-46 to +71C), ballistic shock and vibration, and electromagnetic interference (in accordance with MIL-STD-810G). Designs and develops advanced batteries to reduce battery volume and weight while improving battery energy and power densities within the same footprint and standardized form factor of current batteries (6T) to enhance logistics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.231"
                                            },
                                            "Text": {
                                                "val": "Designed and developed advanced cell level materials to fit into standardized military battery form factors such as 6T. Designed improved advanced standardized battery prototypes by incorporating advanced cell materials. Developed and matured electrochemical cell designs to improve energy density, starting, lighting, propulsion system ignition, silent watch and reliability of military specific battery."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.475"
                                            },
                                            "Text": {
                                                "val": "Will conduct durability and performance testing at the battery cell level for advanced Li-ion chemistries to improve energy density, starting, lighting, propulsion system ignition, silent watch and reliability of military specific batteries. Will begin design work to package the battery cells into modules and full battery packs in the military form factor (6T), to include battery voltage monitoring, state of charge and battery safety control systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.520"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.520"
                                            },
                                            "Text": {
                                                "val": "Will design and mature battery cells into modules. Will then design and mature battery packs built around the modules. Will conduct durability and performance testing at the module level for advanced Li-ion chemistries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Tamper"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops mature anti-tamper methodologies and technologies in combat and tactical vehicles. Technologies such as controllers and tactical information systems for autonomous appliques, active protection systems, and Command, Control, Communications, Computers & Intelligence (C4I), will be designed for enhanced protection against current and evolving threats. This includes: enhancing and defending technologies used to secure data in vehicle systems; defending against the threat of unwanted behavioral changes in multi-agent systems; the prevention of unauthorized control of, or denying service to a targeted platform; reverse engineering and conducting vehicle digital forensics; and responding to active attacks that have penetrated anti-tamper defenses in a platform."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Will develop measurement, analysis and verification methods to identify vulnerabilities of combat and tactical vehicle software-based technologies; will capitalize on currently available virtual (Modeling & Simulation) toolsets to design and ‘virtually’ conduct experiments of potential safeguards and solutions of the vehicle architecture, and will begin to evaluate methods and toolsets on ground vehicle hardware. Will investigate applications of anti-tamper that are applicable to both current and future vehicles."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T26"
                    },
                    "ProjectTitle": {
                        "val": "Ground Vehicle Technologies (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.600"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Ground Vehicle Technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.600"
                                        },
                                        "Text": {
                                            "val": "This is a Congressional Interest Item."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T31"
                    },
                    "ProjectTitle": {
                        "val": "NAT'L AUTO CENTER APP RES INIT (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for National Automotive Center applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20.000"
                                        },
                                        "Text": {
                                            "val": "This is a Congressional Interest item."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}