{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c43fbf6cbb750060d4e843075183a8e999b0dddb3a2f8fae77d834880adb92d8-45",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604400D8Z"
        },
        "ProgramElementTitle": {
            "val": "Department of Defense (DoD) Unmanned Systems Common Development"
        },
        "R1LineNumber": {
            "val": "101"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "50.945"
            },
            "PriorYear": {
                "val": "7.731"
            },
            "CurrentYear": {
                "val": "3.320"
            },
            "BudgetYearOne": {
                "val": "3.967"
            },
            "BudgetYearOneBase": {
                "val": "3.967"
            },
            "BudgetYearTwo": {
                "val": "3.811"
            },
            "BudgetYearThree": {
                "val": "3.826"
            },
            "BudgetYearFour": {
                "val": "3.898"
            },
            "BudgetYearFive": {
                "val": "3.975"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense (DoD) Unmanned Systems (UxS) Common Development program is a joint effort to develop and demonstrate common standards, architectures, and technologies that address unmanned systems’ issues across all Military Services.  The intent is to increase interoperability and effectiveness by promoting cooperative development of solutions that are applicable across all unmanned systems.  This effort initially focused on addressing DoD unmanned aircraft system (UAS) integration into the National Airspace System (NAS) and a demonstration of a common, interoperable ground station architecture and associated interface standards. While UAS initially were the primary focus, interoperability among all unmanned and manned systems is the long-term goal."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.786"
                },
                "CurrentYear": {
                    "val": "3.320"
                },
                "BudgetYearOne": {
                    "val": "3.998"
                },
                "BudgetYearOneBase": {
                    "val": "3.998"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.731"
                },
                "CurrentYear": {
                    "val": "3.320"
                },
                "BudgetYearOne": {
                    "val": "3.967"
                },
                "BudgetYearOneBase": {
                    "val": "3.967"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.055"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.031"
                },
                "BudgetYearOneBase": {
                    "val": "-0.031"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.055"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Management Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.004"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "DTIC Offset Bill"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.027"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.027"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY2017 funding request was reduced by $ 0.063 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P440"
                    },
                    "ProjectTitle": {
                        "val": "UAS Airspace Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "29.028"
                        },
                        "PriorYear": {
                            "val": "3.660"
                        },
                        "CurrentYear": {
                            "val": "0.990"
                        },
                        "BudgetYearOne": {
                            "val": "1.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.000"
                        },
                        "BudgetYearThree": {
                            "val": "1.000"
                        },
                        "BudgetYearFour": {
                            "val": "1.000"
                        },
                        "BudgetYearFive": {
                            "val": "1.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Airborne Sense-and-Avoid (ABSAA) and Ground Based Sense-and-Avoid (GBSAA) technology development transitioned to UAS programs of record during FY2013."
                        },
                        "ProjectMissionDescription": {
                            "val": "Global Hawk and Triton, as well as other Group 3-5 UAS, need a sense-and-avoid (SAA) capability as an alternate means of compliance to Title 14 Code of Federal Regulations, Part 91.111 and Part 91.113, requirement to see-and-avoid other aircraft.  The Air Force is leading the effort to develop an ABSAA system that is suitable to support operations within US and foreign national airspace. The RQ-4 Global Hawk, MQ-4C Triton, MQ-1B Predator, MQ-1C Gray Eagle, and MQ-9 Reaper all have a requirement for SAA capability and will leverage the technology being developed by the Air Force. The Army is leading the development of a GBSAA system to provide a solution for improved airspace access in terminal operations as well as  operations\/training within the GBSAA system's coverage area (e.g., Gray Eagle at Fort Hood, Shadow operations at Cherry Point). This system will provide a near-term solution and is an integral part of the long-term permanent solution.\n \nThis joint funding also supports development of common operating concepts, policy, standards, modeling and simulation, and technology to enable DoD UAS to routinely access the national and international airspace systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned Aircraft System Airspace Integration Initiatives"
                                    },
                                    "Description": {
                                        "val": "Starting in FY 2010 the Department's sense-and-avoid (SAA) developmental efforts are enhanced by this defense-wide program element. This program has provided joint funding to accelerate the development of SAA technology and standards to enable UAS to routinely access the national and international airspace systems.  This program also supports development of UAS airspace integration policy and standards, as well as the modeling, simulation, and operational analysis needed to validate the standards.  In FY 2013 ABSAA and GBSAA efforts transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.660"
                                            },
                                            "Text": {
                                                "val": "Completed updates to and implemented DoD\/FAA MOA.  Implemented findings from the Joint Test of UAS operation in US airspace. Completed small UAS Groups 1-3 airworthiness requirements study and provided a document that identifies gaps and recommends courses of action. Completed survey and analysis of UAS CONUS operating locations and airspace requirements.  Continued analysis of UAS AI Safety Case issues to expand UAS access to the NAS. Developed and validated separation minima that enabled low-altitude military UA to remain well clear of other aircraft.  Identified and addressed key capability gaps for broad-spectrum military UAS operations at low altitudes.  Through the SARP, coordinated with and leverage the resources of the FAA, NASA and DHS to work common integration challenges. Investigated and identified best-candidate solutions for low size, weight, power and cost approaches supporting military small UAS (sUAS) operations in national, international and foreign national airspace. Finalized and reported recommended criteria and methods to quantify the contribution of the UAS pilot performance of the SAA function to overall airspace safety. Engaged with FAA to discuss concepts, architectures, functional requirements as well as policy and procedural issues regarding UAS Spectrum, Communications, Command and Control and other infrastructure that was enhanced, improved or replaced in order to facilitate DoD UAS integration into the NAS. Collaborated to develop and implemented operating systems in the NAS that support UAS integration, such as GBSAA. Identified specific use cases of current operations and identified the gaps\/deltas between current UAS operations in the NAS under a Certificate of Waiver or Authorization (COA) and UAS operating as fully integrated into the NAS.  Identified specific scenarios for research, implementation, and testing. Identified operational use cases for research, development, and testing, and provided semantic decision support, and modeling and simulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.990"
                                            },
                                            "Text": {
                                                "val": "Evaluate and validate identified best-candidate solutions for low size, weight, power and cost technology supporting military sUAS operations in national, international and foreign national airspace.  Develop and finalize quantitative safety assessment approaches that support unique UAS operations to support emerging DoD needs and inform future rulemaking. Make formal recommendations for separation minima that enable low-altitude military UAS to remain well clear of other aircraft. Continue to engage the FAA to advance DoD UAS airspace integration. Finalize implementation of the UAS Airspace Integration Joint Test into Service regulations and training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Evaluate and validate identified best-candidate solutions for low size, weight, power and cost technology supporting military sUAS operations in national, international and foreign national airspace.  Develop and finalize quantitative safety assessment approaches that support unique UAS operations to support emerging DoD needs and inform future rulemaking. Make formal recommendations for separation minima that enable low-altitude military UAS to remain well clear of other aircraft. Continue to engage the FAA to advance DoD UAS airspace integration. Finalize implementation of the UAS Airspace Integration Joint Test into Service regulations and training."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P442"
                    },
                    "ProjectTitle": {
                        "val": "Interoperability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "20.834"
                        },
                        "PriorYear": {
                            "val": "3.859"
                        },
                        "CurrentYear": {
                            "val": "1.980"
                        },
                        "BudgetYearOne": {
                            "val": "2.617"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.617"
                        },
                        "BudgetYearTwo": {
                            "val": "2.461"
                        },
                        "BudgetYearThree": {
                            "val": "2.476"
                        },
                        "BudgetYearFour": {
                            "val": "2.548"
                        },
                        "BudgetYearFive": {
                            "val": "2.625"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Interoperability project will develop and demonstrate an interoperable, standards-based, open ground station architecture for cross-domain (air, ground, maritime) unmanned systems.  The intent is to improve joint and coalition interoperability and to promote competition through the implementation of open standards and open architectures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interoperability"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an interoperable, standards-based, open ground station architecture for cross-domain (air, ground, maritime) unmanned systems; improve joint and coalition interoperability; and promote competition through the implementation of open standards and open architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.859"
                                            },
                                            "Text": {
                                                "val": "Joint Service along with Industry demonstrated a combined UAV Tactical C2 capability with the Marine Corps KMAX Platform. The combined C2 capability demonstrated a Navy Common Control Station (CCS) and Air Force Common Mission Command Center (CMCC) working together and sharing mission and telemetry data using UAS Control Segment Architecture (UCS) interfaces. \n  \nDeveloped a Joint Communication Architecture for Unmanned Systems (JCAUS) which aims to establish a Government and Industry framework for unmanned systems communications. The architecture aligns with modular open systems architecture principles and allows PoRs to encourage competitive business environments and to react to emerging and urgent communication requirements faster by providing a framework for rapid technology insertions. \n\nEstablished an MOA between Navy and Army Unmanned Ground Systems (UGS) PoRs to assess their Joint Architecture Unmanned System (JAUS) based test tools to develop a plan that will combine and standardize the tools sets.\n\nSponsored an Unmanned Systems Interoperability and Integration workshop\/technical exchange that focused on the integration aspects of unmanned systems, rather than the technology of the systems themselves.  Focus areas were Unmanned Systems Integration with Platforms (integration of UxS to Aircraft, Ships, Ground Vehicles); with other Systems (integration of payloads, weapons, sensors); with Humans (operator interaction, human-robot interface, controllers, trust issues, training etc.) and Integration with the Force\/Fleet (mission integration).\n\nAssessed the Unmanned Systems Safety Guidance Document, publish in 2007, for technology advancement gaps due to the evolution of autonomous technology and unmanned systems. The identified gaps were categorized as “critical”, “substantial” and “other”.   The six critical gaps resulted largely from the evolution of unmanned systems into more autonomous and learning systems, increased weaponization of the systems, easier access to such systems by all nations and even non-nation actors, and the increasingly robotic (or mobile) nature of unmanned systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.980"
                                            },
                                            "Text": {
                                                "val": "Continue SAE working group support for UAS Control Segment Architecture (UCS) interfaces and Joint Architecture Unmanned System (JAUS).  \nDevelop JCAUS compliant prototypes to validate and further mature the architecture.\nContinue support for Unmanned Systems Interoperability and Integration workshop\/technical exchange meeting.\nSponsor development effort to standardize the UGS test suite tool set.\nUpdate the Unmanned Systems Safety Guidance Document.\nEstablish and align DoD Interoperability Strategic Goals with DoD Third Off-set Strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.617"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.617"
                                            },
                                            "Text": {
                                                "val": "Continue SAE working group support for UAS Control Segment Architecture (UCS) interfaces and Joint Architecture Unmanned System (JAUS).  \nContinue JCAUS compliant prototypes to validate and further mature the architecture.\nContinue support for Unmanned Systems Interoperability and Integration workshop\/technical exchange meeting.\nContinue support to DoD Interoperability IPT."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "n\/a"
                        },
                        "PerformanceMetrics": {
                            "val": "n\/a"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P443"
                    },
                    "ProjectTitle": {
                        "val": "Unmanned Systems Roadmap"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.083"
                        },
                        "PriorYear": {
                            "val": "0.212"
                        },
                        "CurrentYear": {
                            "val": "0.350"
                        },
                        "BudgetYearOne": {
                            "val": "0.350"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.350"
                        },
                        "BudgetYearTwo": {
                            "val": "0.350"
                        },
                        "BudgetYearThree": {
                            "val": "0.350"
                        },
                        "BudgetYearFour": {
                            "val": "0.350"
                        },
                        "BudgetYearFive": {
                            "val": "0.350"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This effort supports the Department's Unmanned Systems Integrated Roadmap and updates.  The roadmap provides a DoD vision for the continuing development, fielding and employment of unmanned systems technologies; establishes the current state of unmanned systems in today’s force; and outlines a strategy to address common challenges to achieve the shared vision across all unmanned domains (air, ground, and maritime)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned Systems Roadmap"
                                    },
                                    "Description": {
                                        "val": "Develops and updates the Department's Unmanned Systems Integrated Roadmap."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.212"
                                            },
                                            "Text": {
                                                "val": "Updated and published the Department's \"Unmanned Systems Integrated Roadmap, 2016-2041\" and performed related studies supporting the Department's vision for unmanned systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Update the Department's Unmanned Systems Integrated Roadmap and perform related studies supporting the Department's vision for unmanned systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Update the Department's Unmanned Systems Integrated Roadmap and perform related studies supporting the Department's vision for unmanned systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Provide up-to-date Unmanned Systems Roadmap providing a DoD vision for the continuing development, fielding and employment of unmanned systems technologies."
                        }
                    }
                }
            ]
        }
    }
}