{
    "id": "2018-Navy-PB-1319-MJBOOK-0-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-28",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603801N"
        },
        "ProgramElementTitle": {
            "val": "(U) Innovative Naval Prototypes (INP) Adv Tech Dev"
        },
        "R1LineNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "108.285"
            },
            "BudgetYearOneBase": {
                "val": "108.285"
            },
            "BudgetYearTwo": {
                "val": "86.342"
            },
            "BudgetYearThree": {
                "val": "87.193"
            },
            "BudgetYearFour": {
                "val": "87.201"
            },
            "BudgetYearFive": {
                "val": "88.945"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) address the Advanced Technology Development associated with the Innovative Naval Prototypes (INP) Program and its associated Leap Ahead Technology (LA-Tech) investments.  These investments represent game changing technologies with the potential to revolutionize operational concepts.  They are disruptive in nature as they would dramatically change the way naval forces fight.  INPs push the imagination of our nation's technical talent to deliver transformational warfighting capabilities. The projects in this portfolio are high risk, technically challenging technology development efforts that offer the potential of high warfighting payoff in the future.  The goal of these investments is to develop and demonstrate the viability of new technological capabilities via experimental prototypes that prove the new capability could be implemented if an acquisition program were to be established to further develop the demonstrated capability.   These investments are selected by a process that involves senior leadership in the Department of the Navy, with new INPs approved by the 4-star RDT&E Corporate Board.  \n\nDeveloping INPs and Leap Ahead Technologies requires the development of subsystems and components, and efforts to integrate these subsystems and components into system prototypes for field experiments and tests in an appropriate environment.  The efforts funded within this PE include concept and technology demonstrations of components and subsystems, which may be form, fit and function prototypes or scaled models that serve the same demonstration purpose.  The goal of these development efforts is to prove the technological feasibility and assessment of subsystem and component operability and producibility rather than the development of hardware for service use.  By demonstrating the general military utility and direct relevance to identified military needs, the pre-Milestone B technology becomes available for transition and further development within an emerging or new Program of Record.  INPs and LA-Tech investments do not necessarily lead to subsequent development or procurement phases, but they do have the goal of moving out of Science and Technology (S&T) and into the acquisition process within the future years defense program (FYDP).\n\nThis is a new PE for FY 2018 that consolidates all Navy 6.3 Advanced Technology Development investments funding INPs and their associated LA-Tech investments into a single Navy 6.3 PE.  In FY 2017, these investments were spread across 5 separate 6.3 PEs:  0603114N Power Projection Advanced Technology, 0603123N Force Protection Advanced Technology, 0603271N Electromagnetic Systems Advanced Technology, 0603747N Undersea Warfare Advanced Technology and 0603758N Navy Warfighting Experiments and Demonstrations. The consolidation in this PE allows all investments within this portfolio to be viewed in one place.  It greatly enhances the visibility of the program by providing an easily navigable overview of all 6.3 Advanced Technology Development INP and LA-Tech investments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "108.285"
                },
                "BudgetYearOneBase": {
                    "val": "108.285"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "108.285"
                },
                "BudgetYearOneBase": {
                    "val": "108.285"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "95.285"
                                },
                                "BudgetYearOneBase": {
                                    "val": "95.285"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "13.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3400"
                    },
                    "ProjectTitle": {
                        "val": "Innovative Naval Prototypes (INP) Adv Tech Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "108.285"
                        },
                        "BudgetYearOneBase": {
                            "val": "108.285"
                        },
                        "BudgetYearTwo": {
                            "val": "86.342"
                        },
                        "BudgetYearThree": {
                            "val": "87.193"
                        },
                        "BudgetYearFour": {
                            "val": "87.201"
                        },
                        "BudgetYearFive": {
                            "val": "88.945"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "INP investments are typically 4-8 years in duration.  They provide a continuance of basic research by maturing technologies from a Technology Readiness Level (TRL) of 2 or 3 to a TRL of 6.  All prototypes developed within this program require BA2 and BA3 funded technology development, which is coordinated to ensure the investments conclude with a demonstration proving the feasibility of the new technological capability in relevant environment.   The portfolio is periodically refreshed through the selection of new INPs and Leap Ahead Technology (LA-Tech) investments as existing ones are completed.  Successful demonstrations are intended to present the Department of the Navy with a programmatic challenge as these new capabilities can lead to the obsolescence of existing capabilities and significant decisions as to the path forward for integrating the new technological capabilities into the warfighting systems of the future.  \n\nINPs and LA-Tech investments, including FY17 jump-start efforts, have been collectively grouped into R-2 Activities that include Unmanned and Autonomous Systems, Directed Energy \/ Electric Weapons, Electromagnetic Maneuver Warfare, Cyber and Undersea Warfare."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Innovative Prototype (INP) and associated Leap Ahead Technology (LA-Tech) investments that are developing new technologies for cyber warfare.  The Advanced Technology Development effort for the Total Platform Cyber Protection (TPCP) INP was previously funded in PE 0603123N Force Protection Advanced Technology Development. It was selected after the President's Budget for FY17 was delivered to the Congress. The FY 2018 amount reflects the sum total of all Budget Activity (BA) 6.3 Advanced Technology Development efforts in this INP.   Starting in FY 2018, all INP\/LA-Tech investments in Cyber warfare will be shown in this R-2 Activity to better convey exactly what the Office of Naval Research is working on in this area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.238"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.238"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "INP:  Total Platform Cyber Protection (TPCP) \n\nContinue the BA 3 effort for the TPCP project, previously funded in PE 0603123N Force Protection Advanced Technology Development, which will develop leap-ahead resilient cybersecurity tools to enable our warfighting platforms to fight through current and future unauthorized cyber intrusions and ensure command and control of any Naval platform (submarine, surface, and air platforms) by providing an adaptive cyber toolkit and real time cyber sensors.  This project develops a prototype and will demonstrate cyber sensors and automated vulnerability assessment cyber tools that deliver comprehensive defense-in-depth cyber capabilities to monitor, detect, mitigate, and recover from cyber threats in near real-time.  Relevant naval cyber tools will be developed and tested to verify the technology can autonomously perform cyber vulnerability assessments and implement mitigation strategies that protect naval platforms from unauthorized cyber intrusions.   New cyber autonomy tools will be developed to protect critical naval warfighting capabilities supporting multiple missions, including time critical strike, expeditionary warfare, anti-surface warfare, and anti-air warfare.  These tools, which rely on cyber components, will be developed and demonstrated over an extended period of time at several integrated hardware in-the-loop facilities across the Naval Research Enterprise.  Optimized cyber resiliency warfighting effectiveness will be developed and demonstrated.  The technology will be developed to protect common layers of cyber functionality in hardware components, and local, system, and peripheral buses.  The protection will be extended into the system BIOS, hypervisor, operating system, middleware, the application space, and the network infrastructure."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy \/ Electric Weapons"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Innovative Prototype (INP) and associated Leap Ahead Technology (LA-Tech) investments that are developing new technologies for directed energy and electric weapons.   FY 2018 reflects the sum total of all such BA 6.3 Advanced Technology Development efforts in the program.   Some of these efforts were previously funded in PE 0603114N Power Projection Advanced Technology Development and 0603758N Navy Warfighting Experiments and Demonstrations.  Starting in FY 2018, all INP and LA-Tech investments in directed energy and electric weapons will be shown in this R-2 Activity to better convey exactly what the Office of Naval Research is working on in this area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.529"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.529"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "INP:  Electro-Magnetic Railgun (EMRG)\n\nContinue EMRG, which was previously funded in 0603114N Force Protection Advanced Technology Development.  The EMRG capability will support Naval Surface Fire Support (NSFS), Integrated Air and Missile Defense (IAMD), Fast Attack Craft and Fast Inshore Attack Craft (FAC\/FIAC) and Anti-Surface Warfare (ASuW) missions.  Design, fabricate and integrate Electro Magnetic (EM) railgun subsystems and components into a system prototype capable of rep-rate operations.  Assess the manufacturability of major components such as the railgun launcher and pulsed power modules, which are key to the technology capability. Conduct preliminary prototype system tests and demonstrations to prove the technological feasibility of the EMRG capability and assess sub-system and component operability under stressing rep-rate conditions.  Continue developing and testing a prototype rep-rate railgun launcher that is suitable for installation in a prototype railgun gun mount, where the design of the power and energy architecture necessary to support the prototype EMRG system can be assessed.  Continue to test and build full-scale electro-magnetic railgun system prototypes that include the battery charging system, the pulsed power subsystem, and the electromagnetic launcher.  Perform full-scale testing of long-life railgun launcher material solutions inserted in laboratory launchers.  Design, build, test, and evaluate iterative electromagnetic railgun composite launcher prototypes to demonstrate the technological feasibility, performance, multi-shot life, and suitable firing rate of the system.  Continue activities to integrate and test a Hyper Velocity Projectile (HVP) for use with the EMRG.\n\nLA-Tech:  Solid State Laser Technology Maturation (SSL TM)\n\nComplete SSL TM, which was previously funded in 0603114N Force Protection Advanced Technology Development.  Continue development of a maritime laser weapons system prototype and test it on a representative test platform for a naval surface combatant. Conduct the required laser weapon system engineering, design, integration and testing necessary to have a testable, experimental prototype. This system will be capable of supporting missions such as defense against small boat and Unmanned Aerial Vehicle (UAV) swarms and Intelligence, Surveillance and Reconnaissance (ISR) disruption and defeat.  The results of scientific and engineering trade studies, including those that measure atmospheric absorption and turbulence, will be used to support the integration and testing of a maritime beam director and a high power, Solid State Laser (SSL) capable of tracking and engaging surface and airborne targets at a relevant stand-off distance in the maritime environment.  A Hybrid Predictive Avoidance Safety System (HPASS) will be integrated with a solid state laser weapon system demonstrator to de-conflict laser operations with friendly sensors and platforms. At-sea testing will be conducted on the full laser weapon system demonstrator (i.e., prototype) from a representative test platform for a naval surface combatant.\n\nLA-Tech:  High-power Joint Electromagnetic Non-Kinetic Strike (HIJENKS) \n\nContinue HIJENKS, a joint USAF\/USN project previously funded as a FY17 Leap-Ahead jump start effort in PE 0603758N Navy Warfighting Experiments and Demonstrations emergent technology breakthroughs technology.  Develop a High Power Radio Frequency (HPRF) technology payload integrated on an air platform capable of engaging multiple electronic targets with a single, scalable effects weapon across a variety of warfighting missions.  This effort will culminate in a live fire demonstration of a multi-mission\/multi-target HPRF payload integrated into a demonstration platform.  The operational impacts include decreased cost exchange ratios, non-kinetic counter electronic effects, reduced collateral damage, and the ability to engage multiple targets with a single weapon.  This effort aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.  During FY18, the following advanced technology development efforts are planned:  conduct system requirements and preliminary design assessments to further mature the development of an HPRF advanced development (prototype) system; perform trade studies to examine different technical approaches for developing the HPRF prototype and assessing the Technology Readiness Level (TRL) of emerging HPRF sources; begin the initial design of HPRF advanced payload activities; refine the prototype system performance requirements with input from operational stakeholders; study platform integration approaches and begin integration design activities;  begin developing the hardware and software required to integrate an advanced HPRF payload for a future demonstration; analyze platform modifications;  begin testing target classes for the Radio Frequency (RF) waveform specification being developed in BA 6.2; conduct kill-chain studies to identify and recommend design trade-offs to enable weapon system interoperability; begin live fire demonstration planning; and begin conceptually designing the next generation RF source technology."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Maneuver Warfare"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Innovative Prototype (INP) and associated Leap Ahead Technology (LA-Tech) investments that are developing new technologies for Electromagnetic Maneuver Warfare (EMW).   FY 2018 reflects the sum total of all such BA 6.3 Advanced Technology Development efforts in the program.   These efforts were previously funded in PE 0603271N Electromagnetic Systems Advanced Technology Development.  Starting in FY 2018, all INP and LA-Tech investments in Electromagnetic Maneuver Warfare will be shown in this R-2 Activity to better convey exactly what the Office of Naval Research is working on in this area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "INP:  Electromagnetic Maneuver & Control Capability (EMC2)\n\nContinue the EMC2 project, which was previously funded in 0603271N Electromagnetic Systems Advanced Technology Development.  The EMC2 project will enable a battle group to work cooperatively in the Electromagnetic Spectrum (EMS) by optimizing Electronic Warfare (EW), Information Operations (IO), communications, and radar performance.  EMC2 will incorporate the results of its ongoing advanced technology development efforts in Radio Frequency (RF) resource optimization into the Resource Allocation Manager (RAM) construct that was previously developed for single multifunction systems under the InTop program, which optimized spectrum and functional use across a platform and an entire strike group.  EMC2 will begin building a Lowband RF Intelligent Distribution Resource (LowRIDR) prototype and continue efforts to develop a multifunction control system for LowRIDR.  EMC2 will also begin building the necessary advanced technology components of a wideband, multifunction airborne system that can be integrated with ship-based wideband, multifunction systems.  Experimentation and demonstrations will be performed to determine how best to utilize the wideband, multifunction systems that have already been delivered {i.e., Wideband Submarine Satellite Communications (SubSatCom), EW\/IO\/Communications and Flexible, Distributed Array Radar (FlexDAR)} to enable EMW and provide the ability to dominate the EMS domain.\n\nINP:  Nemesis \n\nComplete the Nemesis project, previously funded in 0603271N Electromagnetic Systems Advanced Technology Development, by designing and building prototype Nemesis payloads that implement industry standards for software, hardware, and firmware interfaces.   Nemesis expendable decoys and prototype system hardware will be completed and delivered for field testing.   Demonstrations of Nemesis platforms and payload will be conducted during fleet experimentation, as well as during focused field and laboratory tests."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Undersea Warfare"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Innovative Prototype (INP) and associated Leap Ahead Technology (LA-Tech) investments that are developing new technologies for Undersea Maneuver Warfare.   FY 2018 reflects the sum total of all such BA 6.3 Advanced Technology Development efforts in the program.   These efforts were previously funded in PE 0603123N Force Protection Advanced Technology Development and 0603747N Undersea Warfare Advanced Technology Development. Starting in FY 2018, all INP and LA-Tech investments in Undersea Maneuver Warfare will be shown in this R-2 Activity to better convey exactly what the Office of Naval Research is working on in this area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.168"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.168"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "INP:  Forward Deployed Energy & Communications Outpost (FDECO)\n\nContinue FDECO, which was previously funded in PE 0603123N Force Protection Advanced Technology Development.  Incorporate results from the FDECO architecture planning study into the FDECO design.  Begin integrating FDECO component technologies into experimental FDECO subsystems and utilize the results of limited objective experiments to begin developing a future demonstration plan. Continue to demonstrate FDECO's ability and capacity to support vehicle agnostic docking, autonomous and efficient energy management, and federated command & control (C2) of the system and hosted assets. Continue to demonstrate notional intelligence preparation of the operational environment and begin demonstrating notional mine warfare and anti-submarine warfare capabilities.\n\nLA-Tech:  Anti-Submarine Warfare Mission Packages (ASW MP)\n\nContinue ASW MP, which was previously funded in PE 0603747N Undersea Warfare Advanced Technology Development.  The ASW MP will develop a system of sensors and autonomy algorithms to enable a Large Displacement Unmanned Undersea Vehicle (LDUUV) to conduct a classified ASW mission. Advanced technology development funds will be used to integrate sensor components and autonomy algorithms developed in PE 0602792N into the mission packages system.  During FY18, an Unmanned Undersea Vehicle (UUV) will be selected to be used for the ASW mission and measurements will be taken of its characteristics.  New designs for situational awareness sensor electronics and components will be integrated into the UUV.  The project will also conduct modeling and simulation of the integrated components of the selected UUV for the ASW mission to evaluate overall integrated system performance."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned and Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "This R-2 Activity contains all Innovative Prototype (INP) and associated Leap Ahead Technology (LA-Tech) investments that are developing new technologies for Unmanned and Autonomous Systems.   FY 2018 reflects the sum total of all such BA 6.3 Advanced Technology Development efforts in the program.   These efforts were previously funded in PE 0603123N Force Protection Advanced Technology Development and 0603747N Undersea Warfare Advanced Technology Development. Starting in FY 2018, all INP and LA-Tech investments in Unmanned and Autonomous Systems will be shown in this R-2 Activity to better convey exactly what the Office of Naval Research is working on in this area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.511"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.511"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "INP:  Autonomous Aerial Cargo\/Utility System (AACUS)\n\nComplete the AACUS project, which was previously funded in PE 0603123N Force Protection Advanced Technology Development.  Continue development of the design and build of a prototype sensor suite and software package suitable for integration and testing on an existing USMC rotary wing aircraft that will enable the capability for optional unmanned autonomous flight.  Conduct development and planning for a demonstration of the system's ability to autonomously perform an assault support mission in an operationally representative environment. This demonstration will include performing autonomous take-off, conducting en route navigation, approaching and landing at multiple unprepared landing zones using supervisory control managed by a minimally trained Marine via a tablet-based application, detecting and avoiding ground-based obstacles, and safely operating in degraded visual environments.\n\nINP:  Claws\n\nInitiate Claws.  Claws will develop the autonomy required to operate large and extra-large Unmanned Undersea Vehicles (UUVs) in an anti-access, anti-denial environment.  To support large and extra-large UUV operations further forward and farther from the battle group, the technology will be evolved to allow operations with limited navigational fixes and limited communication opportunities.  During FY18, at-sea testing of Technology Readiness Level (TRL) 5 research technologies will be initiated in a realistic environment.   At-sea data will be collected to support the further development of Claws technologies emerging out of the Claws applied research effort in PE 0602792N.  Analysis of promising technologies will be conducted using laboratory and at-sea testing to provide realistic performance data.\n\nINP:  Large Displacement Unmanned Undersea Vehicle (LDUUV)\n\nComplete LDUUV, which was previously funded in PE 0603747N Undersea Warfare Advanced Technology Development.  Continue progress developing a prototype LDUUV and demonstrate the autonomy technology that enables the LDUUV to avoid undersea static obstacles, operate in a variety of currents, and adapt to local environments so as to maintain station. Conduct development, testing and demonstration of the endurance technology and recommend a reliability strategy allowing for 30 days of continuous operations.  Conduct a demonstration of the LDUUV fuel cell system installed in an LDUUV vehicle operating in an Intelligence Surveillance Reconnaissance (ISR) like mission for 60 days.  Continue to document the data analysis from the technology development in order to transition the information to Program Executive Office for the Littoral Combat Ship.\n\nINP:  Low-Cost UAV Swarming Technology (LOCUST)\n\nInitiate the BA 3 technology development effort for the LOCUST project, which will ultimately deliver a scalable system of inexpensive Unmanned Aerial Vehicles (UAVs) and payloads that will provide game-changing disruptive capabilities over a wide range of military operations and areas of operations.  LOCUST will make advances in unmanned system collective autonomous behaviors, robust low probability of interception or detection ad hoc networks, and payload miniaturization and modularity breakthroughs to counter threats in constrained urban environments, as well as large-scale anti-access area denial defenses.  This will be accomplished at greatly reduced cost and risk when compared to traditional manned platform target prosecution.  During FY18, the LOCUST program will begin to develop a range of key technologies that will be integrated together in order to demonstrate a scalable system of inexpensive, commoditized, swarming UAVs that provide disruptive capabilities.  Critical milestones for each major sub-system and system will be established, as well as a revisit to requirements and metrics throughout.  Yearly wargames will be utilized to shape and inform the demonstrations, which will be of increasing complexity in both mission and operating environment.  The demonstrations in turn will provide the Navy with an ability to spiral out capability as needed.  FY18 demonstrations are planned to encompass missions utilizing intelligence, surveillance and reconnaissance and kinetic strike payloads.\n\nLA-Tech:  Medium Displacement Unmanned Surface Vehicle (MDUSV)\n\nContinue the MDUSV project, which was previously funded in 0603123N Force Protection Advanced Technology Development.  The MDUSV project will design and build a prototype MDUSV platform sized for theater or global independent operations.   New autonomy, Mine Countermeasures (MCM), Anti-Submarine Warfare (ASW), and Electronic Warfare (EW) technologies will be integrated into the MDUSV platform.  The capability of the MSUSV to autonomously perform ASW, MCM and EW missions over an extended period of time will be demonstrated during a 40-day period of at-sea testing.  The capability to autonomously operate in all-weather conditions, using new technologies that provide robust perception using Electro-Optic\/Infrared (EO\/IR) sensors that detect low radar cross-section craft with reduced vulnerability to jamming and reduced Radio Frequency (RF) emissions, will be assessed.  The use of integrated acoustic and High Temperature Superconductor (HTS) mine influence sweep technologies as well as a novel ASW sensor suite that includes an advanced version of the Non-Traditional Sensor System (NTSS) will be tested on an instrumented range.  \n\nLA-Tech:  Tern\n\nComplete Tern, a joint ONR and DARPA effort, previously funded in 0603123N Force Protection Advanced Technology Development.  Continue TERN technology development by conducting hardware and software testing and a sea-based Vertical Take-Off and Landing (VTOL) flight demonstration.  The developed Tern enabling technologies have been focused on supporting a DDG-51 and LCS-2 based future long endurance Unmanned Air Vehicle (UAV) capability that could be transitioned and implemented with minimal ship modification."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In all cases, the technologies being developed within this PE support the Department of the Navy INP Program and are managed at the Office of Naval Research.  The primary technological metrics used in this PE involve experiments and tests that demonstrate proof of concept for the technological capability being developed.  All investments are coordinated with the acquisition, resources\/requirements, and Fleet communities, with periodic briefs given to the Department of the Navy's leadership, including the 4-star RDT&E Corporate Board.  At the lowest level, each project is measured against technical and financial milestones on a periodic and frequent basis.  Annually, each project is reviewed in depth for technical performance and development status by the Chief of Naval Research.  Department of the Navy leadership, including the RDT&E Corporate Board is briefed on the program's status at least annually, if not more often, by the Chief of Naval Research."
                        }
                    }
                }
            ]
        }
    }
}