{
    "id": "2018-AirForce-PB-3600-MJBOOK-0-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-23",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603601F"
        },
        "ProgramElementTitle": {
            "val": "Conventional Weapons Technology"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "42.204"
            },
            "CurrentYear": {
                "val": "102.009"
            },
            "BudgetYearOne": {
                "val": "167.415"
            },
            "BudgetYearOneBase": {
                "val": "167.415"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "197.001"
            },
            "BudgetYearThree": {
                "val": "233.030"
            },
            "BudgetYearFour": {
                "val": "205.660"
            },
            "BudgetYearFive": {
                "val": "230.332"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops, integrates, and demonstrates advanced ordnance and guidance technologies for air-launched conventional weapons.  The program focuses on conventional ordnance component technologies such as warheads, fuzes, and explosives, as well as munition guidance component technologies such as navigation and control systems and seekers.  Technologies to be developed, demonstrated, and integrated into system concepts will address blast, fragmentation, penetration, low-collateral damage, variable depth\/location fuzing, precise guidance, and high performance and insensitive explosives.  \n\nEfforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.036"
                },
                "CurrentYear": {
                    "val": "102.009"
                },
                "BudgetYearOne": {
                    "val": "155.804"
                },
                "BudgetYearOneBase": {
                    "val": "155.804"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "42.204"
                },
                "CurrentYear": {
                    "val": "102.009"
                },
                "BudgetYearOne": {
                    "val": "167.415"
                },
                "BudgetYearOneBase": {
                    "val": "167.415"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.832"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "11.611"
                },
                "BudgetYearOneBase": {
                    "val": "11.611"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.832"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "11.611"
                                },
                                "BudgetYearOneBase": {
                                    "val": "11.611"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2018 due to increased emphasis and endeavor to fully fund small-sized air-to-air weapon technology-demonstration."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "63670A"
                    },
                    "ProjectTitle": {
                        "val": "Weapon Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.204"
                        },
                        "CurrentYear": {
                            "val": "60.509"
                        },
                        "BudgetYearOne": {
                            "val": "87.215"
                        },
                        "BudgetYearOneBase": {
                            "val": "87.215"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "96.401"
                        },
                        "BudgetYearThree": {
                            "val": "58.330"
                        },
                        "BudgetYearFour": {
                            "val": "46.660"
                        },
                        "BudgetYearFive": {
                            "val": "75.396"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission Description not provided."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ordnance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate integrated ordnance technologies to improve conventional air-delivered munitions.  Specific technical areas of focus include energetic materials, fuze technology, warhead sciences, and modeling and simulation (M&S)tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.252"
                                            },
                                            "Text": {
                                                "val": "Demonstrated revolutionary embedded fuzing technologies to increase the reliability of legacy penetrating weapons and portends selectable and dialable weapon effects.  Continued to develop and assess ordnance technologies for challenging high-speed strike weapon employment concepts.  Matured M&S tools to determine survivability and lethality of general purpose and future weapons systems across an ever increasing spectrum of targets.  Continued to research alternative fuzing systems pervasive across a spectrum of currently fielded and future munitions that will reduce logistics tail and associated costs.  Demonstrated live drop of selectable effects weapon with precision height of burst technology and custom warhead.  Conducted proof-of-concept test of sub-scale dialable effects munition which enables wide area attack, provides limited penetration capability and has applications for close air support.  Completed trade study for next generation research for hard target defeat, including assessment of very high-speed penetration and multi\/cumulative attack."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.569"
                                            },
                                            "Text": {
                                                "val": "Continue to mature distributed fuzing concepts for close-controlled strike, area attack, and penetration applications, including assessing long term safety, survivability and functionality.  Continue to research ordnance technologies to allow tailored lethality by controlling weapon fragmentation.  Continue to mature ordnance technologies for rapid transition into high-speed strike weapon concepts.  Continue to develop test capabilities and analysis tools to evaluate ordnance technologies in relevant environments.  Continue to develop ordnance technologies\/methodologies for high-speed impact and functional defeat. Continue research for distributed and multi-point fuzing concepts to reduce the logistics tail necessary for future and fielded munitions systems, as well as safe and arm functions.  Initiate research into armament systems for Special Operations applications.  Conduct lethality analyses for air-to-air weaponry.  Research distributed, collaborative, cooperative effects munitions technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.817"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.817"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate distributed, embedded fuzing concepts for close-controlled strike, area attack, and penetration applications (layer counting at high speed), including assessing long term safety, survivability and functionality.  Continue development of ordnance technologies to allow tailored lethality by controlling weapon fragmentation.  Continue to mature ordnance technologies for rapid transition into high-speed strike weapon concepts, collecting complex arena test data for implementation into lethality modeling and simulation tools.  Continue to develop test capabilities and analysis tools to evaluate ordnance technologies in relevant environments.  Develop ordnance technologies\/methodologies for high-speed impact and functional defeat.  Continue research for distributed and multi-point fuzing concepts to reduce the logistics tail necessary for future and fielded munitions systems, as well as safe and arm functions.  Continue research into armament systems for Special Operations applications.  Continue to conduct lethality analyses for air-to-air weaponry.  Continue to mature research on distributed, collaborative, cooperative effects munitions technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guidance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop guidance technologies to improve the precision, controlled lethality, and flexibility of conventional, air-delivered munitions. Specific technical areas include precision navigation and terminal seekers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.051"
                                            },
                                            "Text": {
                                                "val": "Established Integrated Guidance Evaluation and Verification (IGEV) team and initiated configuration management high fidelity simulation software for high-speed, long-range weapon research.  Demonstrated end-to-end functionality of high fidelity, six degree of freedom model for investigating guidance modes and stressing vehicle dynamics in a hypersonic environment.  Refurbished a new five axis flight motion simulator for FY 2017 installation.  Upgraded computing capabilities to full capability for analyzing integrated functionality of guidance, navigation, inertial sensing, executive control, and a seeker.  Demonstrated software defined approach to radio frequency target simulation, in preparation for future hardware-in-the-loop demonstrations of high-speed weapon concepts and eventual transition to acquisition.  Established contracts to research test methods for seeker performance in a hypersonic environment and a revolutionary new autopilot design approach.  Delivered weapon simulation data supporting analysis tools and documentation to contractors and developed scenarios to support seeker trade studies.  Initiated contract actions to develop initial weapons carriage and release systems to include initial rack and integral weapon ejector rack.  Initiated process to construct state-of-art M&S analysis center, to provide interoperable warfighter solutions in a live, virtual, and constructive environment including engagement, mission, campaign, hardware-in-the-loop, human-in-the-loop, and live flight."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.940"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct wind-tunnel and limited flight experiments to characterize air-to-air guidance and control.  Continue to conduct research on integrated hardware and software-in-the-loop demonstrations of high speed weapon technologies.  Continue to develop advanced modular and service oriented weapon architectures.  Continue design and development of seeker subsystem prototypes for platform self-defense.  Continue to develop projector and common scene generator technologies for design, development, and analysis of advanced weapon concepts in representative environments for assets networked and operating in future battle spaces. Develop technologies for precision navigation of weapons in global Positioning System (GPS)-denied scenarios.  Continue to develop technologies for precision navigation of weapons.  Evaluate and categorize multiple advanced carriage and release concepts, conduct design reviews and begin construction of new systems.    Continue M&S center design to enable simultaneous, multi-level security M&S activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.398"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.398"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct hardware-in-the-loop and software-in-the-loop to characterize air-to-air and air-to-ground guidance and control technologies.  Continue increased emphasis on integrated hardware-in-the-loop, software-in-the-loop, and other M&S technologies for the demonstration of open architecture and modular weapon munition concepts.  Continue development of advanced, high-resolution infrared scene projectors, distributed simulation concepts, software defined RF test chamber, scene generation, mission, engagement, campaign level simulations, and panoramic infrared dome technologies.  Continue to develop technologies for precision navigation of weapons in GPS-denied scenarios.  Continue to mature and integrate advanced carriage and release concepts and sub-systems.  Complete design of M&S capability and initiate approval processes to permit simultaneous multi-level security M&S activities.  Complete M&S center design and security approval processes to enable simultaneous, multi-level security M&S activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Munition Concept Technologies"
                                    },
                                    "Description": {
                                        "val": "Demonstrate advanced conventional munitions concepts.  These innovative concepts integrate ordnance, guidance, and carriage and release technologies to demonstrate warfighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.901"
                                            },
                                            "Text": {
                                                "val": "Initiated program planning for subsonic, standoff, low cost cruise missile.  Launched Joint Capability Technology Demonstration for enabling technologies for low-cost standoff delivery vehicle.  Performed risk reduction activities in support of air-to-air weapons for both offensive and defensive purposes.  Awarded multiple competitive contracts for maturation of propulsion and warhead technologies for advanced air-to-air weapons.  Conducted wind tunnel test series to explore aerodynamics and agility on numerous candidate airframe designs.  Continued to mature high risk technologies in ordnance, guidance, airframe, and conducted lethality analysis of candidate warhead technologies.  Performed high fidelity lethality and weapons engagement analysis for air-to-air and air-to-ground weapons concepts.  Released version 1.4 of weapon effect server capability which enhanced fidelity of directed energy engagement analysis and initiated pilot analyses supporting the future air dominance platforms.   Successfully completed a systems analysis of modular weapons systems to determine early requirements and impacts of modular weapon components.  Demonstrated several modular weapons concepts in a digital simulation environment.  Performed risk reduction activities in support of air-to-air weapons for both offensive and defensive purposes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2017 and beyond, work accomplished under this effort will be reported in Project 63670B, Weapon Concept Development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63670B"
                    },
                    "ProjectTitle": {
                        "val": "Weapon Concept Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "41.500"
                        },
                        "BudgetYearOne": {
                            "val": "80.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "80.200"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "100.600"
                        },
                        "BudgetYearThree": {
                            "val": "174.700"
                        },
                        "BudgetYearFour": {
                            "val": "159.000"
                        },
                        "BudgetYearFive": {
                            "val": "154.936"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Starting in FY 2017, Project 63670B, Weapon Concept Development, was created and activities were re-aligned from Project 63670A, Conventional Weapons Development, under the effort, Advanced Munition Concept Technologies.  In order to further focus this new Project, two efforts were created under it: Air-to-Air Concept Development and Air-to-Ground Concept Development.  This project will develop, refine, and integrate ordnance and guidance technologies into demonstrations to reduce risk for potential air-launched conventional weapons acquisitions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air-to-Air Concept Development"
                                    },
                                    "Description": {
                                        "val": "Mature, integrate, and demonstrate air-to-air weapon components and systems (ordnance, guidance, and carriage and release technologies) to demonstrate warfighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the work for this effort was performed under Project 63670A, Weapon Technology Development, in the effort, Advanced Munition Concept Technologies.\n\nContinue to demonstrate weapon integration concept for air target engagement. Continue planning and technology risk reduction for weapon concepts responsive to the 2030 timeframe threat environment (including air-to-air weapons for both offensive and defensive purposes). Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons. Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.220"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.220"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate weapon integration concept for air target engagement. Continue planning and technology risk reduction for weapon concepts responsive to the 2030 timeframe threat environment (including air-to-air weapons for both offensive and defensive purposes). Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons. Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness. Continue to test prototype propulsion systems to demonstrate attributes to meet next-generation air-to-air weapon requirements. Continue to conduct lethality studies to enable design of small form factor self-defense of an air platform. Continue to develop preliminary design of weapon concept for sixth generation platform. Continue to conduct wind-tunnel and limited flight experiments to characterize air-to-air maneuverability, range, and guidance and control for sixth generation weapon concept. Continue to conduct ground and arena tests of advanced weapons experimental-carriages for sixth generation weapon concept and prepare for flight worthiness testing.  maneuver"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air-to-Ground Concept Development"
                                    },
                                    "Description": {
                                        "val": "Mature, integrate, and demonstrate air-to-ground weapon components and systems (ordnance, guidance, and carriage and release technologies) to demonstrate warfighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.500"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the work for this effort was performed under Project 63670A, Weapon Technology Development, in the effort, Advanced Munition Concept Technologies.\n\nIncrease emphasis in conducting relevant long range strike weapon technology demonstrations to reduce risk for potential follow on acquisition programs. Continue the development of munition concepts to incorporate technologies for carriage and terminal impact at high speed. Increase emphasis in investigating concepts for cooperative control of small weapons to produce scalable effects to increase the capacity and capability of fifth generation aircraft. Continue planning and technology risk reduction including demonstration and initial flight testing for weapons concepts responsive to the 2030 timeframe threat environment (including hypersonic and cooperative\/collaborative concepts). Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons. Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.980"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.980"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct relevant long range strike weapon technology demonstrations to reduce risk for potential follow-on acquisition programs, and finalize system detailed design for flying hypersonic munition demonstrator.  Continue the development of munition concepts to incorporate technologies for carriage and terminal impact at high speed.  Continue planning and technology risk reduction including demonstration and initial flight testing for weapons concepts responsive to the 2030 timeframe threat environment (including hypersonic and cooperative\/collaborative concepts).  Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons.  Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness and to apply methodology to support future air dominance analysis.  Continue to investigate concepts for cooperative control of small weapons to produce scalable effects to increase the capacity and capability of fifth generation aircraft.  Continue to refine competitive contractor processes to develop flying experimental concepts of the subsonic, standoff, low cost cruise missile capability.  Continue to develop kinetic\/non-kinetic payloads, networking, seeker, fuze, and defense countermeasures technology for hypersonic applications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}